{
    "image_1": {
        "image_id": 1,
        "image_path": "./fusion_research/fusion_dataset/paper/C18-1117/images/image_1.jpg",
        "caption": [
            "Figure 1: Distributional models in the task of tracing diachronic semantic shifts: research timeline "
        ],
        "footnote": [],
        "context": "Human languages change over time, due to a variety of linguistic and non-linguistic factors and at all levels of linguistic analysis. In the field of theoretical (diachronic) linguistics, much attention has been devoted to expressing regularities of linguistic change. For instance, laws of phonological change have been formulated (e.g., Grimm’s law or the great vowel shift) to account for changes in the linguistic sound system. When it comes to lexical semantics, linguists have studied the evolution of word meaning over time, describing so-called lexical semantic shifts or semantic change, which Bloomfield (1933) defines as 2 The concept of semantic shifts  3 aims to compare different approaches to the task of automatic detection of semantic shifts: in the choice of diachronic data, evaluation strategies, methodology of extracting semantic shifts from data, and the methods to compare word vectors across time spans. Sections 4 and 5 describe two particularly interesting results of diachronic embeddings research: namely, the statistical laws of semantic change and temporal semantic relations. In Section 6 we outline possible applications of systems that trace semantic shifts. Section 7 presents open challenges which we believe to be most important for the field, and in Section 8 we summarize and conclude. ",
        "chunk_order_index": 0,
        "chunk_id": "chunk-d7271197dd3b673e8f49863e67ec57ea",
        "description": "The image is a timeline chart titled 'Distributional models in the task of tracing diachronic semantic shifts: research timeline.' The timeline spans from 2010 to 2017, with each year marked by a circle. Key milestones and developments in the field are annotated along the timeline. Starting from 2010, the first milestone is 'Time tensor with Random Indexing.' This is followed by 'Google Ngrams corpus' in 2011. In 2012, 'Word epoch disambiguation' is noted. The year 2013 marks the introduction of 'Prediction-based models (word2vec).' In 2014, 'Word embeddings with incremental updates' is highlighted. The year 2015 sees the development of 'Models alignment.' The timeline continues with 'NYT corpus' and 'COHA corpus' in 2016. Finally, in 2017, several advancements are noted: 'Laws of semantic change,' 'Local measures better for cultural shifts,' 'Gigaword corpus,' 'Diachronic relations,' and 'Criticism of semantic change laws.' The timeline provides a chronological overview of significant developments in the field of tracing diachronic semantic shifts using distributional models.",
        "segmentation": false
    }
}