{
    "chunk-1d2f35e2fb54d18ba1dd54dabca8b6d3": null,
    "chunk-de4707ebd56153a05119e590392c169a": null,
    "chunk-d6c65d0515df0ea73d7ffb985d859103": null,
    "chunk-b88c4ba882c603a1862ab30706435a86": [
        {
            "entity_name": "Henderson et al.",
            "entity_type": "PERSON",
            "description": "Henderson et al. are associated with both the DSTC2 dataset used for evaluating the proposed method in the restaurant search domain and the dialogue act definition used in the system action mapping.",
            "source_entities": [
                "HENDERSON ET AL., 2013",
                "HENDERSON ET AL., 2014A"
            ]
        },
        {
            "entity_name": "DSTC2",
            "entity_type": "EVENT",
            "description": "DSTC2 is a dataset used for evaluating the proposed method in both the restaurant search domain and for dialogue state tracking.",
            "source_entities": [
                "DSTC2",
                "DIALOGUE STATE TRACKING"
            ]
        },
        {
            "entity_name": "Adam Optimization Method",
            "entity_type": "CONCEPT",
            "description": "The Adam optimization method is used in the training settings with an initial learning rate of 1e-3 and is associated with Kingma and Ba, 2014.",
            "source_entities": [
                "ADAM OPTIMIZATION METHOD",
                "KINGMA AND BA, 2014"
            ]
        },
        {
            "entity_name": "Dialogue Act",
            "entity_type": "CONCEPT",
            "description": "A dialogue act is a unit of communication mapped to a system action and a candidate value for a slot type, as defined by Henderson et al., 2013.",
            "source_entities": [
                "DIALOGUE ACT",
                "SLOT TYPES AND VALUES",
                "HENDERSON ET AL., 2013"
            ]
        },
        {
            "entity_name": "User Simulator",
            "entity_type": "ORGANIZATION",
            "description": "The user simulator, associated with Schatzmann et al., 2007, is used to interact with the end-to-end training agent during imitation and reinforcement learning stages and can be configured with different personalities.",
            "source_entities": [
                "USER SIMULATOR",
                "SCHATZMANN ET AL., 2007"
            ]
        }
    ],
    "chunk-2b703dd999933ff1b24acfd0a93e0d01": null,
    "chunk-e66ce441e74f5f71549e88941907166c": null,
    "chunk-59b53a3b966b99729d304a1c3fab7830": [
        {
            "entity_name": "Steve Young",
            "entity_type": "PERSON",
            "description": "Steve Young is an author who has contributed to multiple papers on dialogue systems and language processing, including Gaussian processes for dialogue manager optimization, reinforcement learning for parameter estimation in statistical spoken dialogue systems, and robust dialog state tracking using delexicalised recurrent neural networks and unsupervised gate.",
            "source_entities": [
                "STEVE YOUNG"
            ]
        },
        {
            "entity_name": "Dilek Hakkani-Tur (Gökhan Tur)",
            "entity_type": "PERSON",
            "description": "Dilek Hakkani-Tur, also known as Gökhan Tur, is an author who has contributed to research on multi-domain joint semantic frame parsing and end-to-end optimization of task-oriented dialogue models.",
            "source_entities": [
                "DILEK HAKKANI-TUR",
                "GOKHAN TUR"
            ]
        },
        {
            "entity_name": "Yun-Nung Chen",
            "entity_type": "PERSON",
            "description": "Yun-Nung Chen is an author who has contributed to research on multi-domain joint semantic frame parsing and end-to-end task-completion neural dialogue systems.",
            "source_entities": [
                "YUN-NUNG CHEN"
            ]
        },
        {
            "entity_name": "Blaise Thomson",
            "entity_type": "PERSON",
            "description": "Blaise Thomson is an author who has contributed to research on dialog state tracking, neural belief tracking, and reinforcement learning for parameter estimation in statistical spoken dialogue systems.",
            "source_entities": [
                "BLAISE THOMSON"
            ]
        },
        {
            "entity_name": "Bing Liu (Ian Lane)",
            "entity_type": "PERSON",
            "description": "Bing Liu, along with Ian Lane, is an author who contributed to multiple papers on spoken language understanding and neural network models for dialogue, including joint online spoken language understanding and language modeling with recurrent neural networks, an end-to-end trainable neural network model with belief tracking for task-oriented dialog, and iterative policy learning in end-to-end trainable task-oriented neural dialog models.",
            "source_entities": [
                "BING LIU",
                "IAN LANE"
            ]
        },
        {
            "entity_name": "Gre´goire Mesnil (Yann Dauphin, Kaisheng Yao, Yoshua Bengio, Xiaodong He, Dong Yu)",
            "entity_type": "PERSON",
            "description": "Gre´goire Mesnil, along with Yann Dauphin, Kaisheng Yao, Yoshua Bengio, Xiaodong He, and Dong Yu, are authors who contributed to a paper on using recurrent neural networks for slot filling in spoken language understanding.",
            "source_entities": [
                "GRE´GOIRE MESNIL",
                "YANN DAUPHIN",
                "KAISHENG YAO",
                "YOSHUA BENGIO",
                "XIAODONG HE",
                "DONG YU"
            ]
        }
    ]
}