{
    "chunk-87d2e06a31aa878bb79077cd36b9e783": [
        {
            "entity_name": "Department of Computer Science and Cornell Tech, Cornell University, New York, NY, 10044",
            "entity_type": "ORGANIZATION",
            "description": "The Department of Computer Science and Cornell Tech at Cornell University is the institution where the research was conducted, located in New York, NY, 10044.",
            "source_entities": [
                "DEPARTMENT OF COMPUTER SCIENCE AND CORNELL TECH, CORNELL UNIVERSITY, NEW YORK, NY, 10044"
            ]
        },
        {
            "entity_name": "LINGUNET",
            "entity_type": "ORGANIZATION",
            "description": "LINGUNET is a language-conditioned image generation network, a variant of the U-NET image-to-image architecture, used in the research to map raw visual observations to goals.",
            "source_entities": [
                "LINGUNET",
                "U-NET"
            ]
        },
        {
            "entity_name": "LANI",
            "entity_type": "EVENT",
            "description": "LANI is a benchmark for instruction following, specifically a navigation task used to evaluate the model's performance, consisting of 6,000 sequences of natural language instructions.",
            "source_entities": [
                "LANI"
            ]
        },
        {
            "entity_name": "CHAI",
            "entity_type": "EVENT",
            "description": "CHAI is a benchmark for instruction following, where an agent executes household instructions in the CHALET environment, used to evaluate the model's performance, consisting of 1,596 instruction sequences.",
            "source_entities": [
                "CHAI",
                "CHALET ENVIRONMENT"
            ]
        },
        {
            "entity_name": "New York (NY)",
            "entity_type": "GEO",
            "description": "New York, abbreviated as NY, is the state where the research was conducted.",
            "source_entities": [
                "NY"
            ]
        },
        {
            "entity_name": "Recurrent Neural Network (RNN)",
            "entity_type": "ORGANIZATION",
            "description": "RNN stands for Recurrent Neural Network, the method used to generate actions after goal prediction in the research.",
            "source_entities": [
                "RNN"
            ]
        },
        {
            "entity_name": "CIFF",
            "entity_type": "ORGANIZATION",
            "description": "CIFF is the code name or identifier for the project where the code and data for this research are available.",
            "source_entities": [
                "CIFF"
            ]
        }
    ],
    "chunk-798992cc0090fbebd246f289f620d883": [
        {
            "entity_name": "CHAI (CIFF)",
            "entity_type": "ORGANIZATION",
            "description": "CHAI is an organization associated with the development of the CIFF project, as indicated by the GitHub repository, where code and data are available.",
            "source_entities": [
                "\"CHAI\"",
                "\"CIFF\""
            ]
        },
        {
            "entity_name": "HCRC Map Task",
            "entity_type": "EVENT",
            "description": "HCRC Map Task is an event that inspired LANI, involving a leader directing a follower to navigate between landmarks on a map, and is related to the work of Anderson et al.",
            "source_entities": [
                "\"HCRC MAP TASK\"",
                "\"ANDERSON ET AL.\""
            ]
        },
        {
            "entity_name": "Chen and Mooney",
            "entity_type": "PERSON",
            "description": "Chen and Mooney are researchers cited in the related work section for their study on mapping instruction to action, along with Kim.",
            "source_entities": [
                "\"CHEN AND MOONEY\"",
                "\"KIM AND MOONEY\""
            ]
        },
        {
            "entity_name": "Artzi and Zettlemoyer",
            "entity_type": "PERSON",
            "description": "Artzi and Zettlemoyer are researchers cited in the related work section for their study on mapping instruction to action.",
            "source_entities": [
                "\"ARTZI AND ZETTLEMOYER\""
            ]
        },
        {
            "entity_name": "Misra et al.",
            "entity_type": "PERSON",
            "description": "Misra et al. are researchers cited multiple times in the related work section for their studies on mapping instruction to action and direct mapping from raw visual observations to actions.",
            "source_entities": [
                "\"MISRA ET AL.\""
            ]
        },
        {
            "entity_name": "Xiong et al.",
            "entity_type": "PERSON",
            "description": "Xiong et al. are researchers cited in the related work section for their study on direct mapping from raw visual observations to actions.",
            "source_entities": [
                "\"XIONG ET AL.\""
            ]
        },
        {
            "entity_name": "Fried et al.",
            "entity_type": "PERSON",
            "description": "Fried et al. are researchers cited in the related work section for their study on direct mapping from raw visual observations to actions.",
            "source_entities": [
                "\"FRIED ET AL.\""
            ]
        },
        {
            "entity_name": "Chaplot et al.",
            "entity_type": "PERSON",
            "description": "Chaplot et al. are researchers cited in the related work section for their study on using synthetic language for instruction following, along with Hermann et al.",
            "source_entities": [
                "\"CHAPLOT ET AL.\"",
                "\"HERMANN ET AL.\""
            ]
        },
        {
            "entity_name": "Sutton et al.",
            "entity_type": "PERSON",
            "description": "Sutton et al. are researchers cited in the related work section for their study on hierarchical reinforcement learning.",
            "source_entities": [
                "\"SUTTON ET AL.\""
            ]
        },
        {
            "entity_name": "Oh et al.",
            "entity_type": "PERSON",
            "description": "Oh et al. are researchers cited in the related work section for their study on mapping synthetic language to actions using a two-level hierarchy.",
            "source_entities": [
                "\"OH ET AL.\""
            ]
        }
    ],
    "chunk-678394879a21253bf623b2593fe21b70": [
        {
            "entity_name": "LANI",
            "entity_type": "ORGANIZATION",
            "description": "LANI is an organization that has inspired work related to data collection and navigation tasks, aiming for a larger corpus and interactive environment. It is scalable and provides an interactive navigation environment instead of only map diagrams, abstracting away interaction challenges similar to the SAIL navigation corpus.",
            "source_entities": [
                "LANI",
                "HCRC MAP TASK",
                "SAIL NAVIGATION CORPUS"
            ]
        },
        {
            "entity_name": "CHAI",
            "entity_type": "ORGANIZATION",
            "description": "CHAI is an organization that collected instructions using scenarios given to workers, similar to the ATIS collection process. It uses the CHALET environment, which is larger and has more complex manipulation compared to similar environments.",
            "source_entities": [
                "CHAI",
                "ATIS COLLECTION PROCESS",
                "CHALET"
            ]
        },
        {
            "entity_name": "Room-to-Room dataset",
            "entity_type": "EVENT",
            "description": "The Room-to-Room dataset is an event or study by Anderson et al., 2018, that makes use of an environment of connected panoramas of house settings. It provides a realistic vision challenge but has a limited state space and no manipulation possibilities.",
            "source_entities": [
                "ROOM-TO-ROOM DATASET"
            ]
        },
        {
            "entity_name": "Anderson et al., 1991",
            "entity_type": "PERSON",
            "description": "Anderson et al., 1991 are researchers who conducted the HCRC Map Task, which inspired LANI's approach to navigation tasks, and also created the Room-to-Room dataset, which is compared to LANI's environments.",
            "source_entities": [
                "ANDERSON ET AL., 1991",
                "ANDERSON ET AL., 2018"
            ]
        },
        {
            "entity_name": "MacMahon et al., 2006",
            "entity_type": "PERSON",
            "description": "MacMahon et al., 2006 are researchers who collected the SAIL navigation corpus, which influenced LANI's approach to data collection.",
            "source_entities": [
                "MACMAHON ET AL., 2006"
            ]
        },
        {
            "entity_name": "Hemphill and Dahl et al., 1990-1994",
            "entity_type": "PERSON",
            "description": "Hemphill et al., 1990 and Dahl et al., 1994 are researchers who contributed to the ATIS collection process, which was used for collecting CHAI instructions.",
            "source_entities": [
                "HEMPHILL ET AL., 1990",
                "DAHL ET AL., 1994"
            ]
        },
        {
            "entity_name": "Hermann and Chaplot et al., 2017-2018",
            "entity_type": "PERSON",
            "description": "Hermann et al., 2017 and Chaplot et al., 2018 are researchers who released multiple 3D research environments, which are compared to LANI's navigation environments.",
            "source_entities": [
                "HERMANN ET AL., 2017",
                "CHAPLOT ET AL., 2018"
            ]
        },
        {
            "entity_name": "Gordon and Das et al., 2018",
            "entity_type": "PERSON",
            "description": "Gordon et al., 2018 and Das et al., 2018 are researchers who contributed to the CHALET environment, which is used for CHAI.",
            "source_entities": [
                "GORDON ET AL., 2018",
                "DAS ET AL., 2018"
            ]
        }
    ],
    "chunk-43c0e6273288c7932f0bd88a4e25c435": [
        {
            "entity_name": "LINGUNET",
            "entity_type": "ORGANIZATION",
            "description": "LINGUNET is an architecture inspired by the U-NET image generation method, used for generating a probability distribution over pixels in a feature map based on natural language instructions. It incorporates various techniques and concepts such as CNN, ReLU, positional embeddings, LSTM, and dropout regularization.",
            "source_entities": [
                "\"LINGUNET\"",
                "\"CNN\"",
                "\"RELU\"",
                "\"POSITIONAL EMBEDDINGS\"",
                "\"LSTM\"",
                "\"INSTRUCTION\"",
                "\"FEATURE MAP\"",
                "\"GOAL MASK\"",
                "\"RNN\"",
                "\"PROBABILITY DISTRIBUTION\"",
                "\"GOAL LOCATION\"",
                "\"AGENT\"",
                "\"PANORAMA OBSERVATION\"",
                "\"BACKWARD CAMERA PROJECTION\"",
                "\"SOFTMAX\"",
                "\"LEARNED SCALAR BIAS TERM\"",
                "\"DROPOUT\"",
                "\"DECONV\"",
                "\"AFFINE\"",
                "\"TEXT KERNEL\"",
                "\"TEXT-CONDITIONED FEATURE MAP\""
            ]
        },
        {
            "entity_name": "LeCun et al., 1998 (CNN)",
            "entity_type": "PERSON",
            "description": "LeCun et al., 1998 are credited with the development of the CNN with rectified linear units (ReLU), which is a fundamental component of the LINGUNET architecture.",
            "source_entities": [
                "\"LECUN ET AL., 1998\"",
                "\"CNN\""
            ]
        },
        {
            "entity_name": "Nair and Hinton, 2010 (ReLU)",
            "entity_type": "PERSON",
            "description": "Nair and Hinton, 2010 are associated with the development of rectified linear units (ReLU), a type of activation function used in the CNN layers within the LINGUNET architecture.",
            "source_entities": [
                "\"NAIR AND HINTON, 2010\"",
                "\"RELU\""
            ]
        },
        {
            "entity_name": "Ronneberger et al., 2015 (U-NET)",
            "entity_type": "PERSON",
            "description": "Ronneberger et al., 2015 are credited with the U-NET image generation method, which inspired the LINGUNET architecture.",
            "source_entities": [
                "\"RONNEBERGER ET AL., 2015\""
            ]
        },
        {
            "entity_name": "Maas et al., 2013 (leaky ReLU)",
            "entity_type": "PERSON",
            "description": "Maas et al., 2013 are associated with the development of leaky ReLU non-linearities, used in the LINGUNET architecture.",
            "source_entities": [
                "\"MAAS ET AL., 2013\""
            ]
        },
        {
            "entity_name": "Ulyanov et al., 2016 (instance normalization)",
            "entity_type": "PERSON",
            "description": "Ulyanov et al., 2016 are associated with the development of instance normalization, used in the LINGUNET architecture.",
            "source_entities": [
                "\"ULYANOV ET AL., 2016\""
            ]
        },
        {
            "entity_name": "Srivastava et al., 2014 (dropout)",
            "entity_type": "PERSON",
            "description": "Srivastava et al., 2014 are credited with the development of dropout regularization, used in the LINGUNET architecture to prevent overfitting.",
            "source_entities": [
                "\"SRIVASTAVA ET AL., 2014\"",
                "\"DROPOUT\""
            ]
        },
        {
            "entity_name": "Hochreiter and Schmidhuber, 1997 (LSTM)",
            "entity_type": "PERSON",
            "description": "Hochreiter and Schmidhuber, 1997 are credited with the development of the long short-term memory (LSTM) RNN, used in the process of generating representations from instructions in the LINGUNET architecture.",
            "source_entities": [
                "\"HOCHREITER AND SCHMIDHUBER, 1997\"",
                "\"LSTM\""
            ]
        }
    ],
    "chunk-2e26f790536e5feae530d964770f265f": [
        {
            "entity_name": "LINGUNET",
            "entity_type": "ORGANIZATION",
            "description": "LINGUNET is a system that includes various components such as CNNs, affine transformations, and RNNs, used for action generation and goal prediction. It also involves LSTM, DECONV, and AFFINE transformations as part of its model parameters.",
            "source_entities": [
                "LINGUNET",
                "CNN",
                "DECONV",
                "AFFINE",
                "RNN",
                "LSTM"
            ]
        },
        {
            "entity_name": "ADAM",
            "entity_type": "EVENT",
            "description": "Adam is the optimization method used for updating model parameters in the LINGUNET model, also referred to as Adam Optimization.",
            "source_entities": [
                "ADAM",
                "ADAM OPTIMIZATION"
            ]
        },
        {
            "entity_name": "POLICY GRADIENT",
            "entity_type": "EVENT",
            "description": "Policy Gradient is the method used for action generation in a contextual bandit setting within LINGUNET.",
            "source_entities": [
                "POLICY GRADIENT",
                "CONTEXTUAL BANDIT"
            ]
        },
        {
            "entity_name": "SUPERVISED LEARNING",
            "entity_type": "EVENT",
            "description": "Supervised Learning is the method used to address the language understanding problem in LINGUNET, which generally has lower sample complexity compared to reinforcement learning.",
            "source_entities": [
                "SUPERVISED LEARNING"
            ]
        },
        {
            "entity_name": "REINFORCEMENT LEARNING",
            "entity_type": "EVENT",
            "description": "Reinforcement Learning is the method mentioned for tasks that benefit from exploration in the context of LINGUNET, often requiring many samples due to high sample complexity.",
            "source_entities": [
                "REINFORCEMENT LEARNING",
                "EXPLORATION"
            ]
        },
        {
            "entity_name": "ACTION GENERATION",
            "entity_type": "EVENT",
            "description": "Action Generation is a process in LINGUNET that involves generating actions using an RNN and is trained by maximizing the expected immediate reward the agent observes while exploring the environment.",
            "source_entities": [
                "ACTION GENERATION",
                "EXPECTED IMMEDIATE REWARD"
            ]
        },
        {
            "entity_name": "GOAL PREDICTION",
            "entity_type": "EVENT",
            "description": "Goal Prediction is a component of LINGUNET that predicts the goal state and is trained by minimizing the cross-entropy of the predicted distribution with the gold-standard goal distribution.",
            "source_entities": [
                "GOAL PREDICTION",
                "CROSS-ENTROPY",
                "GOLD-STANDARD GOAL DISTRIBUTION"
            ]
        }
    ],
    "chunk-a5cbc3dc3119bb20857ce5133d72aac4": null,
    "chunk-ecb5de346dd7867cf3eb231fcde80125": [
        {
            "entity_name": "CHAI",
            "entity_type": "PROJECT",
            "description": "CHAI is a project that combines navigation and simple manipulation in a complex, simulated household environment using the CHALET simulator. It involves a 3D house simulator that provides multiple houses, each with multiple rooms, supporting moving between rooms, picking and placing objects, and opening and closing cabinets and similar containers. The project also includes the collection of a corpus of navigation and manipulation instructions using Amazon Mechanical Turk and involves the evaluation of agent performance with metrics like stop distance and manipulation accuracy.",
            "source_entities": [
                "CHAI",
                "LANI"
            ]
        },
        {
            "entity_name": "CHALET SIMULATOR",
            "entity_type": "TECHNOLOGY",
            "description": "The CHALET simulator is a 3D house simulator used in the CHAI project, providing multiple houses, each with multiple rooms for navigation and object manipulation tasks. It allows for moving between rooms, picking and placing objects, and opening and closing cabinets and similar containers. The simulator was detailed by Yan et al., 2018.",
            "source_entities": [
                "CHALET SIMULATOR",
                "YAN ET AL., 2018"
            ]
        },
        {
            "entity_name": "Amazon Mechanical Turk",
            "entity_type": "PLATFORM",
            "description": "Amazon Mechanical Turk is a crowdsourcing platform used by the CHAI project to collect a corpus of navigation and manipulation instructions. It facilitated the creation of 36 common household scenarios and the collection of instructions through crowdsourcing tasks.",
            "source_entities": [
                "AMAZON MECHANICAL TURK"
            ]
        },
        {
            "entity_name": "Goal Prediction",
            "entity_type": "EVENT",
            "description": "Goal prediction in the CHAI project involves an additional RNN that predicts the sequence of intermediate goals given the instruction only. It includes two types of goals: NAVIGATION for action sequences requiring movement only and ending with the STOP action; and INTERACTION for sequences of movement actions that end with an INTERACT action. The prediction is used to guide the agent's actions in executing instructions.",
            "source_entities": [
                "GOAL PREDICTION",
                "NAVIGATION",
                "INTERACTION",
                "INTERACT",
                "STOP"
            ]
        },
        {
            "entity_name": "Ray Casting",
            "entity_type": "TECHNOLOGY",
            "description": "Ray casting is a technology used in the CHAI project for inferring the goal location, especially for INTERACTION goals that are not on the ground, replacing the backward camera projection.",
            "source_entities": [
                "RAY CASTING"
            ]
        },
        {
            "entity_name": "Evaluation Metrics",
            "entity_type": "CONCEPT",
            "description": "Evaluation metrics in the CHAI project include stop distance (SD), which measures the distance of the agent’s final state to the final annotated position, and manipulation accuracy (MA), which compares the set of manipulation actions to a reference set. Additionally, task completion (TC) is used to measure whether the agent has successfully completed a task.",
            "source_entities": [
                "TASK COMPLETION",
                "MANIPULATION ACCURACY",
                "STOP DISTANCE"
            ]
        }
    ],
    "chunk-6c1df1d042170364405c60ca34c8951c": [
        {
            "entity_name": "LANI",
            "entity_type": "ORGANIZATION",
            "description": "LANI is an organization involved in evaluating the performance of approaches in task completion and stop distance accuracy. It also measures human performance on a sample of development examples for both tasks and conducts a human evaluation with 50 development examples from LANI rating human performance and the approach.",
            "source_entities": [
                "LANI",
                "HUMAN EVALUATION"
            ]
        },
        {
            "entity_name": "CHAI",
            "entity_type": "ORGANIZATION",
            "description": "CHAI is an organization involved in evaluating the performance of approaches in stop distance and manipulation accuracy. It uses intermediate goals with the horizon applied separately for each goal and measures human performance on a sample of development examples for both tasks.",
            "source_entities": [
                "CHAI",
                "INTERMEDIATE GOALS"
            ]
        },
        {
            "entity_name": "Task Performance Metrics",
            "entity_type": "EVENT",
            "description": "Task Performance Metrics include Task Completion (TC), Stop Distance (SD), and Manipulation (MA), which are used to evaluate the accuracy of approaches in completing tasks, stopping at the correct location, and manipulation tasks respectively.",
            "source_entities": [
                "TASK COMPLETION (TC)",
                "STOP DISTANCE (SD)",
                "MANIPULATION (MA)"
            ]
        },
        {
            "entity_name": "Baseline Events",
            "entity_type": "EVENT",
            "description": "Baseline Events include STOP, RANDOMWALK, and MOSTFREQUENT, which are used for comparison in performance metrics such as stop distance and task completion accuracy.",
            "source_entities": [
                "STOP",
                "RANDOMWALK",
                "MOSTFREQUENT"
            ]
        },
        {
            "entity_name": "Model Components",
            "entity_type": "CONCEPT",
            "description": "Model Components include Action Generation RNN, Language Input, and Joint Learning, which are ablated to demonstrate their importance in the model's performance.",
            "source_entities": [
                "ACTION GENERATION RNN",
                "LANGUAGE INPUT",
                "JOINT LEARNING"
            ]
        },
        {
            "entity_name": "Evaluation Methods",
            "entity_type": "EVENT",
            "description": "Evaluation Methods include Human Evaluation and Oracle Goals, which are used to assess the performance of approaches by comparing generated paths with instructions on a Likert scale and to evaluate the approach's performance in navigation tasks.",
            "source_entities": [
                "HUMAN EVALUATION",
                "ORACLE GOALS"
            ]
        },
        {
            "entity_name": "Likert Scale",
            "entity_type": "CONCEPT",
            "description": "Likert Scale is a scale of 1–5 used by raters to evaluate if the generated path follows the instruction, and it is used in the human evaluation process.",
            "source_entities": [
                "LIKERT SCALE",
                "RATERS"
            ]
        },
        {
            "entity_name": "Goal Prediction and Action Generation",
            "entity_type": "EVENT",
            "description": "Goal Prediction is a process that is explicitly separated from Action Generation in the proposed model, which relies on the predicted goal.",
            "source_entities": [
                "GOAL PREDICTION",
                "ACTION GENERATION"
            ]
        }
    ],
    "chunk-0615433e74da4421e4727762494fe775": [
        {
            "entity_name": "Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition",
            "entity_type": "EVENT",
            "description": "An event where research papers are published, including those on vision and language navigation.",
            "source_entities": [
                "IEEE CONFERENCE ON COMPUTER VISION AND PATTERN RECOGNITION",
                "PROCEEDINGS OF THE IEEE CONFERENCE ON COMPUTER VISION AND PATTERN RECOGNITION"
            ]
        },
        {
            "entity_name": "Transactions of the Association for Computational Linguistics",
            "entity_type": "EVENT",
            "description": "An event where research papers on computational linguistics are published, including papers on semantic parsers and representation learning for grounded spatial reasoning.",
            "source_entities": [
                "TRANSACTIONS OF THE ASSOCIATION OF COMPUTATIONAL LINGUISTICS",
                "TRANSACTIONS OF THE ASSOCIATION FOR COMPUTATIONAL LINGUISTICS"
            ]
        },
        {
            "entity_name": "ATIS",
            "entity_type": "ORGANIZATION",
            "description": "ATIS is an organization involved in the development of the ATIS-3 corpus and the ATIS spoken language systems pilot corpus.",
            "source_entities": [
                "ATISPARK"
            ]
        },
        {
            "entity_name": "HCRC",
            "entity_type": "ORGANIZATION",
            "description": "HCRC is an organization that created the HCRC map task corpus and includes contributors such as Anne H Anderson and Miles Bader.",
            "source_entities": [
                "HCRC",
                "ANNE H ANDERSON",
                "MILES BADER"
            ]
        }
    ]
}