{
    "image_1": {
        "image_id": 1,
        "image_path": "./fusion_research/fusion_dataset/news/20220719/images/image_1.jpg",
        "caption": [
            "Rehydrating a soldier at Buckingham Palace. The changing of the guard ceremony was scaled back as London neared 100 degrees. "
        ],
        "footnote": [],
        "context": "The push comes as a deadly summer heat wave made worse by climate change is breaking temperature records in England and sparking wildfires in France, Spain, Portugal and Greece. Dozens of turbines could soon be marching across the horizon, providing urgently needed renewable energy to Catalonia, Government officials are set to approve construction of a huge floating wind farm just offshore, and international energy companies are already jockeying to harness the volatile northerly winds in the area known as la Tramontana. By DAVID GELLES By ALAN RAPPEPORT and JIM TANKERSLEY Wind Farm May Rise on Spanish Seascape That Inspired Dalí he could not immediately support a climate, energy and tax package he had spent months negotiating with the Democratic leadership. He expressed deep misgivings about the international tax deal, which he had previously indicated he could support, saying it would put American companies at a disContinued on Page A15 WASHINGTON — In June, months after reluctantly signing on to a global tax agreement brokered by the United States, Ireland’s finance minister met privately with Treasury Secretary Janet L. Yellen, seeking reassurances that the Biden administration would hold up its end of the deal. Manchin’s ‘No’ Risks Derailing Global Tax Deal ",
        "chunk_order_index": 0,
        "chunk_id": "chunk-13741fb1d335b6a8a60c106410d51dbd",
        "description": "The image captures a moment at Buckingham Palace during the changing of the guard ceremony, which was scaled back due to extreme heat. A soldier in traditional ceremonial attire is being assisted by a security officer. The soldier is dressed in a bright red uniform with gold buttons and a black bearskin hat, holding a rifle. He appears to be experiencing heat-related distress, as he is receiving assistance from the security officer, who is providing him with water or possibly oxygen. The security officer is wearing a dark vest over a white shirt and has a radio attached to his belt. The background features part of the palace's ornate architecture, including a stone balustrade and a blue door with gold trim. The scene conveys a sense of urgency and care, highlighting the impact of extreme weather conditions on public events and individuals.",
        "segmentation": true
    },
    "image_2": {
        "image_id": 2,
        "image_path": "./fusion_research/fusion_dataset/news/20220719/images/image_2.jpg",
        "caption": [
            "CLAES OLDENBURG, 1929-2022 "
        ],
        "footnote": [],
        "context": "The contentious project on the Spanish coast is emblematic of a push-and-pull taking place throughout Europe as officials rush to reduce planet-warming Yehor had hid for two weeks as Russian troops bombed and murdered their way through the town. There, at the entrance to the school basement, was where a Russian soldier had shot a woman in the head just because he could. And over there, on top Spain that is still highly dependent on fossil fuels, but fundamentally altering the character of a region that has changed little from the time when Dalí walked the hills. By MICHAEL SCHWIRTZ horizon, providing urgently needed renewable energy to Catalonia, a part of BUCHA, Ukraine — For the first time since the war began, the Stanislavchuk family was together again. Yehor was leading his parents, Natasha and Sasha, his sister, Tasya, and his grandmother, Lyudmila, on a tour of Bucha, the quaint suburb of Kyiv that has become synonymous with Russian savagery. Here was the school where An influential Pop artist, he transformed ordinary objects into extraordinarily imposing sculptures, including, from left, “Spoonbridge and Cherry,” “Shuttlecocks” and “Cupid’s Span.” Page B12. At Site of Atrocities Near Kyiv, Family Copes With War’s Trauma ",
        "chunk_order_index": 1,
        "chunk_id": "chunk-9fcbc6d539c0abc23da7139c6d352ed0",
        "description": "The image is a triptych featuring three large-scale sculptures by the influential Pop artist Claes Oldenburg. From left to right: The first sculpture is 'Spoonbridge and Cherry,' depicting a giant spoon with a cherry on top, placed in a serene park setting with greenery and a pond in the background. The second sculpture is 'Shuttlecocks,' showing an oversized shuttlecock standing upright on a grassy lawn in front of a grand neoclassical building. The third sculpture is 'Cupid’s Span,' which consists of a massive bow and arrow, set in a grassy area with a clock tower visible in the distance. Each sculpture transforms ordinary objects into extraordinary and imposing art pieces, creating a whimsical and striking visual impact.",
        "segmentation": true
    },
    "image_3": {
        "image_id": 3,
        "image_path": "./fusion_research/fusion_dataset/news/20220719/images/image_3.jpg",
        "caption": [],
        "footnote": [],
        "context": "Netflix Gets In on the Action The streaming service hopes “The Gray Man” will become a blockbuster driver of subscriptions. PAGE B1 Did Trump Media Deal Leak? Authorities are investigating a surge BUSINESS B1-5  Joe Davis, 34, took over for Vin Scully. Now, he will replace Joe Buck in the Fox booth for Tuesday’s All-Star Game and the World Series. PAGE B6 A Rising Baseball Voice SPORTS B6-10  Prosecutors played recordings of gunshots and screams at the sentencing trial of the man who killed 17 at a Parkland, Fla., high school in 2018. PAGE A14 Parkland Horror Recounted NATIONAL A11-17 for residents to let the virus control their lives. The state health director in Louisiana likened a new rise in Covid cases there to a downpour $\\mathrm{~\\textbf~{~\\mu~}~}^{\\epsilon_{\\mathrm{a}}}$ surge within a surge” — but characterized the situation as concerning but not alarming. CHICAGO — Covid-19 is surging around the United States again, fueled by what experts consider the most transmissible variant of the pandemic yet. This article is by Julie Bosman, Thomas Fuller and Edgar Sandoval. With Public Weary and Data Murky, Officials Hesitate to Act MUTED WARNINGS AS VIRUS SURGES ACROSS COUNTRY Continued on Page A12 Continued on Page A9 ",
        "chunk_order_index": 2,
        "chunk_id": "chunk-a8f90295aaccaf7f3e20ceeb3b367df0",
        "description": "The image depicts a man with short, neatly styled hair and a beard, wearing a red suit jacket. He is standing in profile, facing to the left of the image. The background is filled with warm, reddish hues and appears to be a busy, possibly urban setting with blurred lights and reflections, suggesting a nightlife or evening scene. The overall atmosphere conveyed by the image is one of intensity and drama, with the man's serious expression adding to the sense of tension or anticipation.",
        "segmentation": true
    },
    "image_4": {
        "image_id": 4,
        "image_path": "./fusion_research/fusion_dataset/news/20220719/images/image_4.jpg",
        "caption": [],
        "footnote": [],
        "context": "Netflix Gets In on the Action The streaming service hopes “The Gray Man” will become a blockbuster driver of subscriptions. PAGE B1 Did Trump Media Deal Leak? Authorities are investigating a surge in trading that preceded the announcement of a \\$300 million deal. PAGE B1 Monkeypox Advice in Dispute New York City epidemiologists say that some public health messages have given misleading and dangerous BUSINESS B1-5  Joe Davis, 34, took over for Vin Scully. Now, he will replace Joe Buck in the Fox booth for Tuesday’s All-Star Game and the World Series. PAGE B6 A Rising Baseball Voice SPORTS B6-10 but characterized the situation as concerning but not alarming. CHICAGO — Covid-19 is surging around the United States again, fueled by what experts consider the most transmissible variant of the pandemic yet. This article is by Julie Bosman, Thomas Fuller and Edgar Sandoval. With Public Weary and Data Murky, Officials Hesitate to Act MUTED WARNINGS AS VIRUS SURGES ACROSS COUNTRY Continued on Page A12 Continued on Page A9  NATIONAL A11-17 Parkland Horror Recounted Prosecutors played recordings of gunshots and screams at the sentencing trial of the man who killed 17 at a Parkland, Fla., high school in 2018. PAGE A14 ",
        "chunk_order_index": 2,
        "chunk_id": "chunk-a8f90295aaccaf7f3e20ceeb3b367df0",
        "description": "The image is a close-up photograph of an elephant. The elephant's trunk is curled upwards and slightly to the left, suggesting a playful or curious posture. The skin texture is rough and wrinkled, typical of elephants, with a grayish-brown coloration. The elephant's large ear is prominently visible, covering a significant portion of the right side of the image. The background appears to be a natural setting with blurred greenery, indicating that the photo was likely taken in the wild or a natural habitat. The lighting suggests it is daytime, with sunlight casting shadows on the elephant's face and trunk.",
        "segmentation": true
    },
    "image_5": {
        "image_id": 5,
        "image_path": "./fusion_research/fusion_dataset/news/20220719/images/image_5.jpg",
        "caption": [],
        "footnote": [],
        "context": "Netflix Gets In on the Action The streaming service hopes “The Gray Man” will become a blockbuster driver of subscriptions. PAGE B1 Did Trump Media Deal Leak? Authorities are investigating a surge in trading that preceded the announcement of a \\$300 million deal. PAGE B1 Monkeypox Advice in Dispute New York City epidemiologists say that some public health messages have given misleading and dangerous guidance about the disease’s spread. PAGE A12 A Thriving Arabic Party Scene Several venues in New York City offer spaces where anyone and everyone can let loose and enjoy Middle Eastern and North African BUSINESS B1-5 is by Julie Bosman, Thomas Fuller and Edgar Sandoval. With Public Weary and Data Murky, Officials Hesitate to Act MUTED WARNINGS AS VIRUS SURGES ACROSS COUNTRY Continued on Page A12 Continued on Page A9  NATIONAL A11-17 Parkland Horror Recounted Prosecutors played recordings of gunshots and screams at the sentencing trial of the man who killed 17 at a Parkland, Fla., high school in 2018. PAGE A14  SPORTS B6-10 A Rising Baseball Voice Joe Davis, 34, took over for Vin Scully. Now, he will replace Joe Buck in the Fox booth for Tuesday’s All-Star Game and the World Series. PAGE B6 ",
        "chunk_order_index": 2,
        "chunk_id": "chunk-a8f90295aaccaf7f3e20ceeb3b367df0",
        "description": "The image shows a person standing outdoors in a forested area. The individual has long, braided hair and is wearing a teal-colored top. They are adorned with a large, orange beaded necklace that stands out against the teal shirt. The background consists of tall trees with green foliage, suggesting a serene and natural setting. The lighting indicates it might be daytime, with sunlight filtering through the leaves, creating a dappled effect on the person's face and clothing. The overall atmosphere conveyed by the image is one of tranquility and connection with nature.",
        "segmentation": true
    }
}