{
  "chunk-13741fb1d335b6a8a60c106410d51dbd": {
    "tokens": 1200,
    "content": "\"All the News That's Fit to Print\"  \n\n# Che Neu Jork Cimes  \n\n# VOL. CLXXI . . . No. 59,489  \n\n© 2022  The New York Times Company  \n\nNEW YORK, TUESDAY, JULY 19, 2022  \n\n# Blast of Heat Brings Britain To a Standstill  \n\nWave Moves North as Europe Battles Fires  \n\n# By MARK LANDLER  \n\nLONDON — Trains slowed to a crawl. Schools and doctors’ offices shut their doors. The British Museum closed its galleries. Buckingham  Palace  curtailed  the changing of the guard. And the government urged people to work from home.  \n\nMuch of Britain took an involuntary siesta on Monday as merciless heat filtered north from a fire-ravaged continental Europe, driving  temperatures  close  to triple digits Fahrenheit in many areas and reaching the hottest mark ever recorded in Wales. The authorities placed most of the country under a “red” warning for heat for the first time in history, with the mercury hovering around 100 degrees Fahrenheit (37.5 degrees Celsius) across London and the country’s south and Midlands. Britain’s top reading, 100.6,  did  not  quite  reach  the record of 101.7 set in Cambridge in July 2019, but to a sweltering nation, that felt like a distinction without a difference.  \n\nOn the sweltering London Underground — most lines are not air-conditioned — Georgia McQuade, 22, lugged a heavy suitcase as she made her way to Victoria  bus  station,  where  she planned to catch a bus home to Paris.  \n\n“The Tube is really hot right now,” Ms. McQuade said. But she added, “I don’t want to get an Uber, because using cars so much is what caused this heat in the first place.”  \n\nShe expected to encounter even more ferocious temperatures in Paris, as a mass of hot air has baked Italy and Spain over the past week and fanned wildfires in France and other parts of Europe, before spilling across the English Channel.  \n\nOn Monday, French firefighters were battling two enormous wildfires that had torn through 55 square miles of dry pine forest in Continued on Page A7  \n\n# Democrats Take Abortion Battle To Black Voters  \n\n# By ZOLAN KANNO-YOUNGS  \n\nAs she and other faith leaders sat last month with Vice President Kamala Harris to discuss the implications of the Supreme Court’s overturning Roe v. Wade, the Rev. Najuma Smith-Pollard, a pastor at a Black church in Los Angeles, reflected on the complex feelings in her community about abortion.  \n\noverwhelmingly allied with the Democratic  Party,  some,  especially older churchgoers, have a conservative  streak  when  it comes to social issues like abortion. The best way to communicate to them, Ms. Smith-Pollard and other faith leaders said not long before the court ruled to eliminate the constitutional right to abortion, would be to frame the response as not just a matter of abortion, but rather as part of broader movement to restrict individual rights, including voting, marriage and control over one’s own body.  \n\nThe  most  effective  message “would be like having to have the conversation without the word abortion,” Ms. Smith-Pollard later said in an interview.  \n\n“We were all clear that this is about abortion, but this is not just about abortion,” Ms. Smith-Pollard said, adding that it was imperative to focus on “the implicaContinued on Page A13  \n\nMs. Yellen assured the minister, Paschal Donohoe, that the administration would be able to secure enough votes in Congress to ensure that the United States was in compliance with the pact, which was aimed at cracking down on companies evading taxes by shifting jobs and profits around the world.  \n\nMr. Tibau, one of the two remaining fishermen in this speck of a Mediterranean town about 100 miles north of Barcelona, was hoping for a haul of lobster, langoustine and scorpionfish. But as he slowly motored into an otherwise deserted bay, he was preoccupied by the looming threat of modern  \n\nPORT LLIGAT, Spain — Moises Tibau clambered aboard his small wooden boat at dawn, pushing off from  a  craggy  outcropping  in front of the house where Salvador Dalí composed some of his most famous Surrealist paintings.  \n\nIt turns out that Ms. Yellen was overly optimistic. Late last week, Senator Joe Manchin III, Democrat of West Virginia, effectively scuttled  the  Biden  administration’s tax agenda in Congress — at least for now — by saying he could not immediately support a climate, energy and tax package he had  spent  months  negotiating with the Democratic leadership. He expressed deep misgivings about the international tax deal, which he had previously indicated he could support, saying it would put American companies at a disContinued on Page A15  \n\nWASHINGTON  —  In  June, months after reluctantly signing on to a global tax agreement brokered by the United States, Ireland’s finance minister met privately with Treasury Secretary Janet L. Yellen, seeking reassurances that the Biden administration would hold up its end of the deal.  \n\n# Manchin’s ‘No’ Risks Derailing Global Tax Deal  \n\n![](images/image_1.jpg)  \nRehydrating a soldier at Buckingham Palace. The changing of the guard ceremony was scaled back as London neared 100 degrees.  \n\n# Wind Farm May Rise on Spanish Seascape That Inspired Dalí  \n\n# By ALAN RAPPEPORT and JIM TANKERSLEY  \n\n# By DAVID GELLES  \n\nGovernment officials are set to approve construction of a huge floating wind farm just offshore, and international energy companies are already jockeying",
    "chunk_order_index": 0,
    "full_doc_id": "doc-4eb487fe28ba4452734a4e25196ae8b9"
  },
  "chunk-9fcbc6d539c0abc23da7139c6d352ed0": {
    "tokens": 1200,
    "content": "Tax Deal  \n\n![](images/image_1.jpg)  \nRehydrating a soldier at Buckingham Palace. The changing of the guard ceremony was scaled back as London neared 100 degrees.  \n\n# Wind Farm May Rise on Spanish Seascape That Inspired Dalí  \n\n# By ALAN RAPPEPORT and JIM TANKERSLEY  \n\n# By DAVID GELLES  \n\nGovernment officials are set to approve construction of a huge floating wind farm just offshore, and international energy companies are already jockeying to harness the volatile northerly winds in the area known as la Tramontana.  \n\nThe push comes as a deadly summer heat wave made worse by climate change is breaking temperature records in England and sparking wildfires in France, Spain, Portugal and Greece. Dozens of turbines could soon be marching across the horizon, providing urgently needed renewable energy to Catalonia, a part of  \n\nBUCHA, Ukraine — For the first time since the war began, the Stanislavchuk family was together again.  \n\nYehor was leading his parents, Natasha and Sasha, his sister, Tasya, and his grandmother, Lyudmila, on a tour of Bucha, the quaint suburb of Kyiv that has become synonymous with Russian savagery. Here  was  the  school  where  \n\nAn influential Pop artist, he transformed ordinary objects into extraordinarily imposing sculptures, including, from left, “Spoonbridge and Cherry,” “Shuttlecocks” and “Cupid’s Span.” Page B12.  \n\n# At Site of Atrocities Near Kyiv, Family Copes With War’s Trauma  \n\n![](images/image_2.jpg)  \nCLAES OLDENBURG, 1929-2022  \n\n# By MICHAEL SCHWIRTZ  \n\nSpain that is still highly dependent on fossil fuels, but fundamentally altering the character of a region that has changed little from the time when Dalí walked the hills.  \n\nThe contentious project on the Spanish coast is emblematic of a push-and-pull  taking  place throughout  Europe  as  officials rush to reduce planet-warming Yehor had hid for two weeks as Russian troops bombed and murdered their way through the town. There,  at  the  entrance  to  the school basement, was where a Russian soldier had shot a woman in the head just because he could. And over there, on top of the yellow crane, was where the sniper sat, picking off civilians as they scrounged for food and water. Yehor, 28, spoke calmly, and no one expressed surprise. These stories are well known now in Ukraine.  \n\n# As Green Energy Plans Expand, Tensions Flare in Europe  \n\nYet from the coast of Spain to the rivers of Albania, efforts to deploy large wind, solar and hydroelectricity projects are running into  roadblocks  that  include NIMBYism,  environmentalist concerns and a bureaucracy that hampers quick action.  \n\nComplicating matters is the fact that big wind and solar projects Continued on Page A6  \n\nIt was cool and cloudy, and if you squinted you might be able to ignore the incinerated cars and piles of brick and ash that once were homes and imagine that it was a regular summer Saturday in July. White hydrangeas were blooming, and the cherry, apple  \n\n# Reunion After Months of Being Separated  \n\nemissions by phasing out fossil fuels and rapidly building utilityscale renewable energy projects. The war in Ukraine has added urgency to the effort, as European policymakers try to break free from their dependence on Russian oil and gas.  \n\nand plum trees were laden with unripe fruit. At a cafe called Mr. Coffee, the young barista was doing brisk business, selling lattes and fresh croissants to families and hipsters with neck tattoos. Children were being pushed in strollers and riding scooters and HIDDEN ENEMY Ukraine’s president signaled a bolder approach in rooting out spies. PAGE A8  \n\n“I feel strongly that you can’t just kind of cry wolf all the time,” said Dr. Allison Arwady, the commissioner of the Chicago health department, who said she would wait to see whether hospitals become strained before considering another citywide mask mandate. “I want to save the requirements around masks or updating vaccine  requirements  for  when there’s a significant change.” Complicating the country’s un  \n\nThe latest surge, driven by a spike of BA.5 subvariant cases in this country since May, has sent infections rising in at least 40 states, particularly in the Great Plains, West and South. Hospitalizations have climbed by 20 percent in the past two weeks, leaving more than 40,000 people in American hospitals with the coronavirus on an average day.  \n\nAnd the public health officer in King County, Wash., Dr. Jeffrey Duchin, said on Thursday that officials were discussing reissuing a mask mandate but would prefer that the public mask up voluntarily. “We’re not going to be able to have infinite series of mandates forcing people to do this, that and the other,” he said.  \n\nBut something is different this time: The public health authorities are holding back.  \n\nSPIKE IN A SUBVARIANT derstanding of this BA.5 wave is a dearth of data. Not since the earliest months of the pandemic has there been so little precise infor  \n\nMore than two years after the pandemic began, though, public health officials are sounding only quiet warnings amid a picture that they hope has been changed by vaccines, treatments and rising immunity. Deaths are rising, but only modestly so far in this new wave. And state and local public health officials say they also must now factor in a reality that is obvious along the streets from Seattle to New York City: Most Americans are meeting a new Covid wave  with  a  collective  shrug, shunning masks, joining crowds indoors and moving on from the endless barrage of virus",
    "chunk_order_index": 1,
    "full_doc_id": "doc-4eb487fe28ba4452734a4e25196ae8b9"
  },
  "chunk-a8f90295aaccaf7f3e20ceeb3b367df0": {
    "tokens": 733,
    "content": "are sounding only quiet warnings amid a picture that they hope has been changed by vaccines, treatments and rising immunity. Deaths are rising, but only modestly so far in this new wave. And state and local public health officials say they also must now factor in a reality that is obvious along the streets from Seattle to New York City: Most Americans are meeting a new Covid wave  with  a  collective  shrug, shunning masks, joining crowds indoors and moving on from the endless barrage of virus warnings of months past.  \n\nIn Chicago, where the county’s Covid warning level was raised to “high” last week, the city’s top doctor said there was no reason for residents to let the virus control their lives. The state health director in Louisiana likened a new rise in Covid cases there to a downpour $\\mathrm{~\\textbf~{~\\mu~}~}^{\\epsilon_{\\mathrm{a}}}$ surge within a surge” — but characterized the situation as concerning but not alarming.  \n\nCHICAGO — Covid-19 is surging  around  the  United  States again, fueled by what experts consider the most transmissible variant of the pandemic yet.  \n\nThis article is by Julie Bosman, Thomas Fuller and Edgar Sandoval.  \n\nWith Public Weary and Data Murky, Officials Hesitate to Act  \n\n# MUTED WARNINGS AS VIRUS SURGES ACROSS COUNTRY  \n\nContinued on Page A12  \n\nContinued on Page A9  \n\n![](images/image_3.jpg)  \n\n# NATIONAL A11-17  \n\n# Parkland Horror Recounted  \n\nProsecutors played recordings of gunshots and screams at the sentencing trial of the man who killed 17 at a Parkland, Fla., high school in 2018.  PAGE A14  \n\n![](images/image_4.jpg)  \n\n# SPORTS B6-10  \n\n# A Rising Baseball Voice  \n\nJoe Davis, 34, took over for Vin Scully. Now, he will replace Joe Buck in the Fox booth for Tuesday’s All-Star Game and the World Series. PAGE B6  \n\n![](images/image_5.jpg)  \n\n# BUSINESS B1-5  \n\nNetflix Gets In on the Action The streaming service hopes “The Gray Man” will become a blockbuster driver of subscriptions. PAGE B1 Did Trump Media Deal Leak? Authorities are investigating a surge in trading that preceded the announcement of a \\$300 million deal.  PAGE B1 Monkeypox Advice in Dispute New York City epidemiologists say that some public health messages have given misleading and dangerous guidance about the disease’s spread. PAGE A12 A Thriving Arabic Party Scene Several venues in New York City offer spaces where anyone and everyone can let loose and enjoy Middle Eastern and North African music. PAGE A11  \n\n# SCIENCE TIMES D1-8  \n\nThe Tools in the Trunk The secret behind an elephant’s ability to do many feats of flexibility and force may be found right on its nose.  PAGE D2 Snapshots of the Universe Our writer tells of the meetings where experts picked the first shots from the Webb telescope to share. PAGE D4 INTERNATIONAL A4-10 Honoring Abe’s Legacy Prime Minister Fumio Kishida of Japan says he will pursue Shinzo Abe’s goals, such as a stronger military. But he is also setting himself apart. PAGE A10 OPINION A18-19 Michelle Goldberg  \n\n# ARTS C1-6  \n\nSatire, Surrealism and Race In recent books, Chinelo Okparanta, above, and other authors of color have turned to sometimes biting humor to explore racism. PAGE C1",
    "chunk_order_index": 2,
    "full_doc_id": "doc-4eb487fe28ba4452734a4e25196ae8b9"
  }
}