{
    "chunk-755939eee019872ff5affa293e82c0c5": [
        {
            "entity_name": "Wilbur(ZUCKERMAN'S FAMOUS PIG)",
            "entity_type": "PERSON",
            "description": "Wilbur is a pig who is being prepared for the fair and is advised by the old sheep on how to act when being loaded into the crate. He is also referred to as 'Zuckerman's Famous Pig'.",
            "source_entities": [
                "WILBUR",
                "ZUCKERMAN'S FAMOUS PIG"
            ]
        }
    ],
    "chunk-f120fec315b3df9a3b00040815316218": [
        {
            "entity_name": "Wilbur",
            "entity_type": "PERSON",
            "description": "Wilbur is a pig who is being unloaded into a new pigpen at the fair, interacts with other characters, and is central to the story. He is described as having a silky white coat, curly tail, and a kind and radiant expression.",
            "source_entities": [
                "WILBUR",
                "ZUCKERMAN'S FAMOUS PIG"
            ]
        },
        {
            "entity_name": "Mr. Zuckerman",
            "entity_type": "PERSON",
            "description": "Mr. Zuckerman is involved in taking care of Wilbur, interested in looking at tractors at the fair, and walks away with Mrs. Zuckerman and the Arables towards the cattle barn.",
            "source_entities": [
                "MR. ZUCKERMAN",
                "MR. ZUCKERMAN"
            ]
        },
        {
            "entity_name": "Lurvy",
            "entity_type": "PERSON",
            "description": "Lurvy is a character who wanders off by himself, hoping to meet friends and have some fun on the midway.",
            "source_entities": [
                "LURVY",
                "LURVY"
            ]
        },
        {
            "entity_name": "Uncle",
            "entity_type": "PERSON",
            "description": "Uncle is a large pig in the pen next to Wilbur, characterized by his big size, loud voice, and unattractive personality. He is also known for cracking weak jokes and being less clean and pleasant than Wilbur.",
            "source_entities": [
                "UNCLE",
                "UNCLE"
            ]
        }
    ],
    "chunk-b2e4d78b2ca09956b51bd47ad8e07f07": [
        {
            "entity_name": "Charlotte's Egg Sac (Egg Sac, Peachy Little Sac)",
            "entity_type": "OBJECT",
            "description": "Charlotte's Egg Sac is an important object in the narrative, symbolizing her 'great work' and containing 514 eggs. It is described as strong, made of the toughest material, and waterproof, ensuring the eggs inside will be warm and dry. Wilbur affectionately refers to it as the 'peachy little sac'.",
            "source_entities": [
                "EGG SAC",
                "PEACHY LITTLE SAC"
            ]
        }
    ],
    "chunk-9304f370ce63444623c505eb4d1c4046": [
        {
            "entity_name": "Wilbur (The Zuckerman Pig)",
            "entity_type": "PERSON",
            "description": "Wilbur is a pig who is being transported to a judging event and is the center of attention due to a miraculous event involving his web. He is also known as the Zuckerman pig, famous for the miraculous writing on Charlotte's web in Zuckerman's barn.",
            "source_entities": [
                "WILBUR",
                "THE ZUCKERMAN PIG"
            ]
        }
    ],
    "chunk-91bf631ebfbbe809e5abac021fc92c14": [
        {
            "entity_name": "County Fair (Great County Fair)",
            "entity_type": "EVENT",
            "description": "The County Fair, also referred to as the Great County Fair, is the event where Wilbur wins a special prize and attracts many visitors. It is the location where the events of the story unfold.",
            "source_entities": [
                "COUNTY FAIR",
                "GREAT COUNTY FAIR"
            ]
        }
    ],
    "chunk-f6a341547e19189c5ca48f1b8e38bc76": [
        {
            "entity_name": "Mr. Arable (John Arable)",
            "entity_type": "PERSON",
            "description": "Mr. Arable, also known as John Arable, is a character who drives a truck and is involved in handling Wilbur.",
            "source_entities": [
                "\"MR. ARABLE\"",
                "\"JOHN ARABLE\""
            ]
        }
    ],
    "chunk-853bbdb1918877bb9383f2d1c6d22b4c": [
        {
            "entity_name": "Templeton (The Rat)",
            "entity_type": "PERSON",
            "description": "Templeton, also known as the Rat, is a character who moves indoors for the winter and has a relationship with Wilbur, growing big and fat due to overeating. He is advised by the old sheep to eat less for a longer life.",
            "source_entities": [
                "TEMPLETON",
                "THE RAT"
            ]
        }
    ],
    "chunk-5cf6efc77f0ce109563176fc97f22ebe": [
        {
            "entity_name": "Charlotte's Babies (Balloonists)",
            "entity_type": "PERSON",
            "description": "Charlotte's babies, also known as balloonists, are the offspring of Charlotte, the spider. They are leaving the barn cellar using balloons to disperse and create their own webs.",
            "source_entities": [
                "CHARLOTTE'S BABIES",
                "BALLOONISTS"
            ]
        },
        {
            "entity_name": "Charlotte (Spiders)",
            "entity_type": "PERSON",
            "description": "Charlotte is a spider known for her brilliance, beauty, and loyalty. She is the mother of Joy, Aranea, Nellie, and other spider offspring, who are collectively referred to as spiders.",
            "source_entities": [
                "CHARLOTTE",
                "SPIDERS"
            ]
        },
        {
            "entity_name": "Wilbur's Triumph (The Miracle of the Web)",
            "entity_type": "EVENT",
            "description": "Wilbur's triumph and the miracle of the web refer to the same event, where Charlotte's web created a miracle that led to Wilbur's victory and was remembered as a significant event in the barn.",
            "source_entities": [
                "WILBUR'S TRIUMPH",
                "THE MIRACLE OF THE WEB"
            ]
        }
    ],
    "chunk-bbd8b21537b411d0f31462dad600b699": [
        {
            "entity_name": "Charlotte A. Cavatica",
            "entity_type": "PERSON",
            "description": "A large grey spider who becomes a dear friend to Wilbur, a little pig, and saves his life with her clever plan. She is also known as Charlotte.",
            "source_entities": [
                "CHARLOTTE A. CAVATICA",
                "CHARLOTTE"
            ]
        }
    ]
}