{
    "chunk-755939eee019872ff5affa293e82c0c5": [
        {
            "entity_name": "Wilbur",
            "entity_type": "PERSON",
            "description": "Wilbur is a pig who is being prepared for the fair and is advised by the old sheep on how to act when being loaded into the crate. He is also referred to as 'Zuckerman's Famous Pig'.",
            "source_entities": [
                "WILBUR",
                "ZUCKERMAN'S FAMOUS PIG"
            ]
        },
        {
            "entity_name": "Zuckerman's Famous Pig and Two Stowaways",
            "entity_type": "ORGANIZATION",
            "description": "Zuckerman's Famous Pig and Two Stowaways refers to the crate's contents, including Wilbur, Templeton, and Charlotte, who are hiding inside the crate.",
            "source_entities": [
                "ZUCKERMAN'S FAMOUS PIG AND TWO STOWAWAYS",
                "THE CRATE"
            ]
        },
        {
            "entity_name": "The Fair",
            "entity_type": "EVENT",
            "description": "The fair is an event where Wilbur is being taken, described as a place with abundant food leftovers, and includes various locations such as the midway, infield, horse barn, tents, booths, and hay lofts.",
            "source_entities": [
                "FAIR",
                "THE FAIR",
                "MIDWAY",
                "INFIELD",
                "HORSE BARN",
                "TENTS",
                "BOOTHS",
                "HAY LOFTS"
            ]
        }
    ],
    "chunk-9f963812757e4e9006fc123e1a244864": [
        {
            "entity_name": "Wilbur",
            "entity_type": "PERSON",
            "description": "Wilbur is a central character in the narrative who experiences radiance, fainting, and is the focus of concern from other characters. He is handled and loaded onto a truck for transport to the fair.",
            "source_entities": [
                "\"WILBUR\"",
                "PAPA"
            ]
        },
        {
            "entity_name": "Fern",
            "entity_type": "PERSON",
            "description": "Fern is a character who shows concern for Wilbur, interacts with other characters, and participates in the fair activities.",
            "source_entities": [
                "\"FERN\""
            ]
        },
        {
            "entity_name": "Avery",
            "entity_type": "PERSON",
            "description": "Avery is a mischievous character who pretends to be a pig, interacts with Wilbur, and engages in various activities at the fair.",
            "source_entities": [
                "\"AVERY\""
            ]
        },
        {
            "entity_name": "Templeton",
            "entity_type": "PERSON",
            "description": "Templeton is a rat who comments on the actions of the boys and is involved in the events at the fair, hiding under the straw in the crate.",
            "source_entities": [
                "\"TEMPLETON\""
            ]
        },
        {
            "entity_name": "Mr. Arable",
            "entity_type": "PERSON",
            "description": "Mr. Arable is a character who handles the truck, is involved in the events surrounding Wilbur, and participates in the fair activities.",
            "source_entities": [
                "\"MR. ARABLE\""
            ]
        },
        {
            "entity_name": "Mrs. Arable",
            "entity_type": "PERSON",
            "description": "Mrs. Arable is a character who commands Avery and is involved in the events at the fair.",
            "source_entities": [
                "\"MRS. ARABLE\""
            ]
        },
        {
            "entity_name": "Zuckerman",
            "entity_type": "PERSON",
            "description": "Zuckerman is a character who assesses Wilbur's condition, is involved in the events at the fair, and helps load Wilbur onto the truck.",
            "source_entities": [
                "\"ZUCKERMAN\"",
                "\"MRS. ZUCKERMAN\""
            ]
        },
        {
            "entity_name": "Lurvy",
            "entity_type": "PERSON",
            "description": "Lurvy is a character who assists in handling Wilbur, is involved in the events at the fair, and helps load Wilbur onto the truck.",
            "source_entities": [
                "\"LURVY\""
            ]
        },
        {
            "entity_name": "The Fair",
            "entity_type": "EVENT",
            "description": "The Fair is a significant event where various characters gather and participate in different activities, such as riding the Ferris wheel and eating various foods.",
            "source_entities": [
                "\"THE FAIR\""
            ]
        },
        {
            "entity_name": "The Ferris Wheel",
            "entity_type": "GEO",
            "description": "The Ferris wheel is a notable attraction at the fair, symbolizing the excitement and activities available.",
            "source_entities": [
                "\"THE FERRIS WHEEL\""
            ]
        },
        {
            "entity_name": "Geese",
            "entity_type": "PERSON",
            "description": "The geese are a group of characters that react to the events and cheer at various points in the story.",
            "source_entities": [
                "\"GEESE\""
            ]
        },
        {
            "entity_name": "Charlotte",
            "entity_type": "PERSON",
            "description": "Charlotte is a character who hides in a knothole to avoid being seen by Avery and is involved in the events at the fair.",
            "source_entities": [
                "\"CHARLOTTE\""
            ]
        },
        {
            "entity_name": "Fair Grounds",
            "entity_type": "GEO",
            "description": "The Fair Grounds is the location where the fair takes place, featuring various attractions and activities such as the Ferris wheel, race track, and fireworks shed.",
            "source_entities": [
                "\"FAIR GROUNDS\"",
                "\"FIREWORKS SHED\"",
                "\"RACE TRACK\""
            ]
        }
    ],
    "chunk-f120fec315b3df9a3b00040815316218": [
        {
            "entity_name": "Wilbur",
            "entity_type": "PERSON",
            "description": "Wilbur is a pig who is being unloaded into a new pigpen at the fair, interacts with other characters, and is central to the story. He is described as having a silky white coat, curly tail, and a kind and radiant expression.",
            "source_entities": [
                "WILBUR",
                "ZUCKERMAN'S FAMOUS PIG",
                "THE PIGPEN"
            ]
        },
        {
            "entity_name": "Mr. Zuckerman",
            "entity_type": "PERSON",
            "description": "Mr. Zuckerman is involved in taking care of Wilbur, interested in looking at tractors at the fair, and walks away with Mrs. Zuckerman and the Arables towards the cattle barn.",
            "source_entities": [
                "MR. ZUCKERMAN",
                "MR. ZUCKERMAN"
            ]
        },
        {
            "entity_name": "Lurvy",
            "entity_type": "PERSON",
            "description": "Lurvy is a character who wanders off by himself, hoping to meet friends and have some fun on the midway.",
            "source_entities": [
                "LURVY",
                "LURVY"
            ]
        },
        {
            "entity_name": "Uncle",
            "entity_type": "PERSON",
            "description": "Uncle is a large pig in the pen next to Wilbur, characterized by his big size, loud voice, and unattractive personality. He is also known for cracking weak jokes and being less clean and pleasant than Wilbur.",
            "source_entities": [
                "UNCLE",
                "UNCLE"
            ]
        }
    ],
    "chunk-f9b8acadcaeb8bbc04a9e91e2f931713": [
        {
            "entity_name": "Wilbur",
            "entity_type": "PERSON",
            "description": "Wilbur is a pig who is admired for his silky white coat, curly tail, and kind expression, and is a central character in the story. He is also referred to as 'Uncle' in the context of being a bigger pig.",
            "source_entities": [
                "\"WILBUR\"",
                "UNCLE"
            ]
        },
        {
            "entity_name": "Charlotte",
            "entity_type": "PERSON",
            "description": "Charlotte is a spider who builds webs and communicates with Wilbur, playing a significant role in the narrative. She is responsible for writing words in her web to help Wilbur.",
            "source_entities": [
                "\"CHARLOTTE\""
            ]
        },
        {
            "entity_name": "Templeton",
            "entity_type": "PERSON",
            "description": "Templeton is a rat who is involved in the story, going on an adventure to find food and a word for Charlotte. He is also the one who brings back the word 'Humble' for Charlotte's web.",
            "source_entities": [
                "\"TEMPLETON\""
            ]
        },
        {
            "entity_name": "Fern",
            "entity_type": "PERSON",
            "description": "Fern is a child who visits the pigpen, eats Cracker Jack, and later rides the Ferris wheel with her friend Henry Fussy. She is the daughter of Mrs. Arable.",
            "source_entities": [
                "\"FERN\"",
                "\"ARABLES\""
            ]
        },
        {
            "entity_name": "Avery",
            "entity_type": "PERSON",
            "description": "Avery is a child who visits the pigpen with a balloon tied to his ear and later rests under a blanket made from an Indian blanket. He is associated with the Zuckerman family.",
            "source_entities": [
                "\"AVERY\"",
                "\"ZUCKERMANS\""
            ]
        },
        {
            "entity_name": "Mrs. Arable",
            "entity_type": "PERSON",
            "description": "Mrs. Arable is an adult who comments on the heat and is the mother of Fern. She is a member of the Arable family.",
            "source_entities": [
                "\"MRS. ARABLE\"",
                "\"ARABLES\""
            ]
        },
        {
            "entity_name": "Lurvy",
            "entity_type": "PERSON",
            "description": "Lurvy is a character who carries an Indian blanket, which he won, and helps create shade for the children at the Fair Grounds.",
            "source_entities": [
                "\"LURVY\""
            ]
        },
        {
            "entity_name": "Henry Fussy",
            "entity_type": "PERSON",
            "description": "Henry Fussy is Fern's friend who invites her to ride the Ferris wheel with him and buys her a ticket.",
            "source_entities": [
                "\"HENRY FUSSY\""
            ]
        },
        {
            "entity_name": "Fair Grounds",
            "entity_type": "GEO",
            "description": "Fair Grounds is the location where the events of the story are taking place, including the pigpen and various attractions such as the Ferris wheel, the Beano Booth, and the midway with gambling machines and the Merry-Go-Round.",
            "source_entities": [
                "\"FAIR GROUNDS\"",
                "\"THE FERRIS WHEEL\"",
                "\"BEANO BOOTH\"",
                "\"MIDWAY\"",
                "\"GAMBLING MACHINES\"",
                "\"MERRY-GO-ROUND\""
            ]
        },
        {
            "entity_name": "Indian Blanket",
            "entity_type": "GEO",
            "description": "The Indian blanket is an item won by Lurvy and used to provide shade, suggesting its origin or style.",
            "source_entities": [
                "\"INDIAN\""
            ]
        },
        {
            "entity_name": "Humble",
            "entity_type": "EVENT",
            "description": "Humble is the last word that Charlotte writes in her web, which has a double meaning relevant to Wilbur's character, signifying that he is 'not proud' and 'near the ground'.",
            "source_entities": [
                "\"HUMBLE\""
            ]
        }
    ],
    "chunk-e279af1f25428445768a7a93045285ed": [
        {
            "entity_name": "Charlotte",
            "entity_type": "PERSON",
            "description": "Charlotte is a character who weaves words in her web to comfort Wilbur, creates an egg sac which she considers her magnum opus, and is a central figure in the events at the Fair.",
            "source_entities": [
                "CHARLOTTE",
                "MASTERPIECE"
            ]
        },
        {
            "entity_name": "Wilbur",
            "entity_type": "PERSON",
            "description": "Wilbur is a pig who is cared for by the Arables and Zuckermans, and is reassured by Charlotte about his future. He is central to the events at the Fair and is promised to be a famous pig.",
            "source_entities": [
                "WILBUR",
                "ZUCKERMAN"
            ]
        },
        {
            "entity_name": "Arables",
            "entity_type": "ORGANIZATION",
            "description": "The Arables are a family involved in the events at the Fair, responsible for Wilbur's care, and include Mr. Arable, Mrs. Arable, and their children Fern and Avery.",
            "source_entities": [
                "ARABLES",
                "MR. ARABLE",
                "MRS. ARABLE",
                "FERN",
                "AVERY"
            ]
        },
        {
            "entity_name": "Egg Sac",
            "entity_type": "GEO",
            "description": "The Egg Sac is a peach-colored sac containing Charlotte's 514 eggs, which she considers her magnum opus and is revealed to Wilbur in the morning.",
            "source_entities": [
                "EGG SAC",
                "FIRST LIGHT"
            ]
        },
        {
            "entity_name": "Fair",
            "entity_type": "EVENT",
            "description": "The Fair is an event where various characters gather, enjoy food, drinks, and entertainment, and is described as a paradise for a rat. It includes fireworks, a grandstand, and a merry-go-round, and is the setting for significant events involving Wilbur and Charlotte.",
            "source_entities": [
                "FAIR",
                "FIREWORKS",
                "GRANDSTAND",
                "MERRY-GO-ROUND"
            ]
        }
    ],
    "chunk-b2e4d78b2ca09956b51bd47ad8e07f07": [
        {
            "entity_name": "Charlotte's Egg Sac (Egg Sac, Peachy Little Sac)",
            "entity_type": "OBJECT",
            "description": "Charlotte's Egg Sac is an important object in the narrative, symbolizing her 'great work' and containing 514 eggs. It is described as strong, made of the toughest material, and waterproof, ensuring the eggs inside will be warm and dry. Wilbur affectionately refers to it as the 'peachy little sac'.",
            "source_entities": [
                "EGG SAC",
                "PEACHY LITTLE SAC"
            ]
        },
        {
            "entity_name": "Charlotte's Web",
            "entity_type": "OBJECT",
            "description": "Charlotte's Web is a central object in the narrative, where Charlotte writes words to save Wilbur. It is admired by visitors for its beauty, especially with the dew on it, and plays a significant role in the story's events.",
            "source_entities": [
                "WEB"
            ]
        },
        {
            "entity_name": "Wilbur's Pen (Fair Grounds)",
            "entity_type": "GEO",
            "description": "Wilbur's Pen is located at the Fair Grounds, a geographical location where events related to the fair are taking place. It is the place where Wilbur is kept and where a steady stream of people pass by to admire Charlotte's web and marvel at Wilbur.",
            "source_entities": [
                "FAIR GROUNDS"
            ]
        },
        {
            "entity_name": "Charlotte's Offspring (514 Eggs)",
            "entity_type": "EVENT",
            "description": "Charlotte's Offspring refers to the 514 eggs she has laid, which is a significant moment in the narrative and part of her life cycle. These eggs are expected to hatch in the spring, and Wilbur envisions a lively barn cellar with baby spiders, goslings, and lambs.",
            "source_entities": [
                "514 EGGS"
            ]
        },
        {
            "entity_name": "Uncle's Blue Tag",
            "entity_type": "OBJECT",
            "description": "Uncle's Blue Tag signifies that he, a pig, has won first prize at the fair. This information is shared by Templeton and impacts Wilbur's hopes, as it suggests that Wilbur might not win any prize and could face Zuckerman's potential intentions for using him for food.",
            "source_entities": [
                "BLUE TAG"
            ]
        }
    ],
    "chunk-b054668dbec45ac6c411e5cdade7daec": null,
    "chunk-9304f370ce63444623c505eb4d1c4046": [
        {
            "entity_name": "Wilbur (The Zuckerman Pig)",
            "entity_type": "PERSON",
            "description": "Wilbur is a pig who is being transported to a judging event and is the center of attention due to a miraculous event involving his web. He is also known as the Zuckerman pig, famous for the miraculous writing on Charlotte's web in Zuckerman's barn.",
            "source_entities": [
                "WILBUR",
                "THE ZUCKERMAN PIG"
            ]
        },
        {
            "entity_name": "Charlotte",
            "entity_type": "PERSON",
            "description": "Charlotte is a spider whose web is the site of a miraculous event that brought fame to Wilbur, and she is resting in her pigpen during the event. The miraculous event is also known as 'the writing on the spider's web', which declared Wilbur to be extraordinary.",
            "source_entities": [
                "CHARLOTTE",
                "THE SPIDER'S WEB",
                "THE WRITING ON THE SPIDER'S WEB"
            ]
        },
        {
            "entity_name": "The Judging Event (The Hour of Triumph, The Special Award)",
            "entity_type": "EVENT",
            "description": "The judging event is where Wilbur is presented to the crowd and judged, marking a significant moment for the characters involved. It is also referred to as 'The Hour of Triumph' and involves a special award given to Wilbur at the judging ring.",
            "source_entities": [
                "THE HOUR OF TRIUMPH",
                "THE SPECIAL AWARD"
            ]
        }
    ],
    "chunk-91bf631ebfbbe809e5abac021fc92c14": [
        {
            "entity_name": "County Fair (Great County Fair)",
            "entity_type": "EVENT",
            "description": "The County Fair, also referred to as the Great County Fair, is the event where Wilbur wins a special prize and attracts many visitors. It is the location where the events of the story unfold.",
            "source_entities": [
                "COUNTY FAIR",
                "GREAT COUNTY FAIR"
            ]
        },
        {
            "entity_name": "The Spider",
            "entity_type": "ANIMAL",
            "description": "The Spider is an entity discussed in the text, noted for its ability to weave webs but not to write, and is implied to be Charlotte.",
            "source_entities": [
                "THE SPIDER"
            ]
        },
        {
            "entity_name": "The Loud Speaker",
            "entity_type": "PERSON",
            "description": "The Loud Speaker is a character who announces the awarding of the special prize at the County Fair and inquires about Wilbur's condition when he faints.",
            "source_entities": [
                "THE LOUD SPEAKER"
            ]
        },
        {
            "entity_name": "The Judges",
            "entity_type": "ORGANIZATION",
            "description": "The Judges are part of the County Fair, responsible for handing out the prizes and medals, including the special prize to Mr. Zuckerman on behalf of Wilbur.",
            "source_entities": [
                "THE JUDGES"
            ]
        },
        {
            "entity_name": "The Photographer",
            "entity_type": "PERSON",
            "description": "The Photographer is a character who takes Wilbur's picture at the County Fair after he wins the special prize.",
            "source_entities": [
                "THE PHOTOGRAPHER"
            ]
        },
        {
            "entity_name": "The Crowd",
            "entity_type": "ORGANIZATION",
            "description": "The Crowd is a group of people present at the County Fair, reacting to the events involving Wilbur, including his fainting and revival.",
            "source_entities": [
                "THE CROWD"
            ]
        },
        {
            "entity_name": "The Pigpen",
            "entity_type": "GEO",
            "description": "The Pigpen is the location where Wilbur is returned after the events at the County Fair, as driven by Mr. Arable.",
            "source_entities": [
                "THE PIGPEN"
            ]
        }
    ],
    "chunk-f6a341547e19189c5ca48f1b8e38bc76": [
        {
            "entity_name": "Mr. Arable (John Arable)",
            "entity_type": "PERSON",
            "description": "Mr. Arable, also known as John Arable, is a character who drives a truck and is involved in handling Wilbur.",
            "source_entities": [
                "\"MR. ARABLE\"",
                "\"JOHN ARABLE\""
            ]
        },
        {
            "entity_name": "The Arables (The Zuckennans)",
            "entity_type": "ORGANIZATION",
            "description": "The Arables and The Zuckennans are families mentioned in the context of approaching Wilbur, indicating they are likely the same family being referred to with different names.",
            "source_entities": [
                "\"THE ARABLES\"",
                "\"THE ZUCKENNANS\""
            ]
        }
    ],
    "chunk-13dfd378a9b23f98f46d5fa0c2cae7f7": [
        {
            "entity_name": "Charlotte",
            "entity_type": "PERSON",
            "description": "Charlotte is a character who is very ill and cannot accompany the others home due to her condition. She is also the owner of the egg sac that Wilbur is desperate to save.",
            "source_entities": [
                "CHARLOTTE"
            ]
        },
        {
            "entity_name": "Wilbur",
            "entity_type": "PERSON",
            "description": "Wilbur is a character who is desperate to save Charlotte's egg sac and negotiates with Templeton to retrieve it. He is also the one who carries the egg sac home.",
            "source_entities": [
                "WILBUR"
            ]
        },
        {
            "entity_name": "Templeton",
            "entity_type": "PERSON",
            "description": "Templeton is a rat who is initially reluctant but eventually agrees to help Wilbur retrieve Charlotte's egg sac in exchange for food privileges. He is also the one who retrieves items from the dump and helps Wilbur in the past.",
            "source_entities": [
                "TEMPLETON"
            ]
        },
        {
            "entity_name": "Group of People",
            "entity_type": "ORGANIZATION",
            "description": "The group of people includes Lurvy, John Arable, Mr. Zuckerman, Mrs. Arable, Mrs. Zuckerman, Avery, and Fern, who are all coming to the location where Wilbur and Templeton are. They were also present when Wilbur fainted.",
            "source_entities": [
                "LURVY",
                "JOHN ARABLE",
                "MR. ZUCKERMAN",
                "MRS. ARABLE",
                "MRS. ZUCKERMAN",
                "AVERY",
                "FERN",
                "CROWD"
            ]
        },
        {
            "entity_name": "Egg Sac",
            "entity_type": "OBJECT",
            "description": "The Egg Sac is an object that contains Charlotte's eggs, which Wilbur is desperate to save and takes with him. It is waterproof and strong, as mentioned by Charlotte.",
            "source_entities": [
                "EGG SAC"
            ]
        }
    ],
    "chunk-853bbdb1918877bb9383f2d1c6d22b4c": [
        {
            "entity_name": "The Fair Grounds",
            "entity_type": "GEO",
            "description": "The Fair Grounds is a geographical location where the fair takes place and is central to the story's events, including being the place where the Ferris wheel operates and the race horses are loaded into vans after the fair. It is also where the infield, littered with bottles and trash, is located.",
            "source_entities": [
                "THE FAIR GROUNDS",
                "THE INFIELD"
            ]
        },
        {
            "entity_name": "Templeton (The Rat)",
            "entity_type": "PERSON",
            "description": "Templeton, also known as the Rat, is a character who moves indoors for the winter and has a relationship with Wilbur, growing big and fat due to overeating. He is advised by the old sheep to eat less for a longer life.",
            "source_entities": [
                "TEMPLETON",
                "THE RAT"
            ]
        },
        {
            "entity_name": "The Barn (The Pigpen)",
            "entity_type": "GEO",
            "description": "The Barn is a geographical location where Wilbur and other animals reside, and it is associated with a pleasant smell for Wilbur. It also includes the Pigpen, where Mr. Zuckerman hangs Wilbur's medal, indicating that the Pigpen is a part of the Barn.",
            "source_entities": [
                "THE BARN",
                "THE PIGPEN"
            ]
        },
        {
            "entity_name": "The Frozen Pond",
            "entity_type": "GEO",
            "description": "The Frozen Pond is a geographical location in the pasture where Fern and Avery coast, and it is part of the larger geographical area known as the Pasture.",
            "source_entities": [
                "THE FROZEN POND",
                "THE PASTURE"
            ]
        }
    ],
    "chunk-82e936cf2fd34b2e4ed3bdb7f4054d07": [
        {
            "entity_name": "Charlotte's Children",
            "entity_type": "PERSON",
            "description": "Charlotte's children are the tiny spiders that hatch from the egg sac and interact with Wilbur. They are the offspring of Charlotte, resembling her in appearance, and represent the new generation of life in the story.",
            "source_entities": [
                "CHARLOTTE'S CHILDREN"
            ]
        },
        {
            "entity_name": "The Farm",
            "entity_type": "GEO",
            "description": "The Farm is the geographical location where the story takes place, encompassing the barn, manure, pond, board fence, and sheepfold. It serves as the setting for the interactions between Wilbur, Templeton, the old sheep, and the arrival of spring.",
            "source_entities": [
                "THE FARM",
                "MANURE",
                "BOARD FENCE",
                "POND",
                "SHEEPFOLD"
            ]
        },
        {
            "entity_name": "Springtime",
            "entity_type": "EVENT",
            "description": "Springtime is the event marking the end of winter, the arrival of new life, and the hatching of Charlotte's children. It is symbolized by the chorus of frogs, the birth of new lambs, the singing of a sparrow, and the melting of snow, indicating the renewal of life and the cycle of seasons.",
            "source_entities": [
                "SPRINGTIME",
                "FROGS",
                "NEW LAMB",
                "SPARROW",
                "STREAMS AND DITCHES",
                "WARM UPDRAFT"
            ]
        }
    ],
    "chunk-5cf6efc77f0ce109563176fc97f22ebe": [
        {
            "entity_name": "Charlotte's Babies (Balloonists)",
            "entity_type": "PERSON",
            "description": "Charlotte's babies, also known as balloonists, are the offspring of Charlotte, the spider. They are leaving the barn cellar using balloons to disperse and create their own webs.",
            "source_entities": [
                "CHARLOTTE'S BABIES",
                "BALLOONISTS"
            ]
        },
        {
            "entity_name": "Charlotte's Web (Doorway)",
            "entity_type": "GEO",
            "description": "Charlotte's web, located at the doorway, was where Charlotte spun her miraculous webs and where her daughters later decide to construct their own webs, continuing the legacy.",
            "source_entities": [
                "DOORWAY",
                "EGG SAC"
            ]
        },
        {
            "entity_name": "Charlotte (Spiders)",
            "entity_type": "PERSON",
            "description": "Charlotte is a spider known for her brilliance, beauty, and loyalty. She is the mother of Joy, Aranea, Nellie, and other spider offspring, who are collectively referred to as spiders.",
            "source_entities": [
                "CHARLOTTE",
                "SPIDERS"
            ]
        },
        {
            "entity_name": "Wilbur's Triumph (The Miracle of the Web)",
            "entity_type": "EVENT",
            "description": "Wilbur's triumph and the miracle of the web refer to the same event, where Charlotte's web created a miracle that led to Wilbur's victory and was remembered as a significant event in the barn.",
            "source_entities": [
                "WILBUR'S TRIUMPH",
                "THE MIRACLE OF THE WEB"
            ]
        }
    ],
    "chunk-bbd8b21537b411d0f31462dad600b699": [
        {
            "entity_name": "Charlotte A. Cavatica",
            "entity_type": "PERSON",
            "description": "A large grey spider who becomes a dear friend to Wilbur, a little pig, and saves his life with her clever plan. She is also known as Charlotte.",
            "source_entities": [
                "CHARLOTTE A. CAVATICA",
                "CHARLOTTE"
            ]
        },
        {
            "entity_name": "E. B. White",
            "entity_type": "PERSON",
            "description": "The author of 'Charlotte's Web' and other works, E. B. White was born in Mount Vernon, New York, and graduated from Cornell University. His writings have appeared in The New Yorker magazine, and he has received many literary honors, including the 1970 Laura Ingalls Wilder Medal for his children's books 'Stuart Little' and 'Charlotte's Web'. He was also elected to the American Academy of Arts and Letters in 1973.",
            "source_entities": [
                "E. B. WHITE",
                "MOUNT VERNON, NEW YORK",
                "CORNELL UNIVERSITY",
                "THE NEW YORKER",
                "LAURA INGALLS WILDER MEDAL",
                "STUART LITTLE",
                "CHARLOTTE'S WEB",
                "AMERICAN ACADEMY OF ARTS AND LETTERS"
            ]
        }
    ]
}