{
  "chunk-33911236aa6107381f93f86f33327320": {
    "tokens": 1200,
    "content": "VOL. CLXXII . . . . No. 59,730 © 2023  The New York Times Company  \n\nNEW YORK, FRIDAY, MARCH 17, 2023  \n\n![](images/image_1.jpg)  \nFrench lawmakers heckled Prime Minister Élisabeth Borne on Thursday over the government’s decision to raise the retirement age.  \n\n# Macron Decree Alters Pensions As Rage Builds  \n\n# By ROGER COHEN  \n\nPARIS — President Emmanuel Macron,  worried  that  France’s Parliament would not approve a fiercely contested bill raising the retirement age to 64 from 62, opted  to  ram  the  legislation through on Thursday without a full parliamentary vote, a decision certain  to  inflame  an  already tense  confrontation  over  the measure.  \n\nAfter three meetings on Thursday with Mr. Macron and a lastminute discussion with her cabinet, Élisabeth Borne, the prime minister, informed the National Assembly, or lower house, of the government’s decision. She was met by heckling, booing and vociferous  chanting  of  the  “Marseillaise,” France’s national anthem, and had to wait for several minutes  before  being  able  to speak.  \n\n“We cannot gamble on the future of our pensions,” Ms. Borne told lawmakers. “The reform is necessary.”  \n\nEarlier, Mr. Macron told government ministers, “My interest would have been to go to a vote,” according to the Élysée Palace, “but I consider that at the present time the financial and economic risks are too great.” He added, “One cannot play with the future of the country.”  \n\nThe risk now for Mr. Macron is that enacting a retirement age of 64 without a full vote in Parliament smacks of the kind of contempt and aloofness of which he has sometimes been accused. The Yellow Vest movement during his first term, an enormous and sustained protest against proposed fuel increases and other measures, marked Mr. Macron. Rule by diktat  was  not  the  image  he wanted to project during his secContinued on Page A8  \n\n# Tribes Weigh the Future of Plundered Trophies  \n\n# By JULIA JACOBS and KAYLA GAHAGAN  \n\nAt  a  hilltop  cemetery  in Wounded Knee, S.D., the site of one of the bloodiest massacres by American soldiers against Native Americans, a small crowd gathered around a cluster of boxes that had been laid reverently atop two feet of snow.  \n\nInside were Lakota cultural objects  and  belongings  that  had been returned after more than a century on the other side of the country: moccasins, sacred pipes, ritual  clothing,  beaded  leather bags. Some are believed to have been taken from Wounded Knee immediately after the 1890 massacre, when U.S. troops killed as many as 300 or more Lakota men, Finding Way to Honor the Dead and Allow the Living to Heal  \n\nSince the 1890s the collection had been kept in a small-town library museum in Barre, Mass., now known as the Founders Museum, sitting among displays of Victorian-era dolls, Civil War artifacts and taxidermy. But last year, after decades of anguished requests and false starts, the museum agreed to give the Oglala Sioux  Tribe  the  items  it  had sought.  \n\nIt has been more than three decades since Congress passed a law setting up a protocol for federally funded colleges and museums to return Native cultural heritage and, in many cases, human remains. The pace of restitutions has been slow, frustrating tribes that are awaiting the return of their plundered patrimony. But now, amid signs that more institutions are beginning to repatriate Native holdings, citizens of tribes like the Oglala Sioux find themselves  confronting  complicated questions about how to handle returns in ways that honor the dead and the past, and facilitate healing for the living.  \n\nThere is broad consensus that   \nhuman remains should be buried.   \nMany call for burying or burning   \nother objects as well — especially   \nfunerary items — in accordance Continued on Page A12  \n\n![](images/image_2.jpg)  \n\n# Princeton Sends Brackets to Shredder  \n\nThe 15th-seeded Tigers stunned Arizona, a No. 2 seed, early in the N.C.A.A. tournament. Page B8.  \n\n# All-Out Defense of Bakhmut Depletes Ukraine Arsenal for Spring  \n\nThis  article  is  by  Thomas Gibbons-Neff, Lara Jakes and Eric Schmitt.  \n\nThe Ukrainian military is firing thousands of artillery shells a day as it tries to hold the eastern city of Bakhmut, a pace that American and European officials say is unsustainable and could jeopardize a planned  springtime  campaign that they hope will prove decisive. The bombardment has been so intense that the Pentagon raised concerns with Kyiv recently after several days of nonstop artillery firing, two U.S. officials said, highlighting  the  tension  between Ukraine’s  decision  to  defend Bakhmut at all costs and its hopes for  retaking  territory  in  the spring. One of those officials said the Americans warned Ukraine  \n\n# Counteroffensive Might Be Hard to Mount  \n\nagainst wasting ammunition at a key time.  \n\nWith  so  much  riding  on  a Ukrainian counteroffensive, the United States and Britain are preparing to ship thousands of NATO and Soviet-type artillery rounds and rockets to help shore up supplies for a coming Ukrainian offensive.  \n\nBut a senior American defense   \nofficial described that as a “last  \nditch effort” because Ukraine’s al  \nlies do not have enough ammuni  \ntion to keep up with Ukraine’s Continued on Page A6  \n\n# BIGGEST U.S",
    "chunk_order_index": 0,
    "full_doc_id": "doc-889f1f28434ead0ce2a27456446d1e03"
  },
  "chunk-6a6dca492cdaad913d5de757b6b6fe0e": {
    "tokens": 1200,
    "content": "key time.  \n\nWith  so  much  riding  on  a Ukrainian counteroffensive, the United States and Britain are preparing to ship thousands of NATO and Soviet-type artillery rounds and rockets to help shore up supplies for a coming Ukrainian offensive.  \n\nBut a senior American defense   \nofficial described that as a “last  \nditch effort” because Ukraine’s al  \nlies do not have enough ammuni  \ntion to keep up with Ukraine’s Continued on Page A6  \n\n# BIGGEST U.S. BANKS PUT UP \\$30 BILLION TO RESCUE LENDER  \n\nAiding First Republic to Halt Wider Crisis  \n\n# This article is by Rob Copeland, Lauren Hirsch, Alan Rappeport and Maureen Farrell.  \n\nIn an extraordinary effort to stave off financial contagion and reassure the world that the American financial system was stable, 11 of the largest U.S. banks came together on Thursday to inject \\$30 billion into First Republic Bank, a smaller peer on the brink of collapse after the implosion of Silicon Valley Bank last week. Hatched on Tuesday during a call between Treasury Secretary Janet L. Yellen and Jamie Dimon, the chief executive of JPMorgan Chase, the plan has each bank depositing at least \\$1 billion into First Republic. It is meant as a show of support for First Republic and a signal to the market that the San Francisco lender’s woes do not reflect deeper trouble at the bank.  \n\nMs. Yellen believed that such a move by the private sector would underscore  confidence  in  the health of banks. Mr. Dimon, whose bank saved several rivals during the 2008 financial crisis, was on board.  \n\nIn 48 hours, the deal was done. The arrangement was without precedent in decades, and an indication of how dire the banking sector’s  predicament  had  become within a week. With its echoes of the 2008 financial crisis, the collapses of Silicon Valley Bank on Friday and Signature Bank on Sunday set off a panic that appears unlikely to subside immediately.  \n\nThe four banks that put the most money into the effort — JPMorgan Chase, Bank of America, Wells Fargo and Citigroup — said in a joint statement that the action “demonstrates their overall commitment to helping banks serve their customers and communities.”  \n\nThe four banks will each deposit \\$5 billion. Goldman Sachs and Morgan Stanley are putting in \\$2.5 billion each. PNC Financial, Truist, BNY Mellon, State Street and U.S. Bank are each depositing \\$1 billion.  \n\nShares of First Republic, which had lost three-quarters of their value in recent days, rallied on the announcement, which was made during market hours. But numerous other bank stocks, mainly those of small and regional banks, continued to be pummeled. The banking sector has also been under pressure from Credit Suisse, which was fighting for its life before Switzerland’s central bank stepped in to provide a backstop early Thursday.  \n\nBefore Thursday’s announcement, First Republic hired advisers to explore options to save the bank, including a possible sale to a larger rival or a rescue that could include a quick injection of cash to ensure that it had enough to pay out customer withdrawals. The lender had also tried to shore up its finances last weekend with up to \\$70 billion in emergency loans from the Federal Reserve and JPMorgan. As recently as Monday, James Continued on Page A13  \n\n![](images/image_3.jpg)  \n\nCONTAGION FEAR Janet L. Yellen defended actions. Page B4.  \n\n# Chemical Bans Florida Re-edits Pose Challenge A New Subject: To Tech Growth Social Studies  \n\n# By ERIC LIPTON  \n\n# By SARAH MERVOSH  \n\nWASHINGTON — The Biden administration is preparing to impose some of the first new rules in a generation to restrict or ban an array of toxic chemicals that are widely  used  in  manufacturing, presenting the White House with tough choices between its economic agenda and public health. Many of the substances in question are important to industries that President Biden has backed through other policies intended to bolster  global  competitiveness and  national  security,  such  as semiconductors and electric vehicles.  \n\nCorporations are framing the decisions about new regulations for an initial group of toxic chemicals as putting at risk the administration’s  drive  to  nurture  the American economy of the future. Environmental and public health groups are stressing the need to focus on protecting workers and communities  from  substances known to carry health risks, such as cancer, liver and kidney damage and infertility.  \n\nA major lobbying clash is already underway. Chip makers, the burgeoning electric vehicle industry and other companies, including military contractors, are pressuring the administration to water down the new rules, saying the repercussions of a ban or new reContinued on Page A14  \n\nThe nitty-gritty process of reviewing  and  approving  school textbooks has typically been an administrative affair, drawing the attention  of  education  experts, publishing executives and state bureaucrats.  \n\nBut in Florida, textbooks have become hot politics, part of Gov. Ron DeSantis’s campaign against what he describes as “woke indoctrination” in public schools, particularly when it comes to race and gender. Last year, his administration made a splash when it rejected dozens of math textbooks, citing “prohibited topics.”  \n\nNow, the state is reviewing curriculum in what is perhaps the most contentious subject in education: social studies.  \n\nIn the last few months, as part of the review process, a small army of state experts, teachers, parents  and  political  activists have combed thousands of pages of text — not only evaluating academic content, but also flagging anything that could hint, for instance, at critical race theory. A prominent conservative education group, whose members volunteered to review textbooks, objected to a slew of them, accusing INTERNATIONAL A4-9 Anger After Migrant Tragedy After",
    "chunk_order_index": 1,
    "full_doc_id": "doc-889f1f28434ead0ce2a27456446d1e03"
  },
  "chunk-ce5e77442d8a01e24524144690ba295e": {
    "tokens": 515,
    "content": "studies.  \n\nIn the last few months, as part of the review process, a small army of state experts, teachers, parents  and  political  activists have combed thousands of pages of text — not only evaluating academic content, but also flagging anything that could hint, for instance, at critical race theory. A prominent conservative education group, whose members volunteered to review textbooks, objected to a slew of them, accusing INTERNATIONAL A4-9 Anger After Migrant Tragedy After a sinking that killed 86 migrants, Italy remains locked in a furious debate about who is responsible. PAGE A4 Israel’s Impasse Over Judges A key issue stands in the way of a compromise on the government’s judiciary overhaul plan. PAGE A9  \n\n![](images/image_4.jpg)  \n\n# NATIONAL A10-16  \n\n# MAGA, With Martinis  \n\nA combative young Republican group in New York, firmly on the right and Trump-friendly, is wary of the official G.O.P.’s more moderate path.  PAGE A10 State Blocks Abortion Ban North Dakota’s Supreme Court upheld a lower court’s decision and said the state Constitution protects abortion rights in some situations. PAGE A14 Trump Team Plans Attack If the former president faces criminal charges, his campaign aims to accuse Alvin Bragg, the Democratic prosecutor, of political bias. PAGE A15 WEEKEND ARTS C1-16 Picturing Systemic Violence A new exhibition of Kehinde Wiley’s art includes a “respite room” where viewers can regain their composure. PAGE C1 A Pageant of Love and Bigotry “Parade,” a revival about the Leo Frank case, focuses more on a marriage than on a miscarriage of justice. PAGE C1  \n\n![](images/image_5.jpg)  \n\n# BUSINESS B1-6  \n\nA Struggle for College Towns With the decline of manufacturing, many rural areas turned to colleges to support the local economy. Now, declining student enrollment is forcing them to adapt once again. PAGE B1 Wanted: Buyer for TikTok Finding a company willing or able to pay billions for the platform is not going to be easy. Beyond the cost, there are antitrust concerns, and the endless flood of toxic content. PAGE B1  \n\n# OPINION A18-19  \n\n# Pamela Paul  \n\n![](images/image_6.jpg)  \n\nSPORTS B8-12 A Painful Celebration Edwin Díaz, the Mets’ closer, will miss the season after injuring his right knee at the World Baseball Classic.  PAGE B12",
    "chunk_order_index": 2,
    "full_doc_id": "doc-889f1f28434ead0ce2a27456446d1e03"
  }
}