{
    "image_1": {
        "image_id": 1,
        "image_path": "./fusion_research/fusion_dataset/news/20230317/images/image_1.jpg",
        "caption": [
            "French lawmakers heckled Prime Minister Élisabeth Borne on Thursday over the government’s decision to raise the retirement age. "
        ],
        "footnote": [],
        "context": "After three meetings on Thursday with Mr. Macron and a lastminute discussion with her cabinet, Élisabeth Borne, the prime minister, informed the National Assembly, or lower house, of the government’s decision. She was met by heckling, booing and vociferous chanting of PARIS — President Emmanuel Macron, worried that France’s Parliament would not approve a fiercely contested bill raising the retirement age to 64 from 62, opted to ram the legislation through on Thursday without a full parliamentary vote, a decision certain to inflame an already tense confrontation over the measure. By ROGER COHEN Macron Decree Alters Pensions As Rage Builds VOL. CLXXII . . . . No. 59,730 © 2023 The New York Times Company NEW YORK, FRIDAY, MARCH 17, 2023 ",
        "chunk_order_index": 0,
        "chunk_id": "chunk-33911236aa6107381f93f86f33327320",
        "description": "The image depicts a chaotic scene in the French National Assembly. Prime Minister Élisabeth Borne is standing at the podium, addressing the assembly. She is wearing a patterned jacket and appears to be speaking into a microphone. The background is filled with numerous lawmakers, many of whom are holding up signs that read '64 ANS C'EST NON!' (64 years is not okay!) and 'DEMOCRATIE'. The atmosphere is tense and confrontational, with some lawmakers shouting and gesturing aggressively. The seating area is filled with red chairs, and the walls are adorned with wooden panels and decorative elements. The overall mood conveys a sense of protest and dissent against the government's decision to raise the retirement age.",
        "segmentation": true
    },
    "image_2": {
        "image_id": 2,
        "image_path": "./fusion_research/fusion_dataset/news/20230317/images/image_2.jpg",
        "caption": [],
        "footnote": [],
        "context": "The Ukrainian military is firing thousands of artillery shells a day as it tries to hold the eastern city of Bakhmut, a pace that American and European officials say is unsustainable and could jeopardize a planned springtime campaign that they hope will prove decisive. The bombardment has been so intense that the Pentagon raised concerns with Kyiv recently after This article is by Thomas Gibbons-Neff, Lara Jakes and Eric Schmitt. All-Out Defense of Bakhmut Depletes Ukraine Arsenal for Spring The 15th-seeded Tigers stunned Arizona, a No. 2 seed, early in the N.C.A.A. tournament. Page B8. Princeton Sends Brackets to Shredder and, in many cases, human remains. The pace of restitutions has been slow, frustrating tribes that are awaiting the return of their plundered patrimony. But now, amid signs that more institutions are beginning to repatriate Native holdings, citizens of tribes like the Oglala Sioux find themselves confronting complicated questions about how to handle returns in ways that honor the dead and the past, and facilitate healing for the living.  There is broad consensus that human remains should be buried. Many call for burying or burning other objects as well — especially funerary items — in accordance Continued on Page A12 ",
        "chunk_order_index": 0,
        "chunk_id": "chunk-33911236aa6107381f93f86f33327320",
        "description": "The image captures a dynamic moment during a basketball game. Two players are in the foreground, engaged in an intense play. The player on the left is wearing a black jersey with the number 20 and the word 'Princeton' written across the chest. He is in the process of shooting the ball, which he holds above his head with both hands extended. His posture suggests a strong, focused effort to make the shot. The player on the right is wearing a white jersey with red trim and the name 'Larsson' and the number 3 on it. He is attempting to block the shot, with both arms raised high and his body leaning towards the shooter. The background shows a crowded arena with spectators in the stands, creating an atmosphere of excitement and tension. The lighting highlights the players and the ball, emphasizing the action and intensity of the moment.",
        "segmentation": true
    },
    "image_3": {
        "image_id": 3,
        "image_path": "./fusion_research/fusion_dataset/news/20230317/images/image_3.jpg",
        "caption": [],
        "footnote": [],
        "context": "WASHINGTON — The Biden administration is preparing to impose some of the first new rules in a generation to restrict or ban an array of toxic chemicals that are widely used in manufacturing, presenting the White House with tough choices between its economic agenda and public health. Many of the substances in question are important to industries that President Biden has backed through other policies intended to bolster global competitiveness and By SARAH MERVOSH By ERIC LIPTON Chemical Bans Florida Re-edits Pose Challenge A New Subject: To Tech Growth Social Studies CONTAGION FEAR Janet L. Yellen defended actions. Page B4. from Credit Suisse, which was fighting for its life before Switzerland’s central bank stepped in to provide a backstop early Thursday. Before Thursday’s announcement, First Republic hired advisers to explore options to save the bank, including a possible sale to a larger rival or a rescue that could include a quick injection of cash to ensure that it had enough to pay out customer withdrawals. The lender had also tried to shore up its finances last weekend with up to \\$70 billion in emergency loans from the Federal Reserve and JPMorgan. As recently as Monday, James Continued on Page A13 ",
        "chunk_order_index": 1,
        "chunk_id": "chunk-6a6dca492cdaad913d5de757b6b6fe0e",
        "description": "The image depicts a woman with white hair sitting at a conference table. She is wearing a black blazer over a patterned scarf and appears to be engaged in a formal meeting or hearing. Her posture is upright, and she is holding a pen, suggesting she might be taking notes or preparing to speak. In front of her on the table are several documents and a microphone, indicating that she is likely addressing an audience or participating in a discussion. The background shows other individuals who appear to be part of the same event, with one person partially visible behind her and another seated further back. The setting suggests a professional environment, possibly a government or corporate meeting room. The overall atmosphere conveys a sense of formality and seriousness.",
        "segmentation": true
    },
    "image_4": {
        "image_id": 4,
        "image_path": "./fusion_research/fusion_dataset/news/20230317/images/image_4.jpg",
        "caption": [],
        "footnote": [],
        "context": "A combative young Republican group in New York, firmly on the right and Trump-friendly, is wary of the official G.O.P.’s more moderate path. PAGE A10 State Blocks Abortion Ban North Dakota’s Supreme Court upheld a lower court’s decision and said the state Constitution protects abortion rights in some situations. PAGE A14 Trump Team Plans Attack If the former president faces criminal charges, his campaign aims to accuse Alvin Bragg, the Democratic prosecutor, of political bias. PAGE A15 WEEKEND ARTS C1-16 Picturing Systemic Violence A new exhibition of Kehinde Wiley’s art includes a “respite room” where MAGA, With Martinis NATIONAL A10-16   of state experts, teachers, parents and political activists have combed thousands of pages of text — not only evaluating academic content, but also flagging anything that could hint, for instance, at critical race theory. A prominent conservative education group, whose members volunteered to review textbooks, objected to a slew of them, accusing INTERNATIONAL A4-9 Anger After Migrant Tragedy After a sinking that killed 86 migrants, Italy remains locked in a furious debate about who is responsible. PAGE A4 Israel’s Impasse Over Judges A key issue stands in the way of a compromise on the government’s judiciary overhaul plan. PAGE A9 ",
        "chunk_order_index": 2,
        "chunk_id": "chunk-ce5e77442d8a01e24524144690ba295e",
        "description": "The image depicts a scene on a sandy beach where the ocean waves are gently crashing onto the shore. The sand is dark and wet, indicating recent wave activity. In the foreground, there is an orange life vest lying on the sand. The life vest appears to be deflated or partially deflated, with black straps attached to it. The waves in the background are white and frothy, suggesting movement and the natural rhythm of the sea. The overall atmosphere of the image conveys a sense of solitude and perhaps a hint of melancholy, as the life vest seems out of place and abandoned on the beach.",
        "segmentation": true
    },
    "image_5": {
        "image_id": 5,
        "image_path": "./fusion_research/fusion_dataset/news/20230317/images/image_5.jpg",
        "caption": [],
        "footnote": [],
        "context": "SPORTS B8-12 A Painful Celebration Edwin Díaz, the Mets’ closer, will miss the season after injuring his right knee at the World  Pamela Paul OPINION A18-19  A Struggle for College Towns With the decline of manufacturing, many rural areas turned to colleges to support the local economy. Now, declining student enrollment is forcing them to adapt once again. PAGE B1 Wanted: Buyer for TikTok Finding a company willing or able to pay billions for the platform is not going to be easy. Beyond the cost, there are antitrust concerns, and the endless flood of toxic content. PAGE B1 BUSINESS B1-6   North Dakota’s Supreme Court upheld a lower court’s decision and said the state Constitution protects abortion rights in some situations. PAGE A14 Trump Team Plans Attack If the former president faces criminal charges, his campaign aims to accuse Alvin Bragg, the Democratic prosecutor, of political bias. PAGE A15 WEEKEND ARTS C1-16 Picturing Systemic Violence A new exhibition of Kehinde Wiley’s art includes a “respite room” where viewers can regain their composure. PAGE C1 A Pageant of Love and Bigotry “Parade,” a revival about the Leo Frank case, focuses more on a marriage than on a miscarriage of justice. PAGE C1   ",
        "chunk_order_index": 2,
        "chunk_id": "chunk-ce5e77442d8a01e24524144690ba295e",
        "description": "The image depicts a person lying on the ground in a natural setting. The individual is wearing a blue shirt and jeans, with one arm extended outward and the other bent at the elbow. They are positioned on a grassy area with a variety of wildflowers and plants surrounding them. The background is filled with a dense array of colorful flowers and foliage, creating a vibrant and lush environment. The overall atmosphere of the image conveys a sense of tranquility and connection with nature. The person appears to be in a relaxed or contemplative state, possibly enjoying the beauty of the surroundings.",
        "segmentation": true
    },
    "image_6": {
        "image_id": 6,
        "image_path": "./fusion_research/fusion_dataset/news/20230317/images/image_6.jpg",
        "caption": [],
        "footnote": [],
        "context": "SPORTS B8-12 A Painful Celebration Edwin Díaz, the Mets’ closer, will miss the season after injuring his right knee at the World Baseball Classic. PAGE B12 Bigotry “Parade,” a revival about the Leo Frank case, focuses more on a marriage than on a miscarriage of justice. PAGE C1      BUSINESS B1-6 A Struggle for College Towns With the decline of manufacturing, many rural areas turned to colleges to support the local economy. Now, declining student enrollment is forcing them to adapt once again. PAGE B1 Wanted: Buyer for TikTok Finding a company willing or able to pay billions for the platform is not going to be easy. Beyond the cost, there are antitrust concerns, and the endless flood of toxic content. PAGE B1  OPINION A18-19 Pamela Paul ",
        "chunk_order_index": 2,
        "chunk_id": "chunk-ce5e77442d8a01e24524144690ba295e",
        "description": "The image depicts a group of baseball players from the Puerto Rico team celebrating on a field. The players are wearing red and blue uniforms with 'Puerto Rico' written across the chest. One player, wearing a blue cap and a red jersey, is being lifted up by his teammates in a jubilant manner. The background shows a grassy field with a hint of a stadium or bleachers. The atmosphere is one of joy and celebration, as the players appear to be enjoying a moment of triumph. The colors are vibrant, with the red and blue of the uniforms standing out against the green of the field. The players' postures and expressions convey a sense of camaraderie and excitement.",
        "segmentation": true
    }
}