{
  "chunk-7313577eee674acebe28f0e8ac370ca0": {
    "tokens": 1200,
    "content": "VOL. CLXXI . . . No. 59,384 © 2022  The New York Times Company NEW YORK, TUESDAY, APRIL 5, 2022  \n\n# HORROR GROWS OVER SLAUGHTER IN UKRAINE  \n\n![](images/image_1.jpg)  \nTatyana Petrovna found three bodies on Monday in Bucha, Ukraine, where evidence grew that Russians had killed scores of civilians.  \n\n#  \n\n# Dead for Days In the Streets, Hands Bound  \n\n# By RICK GLADSTONE  \n\nPerhaps it was the way the lifeless bodies, bloodied by bullets, and some with hands bound, had been left strewn about or shoveled into makeshift mass graves. Or the reality of seeing them up close in widely circulated photographs and videos.  \n\nThere have been other atrocities in the weeks since Russia invaded  Ukraine,  concentrating much  of  its  firepower  on  the dwellings and gathering spots of ordinary Ukrainians, but the international  outrage  they  provoked has been eclipsed by the reaction to revelations that retreating Russian soldiers left many slain civilians behind near the Ukrainian capital.  \n\nSome of the bodies found this past weekend outside Kyiv were face down, and some curled up. Civilians appear to have been killed on their bicycles, while walking down the street or in the basements of homes. A woman in Bucha, where many of the dead were found, discovered three bodies in her garden.  \n\nMany of the victims had been shot in the head. A coroner in Bucha said his team had collected dozens. The Russians fired at anyone as their tanks rolled through the town in the war’s early days, some residents said.  \n\nRussian officials denied responsibility,  dismissing  the  photographs of bodies as fabricated, but satellite images taken during the Russian occupation of Bucha and other towns belied their claims. An analysis of the satellite images by The New York Times  \n\n# By CARLOTTA GALL  \n\nNOVA  BASAN,  Ukraine Badly frightened and hungry, residents of Nova Basan, a town east of Kyiv, emerged from their cottages and farmhouses on Monday, and described living through the terrifying ordeal of the Russian occupation — detentions, threats and a strict curfew that confined them to their homes with no outside communication for more than a month.  \n\nNova Basan, about 60 miles east of the Ukrainian capital, is one of a stretch of towns and villages retaken from Russian con  \n\n# Violent  Interrogations, With Gunshots Fired Near Their Heads  \n\ntrol after battles through the last week of March, and just now coming back to life.  \n\n“It was terrible,” said Mykola Dyachenko, the official responsible for the administration of the town and surrounding villages. “People were not expecting such things.” He said he was among some 20 men who were held prisoner by Russian troops for 25 days  \n\nHe looked exhausted, his face waxy and pale. He said he had been put through what he called a mock execution 15 times while being questioned about local Ukrainian territorial defense forces and ammunition stored in the area. His interrogators fired an assault rifle over his head during the questioning,  he  said.  His  eyes were bound with sticky tape, but he heard and felt the gunshot above his head. “It was psychological  pressure,”  he  said.  “They were trying to kick out of me information that I was not sharing.” Two other men also described Continued on Page A9  \n\n![](images/image_2.jpg)  \nThe aftermath of a Russian strike on a cultural center serving as a barracks in Kharkiv, Ukraine.  \n\n# Rising Evidence Pushes Europe to Consider Harsh Energy Sanctions  \n\n# By ANTON TROIANOVSKI and MATINA STEVIS-GRIDNEFF  \n\nThe images of dead Ukrainians, some with their hands tied and others haphazardly buried in pits, spurred shocked Western leaders on  Monday  to  promise  even tougher sanctions against Russia, including possibly on energy, as the Kremlin dug in and showed signs of preparing a new assault. The growing evidence that Russian soldiers killed scores of civilians in the Kyiv suburb of Bucha, leaving their bodies behind as they withdrew, prompted President Biden to call for President Vladimir V. Putin to face a “war crime trial.” Germany and France expelled a total of 75 Russian diplomats, and President Emmanuel Macron of France said the European Union should consider sanctions against Russian coal and oil. “This guy is brutal,” Mr. Biden said of Mr. Putin. “And what’s happening in Bucha is outrageous, and everyone’s seen it.” In Moscow on Monday, Mr. Putin said nothing about his war in Ukraine, but his spokesman, Dmitri S. Peskov, said the Kremlin “categorically” denied “any allegations” of Russian involvement in the atrocities. Instead, Russia’s state media aired relentless conspiracy theories about what it said was a Ukrainian fabrication, while the authorities threatened to prosecute  anyone  who  publicly blamed Russians for the Bucha killings.  \n\nRussia said the bodies had been placed only recently on the streets after “all Russian units withdrew completely from Bucha” around March 30. But a review of videos and satellite imagery by The New York Times shows that many of the civilians were killed more than three weeks ago, when Russia’s military was in control of the town. The war in Ukraine may now be headed for an even more dangerous phase, despite Russia’s withdrawal last week from areas near Kyiv.  \n\nUkrainian and Western officials said that Russia appeared to be positioning troops for an intensified assault in the eastern Donbas area, where the port city of Mariupol remains under a brutal siege. And in Kharkiv, roughly 30 miles from the Russian border, unrelenting bombardment has left parts",
    "chunk_order_index": 0,
    "full_doc_id": "doc-128c4bc23b9e79a2bb6ec3bbcd01f348"
  },
  "chunk-1598dfd309909b6a83879a3961630d7e": {
    "tokens": 1200,
    "content": "Russia’s military was in control of the town. The war in Ukraine may now be headed for an even more dangerous phase, despite Russia’s withdrawal last week from areas near Kyiv.  \n\nUkrainian and Western officials said that Russia appeared to be positioning troops for an intensified assault in the eastern Donbas area, where the port city of Mariupol remains under a brutal siege. And in Kharkiv, roughly 30 miles from the Russian border, unrelenting bombardment has left parts of the city of 1.4 million unrecognizable.  \n\nThe  systematic  destruction produces little military gain, but is part of a broader strategy to seize the country’s east, analysts and U.S. military officials say. With  the  Russian  economy showing some signs of resilience after the initial shock of the wideranging Western sanctions put in place after Mr. Putin’s invasion in February, the Kremlin appeared to be girding for a continuation of the war, despite talk in European capitals of now possibly banning Russian coal, oil or, less likely, gas. “They are not going to stop,” Oleksiy Danilov, the secretary of the National Security and Defense Council of Ukraine, said in a statement on Monday. “Putin’s order given to his soldiers to destroy our state has not disappeared.” In a visit to Bucha on Monday, President Volodymyr Zelensky of Continued on Page A9  \n\n![](images/image_3.jpg)  \nDelivering aid to civilians in Nova Basan, Ukraine.  \n\n# Beijing Campaign Casts Russia As the West’s Longtime Victim  \n\n# By CHRIS BUCKLEY  \n\nWhile Russian troops have battered Ukraine, officials in China have been meeting behind closed doors  to  study  a  Communist Party-produced documentary that extols President Vladimir V. Putin of Russia as a hero.   \nThe humiliating collapse of the Soviet Union, the video says, was the result of efforts by the United States to destroy its legitimacy. With swelling music and sunny scenes of present-day Moscow, the  documentary  praises  Mr. Putin for restoring Stalin’s standing as a great wartime leader and for renewing patriotic pride in Russia’s past.   \nTo the world, China casts itself as a principled onlooker of the war in Ukraine, not picking sides, simply  seeking  peace.  At  home, though, the Chinese Communist Party is pushing a campaign that  \n\nvictim rather than an aggressor and defends China’s strong ties with Moscow as vital. Chinese universities have organized classes to give students a “correct understanding” of the war, often highlighting Russia’s grievances with the West. Party newspapers have run series of commentaries blaming the United States for the conflict.  \n\nAround the country, the Communist Party has organized sessions for officials to watch and discuss  the  history  documentary. The 101-minute video, which was completed last year, does not mention the war in Ukraine but argues that Russia is right to worry about neighbors that broke away from the Soviet Union. It describes Mr. Putin as cleansing Russia of the Continued on Page A8  \n\n# Cracks Appear in G.O.P.’s Opposition to Jackson Fossil Fuels Must Be Cut Faster, Panel Warns  \n\n# By CARL HULSE  \n\nWASHINGTON — A nearly unified wall of G.O.P. opposition to Judge  Ketanji  Brown  Jackson cracked slightly on Monday as two more Senate Republicans said they would side with Democrats in supporting her, paving the way for her confirmation as the first Black woman on the Supreme Court. Senators Mitt Romney of Utah  \n\n# 3 Senators Say They’ll Vote to Confirm  \n\nand Lisa Murkowski of Alaska joined a third Republican, Susan Collins of Maine, in lending their support to Judge Jackson, defying deep resistance in their party to the nominee. The G.O.P. opposition was underscored anew on Monday when all 11 Republicans on the Judiciary Committee voted against the nomination. That prompted Democrats to use an unusual procedure to force the nomination out of the deadlocked panel with a vote of the full Senate, which agreed to the move by a vote of 53 to 47. The  three  Republicans  gave President Biden at least a modicum of the bipartisan backing he Continued on Page A16  \n\n# By BRAD PLUMER and RAYMOND ZHONG  \n\nNations need to move away much faster from fossil fuels to retain any hope of preventing a perilous  future  on  an  overheated planet, according to a major new report on climate change released on Monday, although they have made some progress because of the falling costs of clean energy. The report by the Intergovern  \n\n# Next Few Years Critical to Curbing Warming  \n\nmental Panel on Climate Change, a body of experts convened by the United Nations, warns that unless countries  drastically  accelerate efforts over the next few years to slash their emissions from coal, oil and natural gas, the goal of limiting global warming to 1.5 degrees Celsius, or 2.7 degrees Fahrenheit, will likely be out of reach  \n\nThat’s  the  threshold  beyond which scientists say the dangers of global warming — including worsening floods, droughts, wildfires and ecosystem collapse — grow considerably. Humans have already heated the planet by an average  of  1.1  degrees  Celsius Continued on Page A6  \n\n![](images/image_4.jpg)  \n\nNATIONAL A14-19  \n\nJury Picks Begin in Sentencing Jurors will decide if the gunman in the Parkland shooting should be sentenced to death or life in prison. PAGE A19 Senate Deal Cuts Covid Funds Negotiators announced a \\$10 billion package that scraps spending for the global vaccine effort. PAGE A16  \n\n# INTERNATIONAL A4-13  \n\n# Uproar in Sri Lanka  \n\nThe country’s ruling family is facing its toughest challenge yet as protesters demand that the president",
    "chunk_order_index": 1,
    "full_doc_id": "doc-128c4bc23b9e79a2bb6ec3bbcd01f348"
  },
  "chunk-27f76354506b9c19c06e886a7aced997": {
    "tokens": 448,
    "content": ")  \n\nNATIONAL A14-19  \n\nJury Picks Begin in Sentencing Jurors will decide if the gunman in the Parkland shooting should be sentenced to death or life in prison. PAGE A19 Senate Deal Cuts Covid Funds Negotiators announced a \\$10 billion package that scraps spending for the global vaccine effort. PAGE A16  \n\n# INTERNATIONAL A4-13  \n\n# Uproar in Sri Lanka  \n\nThe country’s ruling family is facing its toughest challenge yet as protesters demand that the president step down amid economic turmoil. PAGE A8 Activist Avoids Life Sentence The man who inspired “Hotel Rwanda” had been given a 25-year term in a case condemned by rights groups.  PAGE A6 BUSINESS B1-5 Musk Takes Big Bite of Twitter The head of Tesla, who has criticized the social media company, became its biggest shareholder. PAGE B1  \n\n![](images/image_5.jpg)  \n\n# SPORTS B6-9  \n\nJayhawks Are Back on Top No. 1 Kansas rallied to top North Carolina, an eighth seed, to capture its first men’s N.C.A.A. title since 2008. PAGE B6 A Manager’s Joy? It’s the Shoes. Terry Francona, largely out for two seasons with health issues, is back and feisty with the Guardians. PAGE B7  \n\n# ARTS C1-8  \n\nThe Generational Grammys Despite nods to Gen Z, this year’s awards show seemed to favor historyminded performers like Silk Sonic, Jon Batiste, H.E.R. and Lady Gaga, Jon Caramanica writes. PAGE C1 Bigotry in Extra Innings A revival of “Take Me Out,” Richard Greenberg’s play about baseball and homophobia, has a few misses, Jesse Green says, but is mostly delightful and provocative. PAGE C1  \n\nOPINION A22-23  \n\n# Paul Krugman  \n\nPAGE A23  \n\n![](images/image_6.jpg)  \n\nSCIENCE TIMES D1-8 Eight Arms, but Not Nine Lives Octopuses are hard to use for research because they escape from aquariums and die shortly after laying eggs. But a little help may be at hand. PAGE D1",
    "chunk_order_index": 2,
    "full_doc_id": "doc-128c4bc23b9e79a2bb6ec3bbcd01f348"
  }
}