{
    "chunk-ff0154dbb52267e3857e4a9db1b48f1b": [
        {
            "entity_name": "Complete Siege of Gaza",
            "entity_type": "EVENT",
            "description": "The event where Israel's defense minister announced a blockade on Gaza, cutting off essentials like electricity, food, water, and fuel, in response to the Hamas attack.",
            "source_entities": [
                "COMPLETE SIEGE OF GAZA",
                "COMPLETE SIEGE"
            ]
        },
        {
            "entity_name": "Hamas Gunmen",
            "entity_type": "PERSON",
            "description": "Hamas gunmen breached Israel's border fence, overrunning towns and communities, including Kfar Azza, in a bloody attack that resulted in mass casualties and kidnappings.",
            "source_entities": [
                "HAMAS GUNMEN",
                "BORDER FENCE BREACH",
                "ATTACK ON SATURDAY"
            ]
        },
        {
            "entity_name": "Israeli Airstrikes",
            "entity_type": "EVENT",
            "description": "Israeli airstrikes have flattened mosques, hospitals, and other structures in Gaza as part of their response to the Hamas attack, which has affected Gazans and led to debates over U.S. aid.",
            "source_entities": [
                "ISRAELI AIRSTRIKES",
                "U.S. AID"
            ]
        },
        {
            "entity_name": "Gazan Health Ministry",
            "entity_type": "ORGANIZATION",
            "description": "The organization reporting on the killings of entire families in their homes due to Israeli strikes and the indiscriminate targeting of civilian structures during the conflict.",
            "source_entities": [
                "GAZAN HEALTH MINISTRY"
            ]
        }
    ],
    "chunk-5a54845624c6d1d0a47ebe898b407243": [
        {
            "entity_name": "Israeli Forces",
            "entity_type": "Organization",
            "description": "Israeli Forces are involved in the military conflict, employing firepower, defending the country, and retaking control of towns near the Gaza Strip from Palestinian gunmen.",
            "source_entities": [
                "ISRAELI FORCES",
                "ISRAEL"
            ]
        },
        {
            "entity_name": "Hamas",
            "entity_type": "Organization",
            "description": "Hamas is a militant group that has assailed Israeli civilians and soldiers, leading to significant casualties and conflict, and is holding Americans hostage.",
            "source_entities": [
                "HAMAS",
                "PALESTINIAN GUNMEN"
            ]
        },
        {
            "entity_name": "United States",
            "entity_type": "Geo",
            "description": "The United States is involved in the conflict by providing intelligence and military support to Israel, advocating for a cease-fire, and has a stance on the conflict, with President Biden and Secretary of State Antony J. Blinken playing significant roles.",
            "source_entities": [
                "UNITED STATES",
                "PRESIDENT BIDEN",
                "SECRETARY OF STATE ANTONY J. BLINKEN",
                "AMERICANS"
            ]
        },
        {
            "entity_name": "Gaza Strip",
            "entity_type": "Geo",
            "description": "The Gaza Strip is a region near Israel where conflict is ongoing, with Israeli troops retaking control of towns from Palestinian gunmen, and where Israeli soldiers were seen carrying slain residents.",
            "source_entities": [
                "GAZA STRIP",
                "KIBBUTZ"
            ]
        }
    ],
    "chunk-17c33813d68ef6c049bd4d7f1fe3396a": [
        {
            "entity_name": "Wendy Barclay",
            "entity_type": "PERSON",
            "description": "Wendy Barclay is a virologist at Imperial College London and an author of the study on gene-edited chickens and virus resistance.",
            "source_entities": [
                "WENDY BARCLAY",
                "IMPERIAL COLLEGE LONDON"
            ]
        },
        {
            "entity_name": "Jackson",
            "entity_type": "GEO",
            "description": "Jackson is a wealthy enclave in Wyoming where one man is trying to lure climate investment, and it is a part of the state where green energy initiatives are being pursued.",
            "source_entities": [
                "JACKSON",
                "WYOMING"
            ]
        },
        {
            "entity_name": "777 Partners",
            "entity_type": "ORGANIZATION",
            "description": "777 Partners is an obscure fund that has been scooping up big-name soccer teams, including a bid for Everton.",
            "source_entities": [
                "777 PARTNERS",
                "EVERTON"
            ]
        },
        {
            "entity_name": "Word. Breaking",
            "entity_type": "CONCEPT",
            "description": "Word. Breaking is a form of hip-hop that was largely left out of the 50th anniversary celebration but is now headed to the Paris Olympics.",
            "source_entities": [
                "WORD. BREAKING",
                "PARIS OLYMPICS"
            ]
        },
        {
            "entity_name": "Community Radio Station",
            "entity_type": "ORGANIZATION",
            "description": "Community Radio Station is a platform in India that hosts shows aimed at helping women overcome patriarchal attitudes.",
            "source_entities": [
                "WOMEN OF INDIA",
                "COMMUNITY RADIO STATION"
            ]
        }
    ]
}