{
  "chunk-9fae2b6cf38c8180c2cbfdd0c9f91a4e": {
    "tokens": 1200,
    "content": "# Che Neu Jork Cimes  \n\nVOL. CLXXI . . . No. 59,538  \n\n© 2022  The New York Times Company NEW YORK, TUESDAY, SEPTEMBER 6, 2022  \n\n# Tories Choose Top Diplomat To Run Britain  \n\nTruss Takes Authority as Economy Teeters  \n\n# By MARK LANDLER and STEPHEN CASTLE  \n\nLONDON — A divided British Conservative Party announced on Monday that it had chosen Liz Truss to replace Prime Minister Boris Johnson, turning to a party stalwart, hawkish diplomat and free-market champion to lead a country facing the gravest economic crisis in a generation.  \n\nMs. Truss, 47, defeated Rishi Sunak, a former chancellor of the Exchequer, whose resignation in July set in motion Mr. Johnson’s ouster. Her victory was widely expected, but the margin was less resounding than the polls forecast, suggesting she may face problems pulling together a party shaken by Mr. Johnson’s turbulent three-year tenure and a country rattled by an energy crisis and the aftershocks of Brexit.  \n\nMs. Truss, who served as foreign secretary in Mr. Johnson’s cabinet and was not part of the Tory rebellion that led to his departure, will formally assume the prime minister’s title on Tuesday in a meeting with Queen Elizabeth II at Balmoral Castle in Scotland, where the queen spends her summer holiday.  \n\nMs.  Truss  will  be  Britain’s fourth prime minister in the six years since it voted to leave the European Union, and only its third female  leader,  after  Margaret Thatcher and Theresa May. Like them, she will be greeted by a forbidding array of problems.  \n\nDouble-digit inflation, a looming recession, labor unrest, soaring household energy bills and possible fuel shortages this winter — all will confront Ms. Truss as she moves into 10 Downing Street. She also faces a potential collision with the European Union over her legislation to change trade rules in Northern Ireland, a dispute that could spill over into Britain’s relations  with  the  United  States, which opposes any kind of disruptive change.  \n\nIn a brief, businesslike speech to members of her party after her victory was confirmed, Ms. Truss promised a “bold plan” to lower taxes and revive the economy. “I campaigned as a Conservative, and I will govern as a Conservative,” she declared. “We will deliver, we will deliver and we will deliver.”  \n\nCritics said Ms. Truss’s call for   \ntax cuts and smaller government   \nwas inadequate in the face of the   \ndire  economic  threats  bearing   \ndown on Britain. Many expect her Continued on Page A10  \n\n![](images/image_1.jpg)  \nAndrew Stephenson, the Conservative Party chairman, with Liz Truss, the incoming prime minister, at party headquarters Monday.  \n\n# A Hawkish Political Disrupter To Lead a Nation Facing Crisis  \n\n# One Million Migrants Admitted Into U.S. During Biden’s Tenure  \n\n# By MARK LANDLER  \n\nLONDON — As a passionate 19- year-old student at Oxford in 1994, Elizabeth Truss called for a referendum to abolish the British monarchy, telling an audience of fellow Liberal Democrats, “We do not believe that people should be born to rule.”  \n\nThree decades later, Ms. Truss, now 47 and known as Liz, will travel to a Scottish castle on Tuesday to be anointed by Queen Elizabeth II as Britain’s new prime minister, completing a political odyssey from rabble-rousing republican to tradition-cloaked leader of the Conservative Party.  \n\nMs. Truss long ago pivoted to embrace the monarchy as being good for British democracy, just as she long ago abandoned the Liberal Democrats for the Conservatives.  More  recently,  she switched sides on Brexit, opposing the drive for Britain to leave the European Union before the 2016 referendum, then reversing course to become one of its most ardent evangelists.  \n\ncritics would call it opportunism — has helped propel Ms. Truss to Onetime Opponent of Brexit Turned Into  \n\nArdent Evangelist the pinnacle of British politics. How well it will prepare her for the rigors of the job is another question,  given  the  dire  economic trends  enveloping  the  country, and a Tory party that seems torn between desire for a fresh start and regret about tossing out her flamboyant, larger-than-life predecessor, Boris Johnson.  \n\nBy  her  own  admission,  Ms. Truss has little of Mr. Johnson’s charisma. Awkward where he is easygoing, staccato where he is smooth, she nevertheless scaled the party’s ranks with what colleagues describe as nerve, drive and an appetite for disruptive politics. When Mr. Johnson fell into trouble, she positioned herself adroitly, never publicly breaking with him while staying in the spotlight as a hawkish foreign secretary.  \n\n“She has so much confidence in Continued on Page A11  \n\n# By EILEEN SULLIVAN  \n\nSOUTH PORTLAND, Maine — At a modest hotel a few miles from the ocean here, most of the rooms have been occupied this summer by families from African countries seeking asylum — 192 adults and 119 children in all.  \n\nThey are among the more than one million undocumented immigrants who have been allowed into the country temporarily after crossing the border during President Biden’s tenure, part of a record-breaking cascade of irregular migration around the world. Distinct from the hundreds of thousands who have entered the country undetected during Mr. Biden’s term, many of the one million are hoping for asylum — a long shot — and will have to wait seven years on average before a decision on their case is reached because of the nation’s clogged immigration system.  \n\nThe hotel in South Portland is among a handful",
    "chunk_order_index": 0,
    "full_doc_id": "doc-bfcf20b372289e809a28c8d657f72fe6"
  },
  "chunk-d8b2214d9c8ac101eca13f2fd640c721": {
    "tokens": 1200,
    "content": "been allowed into the country temporarily after crossing the border during President Biden’s tenure, part of a record-breaking cascade of irregular migration around the world. Distinct from the hundreds of thousands who have entered the country undetected during Mr. Biden’s term, many of the one million are hoping for asylum — a long shot — and will have to wait seven years on average before a decision on their case is reached because of the nation’s clogged immigration system.  \n\nThe hotel in South Portland is among a handful in the region, in addition to Portland’s family shelter, that are offering temporary housing for hundreds of new immigrants. Maine is unusual in that it allows asylum seekers to re  \n\n# Burden Falls on States  \n\n# as Asylum Hearings Can Take Years  \n\nceive financial support for rent and  other  expenses,  in  part through its General Assistance program. But the challenge has been steep; in May, officials in Portland announced that the city could no longer guarantee shelter for newly arrived asylum seekers because emergency housing was at capacity.  \n\n“The community is growing so big that the word is traveling that we  are  helping,”  said  Mike Guthrie, the director of Portland’s family shelter. $^{\\ast}\\mathrm{So}$ more people are coming.”  \n\nWhile immigration is among the country’s most hotly debated political issues, the focus is almost always on the surging numbers of people seeking to cross the southwestern  border.  Less  attention has been paid to what happens to those who get released from government custody to lawfully await Continued on Page A16  \n\n# TRUMP CAN HAVE ARBITER REVIEW SEIZED RECORDS  \n\nJUDGE GRANTS REQUEST Ruling on Special Master May Hinder Federal Inquiry for Now  \n\nThis  article  is  by  Alan  Feuer, Glenn Thrush and Charlie Savage.  \n\nA federal judge intervened on Monday in the investigation of former President Donald J. Trump’s handling of sensitive government records,  ordering  the  appointment of an independent arbiter to review a trove of materials seized last month from Mr. Trump’s private club and residence in Florida. The judge, Aileen M. Cannon of the Federal District Court for the Southern District of Florida, also temporarily banned the Justice Department from using the seized materials for any “investigative purpose” connected to its inquiry of Mr. Trump until the work of the arbiter, known as a special master, was completed.  \n\nThe order would prevent, at least for now, federal prosecutors from using key pieces of evidence as they continue to investigate whether the former president illegally retained national defense documents at his estate, Mar-aLago, or obstructed the government’s  repeated  efforts  to  get them back.  \n\nWhile the order may ultimately serve only to delay the criminal inquiry into Mr. Trump, the scope and candor of Judge Cannon’s language and reasoning pointed to broader  themes.  Her  ruling seemed to carve out a special exception  to  the  normal  legal process for the former president and reject the Justice Department’s implicit argument that Mr. Trump be treated like any other investigative subject.  \n\nIndeed, in her order, issued on the Labor Day holiday, Judge Cannon said she had made her decisions $\\mathrm{^{\\infty}t o}$ ensure at least the appearance of fairness and integrity under the extraordinary circumstances.” Her order would not, however, affect a separate review of the documents by the Office of the Director of National Intelligence seeking to determine what risk to national security their removal to Mar-a-Lago may have caused.  \n\nContinued on Page A17 LEGAL VIEW Experts questioned a federal judge’s intervention in a Trump investigation. PAGE A17  \n\n# Ukrainian Power Plant, Blitzed By Shelling, Hangs by a Thread  \n\nThis article is by Marc Santora, Ivan Nechepurenko and Matthew Mpoke Bigg.  \n\n# Disaster Feared as Fire Crews Are Blocked  \n\nKYIV, Ukraine — A fire caused by  renewed  shelling  near  Europe’s largest nuclear power plant led to its disconnection from the national power grid on Monday, Ukrainian officials said, raising fears that despite the presence of U.N. inspectors, conditions at the Russian-occupied  facility  could deteriorate quickly and threaten a catastrophe.  \n\nThe fire forced the staff to sever the plant’s last connection to a reserve line that was providing its only source of outside power, once again placing critical cooling systems at risk of relying solely on emergency backup power, Herman Galushchenko, Ukraine’s en  \n\n# Galushchenko said.  \n\nShelling, explosions and fires around  the  facility,  the  Zaporizhzhia nuclear plant in southern Ukraine, have raised fears for months about a possible disaster, but amid contradictory claims and persistent fighting, it has been difficult for international experts to gauge the danger from afar. Two members of a United Nations team, sent last week to inspect the facility, have remained at the plant in the hopes of ensuring its safety and perhaps reducing the fighting in the area.  \n\nContinued on Page A8  \n\nFirefighting crews had not been able to reach the site of the blaze because  of  continued  fighting around the plant, Mr.  \n\nARMS DEALS Moscow is buying shells and rockets from North Korea, a U.S. report said. PAGE A8  \n\n# A Nevada Rancher Made a Truce With Beavers, and It Paid Off  \n\n# By CATRIN EINHORN  \n\nWELLS, Nev. — Horace Smith blew up a lot of beaver dams in his life.  \n\nA rancher here in northeastern Nevada, he waged war against the animals, frequently with dynamite. Not from meanness or cruelty; it was a struggle over water. Mr. Smith blamed beavers for flooding some parts of his property, Cottonwood Ranch, and drying out others.  \n\nBut his son Agee",
    "chunk_order_index": 1,
    "full_doc_id": "doc-bfcf20b372289e809a28c8d657f72fe6"
  },
  "chunk-1021cca6cf48178eb4801961c0cabe53": {
    "tokens": 845,
    "content": "Paid Off  \n\n# By CATRIN EINHORN  \n\nWELLS, Nev. — Horace Smith blew up a lot of beaver dams in his life.  \n\nA rancher here in northeastern Nevada, he waged war against the animals, frequently with dynamite. Not from meanness or cruelty; it was a struggle over water. Mr. Smith blamed beavers for flooding some parts of his property, Cottonwood Ranch, and drying out others.  \n\nBut his son Agee, who eventually took over the ranch, is making peace. And he says welcoming beavers to work on the land is one of the best things he’s done. “They’re  very  controversial still,” said Mr. Smith, whose father died in 2014. “But it’s getting better. People are starting to wake up.”  \n\nAs global warming intensifies droughts, floods and wildfires, Mr. Smith has become one of a growing number of ranchers, scientists and other “beaver believers” who see the creatures not only as helpers, but as furry weapons of cli  \n\n![](images/image_2.jpg)  \n\nBeavers’ landscape-altering dams and ponds disrupt agriculture, but they also have big benefits.  \n\nmate resilience. Last year, when Nevada suffered one of the worst droughts on record, beaver pools kept his cattle with enough water. When rains came strangely hard and fast, the vast network of dams slowed a torrent of water raging down the mountain, protecting his hay crop. And with the beavers’ help, creeks have widened into wetlands that run through the sagebrush desert, cleaning  water,  birthing  new meadows and creating a buffer against wildfires. True, beavers can be complicated  partners.  They’re  wild, swimming rodents the size of basset hounds with an obsession for building  dams.  When  conflicts Continued on Page A15  \n\n![](images/image_3.jpg)  \n\nParade Makes a Comeback After two years of scaled-back celebrations because of Covid-19, West Indian revelry returned to Brooklyn.  PAGE A18 No Storms but a Lot of Anxiety The hurricane season has gotten off to a calm start, but residents of Louisiana’s gulf coast still fear the worst.  PAGE A14  \n\n# INTERNATIONAL A4-13  \n\nSuspect in Knife Attacks Is Dead A day after 10 people died and 18 were hurt in one of the worst episodes of stabbing violence in Canada, one of the two suspects was found dead.  PAGE A13 Political Red Meat, and Veggies In France, a Green lawmaker told men to give up barbecue for the sake of the planet. The uproar was swift.  PAGE A4 BUSINESS B1-5 $\\mathbb{\\Phi}50$ Billion for Chip Makers The Biden administration released its plan to bolster the U.S. semiconductor industry and counter China. PAGE B1 SCIENCE TIMES D1-8 Singers With Deep Voices Whales share songs from Australia to Ecuador, and their melodies don’t take long to migrate across oceans.  PAGE D3 Preventing a Martian Plague The likelihood is low that bringing rocks to Earth from Mars will sicken us, but NASA is taking no chances. PAGE D1  \n\n![](images/image_4.jpg)  \n\n# ARTS C1-6  \n\nA Fantasy Face-Off “The Rings of Power” vs. “House of the Dragon”: Which has better dragons? Which has better swords? Now that we’ve seen a few episodes of each, here’s an early comparison. PAGE C1 To Mask, or Not to Mask The early unanimity that governed mask and vaccination rules when live performance first returned to theaters and concert halls has given way to a variety of approaches. PAGE C1  \n\nOPINION A20-21 Paul Krugman PAGE A20  \n\n![](images/image_5.jpg)  \n\nSPORTS B6-9 Nadal Ousted in U.S. Open Frances Tiafoe, above, beat the No. 2 seed and 22-time Grand Slam singles champion in four sets, striking a blow for young American players. PAGE B6",
    "chunk_order_index": 2,
    "full_doc_id": "doc-bfcf20b372289e809a28c8d657f72fe6"
  }
}