{
    "chunk-97ca427fd8ebfd82af396a959a2e1da7": [
        {
            "entity_name": "Donald J. Trump",
            "entity_type": "PERSON",
            "description": "Former President Donald J. Trump, central to the ballot case being ruled on by the Supreme Court, concerning his eligibility for the Colorado Republican primary ballot and potentially his eligibility to run in the general election and hold office. Accused by Colorado's top court of insurrection in his efforts to subvert the 2020 election.",
            "source_entities": [
                "DONALD J. TRUMP"
            ]
        },
        {
            "entity_name": "Supreme Court",
            "entity_type": "ORGANIZATION",
            "description": "The Supreme Court is deciding on the eligibility of Donald J. Trump for the Colorado primary ballot and potentially his eligibility to run in the general election and hold office. The case will be argued on Feb. 8, and the court will probably decide it quickly. The Colorado Republican Party urged the justices to rule by March 5, when primaries are held in many states, including Colorado.",
            "source_entities": [
                "SUPREME COURT"
            ]
        },
        {
            "entity_name": "National Rifle Association (NRA)",
            "entity_type": "ORGANIZATION",
            "description": "The National Rifle Association, once a prominent lobbying organization, is facing a corruption trial in Manhattan with New York's attorney general, Letitia James. Wayne LaPierre, the longtime chief of the NRA, announced his resignation on the eve of this legal battle. Andrew Arulanandam, Wayne LaPierre's longtime spokesman, will become the NRA's interim chief executive.",
            "source_entities": [
                "NATIONAL RIFLE ASSOCIATION",
                "WAYNE LAPIERRE",
                "ANDREW ARULANANDAM"
            ]
        },
        {
            "entity_name": "Bush v. Gore",
            "entity_type": "EVENT",
            "description": "Bush v. Gore is a landmark Supreme Court case that decided the 2000 U.S. presidential election, serving as a comparison for the current pivotal role of the court in the Trump case.",
            "source_entities": [
                "BUSH V. GORE"
            ]
        },
        {
            "entity_name": "The New York Times Company",
            "entity_type": "ORGANIZATION",
            "description": "The New York Times Company is the publisher of the newspaper, as indicated by the copyright notice and the article's presentation.",
            "source_entities": [
                "THE NEW YORK TIMES COMPANY"
            ]
        }
    ],
    "chunk-aa1d2a93ea4e43412f301f5e83efbd0a": [
        {
            "entity_name": "White House Office of Intergovernmental Affairs",
            "entity_type": "ORGANIZATION",
            "description": "An administration body directed by Tom Perez, which is in contact with Democratic politicians regarding city crises.",
            "source_entities": [
                "TOM PEREZ",
                "WHITE HOUSE OFFICE OF INTERGOVERNMENTAL AFFAIRS"
            ]
        },
        {
            "entity_name": "Democratic Politicians",
            "entity_type": "ORGANIZATION",
            "description": "Politicians in contact with Tom Perez and other administration officials regarding crises in their cities, seeking help with migrant encampments, packed shelters, and busted budgets.",
            "source_entities": [
                "DEMOCRATIC POLITICIANS",
                "DEMOCRATIC LAWMAKERS"
            ]
        },
        {
            "entity_name": "Pharmaceutical Research and Manufacturers of America (PhRMA)",
            "entity_type": "ORGANIZATION",
            "description": "The major lobbying organization for the pharmaceutical industry, which has opposed the importation of drugs from Canada and is expected to file suit to block the Florida plan.",
            "source_entities": [
                "PHARMACEUTICAL RESEARCH AND MANUFACTURERS OF AMERICA",
                "PHARMACEUTICAL INDUSTRY",
                "BIG PHARMA"
            ]
        },
        {
            "entity_name": "Health Canada",
            "entity_type": "ORGANIZATION",
            "description": "The Canadian government body that has taken steps to block the export of prescription drugs in short supply and whose spokeswoman, Maryse Durette, stated that Canada's drug supply is too small to meet the demands of both American and Canadian consumers.",
            "source_entities": [
                "HEALTH CANADA",
                "MARYSE DURETTE"
            ]
        },
        {
            "entity_name": "Federal Health Officials",
            "entity_type": "ORGANIZATION",
            "description": "Officials who delayed implementing a law allowing drug importation, citing safety concerns.",
            "source_entities": [
                "FEDERAL HEALTH OFFICIALS",
                "FOOD AND DRUG ADMINISTRATION"
            ]
        }
    ],
    "chunk-ba204505f86c95de41c93f01fb0052c5": [
        {
            "entity_name": "Joseph Lelyveld",
            "entity_type": "PERSON",
            "description": "Joseph Lelyveld was the executive editor of The Times, a powerful post in American journalism, where he led the organization to record levels of revenue and profits and introduced digital operations.",
            "source_entities": [
                "JOSEPH LELYVELD",
                "THE TIMES"
            ]
        },
        {
            "entity_name": "Rishi Sunak",
            "entity_type": "PERSON",
            "description": "Rishi Sunak, the Prime Minister of Britain, signaled that citizens will vote in the fall, similar to the U.S. election schedule.",
            "source_entities": [
                "RISHI SUNAK",
                "BRITAIN"
            ]
        },
        {
            "entity_name": "China",
            "entity_type": "GEO",
            "description": "China is the country that has benefited from Russia's switch in purchases due to the war in Ukraine.",
            "source_entities": [
                "CHINA",
                "BEIJING",
                "RUSSIA",
                "UKRAINE"
            ]
        },
        {
            "entity_name": "Apple",
            "entity_type": "ORGANIZATION",
            "description": "Apple is a company that is likely to face an antitrust suit from the Justice Department over its tactics to maintain the iPhone's dominance.",
            "source_entities": [
                "APPLE",
                "JUSTICE DEPARTMENT"
            ]
        },
        {
            "entity_name": "This House Is Not a Home",
            "entity_type": "EVENT",
            "description": "This House Is Not a Home is a play by Nile Harris that uses an unconventional set to convey American divisions.",
            "source_entities": [
                "THIS HOUSE IS NOT A HOME",
                "NILE HARRIS"
            ]
        }
    ]
}