{
  "chunk-ec82d75e498c03f73732442d0d445af8": {
    "tokens": 1200,
    "content": "VOL. CLXXIII . . . No. 59,956 © 2023  The New York Times Company  \n\nSUNDAY, OCTOBER 29, 2023  \n\n![](images/image_1.jpg)  \nA barrage of Israeli airstrikes overnight destroyed hundreds of buildings in Gaza, including at Al-Shati camp, above, near Gaza City.  \n\n# Speaker Injects Fervent Faith Into His Policy  \n\nThis article is by Annie Karni, Ruth Graham and Steve Eder.  \n\nIn the moments before he was to  face  a  vote  on  becoming speaker of the House last week, Representative  Mike  Johnson posted a photograph on social media of the inscription carved into marble atop the chamber’s rostrum: “In God We Trust.”  \n\n![](images/image_2.jpg)  \n\nMike Johnson  \n\nIIS 0 leagues celebrated his candidacy by circulating an image of him on bended knee praying for divine guidance with other lawmakers on the House floor.  \n\nAnd in his first speech from the chamber as speaker, Mr. Johnson cast his ascendance to the position second in line to the presidency in religious terms, saying, “I believe God has ordained and allowed each one of us to be brought here for this specific moment.” Mr. Johnson, a mild-mannered conservative  Republican  from Louisiana whose elevation to the speakership on Wednesday followed weeks of chaos, is known for placing his evangelical Christianity at the center of his political life and policy positions. Now, as the most powerful Republican in Washington, he is in a position to inject it squarely into the national political discourse, where he has argued for years that it belongs. Mr. Johnson, 51, the son of a firefighter and the first in his family to attend college, has deep roots in the Southern Baptist Convention, the nation’s largest Protestant denomination. For years, Mr. Johnson and his wife, Kelly, a licensed pastoral counselor, belonged to First Bossier, whose pastor, Brad Jurkovich, is the spokesman for the  Conservative  Baptist  Network, an organization working to move the denomination to the right.  \n\n# Money, Misconduct and the Price of Appeasement  \n\n# By MEGAN TWOHEY  \n\nThe Adidas team was huddled with Kanye West, pitching ideas for the first shoe they would create together. It was 2013, and the rapper and the sportswear brand had just agreed to become partners.  The  Adidas  employees, thrilled to get started, had arrayed sneakers and fabric swatches on a long table near a mood board pinned with images.  \n\nBut nothing they showed that day at the company’s German headquarters captured the vision Mr. West had shared. To convey how offensive he considered the designs, he grabbed a sketch of a shoe and took a marker to the toe, according  to  two  participants. Then he drew a swastika. It was shocking, especially to the Germans in the group. Most displays of the symbol are banned in their country. The image was acutely sensitive for a company whose founder belonged to the Nazi Party. And they were meet  \n\n# Inside  Kanye  West’s  \n\nDeal With Adidas Adidas tolerated Kanye West’s conduct as a cost of business.  \n\n![](images/image_3.jpg)  \n\ning just miles from Nuremberg, where leaders of the Third Reich were tried for crimes against humanity. That encounter was a sign of what was to come during a collaboration that would break the boundaries of celebrity endorsement deals. Sales of the shoes, Yeezys, would surpass \\$1 billion a year, lifting Adidas’s bottom line and recapturing its cool. Mr. West, who now goes by Ye, would become a billionaire.  \n\nWhen the company ended the relationship last October, it appeared to be the culmination of weeks of Mr. West’s inflammatory public remarks — targeting Jews and disparaging Black Lives Matter — and outside pressure on the brand to cut ties. But it was also the culmination of a decade of Adidas’s tolerance behind the scenes. Inside  their  partnership,  the artist made antisemitic and sexually  offensive  comments,  displayed erratic behavior, and issued ever escalating demands, a New  York  Times  examination found. Adidas’s leaders, eager for the profits, time and again abided his misconduct.  \n\nWhen he exploded in bitter outbursts at Adidas managers, the company typically sought not to Continued on Page 18  \n\n# Old World, Young Africa  \n\n![](images/image_4.jpg)  \n\nMr. Johnson also played a leading role in efforts to overturn the results of the 2020 presidential Continued on Page 14  \n\nAbove, an educational program in Zaria, Nigeria. By 2050, one in three young people on the planet will be African, and the effects of this change are already registering across the world. This is the first article in a series on the world’s fastest-growing population of young people. A Special Section.  \n\n# WAR HAS ENTERED ITS ‘SECOND STAGE,’ NETANYAHU STATES  \n\nVast Tunnel Network Israeli Army Presses Hidden by Hamas Deeper Into Gaza, Poses Big Risks and Remains  \n\nJERUSALEM — Just after midnight on Tuesday, the Israel Defense Forces announced that they had struck a tunnel that allowed Hamas to “infiltrate  Israel through the sea.”  \n\nThe sea tunnel was unusual, a sign that Hamas has designed deadly new ways to attack Israel. The armed group has miles of tunnels under the Gaza Strip — a U.S. official likened them to “miniature cities” — but the exit to this one was on a beach.  \n\nAmong the possible reasons Israel delayed sending troops into Gaza after the Hamas attack on Oct. 7, one stands out, military experts say: the tunnels.  \n\nUnderneath  the  tiny  coastal strip and its more than 2 million people is a vast network of",
    "chunk_order_index": 0,
    "full_doc_id": "doc-388db477b35cf4709c4868c362dc1b9c"
  },
  "chunk-5bf828067bce3c62a1830182773beb09": {
    "tokens": 1200,
    "content": "deadly new ways to attack Israel. The armed group has miles of tunnels under the Gaza Strip — a U.S. official likened them to “miniature cities” — but the exit to this one was on a beach.  \n\nAmong the possible reasons Israel delayed sending troops into Gaza after the Hamas attack on Oct. 7, one stands out, military experts say: the tunnels.  \n\nUnderneath  the  tiny  coastal strip and its more than 2 million people is a vast network of subterranean  pathways,  rooms,  cells and even roads for vehicles. Hamas, which oversees Gaza, is believed to hide weapons, fighters and even command centers in the warren  of  underground  chambers.  \n\nOvernight on Saturday, Israeli fighter planes struck 150 underground targets in the northern Gaza Strip, the Israeli military said.  \n\nFor the Israeli forces who take part in any large-scale ground invasion, one of the most daunting challenges will be the tunnels, which Hamas has spent years refining. For the people who live above the tunnels, one of the most frightening propositions will be how to survive the subterranean warfare.  \n\n“We should have no illusions about how this is going to be,” said Gen. Joseph L. Votel, the former leader of United States Central Command, which is responsible for the Middle East. “It will be bloody, brutal fighting.”  \n\nIn an interview, he recalled the final days of the battle for the Iraqi city of Mosul, where Islamic State fighters hid in a series of tunnels in 2017. “Our Iraqi soldiers were Continued on Page 11  \n\nThis article is by Patrick Kingsley, Ronen  Bergman and  Thomas Fuller.  \n\nJERUSALEM — Prime Minister Benjamin Netanyahu said in a televised news conference on Saturday that Israel’s forces had entered the Gaza Strip, calling it his country’s “second war of independence” and warning Israelis to expect a “long and difficult” campaign to eradicate Hamas.  \n\nMr. Netanyahu said the troops had gone into Gaza on Friday evening, beginning “the second stage of the war.” The Israeli military has not publicly described the current operation as an invasion, and has released only brief footage of its advance.  \n\nThe ground assault in the northern part of the Gaza Strip was shrouded in secrecy and ambiguity and accompanied by an enormous aerial and artillery bombardment. It was the most sustained  fighting  against  Hamas since the war began three weeks ago, when gunmen from the group that controls Gaza launched a surprise cross-border attack into Israel on Oct. 7, killing at least 1,400 people and spurring retaliatory airstrikes by Israel in the Gaza Strip.  \n\nHamas’s armed wing confirmed on Friday night and Saturday af-ternoon that the battle with Israeli ground forces had been joined. Shortly before Mr. Netanyahu’s remarks, a spokesman for the group, Abu Obeida, greeted the relentless airstrikes and the ground incursion with defiance. Hamas would make Israel “taste new ways of death,” the spokesman said.  \n\nWith Gazan internet connections and phone lines down, few Palestinian accounts have emerged, making it difficult to assess the extent of the military action. Palestinian telecommunication companies blamed Israel’s bombardment for the wide-scale communications blackout, which left most people in Gaza unreachable  by  phone.  The  blackout Continued on Page 9  \n\nHOSPITAL OR SHIELD? Israel accused Hamas of concealing command centers beneath a medical facility sheltering tens of thousands. PAGE 8 ‘KINDRED SPIRIT’ President Biden’s “unwavering support” for Israel goes back decades, even as it stirs criticism from the far left. PAGE 10  \n\n# Indiscriminate Art Hoard Draws A Curious Picture of Berlusconi  \n\n# By JASON HOROWITZ and ELISABETTA POVOLEDO  \n\nROME — As his political fortunes sank, his legal and love life tangled, and his age caught up with him, Silvio Berlusconi stayed up late in his mansion outside Milan calling the hotlines of latenight  art  shopping  television channels.  \n\nIt didn’t really matter what the oil painting and antiques vendors hawked. Landscapes. Sculptures. Portraits. A fair share of nudes. Night after night, and then year after year, the octogenarian media mogul and former prime minister who wanted to have it all tried to buy it all, amassing an enormous collection of all the mail-order art he could lay his bleary eyes on.  \n\n“He had this project to build the largest collection in Italy,” said Giuseppe De Gregorio, a televendor near Naples who sold thousands of paintings to Mr. Berlusconi. “He didn’t want important paintings. He wanted paintings. It was enough if they were painted with oil on a canvas.”  \n\nNow, months after Mr. Berlusconi’s death at age 86, his heirs are figuring out who gets what in his sprawling empire. Despite the understanding among some of Mr. Berlusconi’s dealer friends that his heirs want to unload the artworks, his family said in a statement that they are in no rush to diContinued on Page 12  \n\n# NATIONAL 13-24  \n\nPence Ends His Campaign He had increasingly attacked former President Donald J. Trump over Jan. 6, but gained little traction and struggled to raise money. PAGE 23  \n\n# ARTS & LEISURE  \n\nWhat Possessed Us? Since its release 50 years ago, “The Exorcist” has held a diabolical grip on popular culture. Three critics revisit the film and its aftershocks. PAGE 12 SUNDAY BUSINESS Civics Lessons at the Office Concerned that distrust and disinformation could threaten their bottom line, some German companies are offering employees lessons in democracy. PAGE 6  \n\n# SUNDAY STYLES  \n\nThe Unexpected Influencers A trucker, a shepherd",
    "chunk_order_index": 1,
    "full_doc_id": "doc-388db477b35cf4709c4868c362dc1b9c"
  },
  "chunk-6143671bae3a0db63e400d23c51621e0": {
    "tokens": 149,
    "content": "ISURE  \n\nWhat Possessed Us? Since its release 50 years ago, “The Exorcist” has held a diabolical grip on popular culture. Three critics revisit the film and its aftershocks. PAGE 12 SUNDAY BUSINESS Civics Lessons at the Office Concerned that distrust and disinformation could threaten their bottom line, some German companies are offering employees lessons in democracy. PAGE 6  \n\n# SUNDAY STYLES  \n\nThe Unexpected Influencers A trucker, a shepherd and a commercial fisherman are among those who have used their trades to become unlikely social media stars. PAGE 10  \n\nSUNDAY OPINION  \n\n# Erin L. Thompson  \n\n0354753 6  \n\n![](images/image_5.jpg)",
    "chunk_order_index": 2,
    "full_doc_id": "doc-388db477b35cf4709c4868c362dc1b9c"
  }
}