{
    "image_1": [
        {
            "entity_name": "IMAGE_1_CLOCK-2.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'object'. The entity features are as follows:Object Features:- Name: Clock- Color: The clock has a white face with black markings and hands.- Shape: Round- Size: The image shows a close-up, so the actual size of the clock cannot be determined, but it appears to be a standard wall clock.- Material: Likely made of plastic or metal for the frame and glass or plastic for the face cover.- Possible function: Used for telling time.- Other significant characteristics: The clock has a simple design with hour, minute, and second hands. The hour hand is pointing between the 10 and 11, the minute hand is on the 6, and the second hand is near the 9, indicating a specific time."
        },
        {
            "entity_name": "IMAGE_1_PERSON-0.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'person'. The entity features are as follows:Person Features:- Gender: Female- Hairstyle: Long, wavy hair with bangs, styled in a period fashion- Eyes: Large and expressive, with a serious or contemplative expression- Expression: Neutral to slightly concerned- Age: Appears to be a young girl- Clothing: Wearing a long, puffy-sleeved dress with a high collar and a full skirt; a crown on her head, indicating royalty or a regal theme; a necklace around her neck- Accessories: Holding a scepter in her right hand, which is resting on her lapOverall, the character appears to be a depiction of a princess or queen from a fairy tale or historical context, given the crown and scepter."
        },
        {
            "entity_name": "IMAGE_1_PERSON-1.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'person'. The entity features are as follows:Person Features:- Gender: Male- Skin Color: The skin color is not discernible due to the style of the drawing.- Hairstyle: Short, with a distinct parting in the middle.- Clothing: Wearing a robe or cloak that appears to be made of a heavy fabric, with a high collar and long sleeves. The robe has a patterned design, possibly indicating a status of importance or nobility.- Headgear: Wearing a hat or crown that is tall and pointed, suggesting a position of authority or royalty.- Posture: The figure is depicted in profile, facing to the left, with a slight upward gaze.- Expression: The expression is serious and contemplative, with a prominent nose and a small mouth.Overall, the character appears to be a historical or medieval figure, possibly a king or a nobleman, given the style of the clothing and headgear."
        },
        {
            "entity_name": "IMAGE_1",
            "entity_type": "ORI_IMG",
            "description": "The image is a black-and-white illustration depicting a whimsical scene from the story of Alice in Wonderland. At the center, Alice stands with a surprised and somewhat bewildered expression, wearing a dress and a crown, holding a scepter. On either side of her are two large, round-headed figures resembling queens, each adorned with crowns and dressed in elaborate clothing. The queen on the left appears to be asleep, leaning heavily against Alice, while the queen on the right is also slumped over, contributing to the sense of weight and burden that Alice seems to be carrying. The background features tall grasses and wildflowers, adding to the fantastical and dreamlike atmosphere of the scene. The overall mood conveyed is one of confusion and absurdity, as Alice finds herself in an unexpected and surreal situation."
        },
        {
            "entity_name": "ALICE",
            "entity_type": "PERSON",
            "description": "A young girl dressed in a dress, wearing a crown and holding a scepter."
        },
        {
            "entity_name": "KING",
            "entity_type": "PERSON",
            "description": "An older man with a large nose, wearing a crown and a robe, sitting on the ground."
        },
        {
            "entity_name": "QUEEN",
            "entity_type": "PERSON",
            "description": "A woman with a large nose, wearing a crown and a robe, sitting on the ground."
        },
        {
            "entity_name": "SCEPTER",
            "entity_type": "OBJECT",
            "description": "A staff held by Alice, symbolizing authority or power."
        },
        {
            "entity_name": "CROWN",
            "entity_type": "OBJECT",
            "description": "A royal headpiece worn by Alice, King, and Queen, symbolizing royalty."
        },
        {
            "entity_name": "CLOCK",
            "entity_type": "UNKNOWN",
            "description": "The image feature block image_1_clock-2.jpg is a picture of a clock."
        }
    ],
    "image_2": [
        {
            "entity_name": "IMAGE_2_PERSON-1.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'organism'. The entity features are as follows:Organism Features:- Species: Frog- Clothing: Wearing a formal outfit that includes a jacket, vest, and trousers. The jacket has a bow at the back, and the trousers have a patch on one knee.- Posture: Standing upright on two legs in a human-like posture, with one arm bent at the elbow and the other arm hanging by its side.- Structural Characteristics: The frog has a large head with prominent eyes and a wide mouth. Its body is segmented into a torso and limbs, with the limbs ending in webbed feet.Overall, the frog is depicted in a whimsical and anthropomorphic manner, combining animal characteristics with human attire and posture."
        },
        {
            "entity_name": "IMAGE_2_PERSON-0.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'person'. The entity features are as follows:Person Features:- Gender: Female- Hairstyle: Long, wavy hair that reaches down to the waist- Clothing: Wearing a Victorian-style dress with a fitted bodice and a full skirt; the dress has a high neckline and long sleeves; there is a belt around the waist and a frilled hem at the bottom of the skirt- Accessories: A small hat or bonnet on her head, which appears to be decorated with a bow or ribbon; she is also wearing a necklace- Posture: Standing with one arm raised, possibly holding an object (not clearly visible in the image)- Age: Appears to be a young woman or girlOverall, the character gives off a historical or vintage vibe, reminiscent of the Victorian era."
        },
        {
            "entity_name": "IMAGE_2",
            "entity_type": "ORI_IMG",
            "description": "The image is a black-and-white illustration depicting a scene from the story of Alice in Wonderland. The main characters are Alice and a frog-like creature. Alice, dressed in a Victorian-style dress with a crown on her head, stands to the right of the image. She appears to be speaking or shouting at the door, which has an inscription above it reading 'Queen Alice.' The door is ornate with intricate designs and a knocker shaped like a frog's head. To the left of the door stands a frog-like creature, dressed in a bright yellow outfit with large boots, holding a cane. The creature has a solemn expression and is looking towards Alice. The background features a detailed archway with decorative patterns. The overall atmosphere conveys a sense of frustration and confusion, as Alice tries to get the door opened while the frog-like creature seems indifferent or slow to respond."
        },
        {
            "entity_name": "ALICE",
            "entity_type": "PERSON",
            "description": "A young girl dressed in a dress with a crown on her head, holding a scepter and standing in front of a door."
        },
        {
            "entity_name": "DODO",
            "entity_type": "PERSON",
            "description": "A creature resembling a bird with human-like features, wearing a coat and hat, holding a stick and bowing to Alice."
        },
        {
            "entity_name": "DOOR",
            "entity_type": "OBJECT",
            "description": "An ornate wooden door with the inscription 'Queen Alice' above it."
        }
    ],
    "image_3": [
        {
            "entity_name": "IMAGE_3",
            "entity_type": "ORI_IMG",
            "description": "The image is a black-and-white illustration depicting a whimsical and surreal scene. The main figure appears to be a leg of mutton, which is anthropomorphized with a head and arms. The leg of mutton is standing on a plate, wearing what looks like a hat or a flower on its head, and it has a somewhat dignified posture. It is holding a small object in one hand, possibly a napkin or a piece of paper. The background is abstract, with indistinct shapes and lines that suggest a chaotic or dreamlike setting. The overall atmosphere is one of absurdity and fantasy, fitting the context of a story where food items come to life and interact with human characters."
        },
        {
            "entity_name": "HUMPTY DUMPTY",
            "entity_type": "PERSON",
            "description": "A large, egg-shaped character with a human face and limbs, wearing a long coat and standing on a wall."
        },
        {
            "entity_name": "WALL",
            "entity_type": "GEO",
            "description": "A curved surface on which Humpty Dumpty is standing."
        }
    ],
    "image_4": [
        {
            "entity_name": "IMAGE_4",
            "entity_type": "ORI_IMG",
            "description": "The image is a black-and-white illustration depicting a chaotic scene from a fairy tale. The central figure is a young girl with long hair, wearing a dress and a crown, who appears to be in motion, possibly running or jumping. She is surrounded by various objects that seem to be floating or falling, including plates, dishes, and candles. There are also several small creatures, resembling insects or fairies, flying around her. The background is filled with more objects, such as vases and fruits, adding to the sense of disorder. The overall atmosphere is one of whimsy and chaos, typical of a fantastical narrative. The girl's posture and the movement of the objects suggest a dynamic and energetic scene."
        },
        {
            "entity_name": "ALICE",
            "entity_type": "PERSON",
            "description": "A young girl with long hair, wearing a dress and a crown, standing in a fantastical setting."
        },
        {
            "entity_name": "KING",
            "entity_type": "PERSON",
            "description": "A character wearing a crown and a robe, sitting on a throne."
        },
        {
            "entity_name": "QUEEN",
            "entity_type": "PERSON",
            "description": "A character wearing a crown and a robe, standing next to the King."
        },
        {
            "entity_name": "FLAMINGO",
            "entity_type": "OBJECT",
            "description": "A flamingo being used as a croquet mallet in a surreal game."
        },
        {
            "entity_name": "HEDGEHOG",
            "entity_type": "OBJECT",
            "description": "A hedgehog being used as a ball in a surreal game."
        },
        {
            "entity_name": "CROQUET SET",
            "entity_type": "OBJECT",
            "description": "A set of croquet equipment including hoops and a mallet."
        },
        {
            "entity_name": "TABLE SETTING",
            "entity_type": "UNKNOWN",
            "description": "Table Setting是从image_4中提取的实体。"
        }
    ],
    "image_5": [
        {
            "entity_name": "IMAGE_5",
            "entity_type": "ORI_IMG",
            "description": "The image is a black-and-white illustration of a character that appears to be a queen, given the crown with a large ball on top. The queen has a round face and is depicted in a dynamic pose, as if she is being shaken or jolted. She is wearing a long dress with a pattern that resembles checkered squares, and her arms are extended outward, with one hand pointing forward. Her expression seems to convey surprise or distress. The background is minimalistic, with no distinct features other than the shadowing that suggests movement and depth. The overall atmosphere of the image conveys a sense of chaos or sudden change, fitting the context of Alice shaking the Red Queen into a kitten."
        },
        {
            "entity_name": "KING",
            "entity_type": "PERSON",
            "description": "A cartoon character wearing a crown and a robe, appearing to be in motion with one arm extended forward and the other bent at the elbow."
        },
        {
            "entity_name": "CROWN",
            "entity_type": "UNKNOWN",
            "description": "The king is wearing a crown on his head."
        },
        {
            "entity_name": "ROBE",
            "entity_type": "UNKNOWN",
            "description": "The king is wearing a robe."
        },
        {
            "entity_name": "ARM MOTION",
            "entity_type": "UNKNOWN",
            "description": "The king's arms are in motion, with one arm extended forward and the other bent at the elbow."
        }
    ],
    "image_6": [
        {
            "entity_name": "IMAGE_6_DOG-0.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'organism'. The entity features are as follows:Organism Features:- Species: Cat- Age: Appears to be an adult cat- Color: Black with a white underbelly and paws- Shape: The cat has a rounded body, typical of domestic cats, with a visible tail and ears. The posture suggests it is lying down or resting.- Size: The cat appears to be of average size for an adult domestic cat.- Posture: The cat is in a relaxed position, with its front paws stretched out and its head turned slightly to the side, giving a sense of calmness and comfort."
        },
        {
            "entity_name": "IMAGE_6",
            "entity_type": "ORI_IMG",
            "description": "The image is a black-and-white illustration depicting a kitten being held upside down by a human hand. The kitten appears to be in a state of distress or discomfort, with its eyes wide open and its body stretched out. The kitten's fur is dark, and its posture suggests it is being shaken or jostled. The background is minimalistic, with vertical lines that give the impression of a striped pattern or possibly a curtain. The overall atmosphere conveyed by the image is one of tension and discomfort, as the kitten seems to be experiencing an unpleasant situation."
        },
        {
            "entity_name": "CAT",
            "entity_type": "PERSON",
            "description": "A black cat with a surprised expression, being held upside down by a hand."
        },
        {
            "entity_name": "HAND",
            "entity_type": "PERSON",
            "description": "A human hand holding the cat upside down."
        }
    ],
    "image_7": [
        {
            "entity_name": "IMAGE_7_PERSON-1.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'person'. The entity features are as follows:Person Features:- Gender: Female- Hairstyle: Long, wavy hair that falls over the shoulders- Expression: Neutral to slightly curious or contemplative- Age: Appears to be a young girl- Clothing: Wearing a long, flowing dress with ruffled sleeves and a high collar; the dress has a textured pattern- Posture: Sitting with one arm raised, pointing outward, and the other arm holding a small object close to the bodyOverall, the character appears to be from an illustrated story or fairy tale, given the style of the drawing and the attire."
        },
        {
            "entity_name": "IMAGE_7_CAT-0.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'organism'. The entity features are as follows:Organism Features:- Species: Domestic cat- Age: Adult- Color: Black and white, with a mix of solid black areas and white fur with black spots- Shape: The cat is depicted in a seated position with its body slightly turned to the side. Its head is turned towards the viewer, showing one eye and part of its face.- Size: The cat appears to be of average size for an adult domestic cat.- Posture: The cat is sitting with its front paws resting on the ground and its tail curled around its body. Its ears are perked up, indicating alertness or curiosity.- Structural Characteristics: The cat has a round face with prominent whiskers, a small nose, and large eyes. Its fur appears fluffy and well-groomed.Overall, the cat gives off a calm and observant demeanor, typical of a domestic feline in a relaxed state."
        },
        {
            "entity_name": "IMAGE_7",
            "entity_type": "ORI_IMG",
            "description": "The image is a black-and-white illustration from the classic children's book 'Alice in Wonderland.' It depicts Alice, a young girl with long hair, kneeling on the ground. She is holding a large, fluffy cat under her arm with one hand and a small object, possibly a piece of food or a toy, in the other hand. The cat appears to be a raccoon-like creature with a striped tail. To the right of Alice, there is another cat sitting on the ground, looking up at her with a curious expression. The background features a tall, ornate table or pedestal with intricate designs. The overall atmosphere of the image is whimsical and fantastical, capturing the surreal and dreamlike quality of the story. The illustration style is detailed and expressive, with careful attention to the textures and expressions of the characters."
        },
        {
            "entity_name": "ALICE",
            "entity_type": "PERSON",
            "description": "A young girl with long hair, dressed in a dress, holding a flamingo and a hedgehog."
        },
        {
            "entity_name": "FLAMINGO",
            "entity_type": "OBJECT",
            "description": "A flamingo being held by Alice, used as a croquet mallet."
        },
        {
            "entity_name": "HEDGEHOG",
            "entity_type": "OBJECT",
            "description": "A hedgehog being held by Alice, used as a croquet ball."
        },
        {
            "entity_name": "CAT",
            "entity_type": "ANIMAL",
            "description": "A cat sitting on the ground, observing Alice."
        }
    ]
}