{
    "image_1": {
        "entity_name": "GENDER BIAS IN MACHINE TRANSLATION(MT_GENDER)",
        "entity_type": "EVENT",
        "description": "The subject of the paper, which evaluates gender bias in machine translation systems and presents a challenge set and evaluation protocol for this analysis. The project's data and code are publicly available.",
        "reason": "The image illustrates an example of gender bias in machine translation from English to Spanish, which is directly related to the main topic of the paper 'GENDER BIAS IN MACHINE TRANSLATION(MT_GENDER).'",
        "matched_chunk_entity_name": "GENDER BIAS IN MACHINE TRANSLATION(MT_GENDER)"
    },
    "image_2": {
        "entity_name": "WinoMT",
        "entity_type": "EVENT",
        "description": "WinoMT is the challenge set created by concatenating Winogender and WinoBias datasets for evaluating gender bias in MT.",
        "reason": "The image is a table labeled 'Table 1: The coreference test sets and resulting WinoMT corpus statistics (in number of instances)'. The table provides statistics on the WinoMT dataset, which is used to evaluate gender bias in machine translation systems. This matches with the description of WinoMT in the text information.",
        "matched_chunk_entity_name": "WinoMT"
    },
    "image_3": {
        "entity_name": "Table 2",
        "entity_type": "EVENT",
        "description": "Table 2 denotes the difference in performance between male and female translations, indicating a significant bias towards male roles.",
        "reason": "The image is a table comparing the performance of four commercial machine translation (MT) systems on the WinoMT corpus across eight languages. This matches with 'Table 2' which describes the differences in performance between male and female translations, indicating a significant bias towards male roles.",
        "matched_chunk_entity_name": "Table 2"
    },
    "image_4": {
        "entity_name": "Table 3: Performance of recent state-of-the-art academic translation models from English to French and German.",
        "entity_type": "EVENT",
        "description": "The table provides metrics related to gender accuracy in translations, with Acc indicating overall gender accuracy (% of instances the translation had the correct gender), Δ_G denoting the difference in performance F1 score between masculine and feminine scores, and Δ_S representing the difference in performance F1 score between pro-stereotypical and anti-stereotypical gender role assignments. Higher numbers in Δ_G and Δ_S indicate stronger biases.",
        "reason": "The image clearly shows a table labeled 'Table 3' which matches the description provided in the text. The table contains data on the performance of academic translation models for French and German, including accuracy and bias metrics.",
        "matched_chunk_entity_name": "TABLE 3"
    },
    "image_5": {
        "entity_name": "Google Translate’s performance on gender translation on our tested languages",
        "entity_type": "EVENT",
        "description": "The event depicted in the image is a bar chart showing the accuracy of Google Translate in translating stereotypical and non-stereotypical gender roles across eight different languages.",
        "reason": "The image clearly shows a bar chart titled 'Google Translate’s performance on gender translation on our tested languages,' which directly aligns with the content of the text. The chart compares the accuracy of Google Translate in translating stereotypical and non-stereotypical gender roles, which is consistent with the information provided in the text.",
        "matched_chunk_entity_name": "Figure 2"
    },
    "image_6": {
        "entity_name": "Table 4",
        "entity_type": "EVENT",
        "description": "Table 4 shows the performance of Google Translate on Spanish, Russian, and Ukrainian gender prediction accuracy on the original and modified WinoMT corpus.",
        "reason": "The image is a table labeled 'Table 4' which presents the performance of Google Translate on Spanish, Russian, and Ukrainian gender prediction accuracy. This matches with the description provided in the text.",
        "matched_chunk_entity_name": "TABLE 4"
    },
    "image_7": {
        "entity_name": "Table 5",
        "entity_type": "EVENT",
        "description": "Examples of Google Translate’s output for different sentences in the WinoMT corpus. Words in blue, red, and orange indicate male, female and neutral entities, respectively.",
        "reason": "The image is a table labeled 'Table 5: Examples of Google Translate’s output for different sentences in the WinoMT corpus.' This matches the description provided in the text information.",
        "matched_chunk_entity_name": "Table 5"
    }
}