{
    "chunk-ec82d75e498c03f73732442d0d445af8": null,
    "chunk-5bf828067bce3c62a1830182773beb09": [
        {
            "entity_name": "Israel",
            "entity_type": "GEO",
            "description": "Israel is a country in the Middle East that is under attack and has military operations against Hamas in the Gaza Strip. It is also involved in airstrikes and ground invasions, and is supported by the United States.",
            "source_entities": [
                "ISRAEL",
                "U.S.",
                "ISRAELI FIGHTER PLANES",
                "ISRAELI FORCES"
            ]
        },
        {
            "entity_name": "Gaza Strip",
            "entity_type": "GEO",
            "description": "The Gaza Strip is a coastal territory controlled by Hamas, where a network of tunnels exists, and it is the site of conflict with Israel. It experienced a communications blackout due to the conflict.",
            "source_entities": [
                "GAZA STRIP",
                "COMMUNICATIONS BLACKOUT"
            ]
        },
        {
            "entity_name": "Hamas",
            "entity_type": "ORGANIZATION",
            "description": "Hamas is the organization that controls the Gaza Strip, using tunnels for military purposes and is in conflict with Israel. It has conducted a cross-border attack into Israel and is involved in the battle with Israeli ground forces.",
            "source_entities": [
                "HAMAS",
                "ABU OBEIDA",
                "CROSS-BORDER ATTACK",
                "GROUND INCURSION"
            ]
        },
        {
            "entity_name": "United States Central Command",
            "entity_type": "ORGANIZATION",
            "description": "The United States Central Command is a military command responsible for the Middle East, with Gen. Joseph L. Votel as a former leader, providing commentary on the conflict between Israel and Hamas.",
            "source_entities": [
                "UNITED STATES CENTRAL COMMAND",
                "GEN. JOSEPH L. VOTEL"
            ]
        },
        {
            "entity_name": "Benjamin Netanyahu",
            "entity_type": "PERSON",
            "description": "Benjamin Netanyahu is the Prime Minister of Israel, who announced the military operation in the Gaza Strip, referred to as the 'second war of independence', and warned of a long and difficult campaign to eradicate Hamas.",
            "source_entities": [
                "BENJAMIN NETANYAHU",
                "SECOND WAR OF INDEPENDENCE"
            ]
        },
        {
            "entity_name": "Islamic State",
            "entity_type": "ORGANIZATION",
            "description": "Islamic State is a terrorist organization that has used tunnels in past conflicts, drawing parallels to Hamas's tactics, as referenced in the context of the battle for Mosul.",
            "source_entities": [
                "ISLAMIC STATE",
                "ISLAMIC STATE FIGHTERS"
            ]
        },
        {
            "entity_name": "Iraqi City of Mosul",
            "entity_type": "GEO",
            "description": "Mosul is an Iraqi city where Islamic State fighters hid in tunnels during a battle in 2017, drawing parallels to the situation in Gaza.",
            "source_entities": [
                "IRAQI CITY OF MOSUL"
            ]
        },
        {
            "entity_name": "Palestinian Telecommunication Companies",
            "entity_type": "ORGANIZATION",
            "description": "Palestinian telecommunication companies are blaming Israel's bombardment for the communications blackout in Gaza.",
            "source_entities": [
                "PALESTINIAN TELECOMMUNICATION COMPANIES"
            ]
        }
    ],
    "chunk-6143671bae3a0db63e400d23c51621e0": [
        {
            "entity_name": "PAGE 10",
            "entity_type": "EVENT",
            "description": "PAGE 10 is an event or section in the text where discussions on unexpected social media influencers and Erin L. Thompson's opinion are featured.",
            "source_entities": [
                "PAGE 10",
                "PAGE 10"
            ]
        }
    ]
}