{
    "image_1": {
        "image_id": 1,
        "image_path": "./fusion_research/fusion_dataset/novel/Harry Potter and the Sorcerers Stone Illustrated Edition (J. K. Rowling, Jim Kay (Illustrator)) (5)/images/image_1.jpg",
        "caption": [],
        "footnote": [],
        "context": "They had practical exams as well. Professor Flitwick called them one by one It was sweltering hot, especially in the large classroom where they did their written papers. They had been given special, new quills for the exams, which had been bewitched with an Anti-Cheating spell. n years to come, Harry would never quite remember how he had managed to get through his exams when he half expected Voldemort to come bursting through the door at any moment. Yet the days crept by, and there could be no doubt that Fluŀy was still alive and well behind the locked door. very frightened, but she had a word of comfort. “Harry, everyone says Dumbledore’s the only one YouKnow-Who was ever afraid of. With Dumbledore around, YouKnow-Who won’t touch you. Anyway, who says the centaurs are right? It sounds like fortune-telling to me, and Professor McGonagall says that’s a very imprecise branch of magic.”  The sky had turned light before they stopped talking. They went to bed exhausted, their throats sore. But the night’s surprises weren’t over. When Harry pulled back his sheets, he found his Invisibility Cloak folded neatly underneath them. There was a note pinned to it: Just in case. ",
        "chunk_order_index": 0,
        "chunk_id": "chunk-751fb0c13236521a49fd325b0be29c4d",
        "description": "The image is an illustration with the text 'CHAPTER SIXTEEN THROUGH THE TRAPDOOR' prominently displayed in the center. The text is framed by a border of intertwined, twisted vines and leaves. The vines are depicted in various shades of brown and purple, with some leaves in bright yellow and green. The overall style is reminiscent of a fantasy or magical theme, with the vines appearing almost alive and entangled. The background is white, which makes the colorful vines and text stand out prominently. The atmosphere conveyed is one of mystery and intrigue, fitting for a chapter title in a fantasy novel.",
        "segmentation": false
    },
    "image_2": {
        "image_id": 2,
        "image_path": "./fusion_research/fusion_dataset/novel/Harry Potter and the Sorcerers Stone Illustrated Edition (J. K. Rowling, Jim Kay (Illustrator)) (5)/images/image_2.jpg",
        "caption": [],
        "footnote": [],
        "context": "“No, no, no. I tried to kill you. “But Snape tried to kill me!” Harry couldn’t take it in. This couldn’t be true, it couldn’t. “Severus?” Quirrell laughed, and it wasn’t his usual quivering treble, either, but cold and sharp. “Yes, Severus does seem the type, doesn’t he? So useful to have him swooping around like an overgrown bat. Next to him, who would suspect p-p-poor, st-stuttering P-Professor Quirrell?” “But I thought—Snape—” “Me,” he said calmly. “I wondered whether I’d be meeting you here, Potter.” Quirrell smiled. His face wasn’t twitching at all. “You!” gasped Harry. t was Quirrell. I straight through the purple Łre. Harry took a deep breath and picked up the smallest bottle. He turned to face the black łames. “Here I come,” he said, and he drained the little bottle in one gulp. It was indeed as though ice was łooding his body. He put the bottle down and walked forward; he braced himself, saw the black łames licking his body, but couldn’t feel them—for a moment he could see nothing but dark Łre—then he was on the other side, in the last chamber. There was already someone there—but it wasn’t Snape. It wasn’t even Voldemort. ",
        "chunk_order_index": 8,
        "chunk_id": "chunk-45abc7e88159e464ff6f68f9579c5ac8",
        "description": "The image is a title page for Chapter Seventeen of a book, titled 'The Man with Two Faces.' The text is centered and written in a serif font. The background features an abstract watercolor design with swirling dark and light gray patterns, giving the impression of smoke or mist. The overall atmosphere is mysterious and somewhat ominous, fitting the theme suggested by the chapter title.",
        "segmentation": false
    },
    "image_3": {
        "image_id": 3,
        "image_path": "./fusion_research/fusion_dataset/novel/Harry Potter and the Sorcerers Stone Illustrated Edition (J. K. Rowling, Jim Kay (Illustrator)) (5)/images/image_3.jpg",
        "caption": [],
        "footnote": [],
        "context": "Val Brathwaite, Andrew Buckingham at the City of London, Alison Caldwell, Clay Caldwell (my Harry!), Katherine Challis, Amelia Clark, Louise Clark, Mark Coales, Lynne and Duncan Cooper (and the pupils of Burford School, Oxfordshire), Tyler Craste, Alison Eldred, Isabel Ford, Howard GlansŁeld, Sarah Goodwin, Dr. David Goyder, Finley Hess, John Howe, Graham Johnson, Roza Jura, Clive Lundquist, Amy McKay (and the pupils of Corby Academy, Northamptonshire), Anthony Maddock, Patrick Ness, David Nichols, Jim Kay would like to thank the following people: ACKNOWLEDGMENTS  NORWEGIAN RIDGEBACK  DRAGON EGGS  HERMIONE  NEWT SCAMANDER’S GUIDE TO TROLLS  PLATFORM NINE AND THREE-QUARTERS  DIAGON ALLEY: PART II over his face. “They don’t know we’re not allowed to use magic at home. I’m going to have a lot of fun with Dudley this summer....”  A SECOND LOOK To provide the best possible reading experience for Harry Potter and the Sorcerer’s Stone, much of Jim Kay’s artwork has been animated. The following pages contain a selection of Jim Kay’s original illustrations, which will allow you to take a second look and enjoy each spread in greater detail. Should you want to explore an illustration, double tap the image and pinch to zoom and expand it. DIAGON ALLEY: PART I ",
        "chunk_order_index": 16,
        "chunk_id": "chunk-54d972eb388598b771e45807ba44f0dd",
        "description": "The image depicts a whimsical and detailed illustration of a quaint, bustling street scene reminiscent of Diagon Alley from the Harry Potter series. The architecture is medieval with half-timbered buildings adorned with intricate details and vibrant colors. The buildings are closely packed together, creating a narrow alleyway that invites exploration. The facades of the buildings are decorated with various signs, banners, and advertisements, adding to the lively atmosphere. Notable features include a sign for 'Madam Malkin's' and another for 'Ollivanders', iconic shops from the Harry Potter universe. The street is filled with people engaged in various activities, such as shopping, chatting, and window shopping. The sky above is partly cloudy, with a few kites and balloons floating in the air, adding a playful touch to the scene. The overall mood of the image is one of enchantment and magic, capturing the essence of a magical marketplace.",
        "segmentation": true
    },
    "image_4": {
        "image_id": 4,
        "image_path": "./fusion_research/fusion_dataset/novel/Harry Potter and the Sorcerers Stone Illustrated Edition (J. K. Rowling, Jim Kay (Illustrator)) (5)/images/image_4.jpg",
        "caption": [],
        "footnote": [],
        "context": "Val Brathwaite, Andrew Buckingham at the City of London, Alison Caldwell, Clay Caldwell (my Harry!), Katherine Challis, Amelia Clark, Louise Clark, Mark Coales, Lynne and Duncan Cooper (and the pupils of Burford School, Oxfordshire), Tyler Craste, Alison Eldred, Isabel Ford, Howard GlansŁeld, Sarah Goodwin, Dr. David Goyder, Finley Hess, John Howe, Graham Johnson, Roza Jura, Clive Lundquist, Amy McKay (and the pupils of Corby Academy, Northamptonshire), Anthony Maddock, Patrick Ness, David Nichols, Oliver Stacey, J.K. Rowling Jim Kay would like to thank the following people: ACKNOWLEDGMENTS  NORWEGIAN RIDGEBACK  DRAGON EGGS  HERMIONE  NEWT SCAMANDER’S GUIDE TO TROLLS  PLATFORM NINE AND THREE-QUARTERS don’t know we’re not allowed to use magic at home. I’m going to have a lot of fun with Dudley this summer....”  A SECOND LOOK To provide the best possible reading experience for Harry Potter and the Sorcerer’s Stone, much of Jim Kay’s artwork has been animated. The following pages contain a selection of Jim Kay’s original illustrations, which will allow you to take a second look and enjoy each spread in greater detail. Should you want to explore an illustration, double tap the image and pinch to zoom and expand it. DIAGON ALLEY: PART I  DIAGON ALLEY: PART II ",
        "chunk_order_index": 16,
        "chunk_id": "chunk-54d972eb388598b771e45807ba44f0dd",
        "description": "The image depicts a whimsical and detailed illustration of Diagon Alley from the Harry Potter series. The scene is bustling with activity, featuring a variety of shops and buildings that are intricately designed with a medieval architectural style. The buildings are tightly packed together, creating a narrow street lined with various storefronts. Notable features include the sign for 'Flourish & Blotts' on the right side, which is a prominent bookstore in the Harry Potter universe. The architecture is characterized by steep roofs, chimneys, and ornate details, giving the scene a magical and enchanting atmosphere. The sky above is partly cloudy, with a few kites flying high, adding to the lively ambiance. The ground level shows a cobblestone street with potted plants and other small details that enhance the overall charm of the scene. The illustration is rich in color and texture, capturing the essence of this iconic location from the Harry Potter world.",
        "segmentation": true
    },
    "image_5": {
        "image_id": 5,
        "image_path": "./fusion_research/fusion_dataset/novel/Harry Potter and the Sorcerers Stone Illustrated Edition (J. K. Rowling, Jim Kay (Illustrator)) (5)/images/image_5.jpg",
        "caption": [],
        "footnote": [],
        "context": "Val Brathwaite, Andrew Buckingham at the City of London, Alison Caldwell, Clay Caldwell (my Harry!), Katherine Challis, Amelia Clark, Louise Clark, Mark Coales, Lynne and Duncan Cooper (and the pupils of Burford School, Oxfordshire), Tyler Craste, Alison Eldred, Isabel Ford, Howard GlansŁeld, Sarah Goodwin, Dr. David Goyder, Finley Hess, John Howe, Graham Johnson, Roza Jura, Clive Lundquist, Amy McKay (and the pupils of Corby Academy, Northamptonshire), Anthony Maddock, Patrick Ness, David Nichols, Oliver Stacey, J.K. Rowling and of course, my Jim Kay would like to thank the following people: ACKNOWLEDGMENTS  NORWEGIAN RIDGEBACK  DRAGON EGGS  HERMIONE  NEWT SCAMANDER’S GUIDE TO TROLLS allowed to use magic at home. I’m going to have a lot of fun with Dudley this summer....”  A SECOND LOOK To provide the best possible reading experience for Harry Potter and the Sorcerer’s Stone, much of Jim Kay’s artwork has been animated. The following pages contain a selection of Jim Kay’s original illustrations, which will allow you to take a second look and enjoy each spread in greater detail. Should you want to explore an illustration, double tap the image and pinch to zoom and expand it. DIAGON ALLEY: PART I  DIAGON ALLEY: PART II  PLATFORM NINE AND THREE-QUARTERS ",
        "chunk_order_index": 16,
        "chunk_id": "chunk-54d972eb388598b771e45807ba44f0dd",
        "description": "The image depicts a bustling scene at a train station, likely Platform Nine and Three-Quarters from the Harry Potter series. A large, red steam locomotive is prominently featured on the right side of the image, emitting smoke and steam as it prepares to depart. The platform is crowded with people, some of whom are boarding the train while others are saying goodbye or waiting for their turn. Several owls are flying around, adding to the chaotic yet magical atmosphere. One owl is perched on the left side of the image, observing the scene. The background shows a brick wall and an archway, typical of a traditional British railway station. The overall mood is one of excitement and anticipation, as if everyone is embarking on a significant journey.",
        "segmentation": true
    },
    "image_6": {
        "image_id": 6,
        "image_path": "./fusion_research/fusion_dataset/novel/Harry Potter and the Sorcerers Stone Illustrated Edition (J. K. Rowling, Jim Kay (Illustrator)) (5)/images/image_6.jpg",
        "caption": [],
        "footnote": [],
        "context": "ABOUT THE Val Brathwaite, Andrew Buckingham at the City of London, Alison Caldwell, Clay Caldwell (my Harry!), Katherine Challis, Amelia Clark, Louise Clark, Mark Coales, Lynne and Duncan Cooper (and the pupils of Burford School, Oxfordshire), Tyler Craste, Alison Eldred, Isabel Ford, Howard GlansŁeld, Sarah Goodwin, Dr. David Goyder, Finley Hess, John Howe, Graham Johnson, Roza Jura, Clive Lundquist, Amy McKay (and the pupils of Corby Academy, Northamptonshire), Anthony Maddock, Patrick Ness, David Nichols, Oliver Stacey, J.K. Rowling and of course, my mum and dad. Jim Kay would like to thank the following people: ACKNOWLEDGMENTS  NORWEGIAN RIDGEBACK  DRAGON EGGS  HERMIONE home. I’m going to have a lot of fun with Dudley this summer....”  A SECOND LOOK To provide the best possible reading experience for Harry Potter and the Sorcerer’s Stone, much of Jim Kay’s artwork has been animated. The following pages contain a selection of Jim Kay’s original illustrations, which will allow you to take a second look and enjoy each spread in greater detail. Should you want to explore an illustration, double tap the image and pinch to zoom and expand it. DIAGON ALLEY: PART I  DIAGON ALLEY: PART II  PLATFORM NINE AND THREE-QUARTERS  NEWT SCAMANDER’S GUIDE TO TROLLS ",
        "chunk_order_index": 16,
        "chunk_id": "chunk-54d972eb388598b771e45807ba44f0dd",
        "description": "The image is a detailed illustration titled 'Newt Scamander’s Guide to Trolls'. It features various types of trolls, including a Forest Troll and a Mountain Troll. The Forest Troll is depicted in a standing position with a hunched posture, wearing a loincloth and holding a club. The Mountain Troll is shown in a side profile, showcasing its large size and rugged appearance with numerous warts and bumps on its skin. There are also close-up sketches of the trolls' heads and feet, highlighting their distinctive features such as large nostrils and thick, calloused soles. The illustration includes anatomical drawings of a troll skeleton, emphasizing the structure and proportions of the creature. The background contains text warnings and descriptions about the trolls, providing information on their behavior and characteristics. The overall style is reminiscent of a scientific or educational drawing, with precise details and annotations.",
        "segmentation": false
    },
    "image_7": {
        "image_id": 7,
        "image_path": "./fusion_research/fusion_dataset/novel/Harry Potter and the Sorcerers Stone Illustrated Edition (J. K. Rowling, Jim Kay (Illustrator)) (5)/images/image_7.jpg",
        "caption": [],
        "footnote": [],
        "context": "ABOUT THE AUTHOR Val Brathwaite, Andrew Buckingham at the City of London, Alison Caldwell, Clay Caldwell (my Harry!), Katherine Challis, Amelia Clark, Louise Clark, Mark Coales, Lynne and Duncan Cooper (and the pupils of Burford School, Oxfordshire), Tyler Craste, Alison Eldred, Isabel Ford, Howard GlansŁeld, Sarah Goodwin, Dr. David Goyder, Finley Hess, John Howe, Graham Johnson, Roza Jura, Clive Lundquist, Amy McKay (and the pupils of Corby Academy, Northamptonshire), Anthony Maddock, Patrick Ness, David Nichols, Oliver Stacey, J.K. Rowling and of course, my mum and dad. Jim Kay would like to thank the following people: ACKNOWLEDGMENTS  NORWEGIAN RIDGEBACK  DRAGON EGGS I’m going to have a lot of fun with Dudley this summer....”  A SECOND LOOK To provide the best possible reading experience for Harry Potter and the Sorcerer’s Stone, much of Jim Kay’s artwork has been animated. The following pages contain a selection of Jim Kay’s original illustrations, which will allow you to take a second look and enjoy each spread in greater detail. Should you want to explore an illustration, double tap the image and pinch to zoom and expand it. DIAGON ALLEY: PART I  DIAGON ALLEY: PART II  PLATFORM NINE AND THREE-QUARTERS  NEWT SCAMANDER’S GUIDE TO TROLLS  HERMIONE ",
        "chunk_order_index": 16,
        "chunk_id": "chunk-54d972eb388598b771e45807ba44f0dd",
        "description": "The image depicts a young woman standing in front of an old, ornate wooden door. She is dressed in a black robe with red and green trim, suggesting a wizard or witch costume. Her curly hair falls around her shoulders, and she holds a wand in her right hand, pointing it forward. In her left hand, she carries a glowing lantern that emits a soft light. The door behind her is large and made of dark wood, featuring intricate carvings and metal reinforcements. The overall atmosphere is mysterious and magical, evoking a sense of adventure and enchantment.",
        "segmentation": true
    },
    "image_8": {
        "image_id": 8,
        "image_path": "./fusion_research/fusion_dataset/novel/Harry Potter and the Sorcerers Stone Illustrated Edition (J. K. Rowling, Jim Kay (Illustrator)) (5)/images/image_8.jpg",
        "caption": [],
        "footnote": [],
        "context": "J.K. ROWLING ABOUT THE AUTHOR Val Brathwaite, Andrew Buckingham at the City of London, Alison Caldwell, Clay Caldwell (my Harry!), Katherine Challis, Amelia Clark, Louise Clark, Mark Coales, Lynne and Duncan Cooper (and the pupils of Burford School, Oxfordshire), Tyler Craste, Alison Eldred, Isabel Ford, Howard GlansŁeld, Sarah Goodwin, Dr. David Goyder, Finley Hess, John Howe, Graham Johnson, Roza Jura, Clive Lundquist, Amy McKay (and the pupils of Corby Academy, Northamptonshire), Anthony Maddock, Patrick Ness, David Nichols, Oliver Stacey, J.K. Rowling and of course, my mum and dad. Jim Kay would like to thank the following people: ACKNOWLEDGMENTS  NORWEGIAN RIDGEBACK to have a lot of fun with Dudley this summer....”  A SECOND LOOK To provide the best possible reading experience for Harry Potter and the Sorcerer’s Stone, much of Jim Kay’s artwork has been animated. The following pages contain a selection of Jim Kay’s original illustrations, which will allow you to take a second look and enjoy each spread in greater detail. Should you want to explore an illustration, double tap the image and pinch to zoom and expand it. DIAGON ALLEY: PART I  DIAGON ALLEY: PART II  PLATFORM NINE AND THREE-QUARTERS  NEWT SCAMANDER’S GUIDE TO TROLLS  HERMIONE  DRAGON EGGS ",
        "chunk_order_index": 16,
        "chunk_id": "chunk-54d972eb388598b771e45807ba44f0dd",
        "description": "The image is an illustration of various dragon eggs from the book 'Dragon-Breeding for Pleasure and Profit'. The eggs are depicted in a detailed and colorful manner, each labeled with the name of the dragon species they belong to. The eggs are arranged in three rows and four columns. The first row includes the Hungarian Horntail (dark gray), Ukrainian Ironbelly (turquoise with scales), and Antipodean Opal-Eye (light gray). The second row features the Swedish Short-Snout (white with pink spots), Peruvian Vipertooth (blue with cracks), Chinese Fireball (red with spines), and Hebridean Black (black with white spots). The third row shows the Romanian Longhorn (green with spots), Norwegian Ridgeback (black), and Common Welsh Green (brown with green spots). Each egg has a unique texture and color, reflecting the characteristics of its respective dragon species. The background is a parchment-like texture, adding to the vintage and magical feel of the illustration.",
        "segmentation": false
    },
    "image_9": {
        "image_id": 9,
        "image_path": "./fusion_research/fusion_dataset/novel/Harry Potter and the Sorcerers Stone Illustrated Edition (J. K. Rowling, Jim Kay (Illustrator)) (5)/images/image_9.jpg",
        "caption": [],
        "footnote": [],
        "context": "J.K. ROWLING is the ABOUT THE AUTHOR Val Brathwaite, Andrew Buckingham at the City of London, Alison Caldwell, Clay Caldwell (my Harry!), Katherine Challis, Amelia Clark, Louise Clark, Mark Coales, Lynne and Duncan Cooper (and the pupils of Burford School, Oxfordshire), Tyler Craste, Alison Eldred, Isabel Ford, Howard GlansŁeld, Sarah Goodwin, Dr. David Goyder, Finley Hess, John Howe, Graham Johnson, Roza Jura, Clive Lundquist, Amy McKay (and the pupils of Corby Academy, Northamptonshire), Anthony Maddock, Patrick Ness, David Nichols, Oliver Stacey, J.K. Rowling and of course, my mum and dad. Jim Kay would like to thank the following people: ACKNOWLEDGMENTS a lot of fun with Dudley this summer....”  A SECOND LOOK To provide the best possible reading experience for Harry Potter and the Sorcerer’s Stone, much of Jim Kay’s artwork has been animated. The following pages contain a selection of Jim Kay’s original illustrations, which will allow you to take a second look and enjoy each spread in greater detail. Should you want to explore an illustration, double tap the image and pinch to zoom and expand it. DIAGON ALLEY: PART I  DIAGON ALLEY: PART II  PLATFORM NINE AND THREE-QUARTERS  NEWT SCAMANDER’S GUIDE TO TROLLS  HERMIONE  DRAGON EGGS  NORWEGIAN RIDGEBACK ",
        "chunk_order_index": 16,
        "chunk_id": "chunk-54d972eb388598b771e45807ba44f0dd",
        "description": "The image depicts a detailed illustration of a Norwegian Ridgeback dragon. The dragon is shown in a close-up view, focusing on its head and upper body. Its scales are a mix of earthy tones, with shades of brown, beige, and hints of green. The dragon's eye is large and expressive, conveying a sense of intelligence and intensity. Its mouth is open, revealing sharp teeth and a long, forked tongue. The background shows a cityscape with buildings and chimneys, suggesting an urban environment. The dragon appears to be interacting with the city, possibly causing destruction or simply being present. The overall atmosphere is one of tension and awe, as the dragon's presence dominates the scene.",
        "segmentation": true
    },
    "image_10": {
        "image_id": 10,
        "image_path": "./fusion_research/fusion_dataset/novel/Harry Potter and the Sorcerers Stone Illustrated Edition (J. K. Rowling, Jim Kay (Illustrator)) (5)/images/image_10.jpg",
        "caption": [],
        "footnote": [],
        "context": "This digital edition Łrst published by Pottermore Limited in 2017 First published in print in Great Britain in 1997 by Bloomsbury Publishing Plc First published as illustrated edition October 2015 We are the home of worldwide digital publishing, entertainment and news for fans of J.K. Rowling’s Wizarding World. Visit www.pottermore.com, where your own Sorting Ceremony, exclusive new writing by J.K. Rowling and all the latest news and features from the Wizarding World awaits. Register with Pottermore and join us in unlocking the power of imagination. Pottermore is the digital heart of J.K. Rowling’s Wizarding World … from J.K. Rowling Potlermore Fire Harry Potter and the Order of the Phoenix Harry Potter and the Half-Blood Prince Harry Potter and the Deathly Hallows EBOOKS Harry Potter and the Cursed Child Parts One and Two Based on an original story by J.K. Rowling, John Tiŀany and Jack Thorne A play by Jack Thorne HOGWARTS LIBRARY BOOKS: Fantastic Beasts and Where to Find Them Quidditch Through the Ages The Tales of Beedle the Bard POTTERMORE PRESENTS: Short Stories from Hogwarts of Heroism, Hardship and Short Stories from Hogwarts of Power, Politics and Pesky Poltergeists Hogwarts: An Incomplete and Unreliable Guide Potlermore from J.K. Rowling ",
        "chunk_order_index": 16,
        "chunk_id": "chunk-54d972eb388598b771e45807ba44f0dd",
        "description": "The image depicts a close-up view of white feathers. The feathers are densely packed and appear soft and fluffy, with varying shades of white and light gray. The texture is fine and delicate, with individual feather strands visible. The overall appearance is one of softness and lightness, evoking a sense of calm and tranquility.",
        "segmentation": false
    }
}