{
    "chunk-6af6d5471c45dac92b433fd22aa6f6ff": [
        {
            "entity_name": "Wilbur (The Newborn Pig)",
            "entity_type": "ORGANIZATION",
            "description": "Wilbur is a white newborn piglet saved by Mr. Arable from an untimely death and given to his daughter Fern, who becomes attached to it and names it Wilbur. Fern takes care of Wilbur, feeding him and ensuring his comfort. Wilbur is moved from a box near the stove in the kitchen to a bigger box in the woodshed, and later to a small yard under an apple tree.",
            "source_entities": [
                "WILBUR",
                "THE NEWBORN PIG"
            ]
        },
        {
            "entity_name": "The School Bus (The Bus)",
            "entity_type": "ORGANIZATION",
            "description": "The School Bus is the mode of transportation for Fern and Avery to get to school, mentioned as honking from the road and the children running to catch it.",
            "source_entities": [
                "THE SCHOOL BUS",
                "THE BUS"
            ]
        }
    ],
    "chunk-af0922057792e2694b52ac7347267e32": [
        {
            "entity_name": "Mr. Zuckerman(Uncle Homer)",
            "entity_type": "PERSON",
            "description": "Mr. Zuckerman, also known as Uncle Homer, is the owner of the barn where Wilbur is kept after being sold, and he is married to Aunt Edith.",
            "source_entities": [
                "\"MR. ZUCKERMAN\"",
                "\"UNCLE HOMER\""
            ]
        }
    ],
    "chunk-7863557e56e0faf8efd1f9fac73b9514": [
        {
            "entity_name": "Goslings",
            "entity_type": "ORGANIZATION",
            "description": "The Goslings are the seven newly hatched offspring of the goose and gander, representing a group. They are a significant occurrence in the story, marking the result of the goose's hard work and patience.",
            "source_entities": [
                "GOSLINGS",
                "GOSLINGS"
            ]
        }
    ],
    "chunk-de679bdf72b2d074303f713bbe79e1f4": [
        {
            "entity_name": "Mr. Arable (John Arable)",
            "entity_type": "PERSON",
            "description": "Fern's father, involved in the farm's activities and conversations about the happenings on the farm, including the hatching of the goslings and the conspiracy to kill Wilbur.",
            "source_entities": [
                "JOHN ARABLE",
                "MR. ARABLE"
            ]
        }
    ],
    "chunk-8283e172a34b705e2bf78188f93cb933": [
        {
            "entity_name": "Wilbur",
            "entity_type": "PERSON",
            "description": "Wilbur is a character who tries to spin a web using a string but fails due to lacking the necessary equipment, showing a persistent but ultimately unsuccessful effort. He is fond of by Charlotte and Fern, and his smelly pen and stale food attract flies that Charlotte needs.",
            "source_entities": [
                "WILBUR",
                "VILBUR"
            ]
        }
    ]
}