{
  "chunk-87480d1c7e590aec557020c796a0e9c3": {
    "tokens": 1200,
    "content": "NEW YORK, TUESDAY, APRIL 12, 2022  \n\n![](images/image_1.jpg)  \nA funeral on Monday in Irpin, Ukraine. President Vladimir V. Putin of Russia is expected to order a large-scale assault in the east.  \n\n# U.S. Debates Using Hague Court Ballets, Bars and Bomb Scares: To Investigate Russian Atrocities Lviv Learns to Live With War  \n\n# By CHARLIE SAVAGE  \n\n# By JANE ARRAF  \n\nWASHINGTON — The Biden administration is vigorously debating  how  much  the  United States can or should assist an investigation into Russian atrocities in Ukraine by the International Criminal Court in The Hague, according to officials familiar with internal deliberations.  \n\nThe Biden team strongly wants to see President Vladimir V. Putin of Russia and others in his military chain of command held to account. And many are said to consider the court — which was created by a global treaty two decades ago as a venue for prosecuting war crimes, crimes against humanity and genocide — the body most capable of achieving that. But laws from 1999 and 2002, enacted by a Congress wary that the court might investigate Americans, limit the government’s ability to provide support. And the United States has long objected to any exercise of jurisdiction by the court over citizens of countries that are not part of the treaty that created it — like the United States, but also Russia.  \n\nThe internal debate, described by senior administration officials and others familiar with the matter on the condition of anonymity, has been partly shaped by a previously undisclosed 2010 memo by the Justice Department’s Office of Legal Counsel. Obtained by The New York Times, the memo interprets the scope and limits of permissible  cooperation  with  the court.  \n\nThe discussions have also been marked by Pentagon opposition to softening the U.S. stance, even as congressional Republicans, long Continued on Page A11  \n\nLVIV, Ukraine — When war came to Ukraine in February, Helen Polishchuk made some adjustments in the six-story bar she manages in central Lviv. Th  \n\nHouse in Lviv’s DISPATCH historic central square stayed open, but served coffee and hot food instead of alcoholic drinks. They turned off the rock music. And as displaced Ukrainians began pouring into the city from places devastated by Russian attacks hundreds of miles away, she had instructions for the wait staff. “When guests leave the  \n\nrestaurant we normally say, ‘Have a nice day,’” she said. Instead she told them they could say something else, like “Glory to Ukraine,” or “We wish you blue skies.”  \n\n“Because to say ‘have a nice day’ in this period is stupid,” said Ms. Polishchuk, 33. Before the Russian invasion of Ukraine at the end of February, Lviv, a historic city just 40 miles from Poland, was a popular European tourist destination, with 2.5 million visitors a year and the biggest jazz festival in Eastern Europe.  \n\nNow, instead of tourists, there are displaced Ukrainians fleeing the war-torn east of the country. Lviv and its residents are learning to live with what most now believe will be many months of conflict, if not years.  \n\nSeveral Russian airstrikes have targeted infrastructure here, including a rocket attack on a military training base last month that killed more than 30 Continued on Page A13  \n\n# A TALK WITH PUTIN DEEPENS THE FEAR OF WORSE ATTACKS  \n\nLeader Dismisses Brutality as He Targets Donbas, Austrian Chancellor Says  \n\n# By STEVEN ERLANGER and ANTON TROIANOVSKI  \n\nAustria’s  chancellor  visited President Vladimir V. Putin of Russia on Monday — the first Western leader to see him in person since the Ukraine invasion — and said he came away feeling not only  pessimistic  about  peace prospects but fearing that Mr. Putin intended to drastically intensify the brutality of the war. Describing Mr. Putin as dismissive of atrocities in Ukraine, the visiting chancellor, Karl Nehammer, said it was clear that Russian forces were mobilizing for a largescale assault in eastern Ukraine’s Donbas region, the next phase of a war now in its seventh week.  \n\nMany  commentators  in  the West had criticized the Austrian chancellor — his country is a member of the European Union but not of NATO — for having visited Moscow at all, seemingly playing into Mr. Putin’s narrative that American-led efforts to isolate Russia would necessarily end in failure.  \n\nMr. Nehammer told reporters afterward that he had tried to confront Mr. Putin with the horrors of war and of the war crimes that Russian troops are accused of  \n\n“The battle being threatened cannot be underestimated in its violence,” Mr. Nehammer said in a news  conference  after  the  75- minute meeting at Mr. Putin’s residence outside Moscow that the visitor described as blunt and direct.  \n\nThe Austrian chancellor said he had told the Russian president that as long as people were dying in Ukraine, “the sanctions against Russia will stay in place and will be toughened further.”  \n\nThe Kremlin, playing down the meeting’s significance in a terse statement, said only that it was “not long by the standards of recent times.”  \n\nEven as Mr. Nehammer was visiting,  Russian  forces  were bombarding Ukrainian cities and towns, and President Volodymyr Zelensky of Ukraine said “tens of thousands are dead” in Mariupol, the besieged southern city that has been the scene of the most intense destruction of the war.  \n\nAnd Mr. Putin, despite Russia’s military blunders in the war, and for all the Western efforts to ostracize him, still appeared in control of the crisis. He has severely repressed any dissent and benefited from widespread domestic support, continuing revenues from oil and gas sales to Europe,",
    "chunk_order_index": 0,
    "full_doc_id": "doc-50c5313834939f99c698d2292b8ec995"
  },
  "chunk-0b9a3950a1ebe234a70b83fca0d08abc": {
    "tokens": 1200,
    "content": "myr Zelensky of Ukraine said “tens of thousands are dead” in Mariupol, the besieged southern city that has been the scene of the most intense destruction of the war.  \n\nAnd Mr. Putin, despite Russia’s military blunders in the war, and for all the Western efforts to ostracize him, still appeared in control of the crisis. He has severely repressed any dissent and benefited from widespread domestic support, continuing revenues from oil and gas sales to Europe, the implicit backing of China and the reChancellor Karl Nehammer of Austria met with Mr. Putin.  \n\n![](images/image_2.jpg)  \n\nhaving committed in the Kyiv suburb of Bucha and elsewhere. He said he also had told Mr. Putin about  the  destroyed  Russian tanks he saw on a recent visit to Ukraine, to make clear the enormous loss of life that Russia was suffering.  \n\nMr. Nehammer said that Mr. Putin had brushed aside the accusations of war crimes as having been staged by Ukraine. Continued on Page A12  \n\n# Twitter on Edge As Musk Plans His Next Move  \n\n# By MIKE ISAAC and KATE CONGER  \n\nSAN FRANCISCO — Bright and early on Monday, Elon Musk sent the government a surprising new document.  \n\nIn it, Mr. Musk, the world’s wealthiest man, laid out his possible intentions toward Twitter, in which he has amassed a 9.2 percent stake, underlining how drastically his position had changed from a week ago.  \n\nMr. Musk could, if he chose, buy more shares of Twitter and increase his ownership of the company, according to the document, which was filed with the Securities and Exchange Commission. He could freely express his views about Twitter on social media or other  channels,  the  document noted. And he reserved the right to “change his plans at any time, as he deems appropriate.”  \n\nIt was a promise — or perhaps it was a threat. Either way, the filing encapsulated the treacherous situation that Twitter now finds itself in. Mr. Musk, 50, Twitter’s largest shareholder and one of its highestprofile users, could very well use the social media platform against itself and even buy enough shares to take over the company. Continued on Page A17  \n\n![](images/image_3.jpg)  \nNorma Mercado tracks over 750 children. The new money is “like winning the lottery,” she said.  \n\n# An ‘Angel’ for Homeless Students in Rural Texas  \n\n# By JASON DePARLE  \n\nBASTROP, Texas — By the time she reached school on a recent Monday morning, Norma Mercado  had  already  driven  four homeless children to class, one from 30 miles away, having spent the weekend taking a group of homeless students on a college tour and two homeless siblings to buy clothes.  \n\n# Rise in Federal Funding Expands Services  \n\nInside her office, a student was waiting, boiling with rage. Louisa Perez’s ex-best friend was insulting her on Facebook, and Ms. Perez, 17, who until recently had been living in a car, considered the betrayal the latest in a life of violated trust. “That’s why I feel like I can’t be close to nobody — because this always happens!” she sobbed. Friends were urging her to fight.  \n\n“Oh, my goodness,” Ms. Mercado said. “Sounds like you’re super mad.”  \n\nWith a voice as placid as the room was disturbed, Ms. Mercado Continued on Page A18  \n\n# Fewer Workers Plan to Return, Hurting Manhattan’s Comeback  \n\n# By DANA RUBINSTEIN and NICOLE HONG  \n\nPwC, a global consulting firm with its American headquarters in New York City, has told 40,000 of its United States employees that they can work remotely forever. Quinn Emanuel Urquhart & Sullivan, a white-shoe law firm with about 300 lawyers in New York, is allowing its staff to live anywhere in the country.  \n\nVerizon,  which  is  headquartered in New York, has started permitting hybrid employees to come to the office as many, or as few, days a week as they want. The list of companies permanently changing the way they work keeps growing longer, making the five-day-a-week trek into Manhattan an increasingly fading corporate practice — with enormous  consequences  for  New York, whose economy is especially  dependent  on  filling  its forests of office towers.  \n\nThe shift has raised alarms for Mayor  Eric  Adams  and  Gov. Kathy Hochul, who have stepped up their urgent messaging that the city’s roughly 1.3 million private-sector office workers need to return to their desks.  \n\n“You can’t stay home in your pajamas all day,” Mr. Adams has said. But Ms. Hochul and Mr. Adams may well be shouting into the wind, as society changes around Skillshare, based in New York, is letting Nina Anziska do her job out of Los Angeles.  \n\n![](images/image_4.jpg)  \n\nThey have valid reasons for concern. With more companies settling into a permanent period of hybrid work, the average New York City office worker is predicted to reduce annual spending near the office by \\$6,730 from a prepandemic  total  of  around $\\bar{\\mathbb{S}}13\\bar{,}700,$ the largest drop of any major city, according to research from economists at Instituto Tecnológico Autónomo de México, Continued on Page A20  \n\n![](images/image_5.jpg)  \n\n# INTERNATIONAL A4-13  \n\n# Recall in Mexico Fails  \n\nThe threshold for the referendum to be binding was not met, and President Andrés Manuel López Obrador received overwhelming support. PAGE A6  \n\n![](images/image_6.jpg)  \n\n# ARTS C1-6  \n\nA Hilariously Bad Boss The comedian Janel",
    "chunk_order_index": 1,
    "full_doc_id": "doc-50c5313834939f99c698d2292b8ec995"
  },
  "chunk-3a383f0e5a2ae0e30de8336958c05f75": {
    "tokens": 446,
    "content": "major city, according to research from economists at Instituto Tecnológico Autónomo de México, Continued on Page A20  \n\n![](images/image_5.jpg)  \n\n# INTERNATIONAL A4-13  \n\n# Recall in Mexico Fails  \n\nThe threshold for the referendum to be binding was not met, and President Andrés Manuel López Obrador received overwhelming support. PAGE A6  \n\n![](images/image_6.jpg)  \n\n# ARTS C1-6  \n\nA Hilariously Bad Boss The comedian Janelle James talks about her breakout acting role as a terrible school principal in the ABC sitcom “Abbott Elementary.” PAGE C1  \n\n![](images/image_7.jpg)  \n\n# BUSINESS B1-5  \n\nA Market Mystery Who was behind the surge of trading in wheat futures? Some say it was Reddit users who mobbed an E.T.F.  PAGE B1 Echoing War Disinformation China’s officials and state media are increasingly parroting Russian propaganda on the war in Ukraine.  PAGE B1  \n\n# NATIONAL A14-21  \n\nToo Far Right in Arizona? A primary challenge may show whether Republican voters could turn toward more traditional conservatives. PAGE A15 Closer Look at the Permafrost A project to monitor the thawing Arctic ground aims to assess its planet-warming emissions. PAGE A16 SCIENCE TIMES D1-8 Starling’s Role as Villain Recast Researchers debunked a yarn about the common bird’s connections to Shakespeare as well as other myths.  PAGE D1 Where Penguins Could Chill Warming on one side of the Antarctic Peninsula threatens Adélie populations. But the other may be a refuge. PAGE D8 OBITUARIES B11 An Avatar of Punk Style Swathed in rubber and glowering from spiked heels, Jordan Mooney, who died at 66, was a fearsome figurehead for disaffected English teenagers.  \n\n# OPINION A22-23  \n\n# Michelle Goldberg  \n\nSPORTS B6-9 A Mentalist’s Physical Feat Oz Pearlman ran 19 loops of Central Park — 116 miles — in less than 19 hours to set a record for loops. “It’s home ground,” he said.PAGES B6-7",
    "chunk_order_index": 2,
    "full_doc_id": "doc-50c5313834939f99c698d2292b8ec995"
  }
}