{
    "chunk-1598dfd309909b6a83879a3961630d7e": [
        {
            "entity_name": "Donbas",
            "entity_type": "GEO",
            "description": "The Donbas area in eastern Ukraine is where Russia is positioning troops for an intensified assault, indicating a focus on this region for further military actions.",
            "source_entities": [
                "Donbas",
                "DONBAS"
            ]
        },
        {
            "entity_name": "Mariupol",
            "entity_type": "GEO",
            "description": "Mariupol is a port city in Ukraine under brutal siege as part of Russia's military strategy, highlighting its significance in the conflict.",
            "source_entities": [
                "MARIUPOL",
                "Mariupol"
            ]
        },
        {
            "entity_name": "Kharkiv",
            "entity_type": "GEO",
            "description": "Kharkiv is a city in Ukraine near the Russian border that has suffered unrelenting bombardment, leaving parts of the city of 1.4 million unrecognizable.",
            "source_entities": [
                "KHARKIV",
                "Kharkiv"
            ]
        },
        {
            "entity_name": "Bucha",
            "entity_type": "GEO",
            "description": "Bucha is a location in Ukraine visited by President Volodymyr Zelensky, indicating its significance in the conflict.",
            "source_entities": [
                "BUCHA",
                "Bucha"
            ]
        },
        {
            "entity_name": "Putin",
            "entity_type": "PERSON",
            "description": "Mr. Putin is the leader of Russia, responsible for the invasion of Ukraine and the ongoing war, and is portrayed as a hero in a documentary studied in China.",
            "source_entities": [
                "PUTIN",
                "Putin"
            ]
        },
        {
            "entity_name": "China (BEIJING)",
            "entity_type": "GEO",
            "description": "China is casting itself as a principled onlooker of the war, pushing a narrative that Russia is a victim, and Beijing is where officials are meeting to study a documentary that portrays Putin as a hero.",
            "source_entities": [
                "BEIJING",
                "CHINA"
            ]
        },
        {
            "entity_name": "National Security and Defense Council of Ukraine",
            "entity_type": "ORGANIZATION",
            "description": "The council is an organization in Ukraine where Oleksiy Danilov serves as secretary, commenting on the war and Russia's intentions.",
            "source_entities": [
                "NATIONAL SECURITY AND DEFENSE COUNCIL OF UKRAINE",
                "National Security and Defense Council of Ukraine"
            ]
        },
        {
            "entity_name": "Senate Deal",
            "entity_type": "EVENT",
            "description": "Senate Deal is an event where negotiators reached an agreement on a $10 billion package for Covid funds, which scraps spending for the global vaccine effort.",
            "source_entities": [
                "SENATE DEAL",
                "Senate Deal"
            ]
        },
        {
            "entity_name": "Sentencing",
            "entity_type": "EVENT",
            "description": "Sentencing is the event where jurors will decide the fate of the gunman in the Parkland shooting, and Jury Picks is the event where jurors begin the process of deciding the sentencing for the Parkland gunman.",
            "source_entities": [
                "SENTENCING",
                "Sentencing"
            ]
        }
    ]
}