{
    "image_1": [
        {
            "merged_entity_name": "Wilbur",
            "entity_type": "PERSON",
            "description": "Wilbur, also known as the Zuckerman pig, is a pig who is being transported to a judging event and is the center of attention due to a miraculous event involving his web. He is described as having a silky white coat, curly tail, and a kind and radiant expression. In the image, Wilbur is shown wearing a short-sleeved shirt and pants, holding a bucket, and is pouring water on the grass area.",
            "source_image_entities": [
                "MAN"
            ],
            "source_text_entities": [
                "WILBUR (THE ZUCKERMAN PIG)"
            ]
        },
        {
            "merged_entity_name": "Bucket",
            "entity_type": "OBJECT",
            "description": "The black bucket is an object being held by Wilbur in the image, and it is also mentioned in the text as the container from which Lurvy dashes water on Wilbur to revive him after he fainted.",
            "source_image_entities": [
                "BUCKET"
            ],
            "source_text_entities": [
                "THE CRATE"
            ]
        },
        {
            "merged_entity_name": "Grass Area",
            "entity_type": "GEO",
            "description": "The grass area is where Wilbur is pouring water from the bucket as seen in the image, and it is also the location where the preparations for the fair are taking place, including the loading of Wilbur into the truck as described in the text.",
            "source_image_entities": [
                "GRASS"
            ],
            "source_text_entities": [
                "BARNYARD"
            ]
        }
    ],
    "image_2": [
        {
            "merged_entity_name": "Wilbur (the Zuckerman Pig)",
            "entity_type": "PERSON",
            "description": "Wilbur is a pig who is being transported to a judging event and is the center of attention due to a miraculous event involving his web. He is also known as the Zuckerman pig, famous for the miraculous writing on Charlotte's web in Zuckerman's barn. Wilbur is displayed prominently in the image as a large, bold black letter 'W', with a plain white background that contrasts with him.",
            "source_image_entities": [
                "W",
                "BACKGROUND"
            ],
            "source_text_entities": [
                "WILBUR (THE ZUCKERMAN PIG)"
            ]
        },
        {
            "merged_entity_name": "Charlotte A. Cavatica",
            "entity_type": "PERSON",
            "description": "A large grey spider who becomes a dear friend to Wilbur, a little pig, and saves his life with her clever plan. She is also known as Charlotte and is part of the story where she crouchs and makes herself as small as possible in the knothole, so Avery wouldn't see her.",
            "source_image_entities": [],
            "source_text_entities": [
                "CHARLOTTE A. CAVATICA"
            ]
        },
        {
            "merged_entity_name": "Templeton (the Rat)",
            "entity_type": "PERSON",
            "description": "Templeton, also known as the Rat, is a character who moves indoors for the winter and has a relationship with Wilbur, growing big and fat due to overeating. He is advised by the old sheep to eat less for a longer life. In the story, Avery's foot touched Templeton under the straw.",
            "source_image_entities": [],
            "source_text_entities": [
                "TEMPLETON (THE RAT)"
            ]
        },
        {
            "merged_entity_name": "The Big Truck",
            "entity_type": "GEO",
            "description": "The big truck is the vehicle used to transport Wilbur to the fair, driven by Mr. Arable. It is mentioned in the context where Mr. Arable dashed to the driver's seat and pulled on the emergency brake, stopping the truck which had started to roll downhill.",
            "source_image_entities": [],
            "source_text_entities": [
                "THE BIG TRUCK"
            ]
        },
        {
            "merged_entity_name": "The Crate",
            "entity_type": "GEO",
            "description": "The crate is a physical location where Templeton and Charlotte hide, and it is part of Wilbur's transportation to the fair. In the story, the men grabbed the pig and pushed him headfirst toward the crate, and with a final heave they jammed him into the crate.",
            "source_image_entities": [],
            "source_text_entities": [
                "THE CRATE"
            ]
        },
        {
            "merged_entity_name": "The Fair",
            "entity_type": "EVENT",
            "description": "The fair is an event where Wilbur is being taken, and it is described as a place with abundant food leftovers. The story describes the fair as an event with music, the Ferris wheel turning in the sky, the smell of dust from the race track, and the sound of an announcement over the loudspeaker.",
            "source_image_entities": [],
            "source_text_entities": [
                "THE FAIR"
            ]
        }
    ],
    "image_3": "[\n    {\n        \"merged_entity_name\": \"Ferris Wheel\",\n        \"entity_type\": \"EVENT\",\n        \"description\": \"The Ferris wheel is a notable attraction at the fair, symbolizing the excitement and activities available, where Fern rides with Henry Fussy. It is a large Ferris wheel with multiple gondolas, some occupied by people, providing a panoramic view of the fairgrounds.\",\n        \"source_image_entities\": [\"FERRIS WHEEL\"],\n        \"source_text_entities\": [\"\\\"THE FERRIS WHEEL\\\"\", \"\\\"THE FERRIS WHEEL\\\"\"]\n    },\n    {\n        \"merged_entity_name\": \"Fairgrounds\",\n        \"entity_type\": \"GEO\",\n        \"description\": \"The Fair Grounds is the location where the fair takes place, featuring various attractions and activities, including the American flag flying on a pole near the game booth, symbolizing the location. It is the setting for the events of the story, including the pigpen and various attractions.\",\n        \"source_image_entities\": [\"FAIRGROUND\"],\n        \"source_text_entities\": [\"\\\"FAIR GROUNDS\\\"\", \"\\\"FAIR GROUNDS\\\"\"]\n    },\n    {\n        \"merged_entity_name\": \"Game Booth\",\n        \"entity_type\": \"ORGANIZATION\",\n        \"description\": \"A booth where people play games to win prizes, manned by an attendant and attracting several visitors, including the clown making balloon animals for the children, engaging them in a fun activity.\",\n        \"source_image_entities\": [\"GAME BOOTH\"],\n        \"source_text_entities\": []\n    },\n    {\n        \"merged_entity_name\": \"Balloon Animals\",\n        \"entity_type\": \"OBJECT\",\n        \"description\": \"Colorful balloon animals being made by the clown, attracting the attention of children, as part of the activities at the fair.\",\n        \"source_image_entities\": [\"BALLOON ANIMALS\"],\n        \"source_text_entities\": []\n    },\n    {\n        \"merged_entity_name\": \"American Flag\",\n        \"entity_type\": \"GEO\",\n        \"description\": \"An American flag flying on a pole near the game booth, symbolizing the location, indicating the event's setting in the United States.\",\n        \"source_image_entities\": [\"AMERICAN FLAG\"],\n        \"source_text_entities\": []\n    },\n    {\n        \"merged_entity_name\": \"Children\",\n        \"entity_type\": \"UNKNOWN\",\n        \"description\": \"The clown is making balloon animals for the children, engaging them in a fun activity, as part of the fair's attractions.\",\n        \"source_image_entities\": [\"CHILDREN\"],\n        \"source_text_entities\": []\n    },\n    {\n        \"merged_entity_name\": \"Visitors\",\n        \"entity_type\": \"UNKNOWN\",\n        \"description\": \"The game booth is attracting visitors who are playing games and winning prizes, contributing to the lively atmosphere of the fair.\",\n        \"source_image_entities\": [\"VISITORS\"],\n        \"source_text_entities\": []\n    }\n]",
    "image_4": [
        {
            "merged_entity_name": "Wilbur (the Zuckerman Pig)",
            "entity_type": "ANIMAL",
            "description": "Wilbur, also known as the Zuckerman pig, is a large, shaggy pig with a prominent snout and small ears, lying down on the grass in his new pigpen at the fair. He is the center of attention due to a miraculous event involving his web and is famous for the miraculous writing on Charlotte's web in Zuckerman's barn.",
            "source_image_entities": [
                "PIG"
            ],
            "source_text_entities": [
                "\"WILBUR (THE ZUCKERMAN PIG)\""
            ]
        },
        {
            "merged_entity_name": "Charlotte A. Cavatica",
            "entity_type": "ANIMAL",
            "description": "Charlotte A. Cavatica, also known as Charlotte, is a large grey spider who becomes a dear friend to Wilbur, a little pig, and saves his life with her clever plan. She hangs from a thread above the pig's head and later climbs a post to the underside of the roof in Wilbur's new pigpen.",
            "source_image_entities": [
                "SPIDER"
            ],
            "source_text_entities": [
                "\"CHARLOTTE A. CAVATICA\""
            ]
        }
    ],
    "image_5": [
        {
            "merged_entity_name": "BOTTLE",
            "entity_type": "OBJECT",
            "description": "A discarded bottle lying on the ground, partially covered by grass, with a partially visible label that reads 'HUMBLE', which is also the last word Charlotte writes in her web.",
            "source_image_entities": [
                "BOTTLE"
            ],
            "source_text_entities": [
                "HUMBLE"
            ]
        },
        {
            "merged_entity_name": "GRASS",
            "entity_type": "GEO",
            "description": "Green grass surrounding the bottle, partially covering it, and also the environment where Wilbur, the Zuckerman pig, is kept in the Pigpen.",
            "source_image_entities": [
                "GRASS"
            ],
            "source_text_entities": [
                "THE PIGPEN"
            ]
        }
    ],
    "image_6": [
        {
            "merged_entity_name": "Charlotte A. Cavatica",
            "entity_type": "PERSON",
            "description": "A large grey spider who becomes a dear friend to Wilbur, a little pig, and saves his life with her clever plan. She is also known as Charlotte and is depicted in the image as a beaver with wet fur, peeking out from behind a piece of wood, which is symbolically associated with her web.",
            "source_image_entities": [
                "BEAVER",
                "WOOD"
            ],
            "source_text_entities": [
                "CHARLOTTE A. CAVATICA"
            ]
        },
        {
            "merged_entity_name": "Wilbur (The Zuckerman Pig)",
            "entity_type": "PERSON",
            "description": "Wilbur is a pig who is being transported to a judging event and is the center of attention due to a miraculous event involving his web. He is also known as the Zuckerman pig, famous for the miraculous writing on Charlotte's web in Zuckerman's barn.",
            "source_image_entities": [],
            "source_text_entities": [
                "WILBUR (THE ZUCKERMAN PIG)"
            ]
        },
        {
            "merged_entity_name": "Templeton (The Rat)",
            "entity_type": "PERSON",
            "description": "Templeton, also known as the Rat, is a character who moves indoors for the winter and has a relationship with Wilbur, growing big and fat due to overeating. He is advised by the old sheep to eat less for a longer life.",
            "source_image_entities": [],
            "source_text_entities": [
                "TEMPLETON (THE RAT)"
            ]
        },
        {
            "merged_entity_name": "Fern",
            "entity_type": "PERSON",
            "description": "\"Fern is a child who visits the pigpen and later rides the Ferris wheel with her friend Henry Fussy. She is part of the Arables family and enjoys her time at the Fair.\"",
            "source_image_entities": [],
            "source_text_entities": [
                "FERN"
            ]
        },
        {
            "merged_entity_name": "Avery",
            "entity_type": "PERSON",
            "description": "\"Avery is a child who visits the pigpen with a balloon tied to his ear and later rests under a blanket made from an Indian blanket. He is another character from the Arables family, who is already in bed and asleep.\"",
            "source_image_entities": [],
            "source_text_entities": [
                "AVERY"
            ]
        },
        {
            "merged_entity_name": "Charlotte's Egg Sac",
            "entity_type": "GEO",
            "description": "Charlotte's Egg Sac is an important object in the narrative, symbolizing her 'great work' and containing 514 eggs. It is described as strong, made of the toughest material, and waterproof, ensuring the eggs inside will be warm and dry. Wilbur affectionately refers to it as the 'peachy little sac'.",
            "source_image_entities": [],
            "source_text_entities": [
                "CHARLOTTE'S EGG SAC (EGG SAC, PEACHY LITTLE SAC)"
            ]
        },
        {
            "merged_entity_name": "Fair Grounds",
            "entity_type": "GEO",
            "description": "\"Fair Grounds is the location where the events of the story are taking place, including the pigpen and various attractions. It is a geographical location where Wilbur's pen is located and where events related to the fair are taking place.\"",
            "source_image_entities": [],
            "source_text_entities": [
                "FAIR GROUNDS"
            ]
        }
    ],
    "image_7": [
        {
            "merged_entity_name": "Charlotte's Egg Sac",
            "entity_type": "GEO",
            "description": "Charlotte's Egg Sac, also known as the 'peachy little sac', is an important object in the narrative symbolizing Charlotte's 'great work' and containing 514 eggs. It is described as strong, made of the toughest material, and waterproof, ensuring the eggs inside will be warm and dry.",
            "source_image_entities": [
                "N"
            ],
            "source_text_entities": [
                "CHARLOTTE'S EGG SAC (EGG SAC, PEACHY LITTLE SAC)"
            ]
        }
    ],
    "image_8": [
        {
            "merged_entity_name": "Charlotte A. Cavatica",
            "entity_type": "PERSON",
            "description": "Charlotte A. Cavatica, also known as Charlotte, is a large grey spider who becomes a dear friend to Wilbur, a little pig, and saves his life with her clever plan. She is the creator of the web and the egg sac, which she refers to as her 'great work' or 'magnum opus', containing 514 eggs.",
            "source_image_entities": [
                "SPIDER"
            ],
            "source_text_entities": [
                "CHARLOTTE A. CAVATICA"
            ]
        },
        {
            "merged_entity_name": "Web Ball",
            "entity_type": "OBJECT",
            "description": "The Web Ball, also known as Charlotte's web, is a large, spherical mass of interwoven web threads created by Charlotte A. Cavatica. It serves as the foundation for her structure and is the central object in the narrative where she writes words to save Wilbur. The web is admired by visitors for its beauty, especially with the dew on it, and plays a crucial role in the events at the fairgrounds.",
            "source_image_entities": [
                "WEB BALL"
            ],
            "source_text_entities": [
                "WEB"
            ]
        },
        {
            "merged_entity_name": "Charlotte's Egg Sac",
            "entity_type": "OBJECT",
            "description": "Charlotte's Egg Sac, also referred to as the 'peachy little sac', is an important object in the narrative symbolizing Charlotte's 'great work' and contains 514 eggs. It is described as strong, made of the toughest material, and waterproof, ensuring the eggs inside will be warm and dry.",
            "source_image_entities": [
                "WEB BALL"
            ],
            "source_text_entities": [
                "CHARLOTTE'S EGG SAC (EGG SAC, PEACHY LITTLE SAC)"
            ]
        }
    ],
    "image_9": [
        {
            "merged_entity_name": "RAT (TEMPLETON)",
            "entity_type": "ANIMAL",
            "description": "Templeton, also known as the Rat, is a character who moves indoors for the winter and has a relationship with Wilbur, growing big and fat due to overeating. He is advised by the old sheep to eat less for a longer life. In the image, the rat is lying down with its body stretched out, tail curved, and head resting near a wooden structure.",
            "source_image_entities": [
                "RAT"
            ],
            "source_text_entities": [
                "TEMPLETON (THE RAT)"
            ]
        },
        {
            "merged_entity_name": "WOODEN STRUCTURE",
            "entity_type": "OBJECT",
            "description": "A vertical wooden structure next to which the rat, Templeton, is resting. It is part of the setting in the narrative where various interactions take place.",
            "source_image_entities": [
                "WOODEN STRUCTURE"
            ],
            "source_text_entities": []
        },
        {
            "merged_entity_name": "CHARLOTTE'S EGG SAC",
            "entity_type": "OBJECT",
            "description": "Charlotte's Egg Sac is an important object in the narrative, symbolizing her 'great work' and containing 514 eggs. It is described as strong, made of the toughest material, and waterproof, ensuring the eggs inside will be warm and dry. Wilbur affectionately refers to it as the 'peachy little sac'.",
            "source_image_entities": [],
            "source_text_entities": [
                "CHARLOTTE'S EGG SAC (EGG SAC, PEACHY LITTLE SAC)"
            ]
        }
    ],
    "image_10": [
        {
            "merged_entity_name": "Wilbur (The Zuckerman Pig)",
            "entity_type": "PERSON",
            "description": "Wilbur is a pig who is being transported to a judging event and is the center of attention due to a miraculous event involving his web. He is also known as the Zuckerman pig, famous for the miraculous writing on Charlotte's web in Zuckerman's barn. Wilbur is looked upon lovingly by the crowd and is described as humble and grateful. He is bathed with buttermilk, making his skin smooth and white, and is admired by everyone who visits the pigpen.",
            "source_image_entities": [
                "BOY DOING HANDSTAND"
            ],
            "source_text_entities": [
                "WILBUR (THE ZUCKERMAN PIG)"
            ]
        },
        {
            "merged_entity_name": "Charlotte A. Cavatica",
            "entity_type": "PERSON",
            "description": "A large grey spider who becomes a dear friend to Wilbur, a little pig, and saves his life with her clever plan. She is also known as Charlotte. Charlotte crouched unseen, her front legs encircling her egg sac, having played a crucial role in saving Wilbur's life and feeling peaceful and content.",
            "source_image_entities": [],
            "source_text_entities": [
                "CHARLOTTE A. CAVATICA"
            ]
        },
        {
            "merged_entity_name": "Templeton (The Rat)",
            "entity_type": "PERSON",
            "description": "Templeton, also known as the Rat, is a character who moves indoors for the winter and has a relationship with Wilbur, growing big and fat due to overeating. He is advised by the old sheep to eat less for a longer life. Templeton, asleep in the straw, awoke and decided to go along with Wilbur when he saw the men shoving Wilbur into the crate.",
            "source_image_entities": [],
            "source_text_entities": [
                "TEMPLETON (THE RAT)"
            ]
        },
        {
            "merged_entity_name": "Crowd at the Fair Grounds",
            "entity_type": "ORGANIZATION",
            "description": "A group of people watching the interactions at the fairgrounds, some are smiling and others are observing. The crowd represents the group of people attending the event where Wilbur is presented and judging takes place. They gather to watch the buttermilk bathing of Wilbur and admire his cleanliness and humility.",
            "source_image_entities": [
                "CROWD"
            ],
            "source_text_entities": [
                "THE CROWD"
            ]
        },
        {
            "merged_entity_name": "Loud Speaker at the Fair Grounds",
            "entity_type": "TECHNOLOGY",
            "description": "A loudspeaker mounted on a pole, possibly used for announcements. The loud speaker is used to announce events and information to the crowd at the judging event, such as calling for Mr. Homer Zuckerman to bring his famous pig to the judges' booth.",
            "source_image_entities": [
                "LOUDSPEAKER"
            ],
            "source_text_entities": [
                "THE LOUD SPEAKER"
            ]
        },
        {
            "merged_entity_name": "Fair Grounds",
            "entity_type": "GEO",
            "description": "The Fair Grounds is a geographical location where Wilbur's pen is located and where events related to the fair are taking place. It includes Wilbur's pen, the judges' booth, and the grandstand, serving as the central location for the events in the story.",
            "source_image_entities": [
                "TENT"
            ],
            "source_text_entities": [
                "FAIR GROUNDS"
            ]
        }
    ],
    "image_11": [
        {
            "merged_entity_name": "WHITE BACKGROUND",
            "entity_type": "GEO",
            "description": "The background of the image is a plain white surface, which is consistent with the description of the fairgrounds and other locations at the event where Wilbur's story unfolds.",
            "source_image_entities": [
                "WHITE BACKGROUND"
            ],
            "source_text_entities": [
                "FAIR GROUNDS",
                "THE GRANDSTAND",
                "THE JUDGES' BOOTH",
                "THE PIGPEN"
            ]
        },
        {
            "merged_entity_name": "S",
            "entity_type": "CHARACTER",
            "description": "A large, black, serif-style letter S prominently displayed in the image could symbolize a significant element or character in the story, possibly related to the miraculous writing on the spider's web that saved Wilbur.",
            "source_image_entities": [
                "S"
            ],
            "source_text_entities": [
                "THE WRITING ON THE SPIDER'S WEB"
            ]
        }
    ],
    "image_12": [
        {
            "merged_entity_name": "Wilbur (the Zuckerman Pig)",
            "entity_type": "PERSON",
            "description": "Wilbur is a pig who is being transported to a judging event and is the center of attention due to a miraculous event involving his web. He is also known as the Zuckerman pig, famous for the miraculous writing on Charlotte's web in Zuckerman's barn. In the image, he is depicted as a young boy with messy hair, wearing a short-sleeved shirt and shorts, leaning over a large object, which is likely the crate he is being transported in.",
            "source_image_entities": [
                "BOY"
            ],
            "source_text_entities": [
                "WILBUR (THE ZUCKERMAN PIG)"
            ]
        },
        {
            "merged_entity_name": "Charlotte A. Cavatica",
            "entity_type": "PERSON",
            "description": "A large grey spider who becomes a dear friend to Wilbur, a little pig, and saves his life with her clever plan. She is also known as Charlotte. In the image, she is represented by the large object with a textured material and two protruding elements that resemble ears, which could symbolize her web and her role in the story.",
            "source_image_entities": [
                "LARGE OBJECT"
            ],
            "source_text_entities": [
                "CHARLOTTE A. CAVATICA"
            ]
        },
        {
            "merged_entity_name": "Crate",
            "entity_type": "OBJECT",
            "description": "A wooden crate with visible slats and nails, positioned upright next to the large object, which is associated with Charlotte. This crate is used for transporting Wilbur to the judging event at the County Fair.",
            "source_image_entities": [
                "CRATE"
            ],
            "source_text_entities": [
                "THE PIGPEN"
            ]
        }
    ],
    "image_13": [
        {
            "merged_entity_name": "Wilbur (The Zuckerman Pig)",
            "entity_type": "PERSON",
            "description": "Wilbur is a pig who is being transported to a judging event and is the center of attention due to a miraculous event involving his web. He is also known as the Zuckerman pig, famous for the miraculous writing on Charlotte's web in Zuckerman's barn. A pig standing next to the kneeling man, wearing a ribbon around its neck, indicating it might have won a prize.",
            "source_image_entities": [
                "PIG"
            ],
            "source_text_entities": [
                "WILBUR (THE ZUCKERMAN PIG)"
            ]
        },
        {
            "merged_entity_name": "Mr. Zuckerman",
            "entity_type": "PERSON",
            "description": "Mr. Zuckerman is involved in taking care of Wilbur, interested in looking at tractors at the fair, and walks away with Mrs. Zuckerman and the Arables towards the cattle barn. A man standing and shaking hands with another man, likely a judge at an event.",
            "source_image_entities": [
                "JUDGE"
            ],
            "source_text_entities": [
                "MR. ZUCKERMAN"
            ]
        },
        {
            "merged_entity_name": "Avery",
            "entity_type": "PERSON",
            "description": "Avery is a busy helper in the transportation of Wilbur, also concerned with his appearance and eager to assist. A young boy standing between two men, smiling and holding a ribbon, possibly the winner of a competition.",
            "source_image_entities": [
                "BOY"
            ],
            "source_text_entities": [
                "AVERY"
            ]
        },
        {
            "merged_entity_name": "Spectators",
            "entity_type": "ORGANIZATION",
            "description": "A group of people watching the interaction between the man, the judge, and the boy. They are standing behind a fence, observing the event. The crowd represents the group of people attending the event where Wilbur is presented and judging takes place.",
            "source_image_entities": [
                "SPECTATORS"
            ],
            "source_text_entities": [
                "THE CROWD"
            ]
        },
        {
            "merged_entity_name": "Templeton (The Rat)",
            "entity_type": "PERSON",
            "description": "Templeton, also known as the Rat, is a character who moves indoors for the winter and has a relationship with Wilbur, growing big and fat due to overeating. He is advised by the old sheep to eat less for a longer life.",
            "source_image_entities": [],
            "source_text_entities": [
                "TEMPLETON (THE RAT)"
            ]
        }
    ],
    "image_14": [
        {
            "merged_entity_name": "Charlotte A. Cavatica",
            "entity_type": "PERSON",
            "description": "Charlotte A. Cavatica, also known as Charlotte, is a large grey spider who becomes a dear friend to Wilbur, a little pig. She is known for her clever plan to save Wilbur's life by weaving messages into her web. Charlotte is quiet by nature and plays a significant role in the story, providing a deep emotional connection with Wilbur and reflecting on the value of life and friendship.",
            "source_image_entities": [
                "C"
            ],
            "source_text_entities": [
                "CHARLOTTE A. CAVATICA"
            ]
        },
        {
            "merged_entity_name": "Wilbur (the Zuckerman Pig)",
            "entity_type": "PERSON",
            "description": "Wilbur, also known as the Zuckerman Pig, is a pig who is the center of attention due to a miraculous event involving his web. He is being transported to a judging event and becomes famous for the miraculous writing on Charlotte's web in Zuckerman's barn. Wilbur expresses a deep bond with Charlotte and a desire to return home to the barn cellar with the other animals.",
            "source_image_entities": [
                "C"
            ],
            "source_text_entities": [
                "WILBUR (THE ZUCKERMAN PIG)"
            ]
        }
    ],
    "image_15": [
        {
            "merged_entity_name": "Templeton (The Rat)",
            "entity_type": "ANIMAL",
            "description": "Templeton, also known as the Rat, is a character who moves indoors for the winter and has a relationship with Wilbur, growing big and fat due to overeating. He is the only one who can reach Charlotte's egg sac on the ceiling and is described as standing on his hind legs and reaching up towards the ceiling.",
            "source_image_entities": [
                "RAT"
            ],
            "source_text_entities": [
                "TEMPLETON (THE RAT)"
            ]
        },
        {
            "merged_entity_name": "Charlotte's Egg Sac",
            "entity_type": "OBJECT",
            "description": "Charlotte's Egg Sac is an important object in the narrative, symbolizing her 'great work' and containing 514 eggs. It is described as strong, made of the toughest material, and waterproof, ensuring the eggs inside will be warm and dry. Wilbur affectionately refers to it as the 'peachy little sac', and it is located on the ceiling which the rat is reaching towards.",
            "source_image_entities": [
                "CEILING"
            ],
            "source_text_entities": [
                "CHARLOTTE'S EGG SAC (EGG SAC, PEACHY LITTLE SAC)"
            ]
        }
    ],
    "image_16": [
        {
            "merged_entity_name": "WILBUR (THE ZUCKERMAN PIG)",
            "entity_type": "PERSON",
            "description": "Wilbur is a pig who is being transported to a judging event and is the center of attention due to a miraculous event involving his web. He is also known as the Zuckerman pig, famous for the miraculous writing on Charlotte's web in Zuckerman's barn. He carefully took the little bundle of Charlotte's egg sac in his mouth and held it there on top of his tongue, ensuring the safety of Charlotte's unborn children.",
            "source_image_entities": [
                "A",
                "ND"
            ],
            "source_text_entities": [
                "WILBUR (THE ZUCKERMAN PIG)"
            ]
        },
        {
            "merged_entity_name": "CHARLOTTE A. CAVATICA",
            "entity_type": "PERSON",
            "description": "A large grey spider who becomes a dear friend to Wilbur, a little pig, and saves his life with her clever plan. She is also known as Charlotte, and her egg sac is referred to as the 'peachy little sac' by Wilbur. Charlotte never moved again after saying goodbye to Wilbur, and she died, leaving behind her important legacy and her children in the egg sac.",
            "source_image_entities": [
                "ND"
            ],
            "source_text_entities": [
                "CHARLOTTE A. CAVATICA"
            ]
        },
        {
            "merged_entity_name": "CHARLOTTE'S EGG SAC (EGG SAC, PEACHY LITTLE SAC)",
            "entity_type": "OBJECT",
            "description": "Charlotte's Egg Sac is an important object in the narrative, symbolizing her 'great work' and containing 514 eggs. It is described as strong, made of the toughest material, and waterproof, ensuring the eggs inside will be warm and dry. Wilbur affectionately refers to it as the 'peachy little sac' and carries it in his mouth, placing it in a safe corner when he returns home.",
            "source_image_entities": [
                "ND"
            ],
            "source_text_entities": [
                "CHARLOTTE'S EGG SAC (EGG SAC, PEACHY LITTLE SAC)"
            ]
        }
    ],
    "image_17": [
        {
            "merged_entity_name": "TEMPLETON (THE RAT)",
            "entity_type": "PERSON",
            "description": "Templeton, also known as the Rat, is a character who moves indoors for the winter and has a relationship with Wilbur, growing big and fat due to overeating. He is advised by the old sheep to eat less for a longer life. In the image, he is depicted as a rat sitting on a wooden box, facing a sheep.",
            "source_image_entities": [
                "RAT"
            ],
            "source_text_entities": [
                "TEMPLETON (THE RAT)"
            ]
        },
        {
            "merged_entity_name": "SHEEP",
            "entity_type": "PERSON",
            "description": "The sheep are characters who are glad to see Wilbur back and gnaw on the red little apples. In the image, an old sheep is depicted speaking to Templeton about his size and also mentions the arrival of springtime. The sheep is also shown looking over a wooden fence at the rat.",
            "source_image_entities": [
                "SHEEP"
            ],
            "source_text_entities": [
                "SHEEP"
            ]
        },
        {
            "merged_entity_name": "WOODEN BOX",
            "entity_type": "OBJECT",
            "description": "The wooden box is an object on which the rat, Templeton, is sitting. It is a small object mentioned in the text and depicted in the image.",
            "source_image_entities": [
                "WOODEN BOX"
            ],
            "source_text_entities": [
                "BOARD FENCE"
            ]
        },
        {
            "merged_entity_name": "BOARD FENCE",
            "entity_type": "GEO",
            "description": "The board fence is part of the setting where Wilbur places Charlotte's egg sac and where the spiders eventually climb. In the image, it is depicted as a wooden fence separating the rat and the sheep.",
            "source_image_entities": [
                "FENCE"
            ],
            "source_text_entities": [
                "BOARD FENCE"
            ]
        }
    ],
    "image_18": [
        {
            "merged_entity_name": "Wilbur (the Zuckerman Pig)",
            "entity_type": "PERSON",
            "description": "Wilbur is a pig who is being transported to a judging event and is the center of attention due to a miraculous event involving his web. He is also known as the Zuckerman pig, famous for the miraculous writing on Charlotte's web in Zuckerman's barn. In the image, Wilbur is depicted as a pig with bristly hair, looking up and sniffing the air.",
            "source_image_entities": [
                "PIG"
            ],
            "source_text_entities": [
                "\"WILBUR (THE ZUCKERMAN PIG)\""
            ]
        },
        {
            "merged_entity_name": "Charlotte's Children (Balloonists)",
            "entity_type": "PERSON",
            "description": "Charlotte's children, also known as balloonists, are the offspring of Charlotte, the spider. They are leaving the barn cellar using balloons to disperse and create their own webs. In the image, this is represented by wavy lines indicating smoke or scent rising from the fence, symbolizing the departure of the baby spiders on their balloons.",
            "source_image_entities": [
                "SMOKE"
            ],
            "source_text_entities": [
                "\"CHARLOTTE'S CHILDREN (BALLOONISTS)\""
            ]
        },
        {
            "merged_entity_name": "Doorway",
            "entity_type": "GEO",
            "description": "The doorway is where Charlotte's web used to be and where her daughters decide to construct their webs. In the image, it is represented by a wooden fence with a post, which is part of the setting where Wilbur places Charlotte's egg sac and where the spiders eventually climb.",
            "source_image_entities": [
                "FENCE"
            ],
            "source_text_entities": [
                "\"DOORWAY\""
            ]
        }
    ],
    "image_19": [
        {
            "merged_entity_name": "Wilbur (the Zuckerman Pig)",
            "entity_type": "PERSON",
            "description": "Wilbur, also known as the Zuckerman pig, is a central character in the story depicted as a cartoon pig standing in a barnyard, looking towards the viewer. He is famous for the miraculous writing on Charlotte's web in Zuckerman's barn and is the focus of attention due to this event.",
            "source_image_entities": [
                "PIG"
            ],
            "source_text_entities": [
                "\"WILBUR (THE ZUCKERMAN PIG)\""
            ]
        },
        {
            "merged_entity_name": "Barn",
            "entity_type": "GEO",
            "description": "The barn is a wooden structure with a slanted roof, located to the right of Wilbur in the image, and serves as the primary setting of the story where Wilbur and the spiders live. It is described as a warm, delicious cellar with various animals and elements contributing to the environment.",
            "source_image_entities": [
                "BARN"
            ],
            "source_text_entities": [
                "\"THE BARN\""
            ]
        },
        {
            "merged_entity_name": "Charlotte's Children (Balloonists)",
            "entity_type": "PERSON",
            "description": "Charlotte's children, also known as balloonists, are the offspring of Charlotte, the spider. They are depicted in the image as spider webs attached to the top frame, indicating an outdoor setting, and are known for leaving the barn cellar using balloons to disperse and create their own webs.",
            "source_image_entities": [
                "SPIDER WEBS"
            ],
            "source_text_entities": [
                "\"CHARLOTTE'S CHILDREN (BALLOONISTS)\""
            ]
        },
        {
            "merged_entity_name": "Doorway",
            "entity_type": "GEO",
            "description": "The doorway, as shown in the image by the presence of a wooden fence running horizontally across it, is where Charlotte's web used to be and where her daughters decide to construct their webs. It is a significant location in the narrative, symbolizing the continuity of Charlotte's legacy.",
            "source_image_entities": [
                "FENCE"
            ],
            "source_text_entities": [
                "\"DOORWAY\""
            ]
        }
    ],
    "image_20": [
        {
            "merged_entity_name": "Charlotte A. Cavatica",
            "entity_type": "PERSON",
            "description": "A large grey spider who becomes a dear friend to Wilbur, a little pig, and saves his life with her clever plan. She is also known as Charlotte and is the mother of Joy, Aranea, Nellie, and other spider offspring, who are collectively referred to as spiders.",
            "source_image_entities": [
                "BARCODE"
            ],
            "source_text_entities": [
                "CHARLOTTE A. CAVATICA",
                "CHARLOTTE (SPIDERS)"
            ]
        },
        {
            "merged_entity_name": "Wilbur (the Zuckerman Pig)",
            "entity_type": "PERSON",
            "description": "Wilbur is a pig who is being transported to a judging event and is the center of attention due to a miraculous event involving his web. He is also known as the Zuckerman pig, famous for the miraculous writing on Charlotte's web in Zuckerman's barn and loved by Fern, a little girl.",
            "source_image_entities": [
                "BARCODE"
            ],
            "source_text_entities": [
                "WILBUR (THE ZUCKERMAN PIG)",
                "FERN"
            ]
        },
        {
            "merged_entity_name": "Barn Cellar",
            "entity_type": "GEO",
            "description": "The barn cellar is the location where Wilbur and Charlotte's daughters live and where the story unfolds. It is also the place where Wilbur never forgot Charlotte and where her egg sac, containing 514 eggs, is found.",
            "source_image_entities": [
                "BARCODE"
            ],
            "source_text_entities": [
                "BARN CELLAR",
                "CHARLOTTE'S EGG SAC (EGG SAC, PEACHY LITTLE SAC)"
            ]
        }
    ]
}