{
    "chunk-b9f6d0598a02e762124c9ef925dacb45": [
        {
            "entity_name": "Velyka Komyshuvakha",
            "entity_type": "GEO",
            "description": "A village in eastern Ukraine that was occupied by Russian forces for four and a half months and later retaken by Ukraine. The local bar was used as a small outpost by the Russian forces and was covered in graffiti left by the soldiers.",
            "source_entities": [
                "VELYKA KOMYSHUVAKHA",
                "UKRAINE"
            ]
        },
        {
            "entity_name": "Russian Forces",
            "entity_type": "ORGANIZATION",
            "description": "Occupying forces in eastern Ukraine, responsible for the occupation of Velyka Komyshuvakha and other areas, using a local bar as a small outpost and leaving graffiti on the walls.",
            "source_entities": [
                "RUSSIAN FORCES",
                "RUSSIA"
            ]
        },
        {
            "entity_name": "Donald J. Trump",
            "entity_type": "PERSON",
            "description": "Former President of the United States, involved in a federal case regarding documents, and accused of obstructing an investigation into his possession of classified material after leaving office. His aides referred to his collection of papers and odds and ends as 'beautiful mind' material, drawing a parallel to the mathematician John F. Nash Jr., played by Russell Crowe in the film 'A Beautiful Mind'.",
            "source_entities": [
                "DONALD J. TRUMP",
                "WALT NAUTA",
                "JOHN F. NASH JR.",
                "RUSSELL CROWE",
                "WHITE HOUSE"
            ]
        },
        {
            "entity_name": "Justice Department",
            "entity_type": "ORGANIZATION",
            "description": "The department investigating Donald J. Trump, facing political pressure from Trump's allies who aim to end its independence. Under Attorney General Merrick Garland, it also has two Trump-appointed prosecutors investigating President Joe Biden and his son, Hunter Biden.",
            "source_entities": [
                "JUSTICE DEPARTMENT",
                "MERRICK GARLAND",
                "F.B.I."
            ]
        },
        {
            "entity_name": "Joe Biden",
            "entity_type": "PERSON",
            "description": "The current President of the United States, targeted by Donald J. Trump for a special prosecutor if Trump is re-elected, and whose son, Hunter Biden, is under investigation by two Trump-appointed prosecutors.",
            "source_entities": [
                "JOE BIDEN",
                "HUNTER BIDEN"
            ]
        }
    ],
    "chunk-cd435d836780a2d3cdee29bbe6129dd5": [
        {
            "entity_name": "Justice Department",
            "entity_type": "ORGANIZATION",
            "description": "The Justice Department is an organization that has traditionally operated independently from the White House, but Trump has pressured it to align more with his political control. It is also the subject of a larger movement on the right to gut the FBI and overhaul the department, which conservatives claim has been 'weaponized' against them. Two key figures in this effort are Jeffrey B. Clark and Russell T. Vought, who work at the Center for Renewing America.",
            "source_entities": [
                "\"JUSTICE DEPARTMENT\"",
                "\"F.B.I.\"",
                "\"CENTER FOR RENEWING AMERICA\"",
                "\"JEFFREY B. CLARK\"",
                "\"RUSSELL T. VOUGHT\""
            ]
        }
    ],
    "chunk-d4a463288c61eec11351e19c00ee0b57": [
        {
            "entity_name": "Exodus From Urban Malls",
            "entity_type": "Event",
            "description": "An event where retailers are fleeing from urban malls, which is a problem occurring in cities across the country including San Francisco.",
            "source_entities": [
                "EXODUS FROM URBAN MALLS",
                "SAN FRANCISCO"
            ]
        },
        {
            "entity_name": "Boris Johnson Misleading Lawmakers",
            "entity_type": "Event",
            "description": "A report from the U.K. that faults ex-leader Boris Johnson for deliberately misleading lawmakers about parties he held mid-pandemic.",
            "source_entities": [
                "U.K. REPORT",
                "BORIS JOHNSON"
            ]
        },
        {
            "entity_name": "Jack Teixeira Files Leak",
            "entity_type": "Event",
            "description": "The event of Airman Jack Teixeira being indicted for posting secret intelligence reports on a social media server, charged with six counts of retaining and transmitting classified national defense information.",
            "source_entities": [
                "AIRMAN IN FILES LEAK",
                "JACK TEIXEIRA"
            ]
        },
        {
            "entity_name": "Wind and Solar Nationwide",
            "entity_type": "Event",
            "description": "The event of trying to transport wind and solar energy nationwide, which is complicated by the divided power infrastructure.",
            "source_entities": [
                "WIND AND SOLAR NATIONWIDE",
                "POWER INFRASTRUCTURE"
            ]
        }
    ]
}