{
  "chunk-ff0154dbb52267e3857e4a9db1b48f1b": {
    "tokens": 1200,
    "content": "VOL. CLXXIII . . . . No. 59,938 © 2023  The New York Times Company  \n\nWEDNESDAY, OCTOBER 11, 2023  \n\n![](images/image_1.jpg)  \nIsraeli soldiers checked bodies in Kfar Azza, a village near Gaza, on Tuesday. The scale of the horror was rapidly coming into focus.  \n\n# In Rows of Tidy Houses, Carnage in a Kibbutz at Gaza’s Doorstep  \n\n# By ISABEL KERSHNER  \n\nKFAR AZZA, Israel — “Welcome,” said the sign at the entrance to Kfar Azza, a lush Israeli village just across some fields from the border with Gaza. On the pathway, another sign pointed the way to the gym and the swimming pool.  \n\nThen I saw the legs of a bloated corpse dressed in fatigues poking out from under a bush, and beside it a khaki vest with the insignia of a commando unit of Hamas, the group that controls the Palestinian coastal enclave, and staged Saturday’s assault on Israel. Past the village dining hall, kindergarten and culture center, the tidy  rows  of  one-story  beige houses came into view. And the scale of the horror began to unfold.  \n\nFour days after hundreds of Hamas gunmen breached Israel’s  \n\n# Scores Are Slaughtered in Path of Hamas  \n\nborder fence in the most brazen attack on the country in decades, overrunning two dozen towns and communities, including this one, in a bloody killing spree, soldiers and rescue workers on Tuesday began the gruesome task of extri  \n\ncating the bodies.   \nThey moved slowly, house to house, for fear that Hamas gunmen could still be hiding inside or have booby-trapped them. Live grenades lay in wait, to be neutralized by sappers. They carried out one slain resident in a body bag on a stretcher and placed it in the back of a truck. Then another. And another.  \n\nA New York Times photograContinued on Page A12  \n\n# Gazans With Nowhere to Hide Issue a Plea: ‘At Least Warn Us’  \n\n# By RAJA ABDULRAHIM and AMEERA HAROUDA  \n\nIsraeli  airstrikes  flattened mosques over the heads of worshipers. At least two hospitals, and two centers run by the Palestine Red Crescent Society, have been hit. So have two schools run by the U.N. agency that helps Palestinian refugees.  \n\nIsrael’s fighter jets and artillery have struck targets in Gaza frequently over the years as part of the longstanding conflict between the Palestinians and Israel. But from the first day of this new war, residents of Gaza and the health authorities have said that this time the strikes have been indiscriminately hitting structures that haven’t regularly been targeted in the past, such as schools, hospitals and mosques.  \n\nFew warnings have been given before strikes, Gazans say, and entire families have been killed in their  homes,  according  to  the Gazan Health Ministry.  \n\nThe strikes are coming as part of Israel’s response to the attack on Saturday, when hundreds of Palestinian gunmen swept across Israel’s border with Gaza, killing more than 1,000 people and taking around 150 hostages, including children and the elderly. On Monday, Israel’s defense minister announced a “complete siege” of Gaza, saying “no electricity, no food, no water, no fuel” would be allowed in.  \n\nIsrael has said its strikes are targeting all sites connected with Hamas,  the  armed  Palestinian group that controls the Gaza Strip, including the homes of members. Israel  said  it  believes  Hamas members are hiding in homes, schools  and  hospitals.  Hamas members are Palestinians from Gaza, so they live among the community.  \n\nBut  the  Israeli  strikes  have shocked Palestinians. Israel has given general warnings for people to leave certain neighborhoods or towns,  but  has  acknowledged they are not as extensive or speDestruction in Gaza City. Israel says its strikes are targeting all sites connected with Hamas, including mosques and hospitals.  \n\n![](images/image_2.jpg)  \n\n# ISRAEL TAKES BACK TOWNS, PREPARING TO GO ON OFFENSE  \n\nNEWS ANALYSIS Mobilizing  360,000 U.S. Leaders Unify, Troops as Toll at Least for Now Mounts  \n\n# By PETER BAKER  \n\nWASHINGTON — The staggering Hamas surprise attack on Israel has done what Prime Minister Benjamin Netanyahu never could — united America’s fractious politicians behind his nation again. Sort of. Mostly. For now.  \n\nAfter years in which support for Israel had turned into an increasingly partisan issue in Washington, Democratic and Republican leaders in recent days have generally responded with broad condemnation of Hamas and expressions of solidarity following the slaughter of hundreds of Israeli civilians. But that surface unity had already begun to fray around the edges by Monday as Israel retaliated with punishing airstrikes on Gaza, cut off food and water to the enclave and prepared for what may become a ground invasion that could further endanger Palestinian civilians. Some on the left wing of the Democratic Party were criticizing Israel for “apartheid” policies oppressing Palestinians and calling for an end to U.S. aid. For the moment, such sentiments have been restricted to the fringes of the House Democratic caucus and have drawn swift rebukes from more centrist members of the party. The reality, however, is that the sympathy and support for Israel will be tested the longer the fighting continues and the more firepower that Israeli forces employ, according to lawmakers and political strategists. The challenge for President Biden and his allies is to translate the current outrage at Hamas into a sustained consensus for Israel. The sensitivity of that was made clear by mixed signals sent by Mr. Biden’s own administration. The State Department",
    "chunk_order_index": 0,
    "full_doc_id": "doc-84f539a9d00a8f2e3fec818472d9efba"
  },
  "chunk-5a54845624c6d1d0a47ebe898b407243": {
    "tokens": 1200,
    "content": "and have drawn swift rebukes from more centrist members of the party. The reality, however, is that the sympathy and support for Israel will be tested the longer the fighting continues and the more firepower that Israeli forces employ, according to lawmakers and political strategists. The challenge for President Biden and his allies is to translate the current outrage at Hamas into a sustained consensus for Israel. The sensitivity of that was made clear by mixed signals sent by Mr. Biden’s own administration. The State Department’s Office of Palestinian Affairs posted a message on X, the platform formerly known as Twitter, on Saturday pressing “all sides to refrain from violence and retaliatory attacks,” and the account of Secretary of State Antony J. Blinken posted a message on Sunday encouraging Turkey’s “advocacy for a cease-fire.” Both posts were subsequently deleted following an outcry from Israel supporters who said it was too soon to urge Israel to stand down  \n\nBoth Mr. Biden and Mr. Blinken have otherwise steadfastly declared that Israel has a right to defend itself. The admin istration has begun shipping military equipment to Israel to replenish its supplies and moving American warships and planes to the region to deter Ira or other enemies of Israel from escalating the fight.  \n\n# By ISABEL KERSHNER and AARON BOXERMAN  \n\nJERUSALEM — Israeli troops mostly retook control of towns near the Gaza Strip from Palestinian gunmen on Tuesday, four days after  fighters  for  the  militant group Hamas assailed Israeli civilians and soldiers in devastating attacks  that  killed  hundreds, wounded thousands and put the grieving country on the brink of a major military operation.  \n\nThe  Israeli  government  approved the call-up of an additional 60,000 reservists, officials said, raising the total number of mobilized soldiers over the last three days to 360,000, the most in such a short period since the country’s founding. The mobilization has touched nearly every corner of the country of 10 million, which has been plunged into anguish by the killing of more than 1,000 people in the attacks since Saturday. With the border nearly secured on Tuesday — even as rocket attacks from Gaza continued and some firefights broke out — the scale of the horror unleashed on towns and villages near Gaza was rapidly coming into focus. In one kibbutz a mile and a half from Gaza, journalists with The New York Times saw Israeli soldiers carrying  slain  residents  on stretchers, and more than a dozen bloated  bodies  lying  on  the ground.  \n\n![](images/image_3.jpg)  \nGathering for a funeral of a festivalgoer on Tuesday.  \n\nSoldiers and rescue workers said scores, possibly hundreds, had been killed there, including infants and children, suggesting the death toll from the weekend alone would almost certainly keep rising.  \n\nHamas is holding Americans hostage, President Biden said on Tuesday, and 14 Americans were confirmed  to  be  among  those killed. He called the attacks “pure unadulterated evil.”  \n\nMr. Biden said that the United States would provide intelligence to help save hostages held by Hamas. But he did not suggest that American troops would directly assist with hostage rescue missions.  \n\nContinued on Page A11 Continued on Page A13  \n\n# Rape, Race and Years-Old Lie That Still Wounds Gene-Editing Tool Fights Bird Flu in Chickens  \n\n# By CATHERINE PORTER and AURELIEN BREEDEN  \n\nHAZEBROUCK, France — The phone echoed in Farid El Haïry’s home in northern France. It was February 1999.  \n\nA rural police officer was on the line, asking if he could come down to the gendarmerie for a chat.  \n\n“I asked them why and was it urgent,” he says. It’s nothing serious, he remembers being told. Come when you can. It won’t take long.  \n\nThen a lanky 17-year-old about  \n\n# Accuser Recanted Her  \n\n# Story Decades Later  \n\nto start an apprenticeship in a bakery, Mr. El Haïry set out for the brick station a couple of days later. He grabbed some pains au chocolat and a Coke on the way for breakfast.  \n\nHe was charged with the sexual assault and rape of a 15-year-old girl  from  a  neighboring  high school, whom he knew only by sight and had never spoken to. The police had no witnesses, no corroborating evidence, just her word against his.  \n\nAfter a night at the gendarmerie, he was sent to a nearby prison that was notorious for overcrowding, drug use and suicide. He spent the next 11 months and 23 days in pretrial custody before being released with one painful condition — stay away from his home city of Hazebrouck, where his acContinued on Page A6  \n\n# By EMILY ANTHES  \n\nScientists have used the geneediting  technology  known  as CRISPR to create chickens that have some resistance to avian influenza, according to a new study that was published in the journal Nature Communications on Tuesday.  \n\nThe study suggests that genetic engineering could potentially be one tool for reducing the toll of bird flu, a group of viruses that pose grave dangers to both animals and humans. But the study  \n\n# Scientists See Promise and Peril in CRISPR  \n\nalso highlights the limitations and potential risks of the approach, scientists said.  \n\nSome breakthrough infections still  occurred,  especially  when gene-edited  chickens  were  exposed to very high doses of the virus, the researchers found. And when the scientists edited just one chicken gene, the virus quickly adapted.  The  findings  suggest that creating flu-resistant chickens will require editing multiple genes and that scientists will need to proceed carefully to avoid driving further evolution of the virus, the study’s authors said.",
    "chunk_order_index": 1,
    "full_doc_id": "doc-84f539a9d00a8f2e3fec818472d9efba"
  },
  "chunk-17c33813d68ef6c049bd4d7f1fe3396a": {
    "tokens": 578,
    "content": "highlights the limitations and potential risks of the approach, scientists said.  \n\nSome breakthrough infections still  occurred,  especially  when gene-edited  chickens  were  exposed to very high doses of the virus, the researchers found. And when the scientists edited just one chicken gene, the virus quickly adapted.  The  findings  suggest that creating flu-resistant chickens will require editing multiple genes and that scientists will need to proceed carefully to avoid driving further evolution of the virus, the study’s authors said.  \n\nThe research is “proof of concept that we can move toward making chickens resistant to the virus,” Wendy Barclay, a virologist at Imperial College London and an author of the study, said at a news  briefing.  “But  we’re  not there yet.”  \n\n![](images/image_4.jpg)  \n\nNATIONAL A14-19 Schools Reckon With Storms Natural disasters are becoming more common, creating more disruptions to students’ learning. PAGE A14 Santos Faces New Charges Federal prosecutors say Representative George Santos got money from donors’ credit cards without asking.  PAGE A19  \n\n# BUSINESS B1-7  \n\nGreen Energy in Wyoming One man’s quest to lure climate investment from the wealthy enclave of Jackson underscores how the climate law works: It runs on rich people.  PAGE B1 Hurdle for Global Economy A war in the Middle East could complicate efforts to contain inflation at a time when output is “limping along.” PAGE B1 INTERNATIONAL A4-13 Radio for the Women of India Shows on a community radio station are helping women overcome deeply patriarchal attitudes. PAGE A4 FOOD D1-10 Shape-Shifting Global Staple Roti has meant many things to many people. To a new generation, it means pizza, French toast and more.  PAGE D1 A Sweet, and Gooey, Gig When a California family was enlisted to taste-test Pop-Tarts, they had no idea of the phenomenon to come. PAGE D1  \n\n![](images/image_5.jpg)  \n\n# SPORTS B8-11  \n\nDo the Playoffs Need Fixing? The larger bracket in Major League Baseball gives more teams a chance, but it also means a longer layoff for high seeds. This year, they don’t seem to have enjoyed their rest. PAGE B8 Mystery Investor in Soccer The obscure fund 777 Partners had been scooping up big-name teams for two years when it bid for Everton. Doubts about the fund’s finances could kill the deal. PAGE B11  \n\nOPINION A22-23 Bret Stephens  \n\n![](images/image_6.jpg)  \n\nARTS C1-6 A Funky Fresh Revival. Word. Breaking, which was largely left out of hip-hop’s 50th anniversary, is headed to the Paris Olympics. But its pioneers wonder how you can judge art.  PAGE C1",
    "chunk_order_index": 2,
    "full_doc_id": "doc-84f539a9d00a8f2e3fec818472d9efba"
  }
}