{
    "chunk-625f261212df523575922a2ca2ef28a0": null,
    "chunk-f1aa38e03a2cdd3122f479f8a521b9a0": [
        {
            "entity_name": "Beto O'Rourke",
            "entity_type": "PERSON",
            "description": "Beto O'Rourke, also known as Mr. O'Rourke, is a former congressman and the Democratic challenger in the race for governor against the incumbent Greg Abbott. He has raised $27.6 million in the last filing, outpacing Mr. Abbott.",
            "source_entities": [
                "MR. O’ROURKE",
                "BETO O’ROURKE"
            ]
        },
        {
            "entity_name": "Greg Abbott",
            "entity_type": "PERSON",
            "description": "Greg Abbott, also known as Mr. Abbott, is the current governor of Texas and a two-term incumbent. He is competing against Beto O'Rourke in the race for governor and has raised $24.9 million in the last filing.",
            "source_entities": [
                "MR. ABBOTT",
                "GREG ABBOTT"
            ]
        },
        {
            "entity_name": "Kansas State Constitution",
            "entity_type": "EVENT",
            "description": "The Kansas State Constitution is subject to an amendment vote that could remove protections of abortion rights, as part of the Kansas Election following the Supreme Court's decision to overturn Roe v. Wade.",
            "source_entities": [
                "STATE CONSTITUTION",
                "KANSAS ELECTION"
            ]
        },
        {
            "entity_name": "Supreme Court Decision on Abortion",
            "entity_type": "EVENT",
            "description": "The Supreme Court's decision to overturn Roe v. Wade has focused energy on the abortion issue, particularly impacting Kansas, and has led to the Kansas Election being the first test of Americans' attitudes on abortion rights.",
            "source_entities": [
                "SUPREME COURT",
                "ROE V. WADE"
            ]
        }
    ],
    "chunk-e9e3e5db7c871eceddadfa7b878a4638": [
        {
            "entity_name": "Apple",
            "entity_type": "ORGANIZATION",
            "description": "Apple is a big tech company seeking more viewers for its streaming services and competing for rights to broadcast games from sports leagues, including the N.F.L.",
            "source_entities": [
                "APPLE",
                "BIG TECH WANTS IN THE GAME"
            ]
        },
        {
            "entity_name": "Amazon",
            "entity_type": "ORGANIZATION",
            "description": "Amazon is a big tech company seeking more viewers for its streaming services and competing for rights to broadcast games from sports leagues, including the N.F.L.",
            "source_entities": [
                "AMAZON",
                "BIG TECH WANTS IN THE GAME"
            ]
        },
        {
            "entity_name": "Jonas Vingegaard",
            "entity_type": "PERSON",
            "description": "Jonas Vingegaard is a 25-year-old cyclist who won the Tour de France in only his second time riding cycling's most prestigious race, as covered in the SPORTS D1-6 section.",
            "source_entities": [
                "JONAS VINGEGAARD",
                "A SUDDEN ASCENT TO THE TOP"
            ]
        },
        {
            "entity_name": "Meryl Streep",
            "entity_type": "PERSON",
            "description": "Meryl Streep is a fine actress, known for her use of eyewear in her performances, as analyzed in the ARTS C1-6 section.",
            "source_entities": [
                "MERYL STREEP",
                "WHAT SHE SEES IN GLASSES"
            ]
        },
        {
            "entity_name": "University of Strasbourg",
            "entity_type": "ORGANIZATION",
            "description": "The University of Strasbourg is an educational institution that experienced a takeover during World War II, shedding light on a dark period, as reported in the INTERNATIONAL A4-11 section.",
            "source_entities": [
                "UNIVERSITY OF STRASBOURG",
                "WORLD WAR II"
            ]
        },
        {
            "entity_name": "University of Utah",
            "entity_type": "ORGANIZATION",
            "description": "The University of Utah acknowledged missteps in its response to concerns about a student's death, as covered in the NATIONAL A12-17, 20 section.",
            "source_entities": [
                "UNIVERSITY OF UTAH",
                "EXAMINING A STUDENT’S DEATH"
            ]
        },
        {
            "entity_name": "Carleton Varney",
            "entity_type": "PERSON",
            "description": "Carleton Varney was a designer known as Mr. Color, trained by decorator Dorothy Draper, and had an aversion to the bland and beige; he was 85 years old, as mentioned in the OBITUARIES D7-8 section.",
            "source_entities": [
                "CARLETON VARNEY",
                "OBITUARIES D7-8"
            ]
        },
        {
            "entity_name": "No More Pet Store Puppies",
            "entity_type": "EVENT",
            "description": "No More Pet Store Puppies is a bill that prohibits the sale of dogs, cats, and rabbits in New York shops, awaiting the governor's decision, as covered in the NATIONAL A12-17, 20 section.",
            "source_entities": [
                "NO MORE PET STORE PUPPIES",
                "NATIONAL A12-17, 20"
            ]
        }
    ]
}