{
    "image_1": [
        {
            "entity_name": "IMAGE_1",
            "entity_type": "ORI_IMG",
            "description": "The image is a timeline chart titled 'Distributional models in the task of tracing diachronic semantic shifts: research timeline.' The timeline spans from 2010 to 2017, with each year marked by a circle. Key milestones and developments in the field are annotated along the timeline. Starting from 2010, the first milestone is 'Time tensor with Random Indexing.' This is followed by 'Google Ngrams corpus' in 2011. In 2012, 'Word epoch disambiguation' is noted. The year 2013 marks the introduction of 'Prediction-based models (word2vec).' In 2014, 'Word embeddings with incremental updates' is highlighted. The year 2015 sees the development of 'Models alignment.' The timeline continues with 'NYT corpus' and 'COHA corpus' in 2016. Finally, in 2017, several advancements are noted: 'Laws of semantic change,' 'Local measures better for cultural shifts,' 'Gigaword corpus,' 'Diachronic relations,' and 'Criticism of semantic change laws.' The timeline provides a chronological overview of significant developments in the field of tracing diachronic semantic shifts using distributional models."
        },
        {
            "entity_name": "TIME TENSOR WITH RANDOM INDEXING",
            "entity_type": "EVENT",
            "description": "An event that occurred in 2010, involving the use of a time tensor with random indexing."
        },
        {
            "entity_name": "GOOGLE NGRAMS CORPUS",
            "entity_type": "ORGANIZATION",
            "description": "A large database of words and phrases compiled by Google, which was introduced in 2011."
        },
        {
            "entity_name": "WORD EPOCH DISAMBIGUATION",
            "entity_type": "EVENT",
            "description": "An event that took place in 2012, focusing on the disambiguation of word epochs."
        },
        {
            "entity_name": "PREDICTION-BASED MODELS (WORD2VEC)",
            "entity_type": "EVENT",
            "description": "An event that happened in 2013, introducing prediction-based models such as word2vec."
        },
        {
            "entity_name": "WORD EMBEDDINGS WITH INCREMENTAL UPDATES",
            "entity_type": "EVENT",
            "description": "An event that occurred in 2014, discussing word embeddings with incremental updates."
        },
        {
            "entity_name": "MODELS ALIGNMENT",
            "entity_type": "EVENT",
            "description": "An event that took place in 2015, focusing on the alignment of models."
        },
        {
            "entity_name": "NYT CORPUS",
            "entity_type": "ORGANIZATION",
            "description": "A corpus of texts from the New York Times, used for various linguistic studies."
        },
        {
            "entity_name": "COHA CORPUS",
            "entity_type": "ORGANIZATION",
            "description": "The Corpus of Historical American English, a large corpus of texts used for studying historical changes in language."
        },
        {
            "entity_name": "LAWS OF SEMANTIC CHANGE",
            "entity_type": "EVENT",
            "description": "An event that occurred in 2016, discussing the laws governing semantic change."
        },
        {
            "entity_name": "LOCAL MEASURES BETTER FOR CULTURAL SHIFTS",
            "entity_type": "EVENT",
            "description": "An event that took place in 2017, suggesting that local measures are better for tracking cultural shifts."
        },
        {
            "entity_name": "GIGAWORD CORPUS",
            "entity_type": "ORGANIZATION",
            "description": "A large corpus of news articles, used for various linguistic studies."
        },
        {
            "entity_name": "DIACHRONIC RELATIONS",
            "entity_type": "EVENT",
            "description": "An event that occurred in 2017, focusing on diachronic relations."
        },
        {
            "entity_name": "CRITICISM OF SEMANTIC CHANGE LAWS",
            "entity_type": "EVENT",
            "description": "An event that took place in 2017, criticizing the laws of semantic change."
        },
        {
            "entity_name": "JOINT LEARNING ACROSS TIME SPANS",
            "entity_type": "EVENT",
            "description": "An event that occurred in 2017, discussing joint learning across different time spans."
        }
    ]
}