{
    "image_1": [
        {
            "entity_name": "IMAGE_1_BACKPACK-3.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'object'. The entity features are as follows:Object Features:- Name: Backpack- Color: Black- Shape: Rectangular with a slightly curved back panel, designed to fit the contours of the human back- Size: Appears to be a medium to large size, suitable for carrying multiple items- Material: Made of a durable fabric, likely nylon or polyester, with reinforced stitching and padded shoulder straps- Possible Function: Designed for outdoor activities such as hiking or camping, providing ample storage space and comfort during extended use- Other Significant Characteristics: Equipped with multiple compartments and pockets for organized storage, including a main compartment with a two-way zipper, side pockets, and front pockets; also features compression straps to secure the load and adjustable shoulder straps for a customizable fitOverall, this backpack is built for functionality and durability, ideal for adventurers who need reliable gear to carry their essentials."
        },
        {
            "entity_name": "IMAGE_1_PERSON-0.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'person'. The entity features are as follows:Person Features:- Gender: Male- Hairstyle: Short, dark hair with a beard and mustache- Facial Expression: Neutral, focused- Age: Appears to be an adult male, possibly in his 30s or 40s- Clothing: Wearing a military uniform consisting of a green jacket with camouflage pants; the jacket has patches on the sleeves and chest, including a flag patch- Accessories: Equipped with a helmet, goggles, and a tactical vest with pouches and straps- Posture: Standing in a side profile, facing left, with arms slightly bent and hands positioned near the waistOverall, the individual appears to be a soldier or a military personnel, ready for action with a serious demeanor."
        },
        {
            "entity_name": "IMAGE_1_PERSON-1.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'person'. The entity features are as follows:Person Features:- Gender: Male- Hairstyle: Short, dark hair, partially visible under a helmet- Facial Hair: Beard and mustache, well-groomed- Expression: Not clearly visible due to the angle and gear- Age: Appears to be an adult, exact age indeterminate- Clothing: Wearing a tactical uniform with camouflage pattern, including a vest with pouches and a helmet with a communication device- Accessories: Tactical gloves, knee pads, and a backpack with various equipment attached- Posture: Walking forward, head turned slightly to the side, suggesting alertness or scanning the environmentOverall, the individual appears to be a soldier or a military personnel, equipped for combat or field operations."
        },
        {
            "entity_name": "IMAGE_1_PERSON-2.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'person'. The entity features are as follows:Person Features:- Gender: Male- Skin Color: Light skin tone- Hairstyle: Short, dark hair; wearing a black beanie- Facial Hair: Full beard and mustache- Clothing: Wearing a camouflage-patterned military uniform with a tactical vest over it; the uniform includes a jacket and pants in a similar camouflage pattern- Accessories: Black gloves on both hands; carrying a backpack with multiple pouches and straps; a blue strap visible over the right shoulder, possibly from a bag or equipment- Posture: Standing in a side profile view, facing to the left; appears to be in a ready stance, possibly prepared for action or movementOverall, the individual appears to be equipped for a tactical or combat situation, with a focus on readiness and mobility."
        },
        {
            "entity_name": "IMAGE_1_PERSON-4.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'person'. The entity features are as follows:Person Features:- Gender: Male- Skin Color: Light skin tone- Hairstyle: Short, dark hair, partially covered by a helmet- Facial Hair: Beard and mustache- Clothing: Wearing a military uniform consisting of a green jacket with patches on the sleeves, camouflage pants, and a tactical vest with pouches and gear attached- Accessories: Helmet with a night vision device mounted on it, and what appears to be a communication headset- Posture: Standing in a side profile view, facing left, with arms slightly bent and hands positioned near the waistOverall, the individual appears to be a soldier or military personnel equipped for combat or field operations."
        },
        {
            "entity_name": "IMAGE_1",
            "entity_type": "ORI_IMG",
            "description": "The image depicts a war-torn scene in Vuhledar, on the eastern front line of Ukraine. Three Ukrainian soldiers are walking across a desolate area covered with patches of snow and debris. They are dressed in camouflage uniforms and tactical gear, including helmets and backpacks. The background shows a severely damaged multi-story building with numerous windows blown out and structural damage evident. The atmosphere is bleak and somber, reflecting the harsh conditions faced by the troops. The ground is littered with rubble and remnants of destruction, indicating recent conflict. The soldiers appear to be moving cautiously through the area, possibly assessing the situation or preparing for further action."
        },
        {
            "entity_name": "SOLDIER 1",
            "entity_type": "PERSON",
            "description": "Wearing camouflage uniform, helmet, and backpack, walking on a debris-covered ground."
        },
        {
            "entity_name": "SOLDIER 2",
            "entity_type": "PERSON",
            "description": "Wearing camouflage uniform, helmet, and backpack, walking on a debris-covered ground."
        },
        {
            "entity_name": "SOLDIER 3",
            "entity_type": "PERSON",
            "description": "Wearing camouflage uniform, helmet, and backpack, walking on a debris-covered ground."
        },
        {
            "entity_name": "DAMAGED BUILDING",
            "entity_type": "GEO",
            "description": "A large multi-story building with extensive damage, missing windows, and exposed interiors."
        },
        {
            "entity_name": "DEBRIS-COVERED GROUND",
            "entity_type": "GEO",
            "description": "Ground covered in rubble, debris, and scattered snow patches."
        }
    ],
    "image_2": [
        {
            "entity_name": "IMAGE_2_PERSON-1.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'person'. The entity features are as follows:Person Features:- Gender: Male- Hairstyle: Short, dark hair- Expression: Not visible due to the angle and lighting- Age: Appears to be an adult male- Posture: Head turned to the side, profile viewOverall, the character gives off a mysterious vibe due to the low lighting and shadowy appearance."
        },
        {
            "entity_name": "IMAGE_2_PERSON-2.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'object'. The entity features are as follows:Object Features:- Name: Partial circular object- Color: Black silhouette, with no discernible color due to the lack of lighting or color information- Shape: Appears to be a segment of a circle or a crescent shape- Size: The size is difficult to determine due to the lack of context and reference objects; however, it appears to be a medium-sized segment relative to the frame- Material: The material cannot be determined from the image as there are no texture details visible- Possible function: The function is unclear due to the limited information provided by the image. It could be part of a larger object, such as a wheel, a decorative element, or an abstract art piece.Overall, the image shows a black silhouette of a partial circular object with no additional details to provide further context or identification."
        },
        {
            "entity_name": "IMAGE_2_PERSON-3.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'person'. The entity features are as follows:Person Features:- Gender: Male- Skin Color: Dark skin tone- Hairstyle: Short, dark hair with a slight wave- Facial Expression: Serious or intense expression, eyes focused and mouth closed- Age: Appears to be an adult male- Clothing: Wearing a dark-colored jacket with a high collar, partially visible in the frame- Posture: Head turned slightly to the side, giving a profile viewOverall, the character gives off a serious and intense vibe, possibly indicating a moment of concentration or determination."
        },
        {
            "entity_name": "IMAGE_2_PERSON-7.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'person'. The entity features are as follows:Person Features:- Gender: Male- Skin Color: Dark skin tone- Hairstyle: Short, curly hair- Facial Expression: Neutral to serious expression- Age: Appears to be an adult male- Clothing: Wearing a dark-colored garment with a high collar and detailed patterns; the garment appears historical or ceremonial in nature- Posture: Sitting position, with one hand resting on what appears to be a weapon or staffOverall, the character gives off an authoritative and dignified appearance, possibly representing a figure of historical significance or a leader."
        },
        {
            "entity_name": "IMAGE_2_PERSON-6.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'object'. The entity features are as follows:Object Features:- Name: Basketball- Color: Dark, possibly black or deep navy blue- Shape: Spherical- Size: Standard basketball size, approximately 24 cm in diameter- Material: Appears to be made of a synthetic material, typical of modern basketballs- Possible function: Used for playing the sport of basketball, which involves two teams trying to score points by throwing the ball through the other team's hoop- Other significant characteristics: The surface has a textured pattern, which is common for providing better grip during play. The ball appears to be inflated and ready for use."
        },
        {
            "entity_name": "IMAGE_2_PERSON-4.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'object'. The entity features are as follows:Object Features:- Name: Unidentifiable object- Color: Not discernible due to the black background and lack of visible features- Shape: Cannot be determined from the provided image feature block- Size: Cannot be determined from the provided image feature block- Material: Cannot be determined from the provided image feature block- Possible function: Cannot be determined from the provided image feature blockGiven the complete darkness in the image, it is not possible to provide further details about the object."
        },
        {
            "entity_name": "IMAGE_2_PERSON-5.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'person'. The entity features are as follows:Person Features:- Gender: Male- Skin Color: Dark skin tone- Hairstyle: Short, dark hair- Facial Expression: Not fully visible, but appears to be serious or focused- Age: Appears to be an adult male- Clothing: Wearing a red jacket with a high collar and a black shirt underneath; the jacket has a textured pattern and appears to be made of a heavy material- Posture: Standing in a side profile, with one arm raised and holding an object that is not fully visible in the imageOverall, the character gives off a strong and determined vibe, possibly indicating a role that involves action or confrontation."
        },
        {
            "entity_name": "IMAGE_2_BUS-0.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'object'. The entity features are as follows:Object Features:- Name: Bus- Color: Primarily dark, with illuminated windows and signs- Shape: Rectangular, typical of a public transportation bus- Size: Large, consistent with the size of a standard city bus- Material: Metal and glass, common materials for bus construction- Possible function: Public transportation, designed to carry multiple passengers- Other significant characteristics: The bus has multiple windows, some of which are lit from the inside, indicating it is in use. There are visible passengers inside, suggesting it is currently in service. The sign on the side of the bus indicates a fare of \"$6 FOR 2 HRS,\" suggesting it operates on a pay-per-ride system. The bus number \"20833\" is also visible, which is likely used for identification and scheduling purposes."
        },
        {
            "entity_name": "IMAGE_2_PERSON-8.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'person'. The entity features are as follows:Person Features:- Gender: Male- Skin Color: Dark- Hairstyle: Short, dark hair- Facial Expression: Not visible due to the mask- Age: Appears to be an adult male- Clothing: Wearing a black suit with a high collar and a long coat; the suit appears to be made of a heavy, durable material- Accessories: Wearing a large, detailed mask that covers the entire face; the mask has a metallic sheen and intricate designs, suggesting it might be part of a costume or armor- Posture: Sitting in a relaxed position with one arm resting on the back of the chair and the other hanging downOverall, the character gives off a mysterious and possibly menacing vibe, enhanced by the elaborate mask and dark attire."
        },
        {
            "entity_name": "IMAGE_2",
            "entity_type": "ORI_IMG",
            "description": "The image depicts a bustling urban scene at dusk or early evening. In the foreground, there is a double-decker bus with passengers visible through the windows. The bus has a sign indicating a fare of $6 for 2 hours. The upper deck is partially filled with people, some of whom are looking out the windows. The lower deck is less visible but appears to have a few passengers as well. The bus is in front of a large building with the name 'The Mirage' prominently displayed in bright lights. The building features a large advertisement for the Beatles LOVE show by Cirque du Soleil. The sky is darkening, suggesting it is either dusk or early evening. Palm trees are visible in the background, adding to the tropical ambiance of the scene. The overall atmosphere is lively and dynamic, typical of a busy city street near a popular tourist destination."
        },
        {
            "entity_name": "THE MIRAGE",
            "entity_type": "ORGANIZATION",
            "description": "A hotel and casino in Las Vegas, featuring a large billboard with the faces of The Beatles and the word 'LOVE' on it."
        },
        {
            "entity_name": "BUS",
            "entity_type": "OBJECT",
            "description": "A public transportation bus with passengers inside, driving past The Mirage."
        },
        {
            "entity_name": "PASSENGERS",
            "entity_type": "PERSON",
            "description": "People sitting inside the bus, some looking out the windows."
        },
        {
            "entity_name": "PALM TREES",
            "entity_type": "GEO",
            "description": "Tall palm trees located in front of The Mirage building."
        }
    ],
    "image_3": [
        {
            "entity_name": "IMAGE_3_MOTORCYCLE-2.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'object'. The entity features are as follows:Object Features:- Name: Water meters- Color: Predominantly blue and yellow, with some parts in gray and brown- Shape: Cylindrical with various protrusions and connectors- Size: Varies, but generally compact and designed to fit into pipes or walls- Material: Metal, plastic, and rubber components- Possible function: These objects are used for measuring the amount of water used by a building or residence. They are typically installed on the main water supply line and provide readings that can be used for billing purposes or monitoring water usage.- Other significant characteristics: The meters have dials and digital displays for reading the measurements, and they are equipped with various fittings and valves for installation and maintenance. Some meters appear to be older models, showing signs of wear and rust, while others look newer and more robust."
        },
        {
            "entity_name": "IMAGE_3_BOTTLE-1.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'object'. The entity features are as follows:Object Features:- Name: Fishing Reel- Color: Predominantly blue with white and black accents- Shape: Circular with a handle for winding the line- Size: Appears to be of a standard size for fishing reels, suitable for use with a fishing rod- Material: Likely made from a combination of metal and plastic, common materials for fishing reels- Possible Function: Used for casting and retrieving fishing lines during angling activities- Other Significant Characteristics: The reel has a brand logo and text indicating its specifications or model number, which is partially visible. It also features a design that suggests it is built for durability and ease of use in various fishing conditions.Overall, this fishing reel appears to be a well-designed tool for recreational fishing, combining functionality with aesthetic appeal."
        },
        {
            "entity_name": "IMAGE_3_BOTTLE-0.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'object'. The entity features are as follows:Object Features:- Name: Pot- Color: Blue with a white lid- Shape: Round, with a wide mouth and a narrow base- Size: Appears to be medium-sized, suitable for holding food or liquids- Material: Likely ceramic or enameled metal, given the smooth texture and glossy finish- Possible function: Used for cooking or serving food, possibly for boiling or simmering dishesOverall, the pot appears to be a practical kitchen item designed for culinary use."
        },
        {
            "entity_name": "IMAGE_3",
            "entity_type": "ORI_IMG",
            "description": "The image depicts a pile of defunct water meters scattered on the ground. The meters are of various sizes and shapes, predominantly blue and yellow in color. Some meters have visible damage, with parts missing or broken. The background appears to be a concrete surface, suggesting an industrial or storage setting. The meters are interconnected with wires and pipes, indicating they were once part of a larger system. The overall scene conveys a sense of disuse and abandonment, highlighting the failure of infrastructure. The caption indicates that these are defunct water meters from Moss Point, Mississippi, which aligns with the context provided about water crises and infrastructure issues in the region."
        },
        {
            "entity_name": "MOTORCYCLE",
            "entity_type": "UNKNOWN",
            "description": "The image feature block image_3_motorcycle-2.jpg is a picture of a motorcycle."
        },
        {
            "entity_name": "BOTTLE",
            "entity_type": "UNKNOWN",
            "description": "The image feature block image_3_bottle-1.jpg is a picture of a bottle."
        },
        {
            "entity_name": "WATER METERS",
            "entity_type": "UNKNOWN",
            "description": "Water Meters是从image_3中提取的实体。"
        },
        {
            "entity_name": "RORY DOYLE",
            "entity_type": "UNKNOWN",
            "description": "Rory Doyle是从image_3中提取的实体。"
        },
        {
            "entity_name": "THE NEW YORK TIMES",
            "entity_type": "UNKNOWN",
            "description": "The New York Times是从image_3中提取的实体。"
        }
    ],
    "image_4": [
        {
            "entity_name": "IMAGE_4_PERSON-0.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'person'. The entity features are as follows:Person Features:- Gender: Male- Skin Color: Fair- Hairstyle: Short, white hair that is thinning on top- Facial Expression: Smiling with a friendly and approachable expression- Age: Appears to be an older adult- Clothing: Wearing a dark suit jacket, a white dress shirt, and a tie- Posture: Standing upright with one arm raised in a waving gestureOverall, the individual appears to be engaging with an audience or greeting someone."
        },
        {
            "entity_name": "IMAGE_4_TIE-1.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'object'. The entity features are as follows:Object Features:- Name: Feather- Color: White- Shape: Elongated and slender, with a central shaft (rachis) and finer filaments (barbs) branching off from either side- Size: Appears to be relatively small, typical of a bird's feather- Material: Keratin, which is a protein found in the outer layer of skin cells of vertebrates- Possible Function: Feathers serve multiple purposes for birds, including flight, insulation, waterproofing, and displayOverall, the feather appears delicate and lightweight, designed for aerodynamic efficiency and thermal regulation."
        },
        {
            "entity_name": "IMAGE_4",
            "entity_type": "ORI_IMG",
            "description": "The image shows an elderly man with white hair and a friendly expression, waving his right hand in greeting. He is dressed in a dark blue suit with a light blue shirt and a patterned tie. The background appears to be indoors, possibly in a formal setting, with wooden paneling and a painting or framed artwork on the wall. The man's posture is upright, and he seems to be engaging with someone or addressing an audience. The overall atmosphere conveyed by the image is one of warmth and approachability."
        },
        {
            "entity_name": "PRINCE CHARLES",
            "entity_type": "PERSON",
            "description": "An elderly man with white hair, wearing a dark suit and tie, waving his right hand."
        },
        {
            "entity_name": "SUIT",
            "entity_type": "UNKNOWN",
            "description": "Prince Charles is dressed in a dark suit."
        },
        {
            "entity_name": "TIE",
            "entity_type": "UNKNOWN",
            "description": "Prince Charles is wearing a tie with his suit."
        },
        {
            "entity_name": "WAVE",
            "entity_type": "UNKNOWN",
            "description": "Prince Charles is waving his right hand."
        }
    ],
    "image_5": [
        {
            "entity_name": "IMAGE_5_PERSON-0.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'person'. The entity features are as follows:Person Features:- Gender: Female- Skin Color: Dark skin tone- Hairstyle: Curly, voluminous hair, dark in color- Expression: Smiling with an open mouth, showing teeth, and eyes wide open, giving a joyful and energetic impression- Age: Appears to be an adult woman- Clothing: Wearing a form-fitting, long-sleeved outfit that is predominantly pink with darker patterns, resembling a costume or performance attire- Posture: Standing with arms outstretched and one leg slightly bent, suggesting movement or dancingOverall, the character appears to be engaged in a lively activity, possibly dancing or performing, given the dynamic posture and expressive facial features."
        },
        {
            "entity_name": "IMAGE_5_CELL PHONE-1.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'object'. The entity features are as follows:Object Features:- Name: Smartphone- Color: The smartphone has a black front with a blue and yellow pattern on the back.- Shape: Rectangular with rounded corners.- Size: Standard smartphone size, easily portable.- Material: The front appears to be made of glass, while the back seems to have a textured material, possibly plastic or metal with a design.- Possible Function: Used for communication, internet browsing, taking photos, and various other applications typical of smartphones.- Other Significant Characteristics: The screen displays a colorful interface, suggesting it is turned on and in use. The design on the back is vibrant and eye-catching, indicating a possible focus on aesthetic appeal."
        },
        {
            "entity_name": "IMAGE_5",
            "entity_type": "ORI_IMG",
            "description": "The image depicts a person with long, curly hair wearing a form-fitting, sheer dress with a pattern that appears to be of a digital or pixelated nature. The individual is in motion, possibly dancing or walking energetically, as suggested by the dynamic posture and the position of the arms and legs. The person is holding a smartphone in one hand, which displays a colorful screen, possibly indicating an app or game. The background is abstract with soft, pastel colors, primarily pink and white, giving the scene a dreamy and surreal atmosphere. The overall mood conveyed by the image is one of joy and movement, with a modern, digital aesthetic."
        },
        {
            "entity_name": "WOMAN",
            "entity_type": "PERSON",
            "description": "A woman with curly hair, wearing a sheer dress, holding a smartphone in her right hand and extending her left leg."
        },
        {
            "entity_name": "SMARTPHONE",
            "entity_type": "OBJECT",
            "description": "A blue and white smartphone being held by the woman."
        },
        {
            "entity_name": "BACKGROUND",
            "entity_type": "GEO",
            "description": "A pastel-colored background with shades of pink and purple."
        }
    ],
    "image_6": [
        {
            "entity_name": "IMAGE_6_BIRD-2.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'organism'. The entity features are as follows:Organism Features:- Species: Bird, specifically a parrot- Color: Predominantly green with shades of yellow and white on the face and neck- Shape: The bird has a curved beak typical of parrots, with a visible eye ring that is characteristic of some parrot species- Size: The image shows a close-up, so the exact size is not clear, but parrots generally range from small to medium-sized birds- Posture: The bird appears to be in a neutral position, possibly perched, with its head turned slightly to one sideOverall, the bird exhibits features common to parrots, such as a strong, curved beak and a vibrant coloration."
        },
        {
            "entity_name": "IMAGE_6_PERSON-0.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'person'. The entity features are as follows:Person Features:- Gender: Male- Skin Color: Light- Hairstyle: Short, dark hair- Facial Expression: Not visible due to the angle and cropping of the image- Age: Appears to be an adult male- Clothing: Wearing a light-colored shirt with a collar- Posture: Standing upright, but only the upper part of the body is visibleOverall, the image shows a partial view of a man's upper body, focusing on his neck and part of his head."
        },
        {
            "entity_name": "IMAGE_6_PERSON-1.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'person'. The entity features are as follows:Person Features:- Gender: Not discernible from the image- Skin color: Light skin tone- Hand posture: The hand is in a pinching gesture, with the thumb and index finger close together, suggesting the action of picking up or holding a small object- Clothing: Wearing a white shirt with a smooth texture, visible at the wrist area- Accessories: A silver watch band is visible on the wrist, indicating the person might be wearing a watchOverall, the image captures a close-up of a hand performing a precise action, likely interacting with a small object."
        },
        {
            "entity_name": "IMAGE_6_PERSON-3.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'person'. The entity features are as follows:Person Features:- Gender: Not clearly identifiable due to the limited view, but the hand appears to be that of an adult- Skin color: Light skin tone- Hairstyle: Not visible in the image- Clothing: Wearing a light-colored shirt with a white collar and a dark suit jacket- Posture: The hand is positioned with the fingers pinching a small piece of paper or cloth between the thumb and forefinger- Accessories: No visible accessories on the handThe image captures a close-up of a hand performing a delicate action, possibly related to a professional or formal context given the attire."
        },
        {
            "entity_name": "IMAGE_6",
            "entity_type": "ORI_IMG",
            "description": "The image depicts a green parakeet being held by a person's hand. The bird appears to be receiving a dose of CBD oil, which is being administered directly into its mouth using a dropper. The parakeet has bright green feathers with a lighter shade around the eyes and a small patch of yellow on its face. Its eyes are wide open, and it seems to be looking up at the dropper. The person holding the bird has neatly trimmed nails and is wearing a white sleeve, suggesting a clinical or veterinary setting. The background is blurred but appears to be an indoor environment, possibly a veterinary clinic. The overall atmosphere conveys a sense of care and medical treatment."
        },
        {
            "entity_name": "PARROT",
            "entity_type": "ANIMAL",
            "description": "A small green parrot with a curious expression, being held by a person."
        },
        {
            "entity_name": "PERSON",
            "entity_type": "PERSON",
            "description": "A person holding the parrot and administering a liquid through a syringe into its beak."
        },
        {
            "entity_name": "SYRINGE",
            "entity_type": "OBJECT",
            "description": "A medical syringe used to administer liquid to the parrot."
        }
    ]
}