{
  "chunk-484412d0c09a480d2888649880c42bf5": {
    "tokens": 1200,
    "content": "VOL. CLXXIII . . . . No. 60,056 © 2024  The New York Times Company  \n\nTUESDAY, FEBRUARY 6, 2024  \n\n![](images/image_1.jpg)  \nWAR-WEARY Ukrainian troops in Vuhledar, on the eastern front line, where they are outmanned, outgunned and digging in. Page A6.  \n\n# Zelensky Plans A Major ‘Reset’ In Leadership  \n\n# By MARC SANTORA and ANDREW E. KRAMER  \n\nKYIV,  Ukraine  —  President Volodymyr Zelensky of Ukraine said that a broad overhaul of the country’s  military  and  civilian leadership was needed to reboot the war effort against Russia, suggesting that a major shake-up of his government was imminent. Mr. Zelensky’s comments, in a broadcast on Sunday night, indicated that his plans would likely go beyond replacing the top military commander, Gen. Valeriy Zaluzhny.  And  they  signaled  a search for a new strategy among Ukraine’s leadership at a precarious  moment,  with  depleted Ukrainian forces on the defensive and leaders in Kyiv waiting to see whether the United States will provide  much-needed  military and financial assistance.  \n\n“A reset, a new beginning is necessary,” Mr. Zelensky told the Italian media outlet Rai News. “I have something serious in mind, which is not about a single person but about the direction of the country’s leadership.”  \n\nFriction between the military and the civilian government represents the most serious schism in Ukraine’s  leadership  since  the start of the war almost two years ago. The acrimony, which has been building for months, seemed to reach a breaking point last week, when Mr. Zelensky summoned General Zaluzhny for a meeting to tell him he was being fired, only to back off at least temporarily, according to Ukrainian officials familiar with the discussion.  \n\nHeightening the tension in Kyiv is the prospect of a new mobilization bill that could lead to the drafting of up to 500,000 troops. The  bill,  under  debate  in  the  \n\n# Trump Wields Pomp of Past as a Campaign Tool  \n\nThis article is by Jonathan Swan, Maggie Haberman and Shane Goldmacher.  \n\nOnly five days after Donald J. Trump left office, one of his aides emailed a lawyer to request approval of a formal-looking seal for use on statements from the office of the 45th president.  \n\nMargo Martin, one of his closest personal aides, told the lawyer, Scott Gast, that consultants had designed a subtly modified seal for Mr. Trump. “They said they changed a few things to avoid trademark issues,” she wrote, asking Mr. Gast if the design was acceptable.  \n\nThe eventual image that Mr. Trump’s team used — a recognizable eagle from the Great Seal of the United States, placed in a cirAn Ex-President Who Is Determined Not to Act Like One  \n\ncle — was evocative of the presidential seal that identified Mr. Trump with the job he had just left. And while he is hardly the first former White House occupant to affix an eagle to his website, the early conversations about presidential imagery revealed what has turned out to be an important obsession of Mr. Trump’s: being seen as much as a future president as a former one. Mr. Trump vacated the White House before noon on Jan. 20, 202lasreguiredbytheConstitu rived home to Mar-a-Lago, his members-only club in Florida, he has grabbed at every opportunity to inhabit the role of an incumbent president, including by putting the typical trappings of a postpresidency to use in trying to reclaim the office.  \n\nAt a minimum, that approach may have helped to soothe Mr. Trump’s bruised ego. But it has indisputably become a crucial factor in his effort to return to power. A majority of Republican voters, polls show, view Mr. Trump not as a “defeated former president,” as President Biden often calls him, but as a wrongly deposed president whose re-election would amend a grave injustice. Elected Republicans who once privately mocked the conspiracy Continued on Page A11  \n\n![](images/image_2.jpg)  \n\nUneasy About Economy? Nevada Gets It.   \nA sense of insecurity is especially palpable in a state so dependent on the tourism industry. Page B1.  \n\n# Disparate Disasters in Chile and California Have the Same Culprit  \n\n# By SOMINI SENGUPTA  \n\nTwo far-flung corners of the world, known for temperate climates, are buffeted by deadly disasters. Wildfires have killed more than 120 people as they swept the forested hillsides of Chile, and record-breaking  rains have swelled rivers and led to mudslides in Southern California.  \n\nBehind these risks are two powerful  forces:  Climate  change, which can intensify both rain and drought, and the natural weather phenomenon known as El Niño, which can also supersize extreme weather.  \n\nIn  California,  meteorologists had been warning for days that an unusually strong storm, known as an atmospheric river, was gather  \n\n# El Niño and Warming  \n\n# Intensify Devastation  \n\ning force because of extraordinarily high Pacific Ocean temperatures. The rains began over the weekend and several counties were under a state of emergency.  \n\nBy Monday, officials warned that the Los Angeles area could be deluged by the equivalent of a year’s rainfall in a single day. In the southern hemisphere, Chile  has  been  reeling  from drought for the better part of a decade. That set the stage for a hellish weekend, when, amid a severe heat wave, wildfires broke Continued on Page A9  \n\n# NEWS ANALYSIS Many Israelis Want Premier Out, but How?",
    "chunk_order_index": 0,
    "full_doc_id": "doc-29288e148ceba18b28731eee35e12d7c"
  },
  "chunk-6149bfd33b041ee8e7cf5cf2f19d0535": {
    "tokens": 1200,
    "content": "were under a state of emergency.  \n\nBy Monday, officials warned that the Los Angeles area could be deluged by the equivalent of a year’s rainfall in a single day. In the southern hemisphere, Chile  has  been  reeling  from drought for the better part of a decade. That set the stage for a hellish weekend, when, amid a severe heat wave, wildfires broke Continued on Page A9  \n\n# NEWS ANALYSIS Many Israelis Want Premier Out, but How?  \n\n# BLINKEN HAS TALK WITH SAUDI ROYAL IN CEASE-FIRE BID  \n\n4 Ways, With Pitfalls, to Remove Netanyahu  \n\nBy STEVEN ERLANGER JERUSALEM — Prime Minister Benjamin Netanyahu of Israel is on his last legs, it is widely believed, and will be forced to relinquish his post once the war against Hamas in Gaza ends.  \n\nHe is historically unpopular in the opinion polls and blamed for the governmental and security failures that led to the Oct. 7 attack by Hamas, the killings of an estimated 1,200 Israelis and the difficult war that has followed. He faces a long-running trial on a variety of corruption charges.  \n\nAnd he has defied President Biden on American efforts to create a postwar path to a twostate solution, with a demilitarized Palestine alongside Israel. While opposition to a Palestinian state is popular among Israelis, defiance of Washington is considered risky.  \n\nBut Mr. Netanyahu, 74, known everywhere as “Bibi,” has been a remarkable dancer through the complicated choreography of Israeli politics, having survived many previous predictions of his downfall. And new elections in Israel are not legally required until late October 2026. “We’d all like to look past Bibi,”  \n\nNEW DIPLOMATIC PUSH Tour on Gaza War Starts as Drone Hits Base in Syria Used by U.S.  \n\nThis article is by Zolan KannoYoungs, Hwaida Saad, Vivian Yee and Michael Levenson.  \n\nRIYADH, Saudi Arabia — Secretary of State Antony J. Blinken began a diplomatic push in the Middle East on Monday for a deal that would pause the war in the Gaza Strip and release the hostages  there,  even  as  a  drone struck a military base used by American troops and allied forces in eastern Syria.  \n\nMr. Blinken, making his fifth trip to the region since the Oct. 7 attack on Israel, met in Riyadh with Saudi Arabia’s crown prince, Mohammed bin Salman, in the first stop on a trip that will also include meetings in Egypt, Qatar, Israel and the West Bank.  \n\nSpeaking  with  the  crown prince, the kingdom’s de facto ruler, Mr. Blinken “underscored the importance of addressing humanitarian needs in Gaza and preventing further spread of the conflict,” the State Department said. It added that they discussed “an enduring end to the crisis in Gaza that provides lasting peace and security for Israelis and Palestinians alike.”  \n\nwith the left-leaning newspaper Haaretz. “But there is no way to force him to resign.”  \n\nSo how might Mr. Netanyahu leave office before then? Here are the most likely paths, together with their pitfalls.  \n\nPath 1: His Coalition Collapses The simplest route to ousting Mr. Netanyahu is for his coalition to fall apart. He rules with 64 seats in the 120-member Knesset, or Parliament. So the defection of only five members would bring down the government, forcing elections within three months. Mr. Netanyahu leads the Likud  \n\nMr. Blinken is hoping to hammer out an agreement that could temporarily stop the war between Israel and Hamas in the Gaza Strip, secure the release of the remaining hostages there in exchange for Palestinians detained in Israeli jails, and allow more desperately needed aid into the territory.  \n\nBut even as Mr. Blinken sought to ease tensions in the region, a drone struck a base in eastern Syria that has housed American and allied troops, killing six Kurdish fighters, according to the official media outlet of the Syrian Democratic Forces, a Kurdish-led group.  \n\nparty, which won 32 seats in November 2022, the most of any party. But to form a government he had to bring in five other parties, including two tiny farright parties led by Bezalel Smotrich and Itamar Ben-Gvir. Their combined 13 seats keep Mr. Netanyahu in power, while they Continued on Page A5  \n\nMaj. Gen. Patrick S. Ryder, a Pentagon spokesman, said there were no reported U.S. injuries in the wake of the drone strike. The Syrian Democratic Forces blamed the attack on a militia group linked to Iran, which would make it the latest in a series of strikes by Iranian-backed militias Continued on Page A5  \n\n# Promises to Solve Water Woes Brought Even More Problems  \n\n# By SARAH FOWLER  \n\nJACKSON, Miss. — In winter 2021, more than 150,000 people living in Jackson were left without running water.  \n\nFaucets were dry or dribbling a muddy brown. For weeks, people across the city lost the water they normally relied on to drink, cook and bathe. With no way to flush their toilets, some parents sent their children into the woods to relieve  themselves.  Businesses closed. Mississippi’s capital effectively shut down.  \n\nThe next year, at the height of Mississippi’s sweltering summer in August 2022, it all happened again.  \n\nEach time Jackson faced a water crisis, local and state leaders cast blame in familiar directions. Lawmakers  criticized  city  officials for ignoring leaky pipes and failing to collect payments from customers. City officials pointed to Jackson’s shrinking population and decades of economic decline. And  they  said  state  officials, mostly white and Republican, had Defunct water meters at a",
    "chunk_order_index": 1,
    "full_doc_id": "doc-29288e148ceba18b28731eee35e12d7c"
  },
  "chunk-909a31c7ba06476f2df94b1bf924473c": {
    "tokens": 614,
    "content": "next year, at the height of Mississippi’s sweltering summer in August 2022, it all happened again.  \n\nEach time Jackson faced a water crisis, local and state leaders cast blame in familiar directions. Lawmakers  criticized  city  officials for ignoring leaky pipes and failing to collect payments from customers. City officials pointed to Jackson’s shrinking population and decades of economic decline. And  they  said  state  officials, mostly white and Republican, had Defunct water meters at a facility in Moss Point, Miss.  \n\n![](images/image_3.jpg)  \n\nstarved the mostly Black, Democratic city of resources. But the final blow was delivered by Siemens, a giant German corporation that had swept into town in 2010, boldly promising to install modern water meters that would boost revenue and return Jackson’s water system to a moneymaking enterprise that could afford to fix its crumbling infrastructure. ContinuedonPageA14  \n\n![](images/image_4.jpg)  \n\nINTERNATIONAL A4-9 King Charles III Has Cancer Buckingham Palace did not specify the type, but said Britain’s monarch would postpone his public duties. PAGE A8 Earth’s Temperature Ticks Up Research on long-lived sponges is helping scientists piece together a revised history of climate change. PAGE A4  \n\n# NATIONAL A10-15  \n\n10 Guards and 900 Inmates With warnings ignored, the basic operations at Wisconsin’s shorthanded prisons have deteriorated, leading to violence, lockdowns and escapes. PAGE A10 Backlash to Border Deal G.O.P. rejection of a bipartisan plan shows the intractable politics of an election year. News Analysis.  PAGE A12 SPORTS B8-11 Trading Places in a Rematch Four years ago, Kansas City’s offense overcame a dominant 49ers defense. This Super Bowl is different. PAGE B8 ARTS C1-8 Lots of Joy, Some Concerns The Grammys is now more diverse, but questions remain. Above, SZA won the award for the best R&B song.  PAGE C1 Bidding on Pretend Royalty Bonhams is selling costumes and props from “The Crown” TV series, including a horse-drawn carriage. PAGE C2  \n\n![](images/image_5.jpg)  \n\n# BUSINESS B1-7  \n\nF.A.A. Back Under Microscope Long seen as too lax, the Federal Aviation Administration is once again prompting congressional scrutiny of its oversight of Boeing after a door blew off a 737 Max jet. PAGE B1 Layoffs Continue at Big Tech Profits are up and the economy is strong. But the industry faces two challenges: paring down an unwieldy work force expansion during the pandemic and building A.I. PAGE B1 OPINION A18-19 Linda Greenhouse SCIENCE TIMES D1-8 Veterinary Cannabis Medicine While more people have been using medical marijuana, treating animals that way is just beginning. Above, Jerry the parakeet receiving CBD oil. PAGE D1  \n\n![](images/image_6.jpg)",
    "chunk_order_index": 2,
    "full_doc_id": "doc-29288e148ceba18b28731eee35e12d7c"
  }
}