{
    "chunk-e338f2b5d38281269693e22e586485ad": [
        {
            "entity_name": "Entity-GCN",
            "entity_type": "ORGANIZATION",
            "description": "A model developed for multi-hop question answering that uses graph neural networks for information propagation across documents. It includes an entity graph to relate mentions to entities within and across documents, a document encoder for obtaining representations of mentions in context, and a relational graph convolutional network for propagating information through the entity graph.",
            "source_entities": [
                "ENTITY-GCN",
                "ENTITY-GCN"
            ]
        }
    ],
    "chunk-5a1a3958377fab2e9f4d27bf18183d9a": [
        {
            "entity_name": "Entity-GCN",
            "entity_type": "ORGANIZATION",
            "description": "Entity-GCN is the full model that includes all components, showing effectiveness in utilizing the structure encoded in the graph. It is effective in making use of the graph structure and different types of relations, and is used to evaluate the performance of different models, particularly in the WIKIHOP validation set.",
            "source_entities": [
                "ENTITY-GCN",
                "ENTITY-GCN"
            ]
        },
        {
            "entity_name": "US and UNITED STATES",
            "entity_type": "GEO",
            "description": "US and UNITED STATES are variations of the same entity mention, showing the variation in mentions that the coreference system might not retrieve in the unmasked setting.",
            "source_entities": [
                "US",
                "UNITED STATES"
            ]
        }
    ],
    "chunk-93e927343e457bf92ee7a74ecfafb2b1": [
        {
            "entity_name": "EntityGCN",
            "entity_type": "ORGANIZATION",
            "description": "A model that performs well or poorly on certain types of questions, mentioned in the context of multi-document question answering and its performance on questions regarding places.",
            "source_entities": [
                "\"ENTITYGCN\"",
                "\"ENTITYGCN\""
            ]
        },
        {
            "entity_name": "Wikipedia",
            "entity_type": "ORGANIZATION",
            "description": "A source of information that may have mismatches with what is annotated in Wikidata, affecting model performance and used as a reference for model comparison.",
            "source_entities": [
                "\"WIKIPEDIA\"",
                "\"WIKIPEDIA\""
            ]
        },
        {
            "entity_name": "Wikidata",
            "entity_type": "ORGANIZATION",
            "description": "A knowledge base that contains annotations that may differ from information in Wikipedia, impacting model accuracy and used for comparison with Wikipedia.",
            "source_entities": [
                "\"WIKIDATA\"",
                "\"WIKIDATA\""
            ]
        },
        {
            "entity_name": "US and UNITED STATES",
            "entity_type": "GEO",
            "description": "A geo-location used to illustrate entity mention differences and the concept of different degrees of granularity in entity mentions, compared with 'US' and 'London'.",
            "source_entities": [
                "\"US\"",
                "\"UNITED STATES\""
            ]
        },
        {
            "entity_name": "Graph Neural Networks",
            "entity_type": "CONCEPT",
            "description": "A type of model that has been successful on various NLP tasks, including document level modeling, and mentioned in the context of multi-document QA and knowledge base reasoning.",
            "source_entities": [
                "\"GRAPH NEURAL NETWORKS\"",
                "\"GRAPH NEURAL NETWORKS\""
            ]
        }
    ],
    "chunk-16a889dd9a6291bb9f96fc416a0d6f91": [
        {
            "entity_name": "Dutch Organization for Scientific Research (NWO)",
            "entity_type": "ORGANIZATION",
            "description": "The Dutch Organization for Scientific Research (NWO) is an organization that funds scientific research, providing grants such as VIDI 639.022.518 and VICI Grant nr. 277-89-002 to support researchers like Wilker Aziz.",
            "source_entities": [
                "DUTCH ORGANIZATION FOR SCIENTIFIC RESEARCH",
                "Dutch Organisation for Scientific Research"
            ]
        }
    ],
    "chunk-58bed125e330c1a287e0baef935f2136": [
        {
            "entity_name": "Entity-GCN",
            "entity_type": "ORGANIZATION",
            "description": "Entity-GCN is a model evaluated for its performance and instances of failure in the WIKIHOP development set. It is also analyzed in terms of its accuracy with respect to the input graph size, specifically candidate and node set sizes.",
            "source_entities": [
                "ENTITY-GCN",
                "ENTITY-GCN"
            ]
        }
    ]
}