{
    "chunk-6a1862c1200f3971d9c39eab05cd7fa2": [
        {
            "entity_name": "Wodzisaw lski (WODZISAW LSKI)",
            "entity_type": "GEO",
            "description": "Wodzisaw lski is a town in Silesian Voivodeship, southern Poland, mentioned in the context of Witold Cichy's background and used as an example in fact inference.",
            "source_entities": [
                "WODZISAW LSKI",
                "Wodzisaw lski"
            ]
        }
    ],
    "chunk-d5683a5861bc57565129ae8c176a8aea": [
        {
            "entity_name": "WIKIHOP",
            "entity_type": "ORGANIZATION",
            "description": "WIKIHOP is a dataset used for evaluating model performance in an open-domain setting, with both standard and masked setups to assess the ability of models to rely on context rather than lexical cues.",
            "source_entities": [
                "WIKIHOP",
                "WIKIHOP"
            ]
        },
        {
            "entity_name": "MEDHOP",
            "entity_type": "ORGANIZATION",
            "description": "MEDHOP is a dataset used for evaluating model performance, specifically in the context of drug interactions, with both standard and masked setups to assess the ability of models to rely on context rather than lexical cues.",
            "source_entities": [
                "MEDHOP",
                "MEDHOP"
            ]
        }
    ],
    "chunk-728223dc801f8e71465cbb47fef4b6e3": [
        {
            "entity_name": "Schoenmackers et al.",
            "entity_type": "Event",
            "description": "The event refers to the publication or research conducted by Schoenmackers and colleagues in 2008 and 2010, addressing limited coverage, inefficient inference, and efforts to circumvent sparsity in approaches.",
            "source_entities": [
                "SCHOENMACKERS ET AL., 2008",
                "SCHOENMACKERS ET AL., 2010"
            ]
        },
        {
            "entity_name": "Shen et al.",
            "entity_type": "Event",
            "description": "The event refers to the publication or research conducted by Shen and colleagues in 2017, demonstrating end-to-end language understanding approaches for answering questions directly from text and related to query reformulation techniques using neural reinforcement learning.",
            "source_entities": [
                "SHEN ET AL., 2017",
                "SHEN ET AL., 2017"
            ]
        },
        {
            "entity_name": "Nogueira and Cho",
            "entity_type": "Event",
            "description": "The event refers to the publication or research conducted by Nogueira and Cho in 2016 and 2017, addressing the expansion of the document set available to a QA system through web navigation and query reformulation techniques using neural reinforcement learning.",
            "source_entities": [
                "NOGUEIRA AND CHO, 2016",
                "NOGUEIRA AND CHO, 2017"
            ]
        }
    ]
}