{
  "chunk-625f261212df523575922a2ca2ef28a0": {
    "tokens": 1200,
    "content": "\"All the News That's Fit to Print\"  \n\n# Che Xew lork Cimes  \n\nVOL. CLXXI . . . . No. 59,495 © 2022  The New York Times Company NEW YORK, MONDAY, JULY 25, 2022  \n\n\\$3.00  \n\nCongo’s about-face in allowing new oil drilling in environmentally sensitive areas comes eight months after its president, Félix Tshisekedi, stood alongside world leaders at the global climate summit in Glasgow and endorsed a 10- year agreement to protect its rainforest, part of the vast Congo Basin, which is second in size only to the Amazon.  \n\nThe deal included international pledges of \\$500 million for Congo, one of the world’s poorest nations, over the first five years.  \n\nPolicy May Accelerate Global Warming  \n\nBut since then, the world’s immediate priorities have shifted. Russia’s  invasion  of  Ukraine sent oil prices soaring and led to U.S. and British bans on Russian energy and, last week, a call to ration natural gas in Europe.  \n\nThis article is by Stefanos Chen, Ted Clifford and Camellia Burris. Over the past dozen years, Sanford Solny has built a New York real estate empire, snatching up small residential buildings across the city that churn out hundreds of thousands of dollars in rent. His portfolio would be enviable but for one thing — much of it, prosecutors  and  homeowners  \n\n![](images/image_1.jpg)  \nSome of the buildings in Sanford Solny’s formidable portfolio. There have been only 27 deed theft cases since 2014 in Brooklyn.  \n\nDAKAR, Senegal — The Democratic Republic of Congo, home to one of the largest old-growth rainforests on earth, is auctioning off vast amounts of land in a push to become “the new destination for oil investments,” part of a global shift as the world retreats on fighting climate change in a scramble for fossil fuels.  \n\nThe oil and gas blocks, which will be auctioned in late July, extend into Virunga National Park, the world’s most important gorilla sanctuary, as well as tropical peatlands that store vast amounts of carbon, keeping it out of the atmosphere and from contributing to global warming.  \n\n“If oil exploitation takes place in these areas, we must expect a global climate catastrophe, and we will all just have to watch helplessly,” said Irene Wabiwa, who oversees the Congo Basin forest campaign for Greenpeace in Kinshasa.  \n\n# Congo to Allow More Oil Wells In Rainforests  \n\n# A Big New York Property Owner Is Accused of Stealing Homes  \n\n# By RUTH MACLEAN and DIONNE SEARCEY  \n\ncontend, was stolen. In criminal charges and lawsuits, they have accused him of fraud: offering to help homeowners facing foreclosure by arranging to pay off their mortgages, while actually tricking them into signing over their buildings  at  bargain-basement prices. In nearly every case, the mortgage was never paid, leaving the homeowner with no property but a pile of debt.  \n\nThe push, which two right-wing sheriffs’ groups have already endorsed, seeks to lend law enforcement credibility to the false claims and has alarmed voting rights advocates. They warn that it could cause chaos in future elections and further weaken trust in an  \n\n# Shelter From the Swelter  \n\nLAS VEGAS — An influential network of conservative activists fixated on the idea that former President Donald J. Trump won the 2020 election is working to recruit county sheriffs to investigate elections based on the false notion that voter fraud is widespread.  \n\nVisitors found shade at the Lincoln Memorial in Washington, as much of the U.S. saw summer’s first prolonged heat wave. Page A13.  \n\n![](images/image_2.jpg)  \n\n# When Those Behind a Badge Question the Vote  \n\n# By ALEXANDRA BERZON and NICK CORASANITI  \n\nAmerican voting system already battered  by  attacks  from  Mr. Trump and his allies. One of the conservative sheriffs’ groups, Protect America Now, lists about 70 members, and the other, the Constitutional Sheriffs and Peace Officers Association, does not list its membership but says it conducted training on various issues for about 300 of the nation’s roughly 3,000 sheriffs in re  \n\n# Deniers Are Recruiting Sheriffs, Unnerving Election Officials  \n\n# Courts Are Slow to Act in Deed Theft Cases  \n\nThe practice is known as deed theft, and as city and state officials promised to crack down on it, they homed in on Mr. Solny. The Brooklyn district attorney, whose office has charged him with taking the homes of seven families, called his behavior “despicable.” In Queens, prosecutors accused Mr. Solny and his associates of cheating 10 people out of their properties. The court appointed a monitor to scrutinize his transactions.  \n\nBut at least three sheriffs involved in the effort — in Michigan, Kansas and Wisconsin — have been carrying out their own investigations, clashing with election officials who warn that they are overstepping their authority and meddling in an area where they have little expertise.  \n\ncent years. It is unclear how many sheriffs will ultimately wade into election matters. Many aligned with the groups are from small, rural counties.  \n\n“I’m absolutely sick of it,” said Pam Palmer, the clerk of Barry County, Mich., where the sheriff has carried out an investigation into the 2020 results for more than Continued on Page A14  \n\nBut an examination by The New York Times has found that not only is Mr. Solny still profiting from buildings under dispute, city Continued on Page A17  \n\nWe’ve  all  seen  it,  we’ve  all cringed at it, we’ve all done it ourselves: talked to a baby like it was, you know, a baby.",
    "chunk_order_index": 0,
    "full_doc_id": "doc-9c7085c91e2c8acc9d862f43e65fbad7"
  },
  "chunk-f1aa38e03a2cdd3122f479f8a521b9a0": {
    "tokens": 1200,
    "content": ", Mich., where the sheriff has carried out an investigation into the 2020 results for more than Continued on Page A14  \n\nBut an examination by The New York Times has found that not only is Mr. Solny still profiting from buildings under dispute, city Continued on Page A17  \n\nWe’ve  all  seen  it,  we’ve  all cringed at it, we’ve all done it ourselves: talked to a baby like it was, you know, a baby. “Ooo, hellooooo baby!” you say, your voice lilting like a rapturously  accommodating  Walmart employee. Baby is utterly baffled by your unintelligible warble and your shamelessly doofus grin, but “baby so cuuuuuute!” Regardless of whether it helps to know it, researchers recently determined that this sing-songy baby  talk  —  more  technically known as “parentese” — seems to be nearly universal to humans around the world. In the most wide-ranging study of its kind, more than 40 scientists helped to gather and analyze 1,615 voice re  \n\nMr. O’Rourke is now raising more campaign cash than Mr. Abbott — \\$27.6 million to \\$24.9 million in the last filing — in a race that is likely to be among the most expensive of 2022.  \n\nSuddenly, improbably, perhaps unwisely, Texas Democrats are again daring to think — as they have  in  many  recent  election years — that maybe this could be the year.  \n\n# Do You Babble to Your Baby? So Does the Rest of the World.  \n\nThe unrelenting succession of death and difficulty facing Texans over the last two months has soured them on the direction of the state, hurting Gov. Greg Abbott and making the race for governor perhaps the most competitive since Democrats last held that office in the 1990s. Polls have shown a tightening, single-digit contest between Mr. Abbott, the two-term incumbent, and his ubiquitous Democratic challenger, the former congressman Beto O’Rourke.  \n\n# Texas Turmoil Jolts the Race For Governor  \n\nSUGAR LAND, Texas — One of the deadliest school shootings in U.S. history. The revival of a 1920s ban on abortion. The country’s worst episode of migrant death in recent memory. And an electrical grid, which failed during bitter cold, now straining under soaring heat.  \n\n# By J. DAVID GOODMAN  \n\nContinued on Page A16  \n\n# By OLIVER WHANG  \n\n“Kansas is the bull’s-eye of the United States in terms of its geography, but it’s also the bull’s-eye where all the energy that has emerged from the Supreme Court decision has now focused,” said Pastor Randy Frazee, who leads a large church in suburban Kansas City, and who like many clergy members supports giving legislators the power to restrict abortions.  \n\nKansas is a conservative state   \nwhere registered Republicans far   \noutnumber Democrats. But what   \nlimited public polling has been   \nconducted on abortion suggests a   \nrelatively tight race leading up to   \nthe Aug. 2 vote on whether to   \namend the State Constitution to Continued on Page A13  \n\ncordings from 410 parents on six continents, in 18 languages from diverse communities: rural and urban, isolated and cosmopolitan, internet savvy and off the grid, from hunter-gatherers in Tanzania to urban dwellers in Beijing. The results, published recently in the journal Nature Human Behavior, showed that in every one of these cultures, the way parents spoke and sang to their infants differed from the way they communicated with adults — and that those differences were profoundly similar from group to group. “We tend to speak in this higher pitch, high variability, like, ‘Ohh, heeelloo, you’re a baaybee!’” said  \n\nOVERLAND PARK, Kan. — Kansas voters will decide next week whether to remove protections of abortion rights from their State Constitution, providing the first electoral test of Americans’ attitudes on the issue since the Supreme Court overturned Roe v. Wade.  \n\nQUESTION ON ABORTION  \n\n# KANSAS ELECTION POSES FIRST TEST AFTER ROE’S FALL  \n\nMoney, advertising and attention have flooded into the campaign since the ruling last month, returning Kansas to the forefront of the nation’s abortion debate, a place it has occupied frequently and  sometimes  violently  over many decades. Combined, the two sides have spent more than \\$11 million on the election this year. “I’ve never been so enraged for so long,” said Courtney Schmitz, who volunteered for the first time in her life to work at a campaign phone bank after the Supreme Court ruling. Ms. Schmitz, who works in early-childhood education and lives in suburban Kansas City, said she felt “a sense of duty” to make sure women from states where abortion was now banned could continue to get abortions in Kansas.  \n\nThe  election  could  give  the state’s Republican-controlled Legislature authority to pass new abortion limits or to outlaw the procedure entirely, potentially reshaping the map of abortion access in the nation’s center. The vote, which has been planned since last year but took on far higher stakes after the federal right to abortion was eliminated, is expected to send a message far beyond Kansas as politicians nationwide  weigh  new  abortion measures and watch for signs of how the public is reacting.  \n\nLawmakers Could Gain Authority for Ban or Further Limits  \n\n# By MITCH SMITH  \n\n![](images/image_3.jpg)  \n\nINTERNATIONAL A4-11 Finding Solace Amid War In a desolate apartment complex outside Kharkiv, Ukraine, survivors take comfort in one another. PAGE A10 Medical Crimes and Nazis A report on the University of Strasbourg’s takeover during World War II sheds light on a dark",
    "chunk_order_index": 1,
    "full_doc_id": "doc-9c7085c91e2c8acc9d862f43e65fbad7"
  },
  "chunk-e9e3e5db7c871eceddadfa7b878a4638": {
    "tokens": 478,
    "content": "new  abortion measures and watch for signs of how the public is reacting.  \n\nLawmakers Could Gain Authority for Ban or Further Limits  \n\n# By MITCH SMITH  \n\n![](images/image_3.jpg)  \n\nINTERNATIONAL A4-11 Finding Solace Amid War In a desolate apartment complex outside Kharkiv, Ukraine, survivors take comfort in one another. PAGE A10 Medical Crimes and Nazis A report on the University of Strasbourg’s takeover during World War II sheds light on a dark period.  PAGE A4  \n\n# NATIONAL A12-17, 20  \n\nNo More Pet Store Puppies? A bill prohibiting the sale of dogs, cats and rabbits in New York shops awaits the governor’s decision. PAGE A15 Examining a Student’s Death The University of Utah acknowledged missteps in its response to concerns about a student who was killed. PAGE A14  \n\n# OBITUARIES D7-8  \n\nDesigner Known as Mr. Color Carleton Varney was trained by the decorator Dorothy Draper and inherited her aversion to the bland and the beige. He was 85. PAGE D8  \n\n![](images/image_4.jpg)  \n\n# SPORTS D1-6  \n\nStyle, on the Court and Off Players in women’s basketball are styling themselves however they want. And for many, it’s paying off. PAGE D1 A Sudden Ascent to the Top Jonas Vingegaard, 25, won the Tour de France in only his second time riding cycling’s most prestigious race. PAGE D6  \n\n# BUSINESS B1-6  \n\nBig Tech Wants in the Game Companies like Apple and Amazon, seeking more viewers for their streaming services, are competing for rights to broadcast games from the N.F.L. and other sports leagues. PAGE B1 Gen Z Designers Set Up Shop Depop, a social shopping app, became a springboard for young talent in the fashion world, and some of its most successful creators are going into business for themselves. PAGE B1  \n\n# OPINION A18-19  \n\n# Charles M. Blow  \n\n![](images/image_5.jpg)  \n\n# ARTS C1-6  \n\nWhat She Sees in Glasses What makes Meryl Streep such a fine actress? Maybe it’s all that eyewear she puts on, takes off, waves around and sometimes even looks through. PAGE C1",
    "chunk_order_index": 2,
    "full_doc_id": "doc-9c7085c91e2c8acc9d862f43e65fbad7"
  }
}