{
    "chunk-fc8cd8056074dc0bf9f555f4d74b9ff9": [
        {
            "entity_name": "Tweedledum ('DUM', 'First Boy')",
            "entity_type": "PERSON",
            "description": "One of the two characters, often paired with Tweedledee, known for their peculiar behavior and logic. He is identified by the 'DUM' embroidery on his collar and is referred to as 'First Boy' by Alice.",
            "source_entities": [
                "\"TWEEDLEDUM\"",
                "\"THE FIRST BOY\""
            ]
        },
        {
            "entity_name": "Tweedledee ('DEE', 'Next Boy')",
            "entity_type": "PERSON",
            "description": "The other character, often paired with Tweedledum, known for their peculiar behavior and logic. He is identified by the 'DEE' embroidery on his collar and is referred to as 'Next Boy' by Alice.",
            "source_entities": [
                "\"TWEEDLEDEE\"",
                "\"THE NEXT BOY\""
            ]
        },
        {
            "entity_name": "The Dance ('The Music', 'The Song')",
            "entity_type": "EVENT",
            "description": "An event where Alice, Tweedledum, and Tweedledee dance around in a ring, accompanied by music that seems to be played by the branches of the tree they are under, and Alice finds herself singing 'Here we go round the mulberry bush.'",
            "source_entities": [
                "\"THE DANCE\"",
                "\"THE MUSIC\"",
                "\"THE SONG\""
            ]
        }
    ],
    "chunk-a9c7c0e77b59631f5144953245b536d2": [
        {
            "entity_name": "Tweedledee and Tweedledum",
            "entity_type": "PERSON",
            "description": "Tweedledee and Tweedledum are twins who tell the story of the Walrus and the Carpenter to Alice. They also lead Alice to see the Red King.",
            "source_entities": [
                "TWEEDLEDEE",
                "TWEEDLEDUM"
            ]
        },
        {
            "entity_name": "The Walrus and the Carpenter",
            "entity_type": "PERSON",
            "description": "The Walrus and the Carpenter are characters in a story told by Tweedledee and Tweedledum, who lure oysters for a meal and engage in conversation with them.",
            "source_entities": [
                "THE WALRUS",
                "THE CARPENTER"
            ]
        },
        {
            "entity_name": "The Sea and The Beach (Briny Beach)",
            "entity_type": "GEO",
            "description": "The sea and the beach, also referred to as the Briny Beach, are the geographical locations where the story of the Walrus and the Carpenter takes place, with the beach being the location where the Walrus and the Carpenter invite the oysters for a walk.",
            "source_entities": [
                "THE SEA",
                "THE BEACH",
                "BRINY BEACH"
            ]
        },
        {
            "entity_name": "The Sands",
            "entity_type": "GEO",
            "description": "The sands are part of the beach, described as being dry, and are mentioned in the context of the Walrus and the Carpenter's hypothetical cleaning.",
            "source_entities": [
                "THE SANDS"
            ]
        },
        {
            "entity_name": "Oysters",
            "entity_type": "PERSON",
            "description": "Oysters are characters in the story, depicted as being lured and eaten by the Walrus and the Carpenter, despite their initial eagerness and cleanliness.",
            "source_entities": [
                "OYSTERS",
                "ELDEST OYSTER"
            ]
        },
        {
            "entity_name": "The Sun and The Moon",
            "entity_type": "GEO",
            "description": "The Sun and the Moon are celestial bodies mentioned in the story, with the Sun shining on the sea during the middle of the night and the Moon shining sulkily because the Sun is present.",
            "source_entities": [
                "THE SUN",
                "THE MOON"
            ]
        },
        {
            "entity_name": "The Billows",
            "entity_type": "GEO",
            "description": "The Billows are part of the sea, described as being made smooth and bright by the Sun.",
            "source_entities": [
                "THE BILLOWS"
            ]
        },
        {
            "entity_name": "Conversation Topics",
            "entity_type": "GEO",
            "description": "Various topics mentioned in the conversation between the Walrus and the Oysters, including cabbages, kings, pigs, butter, pepper, vinegar, bread, sealing wax, ships, shoes, and clouds.",
            "source_entities": [
                "CABBAGES",
                "KINGS",
                "PIGS",
                "BUTTER",
                "PEPPER",
                "VINEGAR",
                "BREAD",
                "SEALING WAX",
                "SHIPS",
                "SHOES",
                "CLOUDS"
            ]
        },
        {
            "entity_name": "The Rock",
            "entity_type": "GEO",
            "description": "The Rock is the place where the Walrus and the Carpenter rest after walking a mile with the Oysters.",
            "source_entities": [
                "ROCK"
            ]
        }
    ],
    "chunk-54d4ffd5ce4e1f0b5fa0dcbae8c91a17": [
        {
            "entity_name": "Tweedledum and Tweedledee",
            "entity_type": "PERSON",
            "description": "Tweedledum and Tweedledee are two brothers who engage in conversation with Alice, often making bold claims and showing a range of emotions. They are involved in a dispute over a rattle and propose a battle, requiring Alice's assistance.",
            "source_entities": [
                "TWEEDLEDUM",
                "TWEEDLEDEE"
            ]
        },
        {
            "entity_name": "The Red King's Dream",
            "entity_type": "CONCEPT",
            "description": "The Red King's Dream is a central concept in the story, where the Red King's dream is discussed, and Alice's existence within it is questioned by Tweedledee. It also involves the debate on reality and the nature of existence within the dream.",
            "source_entities": [
                "DREAM",
                "REALITY"
            ]
        }
    ],
    "chunk-e88bbdcba879d85263d57e4dbfd1f008": [
        {
            "entity_name": "Tweedledum and Tweedledee",
            "entity_type": "PERSON",
            "description": "Two brothers who engage in a battle, dressing up in various items and planning to fight until a certain time. They are also known to have a toothache and headache on the day of the battle.",
            "source_entities": [
                "TWEEDLEDUM",
                "TWEEDLEDEE"
            ]
        },
        {
            "entity_name": "Alice",
            "entity_type": "PERSON",
            "description": "A character who interacts with Tweedledum and Tweedledee, helping them prepare for their battle and attempting to dissuade them from fighting. She also encounters the White Queen in the wood.",
            "source_entities": [
                "ALICE"
            ]
        },
        {
            "entity_name": "White Queen",
            "entity_type": "PERSON",
            "description": "A character who appears in the wood in a state of distress and is helped by Alice with her shawl. She seems to be muttering 'Bread-and-butter' to herself.",
            "source_entities": [
                "WHITE QUEEN"
            ]
        },
        {
            "entity_name": "Battle",
            "entity_type": "EVENT",
            "description": "The event in which Tweedledum and Tweedledee engage, dressing up in various items such as bolsters, blankets, hearth-rugs, table-cloths, dish-covers, and coal-scuttles, and planning to fight until a certain time. The battle is over a rattle.",
            "source_entities": [
                "BATTLE"
            ]
        },
        {
            "entity_name": "Wood",
            "entity_type": "GEO",
            "description": "The geographical location where the events take place, including the brothers' preparation for battle, Alice's encounter with the White Queen, and the anticipation of a thunderstorm.",
            "source_entities": [
                "WOOD"
            ]
        },
        {
            "entity_name": "Crow",
            "entity_type": "PERSON",
            "description": "A character that causes fear in Tweedledum and Tweedledee, prompting them to flee, and is associated with a hurricane-like wing flapping in the wood.",
            "source_entities": [
                "CROW"
            ]
        },
        {
            "entity_name": "Rattle",
            "entity_type": "GEO",
            "description": "The object over which the battle between Tweedledum and Tweedledee is fought, mentioned as a new one by Tweedledum.",
            "source_entities": [
                "RATTLE"
            ]
        },
        {
            "entity_name": "Umbrella",
            "entity_type": "GEO",
            "description": "Used as a weapon by Tweedledee in the battle, as an alternative to the sword, and described as quite sharp.",
            "source_entities": [
                "UMBRELLA"
            ]
        },
        {
            "entity_name": "Sword",
            "entity_type": "GEO",
            "description": "The weapon used by Tweedledum in the battle, mentioned as the only sword available.",
            "source_entities": [
                "SWORD"
            ]
        },
        {
            "entity_name": "Battle Protection Items",
            "entity_type": "GEO",
            "description": "Items used by Tweedledum and Tweedledee as protection in the battle, including bolsters, blankets, hearth-rugs, table-cloths, dish-covers, and coal-scuttles.",
            "source_entities": [
                "BOLSTER",
                "BLANKETS",
                "HEARTH-RUGS",
                "TABLE-CLOTHS",
                "DISH-COVERS",
                "COAL-SCUTTLES"
            ]
        },
        {
            "entity_name": "Helmet",
            "entity_type": "GEO",
            "description": "The item that Tweedledum wears on his head for protection in the battle, which resembles a saucepan.",
            "source_entities": [
                "HELMET"
            ]
        }
    ],
    "chunk-e0508a0320d927bcbf7f1e59996d97a0": [
        {
            "entity_name": "White Queen",
            "entity_type": "PERSON",
            "description": "A character in conversation with Alice, described as being in a state of disarray with her clothing and hair untidy. She discusses the concept of living backwards, where events happen in reverse order, and is also depicted as having a poor memory that works both ways. She is also the one who anticipates pricking her finger when fastening her shawl again.",
            "source_entities": [
                "\"WHITE QUEEN\"",
                "\"ALICE\"",
                "\"PRICKING\""
            ]
        },
        {
            "entity_name": "King's Messenger",
            "entity_type": "PERSON",
            "description": "A character mentioned as being in prison and awaiting trial, with the peculiarity of his punishment preceding the crime due to the White Queen's concept of living backwards. The King's Messenger is associated with the events of the trial, crime, and punishment.",
            "source_entities": [
                "\"KING'S MESSENGER\"",
                "\"TRIAL\"",
                "\"CRIME\"",
                "\"PUNISHMENT\""
            ]
        },
        {
            "entity_name": "King",
            "entity_type": "PERSON",
            "description": "A figure of authority indirectly referenced in the context of the King's Messenger, suggesting his existence and role in the administration of justice.",
            "source_entities": [
                "\"KING\""
            ]
        }
    ],
    "chunk-9015acbd1380cca16515a5b99e6a1ffc": null,
    "chunk-a9fd49b94f78e09a46e9721f797cd992": [
        {
            "entity_name": "Alice",
            "entity_type": "PERSON",
            "description": "The main character who experiences the oddities of the shop and later finds herself in a boat, interacting with the Sheep.",
            "source_entities": [
                "ALICE"
            ]
        },
        {
            "entity_name": "The Sheep",
            "entity_type": "PERSON",
            "description": "A character who is knitting and interacting with Alice, providing her with a pair of knitting-needles that turn into oars.",
            "source_entities": [
                "SHEEP"
            ]
        },
        {
            "entity_name": "The Shop",
            "entity_type": "GEO",
            "description": "A place filled with curious things that seem to move around, always eluding Alice's attempts to examine them closely. It also has a ceiling through which a 'thing' goes as quietly as possible.",
            "source_entities": [
                "SHOP",
                "CEILING"
            ]
        },
        {
            "entity_name": "The Mysterious Object",
            "entity_type": "OBJECT",
            "description": "A large bright thing that looks sometimes like a doll and sometimes like a work-box, always found on the shelf above the one Alice is looking at, and goes through the ceiling as if it were quite used to it.",
            "source_entities": [
                "DOLL",
                "WORK-BOX"
            ]
        },
        {
            "entity_name": "The Little Boat",
            "entity_type": "GEO",
            "description": "The boat that Alice finds herself in, gliding along between banks after the knitting-needles turn into oars, sometimes passing through beds of weeds and under trees.",
            "source_entities": [
                "LITTLE BOAT",
                "BANKS",
                "WEEDS",
                "TREES"
            ]
        },
        {
            "entity_name": "Scent Rushes",
            "entity_type": "GEO",
            "description": "Scented rushes that Alice finds and picks from the boat, which begin to fade and lose their scent and beauty immediately after being picked.",
            "source_entities": [
                "SCENTED RUSHES"
            ]
        }
    ],
    "chunk-655e59e5d6e63fafc3aba38f4b0967fa": [
        {
            "entity_name": "Humpty Dumpty",
            "entity_type": "PERSON",
            "description": "Humpty Dumpty is a character Alice encounters, initially mistaken for an egg due to his egg-like appearance, and is sitting on a high wall. He is portrayed as having an enormous face and is later revealed to be a person when he speaks.",
            "source_entities": [
                "HUMPTY DUMPTY",
                "EGG"
            ]
        },
        {
            "entity_name": "The Sheep",
            "entity_type": "PERSON",
            "description": "The Sheep is a character who interacts with Alice, selling eggs and knitting while seemingly indifferent to Alice's adventures. She is also present in the boat with Alice and later in the dark shop where Alice buys an egg.",
            "source_entities": [
                "SHEEP"
            ]
        },
        {
            "entity_name": "The High Wall",
            "entity_type": "GEO",
            "description": "The High Wall is the location where Humpty Dumpty is sitting, a narrow structure that makes Alice wonder about his balance. It is the place where Alice encounters Humpty Dumpty in his egg-like form.",
            "source_entities": [
                "HIGH WALL"
            ]
        },
        {
            "entity_name": "Rushes",
            "entity_type": "GEO",
            "description": "The rushes are a natural element in the story, growing far off and causing Alice to scramble to collect them. They later fade and lose their scent and beauty, similar to how dreamrushes would behave.",
            "source_entities": [
                "RUSHES"
            ]
        },
        {
            "entity_name": "The Boat and River",
            "entity_type": "GEO",
            "description": "The boat is a significant setting where Alice and the Sheep are located, and where Alice is swept off her seat by an oar into the river. The river is the body of water where the boat is located, and where Alice is swept into the heap of rushes.",
            "source_entities": [
                "BOAT",
                "RIVER"
            ]
        },
        {
            "entity_name": "The Crab",
            "entity_type": "GEO",
            "description": "The crab is a creature mentioned by the Sheep that Alice wishes to catch and take home with her. It is part of the surreal and whimsical elements of the story, adding to the dream-like nature of Alice's adventures.",
            "source_entities": [
                "CRAB"
            ]
        },
        {
            "entity_name": "The Dark Shop",
            "entity_type": "GEO",
            "description": "The dark shop is a location where Alice finds herself after the boat and river vanish, and where she buys an egg from the Sheep. It is a mysterious and dark place that contributes to the odd and dream-like quality of Alice's experiences.",
            "source_entities": [
                "DARK SHOP"
            ]
        }
    ],
    "chunk-de621d6da18e8cc5591d09e8fc127d25": [
        {
            "entity_name": "Humpty Dumpty",
            "entity_type": "PERSON",
            "description": "A character who engages in a conversation with Alice, displaying a sense of pride and a peculiar perspective on language and names. He is also known for his potential fall from a wall, which is a point of discussion and concern.",
            "source_entities": [
                "\"HUMPTY DUMPTY\"",
                "\"THE FALL\""
            ]
        },
        {
            "entity_name": "Alice",
            "entity_type": "PERSON",
            "description": "A character who has a conversation with Humpty Dumpty, asking questions and showing curiosity about his situation. She is also the one who recites the nursery rhyme about Humpty Dumpty's fall.",
            "source_entities": [
                "\"ALICE\""
            ]
        },
        {
            "entity_name": "The King's Assistance",
            "entity_type": "ORGANIZATION",
            "description": "Refers to the resources of the King, including all his horses and all his men, which would be used to help Humpty Dumpty if he were to fall, indicating their role in the narrative.",
            "source_entities": [
                "\"ALL THE KING'S HORSES\"",
                "\"ALL THE KING'S MEN\""
            ]
        },
        {
            "entity_name": "The Wall",
            "entity_type": "GEO",
            "description": "The location where Humpty Dumpty is sitting, and it plays a significant role in the conversation as it is the potential site of a fall. It is also the place where the King's assistance would be needed if Humpty Dumpty were to fall.",
            "source_entities": [
                "\"THE WALL\"",
                "\"THE PLACE\""
            ]
        },
        {
            "entity_name": "The Book",
            "entity_type": "EVENT",
            "description": "The source of Alice's knowledge about Humpty Dumpty's fall and the King's promise, and it is a point of contention in the conversation between Alice and Humpty Dumpty.",
            "source_entities": [
                "\"THE BOOK\"",
                "\"THE CONVERSATION\""
            ]
        }
    ],
    "chunk-e45ce77df486f00608288cc7dc64d880": [
        {
            "entity_name": "Humpty Dumpty",
            "entity_type": "PERSON",
            "description": "Humpty Dumpty is a character who becomes offended by Alice's confusion between a cravat and a belt, discusses the concept of un-birthday presents, and debates the flexibility of word meanings with Alice. He is also portrayed as someone who claims to manage words, particularly verbs, and uses terms like 'impenetrability' and 'glory' in unique ways.",
            "source_entities": [
                "HUMPTY DUMPTY"
            ]
        },
        {
            "entity_name": "Alice",
            "entity_type": "PERSON",
            "description": "Alice is a character who engages in conversation with Humpty Dumpty, showing curiosity and confusion about his words and the concept of un-birthday presents. She also works out a mathematical problem in her memorandum book for Humpty Dumpty.",
            "source_entities": [
                "ALICE"
            ]
        },
        {
            "entity_name": "White King and Queen",
            "entity_type": "ORGANIZATION",
            "description": "The White King and Queen are mentioned as the givers of a cravat to Humpty Dumpty as an un-birthday present, indicating their role in the narrative.",
            "source_entities": [
                "WHITE KING AND QUEEN"
            ]
        },
        {
            "entity_name": "Un-birthday Present",
            "entity_type": "EVENT",
            "description": "Un-birthday Present is the concept of a gift given on any day that is not one's birthday, as explained by Humpty Dumpty to Alice, who received a cravat from the White King and Queen on such an occasion.",
            "source_entities": [
                "UN-BIRTHDAY PRESENT"
            ]
        },
        {
            "entity_name": "Cravat",
            "entity_type": "GEO",
            "description": "Cravat is an item of clothing, described as beautiful and given to Humpty Dumpty by the White King and Queen as an un-birthday present, which Alice initially mistakes for a belt.",
            "source_entities": [
                "CRAVAT",
                "BELT"
            ]
        },
        {
            "entity_name": "Jabberwocky",
            "entity_type": "EVENT",
            "description": "Jabberwocky is a poem that Alice asks Humpty Dumpty to explain, indicating its significance in their conversation.",
            "source_entities": [
                "JABBERWOCKY"
            ]
        },
        {
            "entity_name": "Parts of Speech",
            "entity_type": "CONCEPT",
            "description": "Parts of Speech include verbs and adjectives, which Humpty Dumpty discusses in terms of their manageability and flexibility within language. He claims to have a special ability to manage verbs, which he considers the proudest, and views adjectives as more easily manipulated.",
            "source_entities": [
                "VERBS",
                "ADJECTIVES"
            ]
        },
        {
            "entity_name": "Impenetrability",
            "entity_type": "CONCEPT",
            "description": "Impenetrability is a term used by Humpty Dumpty to indicate the end of a subject, suggesting a way to control conversation, and implying that the topic has been sufficiently discussed.",
            "source_entities": [
                "IMPENETRABILITY"
            ]
        },
        {
            "entity_name": "Glory",
            "entity_type": "CONCEPT",
            "description": "Glory is a term that Humpty Dumpty uses to mean a 'nice knock-down argument,' which confuses Alice and leads to a discussion on the flexibility of word meanings.",
            "source_entities": [
                "GLORY"
            ]
        },
        {
            "entity_name": "Wages",
            "entity_type": "CONCEPT",
            "description": "Wages are mentioned by Humpty Dumpty in the context of people coming to him on Saturday nights, suggesting a role in a transactional relationship.",
            "source_entities": [
                "WAGES"
            ]
        },
        {
            "entity_name": "Memorandum Book",
            "entity_type": "GEO",
            "description": "Memorandum Book is an item Alice uses to work out a mathematical problem for Humpty Dumpty, showing its use in their interaction.",
            "source_entities": [
                "MEMORANDUM BOOK"
            ]
        }
    ],
    "chunk-4147c294af03ca342f69aec02d7c8742": [
        {
            "entity_name": "Jabberwocky",
            "entity_type": "Event",
            "description": "A poem mentioned in the text, whose meaning Alice asks Humpty Dumpty to explain. It contains invented words and phrases that Humpty Dumpty interprets for Alice.",
            "source_entities": [
                "JABBERWOCKY"
            ]
        },
        {
            "entity_name": "Humpty Dumpty",
            "entity_type": "Person",
            "description": "A character who explains the meanings of words and poems to Alice, claiming to know the meanings of many invented words. He also shares a poem written for Alice's amusement and communicates with the little fishes of the sea.",
            "source_entities": [
                "HUMPTY DUMPTY"
            ]
        },
        {
            "entity_name": "Alice",
            "entity_type": "Person",
            "description": "The main character in the text, engaging in a conversation with Humpty Dumpty and asking about the meanings of words and poems. She also recalls poetry repeated to her by Tweedledee.",
            "source_entities": [
                "ALICE"
            ]
        },
        {
            "entity_name": "Tweedledee",
            "entity_type": "Person",
            "description": "Mentioned by Alice as someone who repeated poetry to her, which was easier to understand than the poem Jabberwocky.",
            "source_entities": [
                "TWEEDLEDEE"
            ]
        },
        {
            "entity_name": "Portmanteau words in Jabberwocky",
            "entity_type": "Concept",
            "description": "A collection of words in the poem Jabberwocky that combine two meanings into one, as explained by Humpty Dumpty. Examples include 'slithy' (lithe and slimy), 'mimsy' (flimsy and miserable), and potentially others.",
            "source_entities": [
                "BRILLIG",
                "SLITHY",
                "MIMSY"
            ]
        },
        {
            "entity_name": "Creatures in Jabberwocky",
            "entity_type": "Concept",
            "description": "A group of fantastical creatures mentioned in the poem Jabberwocky, described with unique characteristics such as 'toves' (similar to badgers, lizards, and corkscrews), 'borogoves' (thin, shabby-looking birds), and 'mome raths' (green pigs that are lost).",
            "source_entities": [
                "TOVES",
                "BOROGOVE",
                "MOME RATHS"
            ]
        },
        {
            "entity_name": "Actions in Jabberwocky",
            "entity_type": "Concept",
            "description": "A set of actions described in the poem Jabberwocky, including 'gyre' (to go round and round like a gyroscope), 'gimble' (to make holes like a gimblet), and 'outgrabe' (a sound between bellowing, whistling, and sneezing).",
            "source_entities": [
                "GYRE",
                "GIMBLE",
                "OUTGRABE"
            ]
        },
        {
            "entity_name": "Settings in Jabberwocky",
            "entity_type": "Concept",
            "description": "Settings mentioned in the poem Jabberwocky, including 'the wabe' (the grass-plot around a sun-dial) and the sun-dial itself, which are integral to the poem's imagery and narrative.",
            "source_entities": [
                "WABE"
            ]
        },
        {
            "entity_name": "Little fishes of the sea",
            "entity_type": "Geo",
            "description": "The 'fish' mentioned in the text are the little fishes of the sea that communicate with Humpty Dumpty, refusing to follow his commands and engaging in a dialogue with him.",
            "source_entities": [
                "FISH"
            ]
        }
    ],
    "chunk-92dcf7f8c01b64223fb81fdf9cd1f473": [
        {
            "entity_name": "Humpty Dumpty (Dumpty)",
            "entity_type": "PERSON",
            "description": "A character who interacts with Alice, displaying a discontented tone and making unusual remarks about faces. He is also known as Dumpty.",
            "source_entities": [
                "\"HUMPTY DUMPTY\"",
                "\"DUMPTY\""
            ]
        },
        {
            "entity_name": "Soldiers",
            "entity_type": "ORGANIZATION",
            "description": "A group of characters that run through the wood, tripping and falling, creating confusion. They are mentioned as part of the White King's actions.",
            "source_entities": [
                "\"SOLDIERS\""
            ]
        },
        {
            "entity_name": "Horses",
            "entity_type": "ORGANIZATION",
            "description": "The horses manage better than the foot-soldiers but still stumble occasionally, causing their riders to fall off. They are also mentioned as part of the White King's actions.",
            "source_entities": [
                "\"HORSES\""
            ]
        },
        {
            "entity_name": "Messengers",
            "entity_type": "ORGANIZATION",
            "description": "Two individuals who have been sent to the town as part of the White King's actions.",
            "source_entities": [
                "\"MESSENGERS\""
            ]
        },
        {
            "entity_name": "Town",
            "entity_type": "GEO",
            "description": "A location where the Messengers are sent, as mentioned by the White King.",
            "source_entities": [
                "\"TOWN\""
            ]
        },
        {
            "entity_name": "Wood",
            "entity_type": "GEO",
            "description": "A location where Alice observes the soldiers and horses, and later exits to find the White King.",
            "source_entities": [
                "\"WOOD\""
            ]
        },
        {
            "entity_name": "Fishes",
            "entity_type": "ORGANIZATION",
            "description": "The fishes are mentioned as not listening to advice and are the subject of Dumpty's narrative.",
            "source_entities": [
                "\"FISHES\""
            ]
        },
        {
            "entity_name": "Kettle",
            "entity_type": "GEO",
            "description": "An object used by Dumpty in his narrative to fill with water from the pump.",
            "source_entities": [
                "\"KETTLE\""
            ]
        },
        {
            "entity_name": "Pump",
            "entity_type": "GEO",
            "description": "The source from which Dumpty fills the kettle with water in his story.",
            "source_entities": [
                "\"PUMP\""
            ]
        },
        {
            "entity_name": "Corkscrew",
            "entity_type": "GEO",
            "description": "An object Dumpty mentions taking from the shelf to wake the fishes.",
            "source_entities": [
                "\"CORKSCREW\""
            ]
        },
        {
            "entity_name": "Door",
            "entity_type": "GEO",
            "description": "A part of Dumpty's narrative where he encounters it locked and tries to open it.",
            "source_entities": [
                "\"DOOR\""
            ]
        },
        {
            "entity_name": "Lion and the Unicorn",
            "entity_type": "GEO",
            "description": "The lion and the unicorn are part of the chapter title 'the lion and the unicorn,' indicating their significance in the narrative.",
            "source_entities": [
                "\"LION\"",
                "\"UNICORN\""
            ]
        },
        {
            "entity_name": "Game",
            "entity_type": "EVENT",
            "description": "The game is mentioned by the White King as a reason for not sending all the horses, suggesting its importance.",
            "source_entities": [
                "\"GAME\""
            ]
        },
        {
            "entity_name": "Road",
            "entity_type": "GEO",
            "description": "The road is where Alice looks to see if she can spot the Messengers, as instructed by the White King.",
            "source_entities": [
                "\"ROAD\""
            ]
        }
    ],
    "chunk-89e32c9b67baf561f124619c34d8f9ab": [
        {
            "entity_name": "Haigha (ANGLO-SAXON MESSENGER)",
            "entity_type": "PERSON",
            "description": "Haigha, also known as the Anglo-Saxon Messenger, is an Anglo-Saxon who uses peculiar attitudes to express happiness and delivers messages and food to the King. He is one of the two messengers, living on the Hill.",
            "source_entities": [
                "MESSENGER",
                "ANGLO-SAXON MESSENGER"
            ]
        },
        {
            "entity_name": "Hatta",
            "entity_type": "PERSON",
            "description": "Hatta is the other Messenger, necessary for the King to have two messengers for coming and going.",
            "source_entities": [
                "HATTA"
            ]
        },
        {
            "entity_name": "The Lion and the Unicorn (LION, UNICORN)",
            "entity_type": "EVENT",
            "description": "The Lion and the Unicorn are engaged in a fight for the crown, which is a recurring event mentioned by the King and Alice. They are combatants in the battle, and the outcome of their fight does not determine the ownership of the crown.",
            "source_entities": [
                "LION AND THE UNICORN",
                "LION",
                "UNICORN"
            ]
        },
        {
            "entity_name": "The Battle for the Crown (WHITE BREAD, BROWN BREAD, PLUM-CAKE)",
            "entity_type": "EVENT",
            "description": "The Battle for the Crown is an event where the Lion and the Unicorn fight, and it is mentioned in a song recited by Alice. During the fight, they are given white bread, brown bread, and plum-cake by onlookers.",
            "source_entities": [
                "LION AND THE UNICORN",
                "WHITE BREAD",
                "BROWN BREAD",
                "PLUM-CAKE"
            ]
        }
    ],
    "chunk-b1f8a7638b6026887d2a45a300e90a2b": [
        {
            "entity_name": "The Lion and the Unicorn (FIGHT FOR THE CROWN)",
            "entity_type": "EVENT",
            "description": "The central event in the story where the Lion and the Unicorn engage in a fight for the crown. They are the two main characters battling each other, and the fight is a significant part of the narrative.",
            "source_entities": [
                "THE LION",
                "THE UNICORN",
                "FIGHT FOR THE CROWN"
            ]
        },
        {
            "entity_name": "Alice",
            "entity_type": "PERSON",
            "description": "The protagonist of the story, Alice is an observer and participant in the events, interacting with various characters and providing commentary on the fight between the Lion and the Unicorn.",
            "source_entities": [
                "ALICE"
            ]
        },
        {
            "entity_name": "The King",
            "entity_type": "PERSON",
            "description": "A character in the story who interacts with Alice and comments on the fight between the Lion and the Unicorn. He also makes a metaphorical reference to the speed of the White Queen, likening it to trying to catch a Bandersnatch.",
            "source_entities": [
                "KING"
            ]
        },
        {
            "entity_name": "Hatta and Haigha",
            "entity_type": "PERSON",
            "description": "Hatta is a character who has just come out of prison and is watching the fight with a cup of tea and bread-and-butter. Haigha is a character who provides information to Alice about Hatta and engages in conversation with him. Both are involved in the events surrounding the fight and are part of the narrative's supporting cast.",
            "source_entities": [
                "HATTA",
                "HAIGHA"
            ]
        },
        {
            "entity_name": "White Queen (RUNNING)",
            "entity_type": "EVENT",
            "description": "The White Queen is mentioned as running across the country, being chased by some enemy. This event is a brief part of the story, highlighting the White Queen's flight and the King's commentary on it.",
            "source_entities": [
                "WHITE QUEEN",
                "RUNNING"
            ]
        },
        {
            "entity_name": "Refreshments (WHITE BREAD, BROWN BREAD, PLUM-CAKE)",
            "entity_type": "EVENT",
            "description": "An event during the fight where the Lion and the Unicorn are allowed a break for refreshments, which include white bread, brown bread, and plum-cake. This event showcases a moment of respite in the ongoing fight.",
            "source_entities": [
                "REFRESHMENTS",
                "WHITE BREAD",
                "BROWN BREAD",
                "PLUM-CAKE"
            ]
        },
        {
            "entity_name": "Prison (HATTA)",
            "entity_type": "GEO",
            "description": "The place where Hatta was kept before being released, mentioned as part of Hatta's backstory. It is referenced in the context of Hatta's hunger and thirst, indicating the conditions of his imprisonment.",
            "source_entities": [
                "PRISON"
            ]
        },
        {
            "entity_name": "Wood (COUNTRY)",
            "entity_type": "GEO",
            "description": "The location from which the White Queen is said to have come flying out, and where the King suggests enemies are hiding. It is part of the setting for the White Queen's running event and adds to the story's atmosphere.",
            "source_entities": [
                "WOOD",
                "COUNTRY"
            ]
        }
    ],
    "chunk-a13ec2ac9ad9365599f95029e5b2582f": [
        {
            "entity_name": "Anglo-Saxon Messengers",
            "entity_type": "ORGANIZATION",
            "description": "A group of people mentioned in Alice's thoughts, possibly having a role in the unfolding events of the story.",
            "source_entities": [
                "ANGLO-SAXON MESSENGERS",
                "ANGLO-SAXON"
            ]
        }
    ],
    "chunk-2adf172dea4c3ec6f34eca88a6b6b035": [
        {
            "entity_name": "White Knight",
            "entity_type": "PERSON",
            "description": "The White Knight is a character who engages in a battle with the Red Knight over Alice, characterized by his tin armour and upside-down box. He promises to see Alice safe to the end of the wood and is involved in a peculiar plan to get honey from bees that might nest in his discarded box.",
            "source_entities": [
                "WHITE KNIGHT",
                "WHITE KNIGHT"
            ]
        },
        {
            "entity_name": "Red Knight",
            "entity_type": "PERSON",
            "description": "The Red Knight is one of the two knights who fight over Alice, claiming her as his prisoner. He wears crimson armour and brandishes a great club, participating in the combat that is governed by the unspoken Rules of Battle.",
            "source_entities": [
                "RED KNIGHT"
            ]
        }
    ],
    "chunk-724136f1a294c8fd1af5a2c5011d9f50": [
        {
            "entity_name": "Knight",
            "entity_type": "PERSON",
            "description": "The Knight is a character who has various conversations with Alice and struggles with riding a horse. He is also the inventor of several items, such as the anklets to guard against shark bites and has a bee-hive and mouse-trap as part of his equipment.",
            "source_entities": [
                "KNIGHT"
            ]
        },
        {
            "entity_name": "Alice",
            "entity_type": "PERSON",
            "description": "Alice is a character who engages in conversation with the Knight and helps him with various tasks, such as carrying the dish meant for plum-cake and managing the bag with its contents.",
            "source_entities": [
                "ALICE"
            ]
        },
        {
            "entity_name": "Horse",
            "entity_type": "ANIMAL",
            "description": "The Horse is the mode of transportation for the Knight and is often the cause of his falls. It is also equipped with anklets invented by the Knight to guard against shark bites and carries various items on its saddle.",
            "source_entities": [
                "HORSE"
            ]
        },
        {
            "entity_name": "End of the Wood",
            "entity_type": "LOCATION",
            "description": "The End of the Wood is the destination the Knight plans to accompany Alice to.",
            "source_entities": [
                "END OF THE WOOD"
            ]
        },
        {
            "entity_name": "Bee-Hive",
            "entity_type": "OBJECT",
            "description": "The Bee-hive is an object fastened to the saddle, which the Knight hopes will attract bees for honey.",
            "source_entities": [
                "BEE-HIVE"
            ]
        },
        {
            "entity_name": "Mouse-Trap",
            "entity_type": "OBJECT",
            "description": "The Mouse-trap is an object carried by the Knight, intended to catch mice that might disturb the bees.",
            "source_entities": [
                "MOUSE-TRAP"
            ]
        },
        {
            "entity_name": "Anklets",
            "entity_type": "OBJECT",
            "description": "The Anklets are objects around the horse's feet, invented by the Knight to guard against shark bites.",
            "source_entities": [
                "ANKLETS"
            ]
        },
        {
            "entity_name": "Bag",
            "entity_type": "OBJECT",
            "description": "The Bag is used by the Knight to carry various items, including the dish meant for plum-cake and candlesticks.",
            "source_entities": [
                "BAG",
                "CANDLESTICKS"
            ]
        },
        {
            "entity_name": "Dish",
            "entity_type": "OBJECT",
            "description": "The Dish is meant for holding plum-cake and is carried by the Knight and Alice.",
            "source_entities": [
                "DISH",
                "PLUM-CAKE"
            ]
        },
        {
            "entity_name": "Saddle",
            "entity_type": "OBJECT",
            "description": "The Saddle is loaded with bunches of carrots, fire-irons, and many other things, including the dish meant for plum-cake.",
            "source_entities": [
                "CARROTS",
                "FIRE-IRONS",
                "BUNCHES"
            ]
        },
        {
            "entity_name": "Wind",
            "entity_type": "NATURAL_PHENOMENON",
            "description": "The Wind is a strong natural element in the story, causing the Knight concern about Alice's hair.",
            "source_entities": [
                "WIND"
            ]
        },
        {
            "entity_name": "Sharks",
            "entity_type": "ANIMAL",
            "description": "Sharks are mentioned by the Knight as a reason for the anklets around the horse's feet.",
            "source_entities": [
                "SHARKS"
            ]
        },
        {
            "entity_name": "Mice",
            "entity_type": "ANIMAL",
            "description": "Mice are mentioned by the Knight as potential pests that might be kept away by bees or vice versa.",
            "source_entities": [
                "MICE"
            ]
        }
    ],
    "chunk-01e44b3e69b04f6d4f4c4d87b5ecd71a": [
        {
            "entity_name": "Knight",
            "entity_type": "PERSON",
            "description": "A character who frequently falls off his horse, discusses his inventions, and shares his thoughts on various topics with Alice. He is also known as the White Knight, who mistakenly wore the Knight's helmet, causing a mix-up and a humorous situation.",
            "source_entities": [
                "KNIGHT",
                "WHITE KNIGHT"
            ]
        },
        {
            "entity_name": "Horse",
            "entity_type": "GEO",
            "description": "The mode of transportation for the Knight, involved in his falls and acts as a central element in the discussions about riding and balance.",
            "source_entities": [
                "HORSE"
            ]
        },
        {
            "entity_name": "Gate",
            "entity_type": "GEO",
            "description": "An object mentioned by the Knight as part of his invented method for getting over it, highlighting his unconventional thinking.",
            "source_entities": [
                "GATE"
            ]
        },
        {
            "entity_name": "Helmet",
            "entity_type": "GEO",
            "description": "One of the Knight's inventions, which plays a role in a humorous incident involving the White Knight.",
            "source_entities": [
                "HELMET"
            ]
        },
        {
            "entity_name": "Pudding",
            "entity_type": "GEO",
            "description": "Mentioned as an invention by the Knight, created during the meat-course, showcasing his inventive nature.",
            "source_entities": [
                "PUDDING"
            ]
        },
        {
            "entity_name": "Ditch",
            "entity_type": "GEO",
            "description": "Where the Knight falls into after losing his balance while discussing the concept of 'fastness,' adding to the series of his falls.",
            "source_entities": [
                "DITCH"
            ]
        }
    ],
    "chunk-8c16c629437bd13d18b29c28c1dae37b": [
        {
            "entity_name": "Knight",
            "entity_type": "PERSON",
            "description": "The Knight is a character who engages in a conversation with Alice about a clever pudding and sings a song to comfort her. He is also known as 'KNIGHT' in the text.",
            "source_entities": [
                "KNIGHT",
                "ALICE"
            ]
        },
        {
            "entity_name": "Through The Looking-Glass",
            "entity_type": "EVENT",
            "description": "Through The Looking-Glass is the journey Alice is on, where she encounters the Knight and other strange events. It is also referred to as the setting of the events involving Alice and the Knight.",
            "source_entities": [
                "THROUGH THE LOOKING-GLASS"
            ]
        },
        {
            "entity_name": "The Song",
            "entity_type": "EVENT",
            "description": "The song sung by the Knight has multiple names that create confusion: 'Haddocks' Eyes', 'The Aged Aged Man', 'Ways And Means', and 'Spadesuit-sitting On A Gate'. It tells the story of an 'Aged aged man' and mentions 'Rowland's Macassar-Oil'.",
            "source_entities": [
                "HADDOCKS' EYES",
                "THE AGED AGED MAN",
                "WAYS AND MEANS",
                "SPADESUIT-SITTING ON A GATE",
                "AGED AGED MAN",
                "ROWLAND'S MACASSAR-OIL"
            ]
        }
    ],
    "chunk-15cd8f78b8f408e6f0bb575dd105ac50": [
        {
            "entity_name": "Alice",
            "entity_type": "PERSON",
            "description": "Alice is a central character in the story who embarks on a journey, interacts with various characters including the Knight and the Red Queen, and eventually becomes a Queen, symbolized by finding a golden crown.",
            "source_entities": [
                "ALICE",
                "QUEEN"
            ]
        },
        {
            "entity_name": "Rowland’s Macassar-Oil",
            "entity_type": "ORGANIZATION",
            "description": "Rowland’s Macassar-Oil is mentioned as a product derived from a mountain-rill, suggesting a company or brand involved in the production of this specific oil.",
            "source_entities": [
                "ROWLAND’S MACASSAR-OIL"
            ]
        },
        {
            "entity_name": "Hansom-cabs",
            "entity_type": "ORGANIZATION",
            "description": "Hansom-cabs are mentioned in the context of searching for their wheels, indicating a transportation service or company that operates horse-drawn cabs.",
            "source_entities": [
                "HANSOM-CABS"
            ]
        },
        {
            "entity_name": "Old Man",
            "entity_type": "PERSON",
            "description": "The old man is a character with distinct physical features and behaviors, described as having a mild look, slow speech, white hair, and a face likened to a crow. He is remembered by the narrator for his peculiar actions and the impression he left.",
            "source_entities": [
                "OLD MAN"
            ]
        },
        {
            "entity_name": "Eighth Square",
            "entity_type": "GEO",
            "description": "The Eighth Square is a significant location in Alice's journey, marking her progress and the point at which she discovers the golden crown, signifying her new status as a Queen.",
            "source_entities": [
                "EIGHTH SQUARE"
            ]
        }
    ],
    "chunk-8bc797ee5f0bdbf691817640d60d286f": [
        {
            "entity_name": "Alice",
            "entity_type": "PERSON",
            "description": "The main character who interacts with the Red Queen and the White Queen, and is involved in a series of nonsensical discussions and mathematical riddles. Also referred to as 'CHILD' by the Red Queen, indicating her youth and implying a lack of understanding or importance.",
            "source_entities": [
                "\"ALICE\"",
                "\"CHILD\""
            ]
        },
        {
            "entity_name": "Queens",
            "entity_type": "PERSON",
            "description": "Refers to the Red Queen and the White Queen, two queens Alice encounters known for their sharp interruptions, insistence on manners and logic, often leading to absurd conclusions. The 'QUEEN' entity is a generic reference to a queen used by Alice when she is unsure of the specific identity of the queens she is addressing.",
            "source_entities": [
                "\"RED QUEEN\"",
                "\"WHITE QUEEN\"",
                "\"QUEEN\""
            ]
        },
        {
            "entity_name": "Dinner Party",
            "entity_type": "EVENT",
            "description": "The unexpected dinner party that Alice is supposedly hosting, discussed by the Red Queen and the White Queen, of which Alice is initially unaware.",
            "source_entities": [
                "\"DINNER-PARTY\""
            ]
        },
        {
            "entity_name": "Lessons",
            "entity_type": "EVENT",
            "description": "Referenced by Alice when discussing what manners are not taught in, implying a structured educational setting.",
            "source_entities": [
                "\"LESSONS\""
            ]
        },
        {
            "entity_name": "Examination",
            "entity_type": "EVENT",
            "description": "Mentioned by the Red Queen as an examination that Alice must pass to be considered a queen, indicating a formal test or assessment.",
            "source_entities": [
                "\"EXAMINATION\""
            ]
        },
        {
            "entity_name": "Game",
            "entity_type": "EVENT",
            "description": "Alice inquires if the game is over, referring to the ongoing activities or challenges she is involved in with the queens.",
            "source_entities": [
                "\"GAME\""
            ]
        },
        {
            "entity_name": "Realm",
            "entity_type": "GEO",
            "description": "Mentioned in the context of a message from a realm beyond stars and stripes, suggesting a geographical area or kingdom.",
            "source_entities": [
                "\"REALM\""
            ]
        },
        {
            "entity_name": "Message from the Heavens",
            "entity_type": "EVENT",
            "description": "Referenced in the context of humanity's response to a message, indicating a communication or signal from a higher or external source.",
            "source_entities": [
                "\"MESSAGE FROM THE HEAVENS\""
            ]
        },
        {
            "entity_name": "Dog",
            "entity_type": "PERSON",
            "description": "Mentioned in a riddle by the Red Queen about taking a bone from a dog, used to illustrate a point about subtraction.",
            "source_entities": [
                "\"DOG\""
            ]
        }
    ],
    "chunk-814ad311ca6901e97305b88e1186db84": null
}