{
  "chunk-1b1543df794d06ac12399619acc81141": {
    "tokens": 1200,
    "content": "# \"All the News Che Neu Hork Cimes That's Fit to Print\"  \n\n![](images/image_1.jpg)  \nOn a beach in Senegal. More than 60 percent of those who speak French daily live in Africa, where the youth population is surging.  \n\n# Through Jokes and Hip-Hop, Africans Are Changing French  \n\n# Zelensky Fails to Sway the G.O.P. In an Urgent Visit to Capitol Hill  \n\n# By ELIAN PELTIER  \n\nABIDJAN,  Ivory  Coast  — French, by most estimates the world’s  fifth  most  spoken  language, is changing — perhaps not in the gilded hallways of the institution in Paris that publishes its official dictionary, but on a rooftop in Abidjan, the largest city in Ivory Coast.  \n\nThere one afternoon, a 19-yearold rapper who goes by the stage name Marla rehearsed her upcoming  show,  surrounded  by friends and empty soda bottles. Her words were mostly French, but the Ivorian slang and English words that she mixed in made a new language.  \n\nTo speak only French, “c’est zogo”  —  “it’s  uncool,”  Marla, whose  real  name  is  Mariam Dosso, said, combining a French word with Ivorian slang. But playing with words and languages, she said, is “choco,” an abbreviation of chocolate  meaning  “sweet”  or “stylish.”  \n\nA growing number of words and expressions from Africa are now infusing  the  French  language, spurred by booming populations of young people in West and Central Africa.  \n\nMore than 60 percent of those who speak French daily now live in Africa, and 80 percent of children studying in French are in Africa. There are as many French speakers in Kinshasa, the capital of the Democratic Republic of Congo, as in Paris.  \n\nThrough social media platforms like TikTok and YouTube, they are literally spreading the word, reshaping  the  French  language  \n\n# OLD WORLD, YOUNG AFRICA The Evolution of a Language  \n\nfrom African countries, like Ivory Coast, that were once colonized by France.  \n\n“We’ve tried to rap in pure French, but nobody was listening to us,” said Jean Patrick Niambé, known as Dofy, a 24-year-old Ivorian  hip-hop  artist  listening  to Marla on the rooftop. “So we create words from our own realities, and then they spread.”  \n\nWalking down the streets of Paris or its suburbs, you can hear people use the word “enjailler” to mean “having fun.” But the word originally came from Abidjan to describe how adrenaline-seeking young  Ivorians  in  the  1980s jumped on and off buses racing through the streets.  \n\nThe youth population in Africa is surging while the rest of the world grays. Demographers predict that by 2060, up to 85 percent of French speakers will live on the African continent. That’s nearly the inverse of the 1960s, when 90 percent of French speakers lived in European and other Western countries.  \n\n“French flourishes every day in Africa,” said Souleymane Bachir Diagne, a renowned Senegalese professor  of  philosophy  and French at Columbia University. “This creolized French finds its way in the books we read, the sketches we watch on television, the songs we listen to.” Nearly half of the countries in Africa were at one time French colonies  or  protectorates,  and Continued on Page A12  \n\nThis article is by Zolan KannoYoungs, Catie Edmondson, Karoun Demirjian and Michael D. Shear. WASHINGTON — President Biden warned on Tuesday that Russia was celebrating American division  over  providing  aid  to Ukraine, as President Volodymyr Zelensky hit a wall of resistance from congressional Republicans during a daylong lobbying blitz in Washington.  \n\nSpeaking from the White House with Mr. Zelensky by his side, Mr. Biden  said  failing  to  support Ukraine would be a gift to President Vladimir V. Putin of Russia. “Putin is banking on the United States  failing  to  deliver  for Ukraine,” Mr. Biden said at the White House. “We must, we must, we must prove him wrong.” Republican leaders in Congress have insisted that any aid for  \n\n# Time Is Ticking for Aid That’s Tethered to Border Security  \n\nUkraine be paired with tighter security at the southern border, arguing that the migrant crisis had become a threat to national security. But even Republican supporters of more aid for Ukraine appeared to have given up hope of approving  it  before  Congress heads home for the holidays. Senator Mitch McConnell, the top Republican, suggested that the effort was all but dead for the year, saying it would be “practically impossible” to quickly pass a deal that ties together aid for Ukraine with the kind of border President Volodymyr Zelensky of Ukraine, center, on Tuesday.  \n\n![](images/image_2.jpg)  \n\n# Court Clears Way for New York Democrats to Redraw House Map  \n\nBy NICHOLAS FANDOS New York’s highest court or  \ndered the state to redraw its con  \ngressional map on Tuesday, deliv  \nering a ruling that offers Demo  \ncrats a new weapon to wrest con  \ntrol of the House from Repub  \nlicans in 2024. The decision could have far  \nreaching implications in reshap  \n\ning the House battlefield in a key state. New York Democrats are widely expected to use the opening to try to shift two to six Republican-held  swing  districts  that President Biden won, from Long Island to Syracuse. The State Constitution still prohibits",
    "chunk_order_index": 0,
    "full_doc_id": "doc-e303d8ce7169419abe975d70479f12e2"
  },
  "chunk-050f218ffbe46e8cd0f8d6eb74153087": {
    "tokens": 1200,
    "content": "map on Tuesday, deliv  \nering a ruling that offers Demo  \ncrats a new weapon to wrest con  \ntrol of the House from Repub  \nlicans in 2024. The decision could have far  \nreaching implications in reshap  \n\ning the House battlefield in a key state. New York Democrats are widely expected to use the opening to try to shift two to six Republican-held  swing  districts  that President Biden won, from Long Island to Syracuse. The State Constitution still prohibits partisan gerrymandering. But Democrats would need to make only slight alterations to the  \n\n# Deleting Lines G.O.P. Used to Win Majority  \n\ndistrict lines to improve the party’s chances and imperil Republicans’ three-seat majority before the campaign season even begins. “They might have won two or three of those Biden districts back anyway — now it might be five or six,” said Dave Wasserman, an elections analyst with the Cook Political Report. “When you are talking about such a narrow majority  in  the  House,  obviously that’s a big deal.”  \n\nThe 4-to-3 ruling by the State Court of Appeals effectively wiped Continued on Page A17  \n\n# Israel Is Losing Support Over War, Biden Says, Exposing Leaders’ Rift  \n\nWarns Against ‘Indiscriminate Bombing’  \n\n# By MICHAEL D. SHEAR  \n\nWASHINGTON — President Biden  told  Israel’s  leaders  on Tuesday that they were losing international support for their war in Gaza, exposing a widening rift with Prime Minister Benjamin Netanyahu, who rejected out of hand the American vision for a postwar resolution to the conflict. Mr. Biden delivered the blunt assessment of America’s closest ally in the Middle East during a fund-raiser in Washington, where he described Mr. Netanyahu as the leader of “the most conservative government in Israel’s history,” which doesn’t “want anything  remotely  approaching  a two-state solution” to the country’s long-running dispute with Palestinians.  \n\nThe president said that Israel had support from Europe and much of the world as well as the United States, but he added that “they’re starting to lose that support by the indiscriminate bombing that takes place.”  \n\nThe president’s remarks came hours  after  Mr.  Netanyahu pledged to defy weeks of American pressure to put the Palestinian Authority in charge of Gaza once the fighting ends. Mr. Netanyahu ruled out any role there for the group, which now governs Palestinian society in the Israeli-occupied West Bank.  \n\nUntil Tuesday, the United States had largely backed Israel both in action and in rhetoric — supporting the assault on Gaza, fending off calls for a cease-fire at the United Nations and authorizing the  sale  of  thousands  of  tank  \n\n“There is disagreement about ‘the day after Hamas,’” Mr. Netanyahu said in a video statement posted on social media. He said he hoped the two governments could reach an agreement about what happens after the war ends, but he vowed not to allow threats to Israel’s population to continue. “After the great sacrifice of our civilians and our soldiers, I will not allow the entry into Gaza of those who educate for terrorism, support terrorism and finance terrorism,”  Mr.  Netanyahu  said. “Gaza will be neither Hamastan nor Fatahstan.”  \n\nFatah is the political faction, a rival to Hamas, that controls the Palestinian Authority, which was ousted from Gaza in 2007 but still administers  parts  of  the  West Bank.  \n\nIn his remarks at the fundraiser, Mr. Biden pledged to continue that support for Israel’s effort to protect itself, saying that “we’re not going to do a damn thing other than protect Israel in the process. Not a single thing.” “Without Israel as a free-standing state, not a Jew in the world is safe,” he added.  \n\nBut he also described his response to Mr. Netanyahu’s private assertion that the United States had “carpet-bombed” Germany and dropped the atomic bomb on Japan.  \n\n“I said, ‘Yeah, that’s why all these institutions were set up after World War II, to see to it that it didn’t happen again,’” Mr. Biden Continued on Page A9  \n\n# Defying Critics, Harvard Sticks With Its Leader  \n\nThis article is by Jeremy W. Peters, Dana Goldstein and Anemona Hartocollis.  \n\nAs universities across the country strained under pressure to take a public position on the Oct. 7 attack on Israel by Hamas, few were as tormented as Harvard. First, university officials said nothing when a pro-Palestinian student group wrote an open letter saying that Israel was “entirely  responsible”  for  the  violence. Harvard followed up with a letter to the university community acknowledging “feelings of fear, sadness, anger, and more.” After an outcry, Harvard’s president, Claudine Gay, issued a more forceful statement condemning Hamas for “terrorist atrocities” while urging people to use words that “illuminate and not inflame.”  \n\nThe difficult and divisive questions over how universities should respond when student demonstrations cross a line into threatening,  disruptive  and  harmful came to a head at Harvard over the last week, as Dr. Gay faced calls to resign after her widely criticized  appearance  before  a congressional committee looking into  antisemitism  on  campus. When asked whether threatening Jewish  people  with  genocide would violate the school’s code of conduct, she equivocated. On Tuesday, Harvard’s governing body said it stood firmly beFree-ranging cats devour over 2,000 species, a study warned.  \n\n![](images/image_3.jpg)  \n\n# Menu à la Cat: Alfresco Buffet Has Downside  \n\n# By CATRIN EINHORN  \n\nEveryone can agree on one thing:  It’s  not  the  cats",
    "chunk_order_index": 1,
    "full_doc_id": "doc-e303d8ce7169419abe975d70479f12e2"
  },
  "chunk-2f4798aaf45bae056a3be4ace74cf6df": {
    "tokens": 455,
    "content": "When asked whether threatening Jewish  people  with  genocide would violate the school’s code of conduct, she equivocated. On Tuesday, Harvard’s governing body said it stood firmly beFree-ranging cats devour over 2,000 species, a study warned.  \n\n![](images/image_3.jpg)  \n\n# Menu à la Cat: Alfresco Buffet Has Downside  \n\n# By CATRIN EINHORN  \n\nEveryone can agree on one thing:  It’s  not  the  cats’  fault they’re bad for wildlife. Cats are carnivores. Their talent for preying on rodents is a big reason their ancestors and ours started hanging around together in the first place. But then, people carried cats  around  the  world,  into ecosystems that weren’t equipped for such predators.  \n\nWherever they are, they stalk. They pounce. They kill. They eat. Now, researchers have documented the breadth of cats’ global buffet. A study published on Tuesday in the journal Nature Communications found that free-ranging domestic  cats  (including  feral ones) eat more than 2,000 species, raising renewed concerns about Continued on Page A21  \n\n# INTERNATIONAL A4-14  \n\nSunak Wins Deportation Vote The British prime minister’s contentious proposal to send asylum seekers to Rwanda moved forward, but it still faces stumbling blocks. PAGE A14 SPORTS B7-10, 12 Still a Record After 40 Years On Dec. 13, 1983, the Nuggets and the Pistons combined for the highest-scoring game in N.B.A. history, with the help of just two 3-pointers. PAGE B7 ARTS C1-8 Resurrecting van Gogh An attempt at championing the painter’s legacy is taking place at a Paris museum, where a lifelike doppelgänger of the artist chats with visitors. PAGE C1  \n\nFOOD D1-14   \nA Delectable 2023   \nWhat have been the most beloved recipes, notable restaurants, compelling cookbooks and can’t-miss dishes of the year? We have some ideas. PAGE D1  \n\n# OPINION A22-23  \n\nThomas L. Friedman PAGE A22 0 354613 C",
    "chunk_order_index": 2,
    "full_doc_id": "doc-e303d8ce7169419abe975d70479f12e2"
  }
}