{
    "image_1": {
        "entity_name": "Table 1: Overview of annotated parallel sentences per language pair",
        "entity_type": "TABLE",
        "description": "The table provides a comprehensive overview of the distribution of annotated parallel sentences across different language pairs, including combinations of English with various other languages.",
        "reason": "The image clearly shows a table labeled 'Table 1: Overview of annotated parallel sentences per language pair', which matches the description provided in the text. The table lists language pairs and the number of sentences for each pair, aligning with the content described in the text.",
        "matched_chunk_entity_name": "no match"
    },
    "image_2": {
        "entity_name": "Percentage of female and male speakers per age group",
        "entity_type": "CONCEPT",
        "description": "The concept represented by the bar chart showing the distribution of male and female speakers across different age groups.",
        "reason": "The image is a bar chart that clearly shows the percentage of male and female speakers for each age group, which aligns with the description provided in the text. The chart provides a visual representation of the gender distribution in the Europarl dataset, which is discussed in the text.",
        "matched_chunk_entity_name": "GENDER-UNBALANCE"
    },
    "image_3": {
        "entity_name": "BLEU SCORES",
        "entity_type": "EVENT",
        "description": "BLEU scores are a metric used to evaluate the performance of NMT systems, as presented in Table 2 and Table 3.",
        "reason": "The image is a table comparing BLEU scores for machine translation systems from English (EN) to various target languages, both with and without gender tagging. The text also mentions BLEU scores in the context of evaluating the performance of NMT systems.",
        "matched_chunk_entity_name": "BLEU SCORES"
    },
    "image_4": {
        "entity_name": "BLEU-scores on EN–FR",
        "entity_type": "EVENT",
        "description": "The BLEU scores for English to French translations comparing the baseline (EN) and the tagged systems (EN–TAG) across four different test sets: FR (M), FR (F), FR (M1), and FR (F1).",
        "reason": "The image clearly shows a table comparing BLEU-scores on EN–FR translations between the baseline (EN) and the tagged systems (EN–TAG) across four different test sets. The content of the image directly aligns with the description provided in the text.",
        "matched_chunk_entity_name": "BLEU SCORES"
    }
}