{
    "chunk-0ff1311559b245c00201952cf8ff419b": [
        {
            "entity_name": "Nyamut Gai",
            "entity_type": "PERSON",
            "description": "A 28-year-old woman from South Sudan who lost her children due to disease and hunger during her journey from Sudan back to South Sudan, and is originally from JODA, a location in South Sudan where her village was stormed by armed militias.",
            "source_entities": [
                "NYAMUT GAI"
            ]
        },
        {
            "entity_name": "South Sudan",
            "entity_type": "GEO",
            "description": "A landlocked African country tormented by civil war, famine, and flooding, and is Nyamut Gai's homeland. It is also the location of Renk, a town where Nyamut Gai was quoted at an aid center, expressing her feelings of being unsafe.",
            "source_entities": [
                "SOUTH SUDAN",
                "RENK"
            ]
        },
        {
            "entity_name": "Sudan",
            "entity_type": "GEO",
            "description": "A country where Nyamut Gai and her family sought refuge, but later had to flee due to a war breaking out between rival factions of the military, including Gen. Abdel Fattah al-Burhan and Lt. Gen. Mohamed Hamdan. It is also the location of its capital, Khartoum, where Nyamut Gai worked as a cleaner and began to settle in after fleeing from South Sudan.",
            "source_entities": [
                "SUDAN",
                "KHARTOUM",
                "GEN. ABDEL FATTAH AL-BURHAN",
                "LT. GEN. MOHAMED HAMDAN"
            ]
        },
        {
            "entity_name": "The New York Times Company",
            "entity_type": "ORGANIZATION",
            "description": "A media organization that owns and publishes The New York Times newspaper, mentioned as the source of the reports on South Sudanese refugees, the conflict in Ukraine, and the political situation in Los Angeles.",
            "source_entities": [
                "THE NEW YORK TIMES COMPANY",
                "NEW YORK"
            ]
        },
        {
            "entity_name": "Ukraine",
            "entity_type": "GEO",
            "description": "A country in Eastern Europe that has been in conflict with Russia, particularly in the village of Urozhaine from which Russian troops retreated, as reported by The New York Times. The United States has provided arms to Ukraine to help offset shortages.",
            "source_entities": [
                "UKRAINE",
                "UROZHAINE",
                "RUSSIAN TROOPS",
                "UNITED STATES"
            ]
        },
        {
            "entity_name": "Nithya Raman",
            "entity_type": "PERSON",
            "description": "A political figure who campaigned for the Los Angeles City Council in 2020, focusing on housing prices and advocating for renters and homeless people. She received more votes than any council member in the city's history and was compared to Alexandria Ocasio-Cortez due to their similar political stances. She faced challenges in the redistricting process, which was overseen by her representative on the redistricting commission, Jackie Goldberg.",
            "source_entities": [
                "NITHYA RAMAN",
                "LOS ANGELES CITY COUNCIL",
                "LOS ANGELES",
                "MASSACHUSETTS INSTITUTE OF TECHNOLOGY",
                "JACKIE GOLDBERG",
                "ALEXANDRIA OCASIO-CORTEZ"
            ]
        }
    ],
    "chunk-4c974663e2021d76dd1b48bba969af48": [
        {
            "entity_name": "Mattel",
            "entity_type": "ORGANIZATION",
            "description": "Mattel is the company that produces Barbie and is discussed in the context of the success of a feature film starring Barbie.",
            "source_entities": [
                "MATTEL",
                "MATTEL"
            ]
        },
        {
            "entity_name": "Ecuadorian Community (ECUADOR)",
            "entity_type": "GEO",
            "description": "Ecuador is the country of origin for the sport ecuavoley, which has a significant following in Queens, New York, particularly among immigrants from the Andean country.",
            "source_entities": [
                "ECUADOR",
                "ANDEAN"
            ]
        },
        {
            "entity_name": "Flushing Meadows Corona Park (QUEENS)",
            "entity_type": "GEO",
            "description": "Flushing Meadows Corona Park in Queens hosts a distinct sporting event and is also the location for the U.S. Open tennis tournament.",
            "source_entities": [
                "FLUSHING MEADOWS CORONA PARK",
                "QUEENS"
            ]
        },
        {
            "entity_name": "Corona (QUEENS)",
            "entity_type": "GEO",
            "description": "Corona is a neighborhood in Queens, New York, with a pronounced Ecuadorian flavor and is the location where ecuavoley is played.",
            "source_entities": [
                "CORONA",
                "QUEENS"
            ]
        },
        {
            "entity_name": "Billie Jean King National Tennis Center (QUEENS)",
            "entity_type": "GEO",
            "description": "The Billie Jean King National Tennis Center is located in Queens and is the site of the U.S. Open tennis tournament.",
            "source_entities": [
                "BILLIE JEAN KING NATIONAL TENNIS CENTER",
                "QUEENS"
            ]
        }
    ],
    "chunk-7fb9e14e719e3da6c39e0e08993a7fdf": [
        {
            "entity_name": "Barbie",
            "entity_type": "Event",
            "description": "'Barbie' is a film produced by Mattel, starring the iconic doll, which has become a significant cultural event and financial success, nearing $1.4 billion in revenue and surpassing one of the 'Harry Potter' movies as the top-grossing Warner Bros. film of all time.",
            "source_entities": [
                "\"BARBIE\"",
                "\"MATTEL\"",
                "\"WARNER BROS.\""
            ]
        },
        {
            "entity_name": "Ynon Kreiz",
            "entity_type": "Person",
            "description": "Ynon Kreiz is the chief executive of Mattel who initiated the 'Barbie' film project, aiming for it to be a cultural event and a film of high quality, even if it did not sell additional dolls. He was portrayed in the movie as 'vain and foolish to the nth degree' by The Guardian.",
            "source_entities": [
                "\"YNON KREIZ\"",
                "\"THE GUARDIAN\""
            ]
        },
        {
            "entity_name": "G20 Summit",
            "entity_type": "Event",
            "description": "The G20 Summit is an international event hosted by India, showcasing the country's growing power and ambitions. However, Prime Minister Narendra Modi's divisive religious politics are seen as a threat to India's rise.",
            "source_entities": [
                "\"G20 SUMMIT\"",
                "\"NARENDRA MODI\""
            ]
        },
        {
            "entity_name": "Ukraine",
            "entity_type": "GEO",
            "description": "Ukraine is a country that has received ions and has been the subject of pleas by President Volodymyr Zelensky, resulting in widespread condemnation and criticism from American allies.",
            "source_entities": [
                "\"UKRAINE\"",
                "\"VOLODYMYR ZELENSKY\"",
                "\"AMERICAN ALLIES\""
            ]
        },
        {
            "entity_name": "Peter Navarro",
            "entity_type": "Person",
            "description": "Peter Navarro is an adviser to former President Donald J. Trump who has been convicted for defying the Jan. 6 panel’s summons, making him the second adviser to be convicted for such actions.",
            "source_entities": [
                "\"PETER NAVARRO\"",
                "\"DONALD J. TRUMP\""
            ]
        }
    ]
}