{
  "chunk-f6c01ae6ca1a6e86d8d52ee6a393927d": {
    "tokens": 1200,
    "content": "# Che New Hork Cimes  \n\nVOL. CLXXII . . . . No. 59,897 © 2023  The New York Times Company NEW YORK, THURSDAY, AUGUST 31, 2023  \n\n# Chile to Search for Missing, Decades After They Vanished  \n\nGovernment Calls Finding Pinochet’s Victims ‘a Duty  \n\n# By PASCALE BONNEFOY  \n\nSANTIAGO, Chile — Thirty-six years after Fernando Ortíz’s abduction and disappearance, his family  finally  received  his  remains: five bone fragments in a box.  \n\nMr. Ortíz, a 50-year-old professor, was kidnapped in 1976 during the dictatorship of Gen. Augusto Pinochet, rounded up with other communist leaders in Chile and sent to a torture center so secret that no one knew of its existence for three decades.  \n\nNo one came out alive from the black site named for the street it was on: Simón Bolívar. It was little more than a house in a rural area east of the capital run by the regime’s intelligence agency, DINA. There were no witnesses or survivors to shed light on the detainees’ fates. For decades, there was only deafening silence.  \n\nMr. Ortíz was one of 1,469 people who disappeared under Chile’s military rule from 1973 to 1990. Only 307 of them have been found and identified.  \n\nNow, before the 50th anniversary of the coup that toppled one of Latin America’s most stable deA rally in Santiago, Chile, for those who have disappeared.  \n\n![](images/image_1.jpg)  \n\nmocracies and installed the 17- year dictatorship that imprisoned, tortured and killed thousands of its opponents, Chile has enacted a national search plan to track down the remaining disappeared.  \n\n“Justice has taken too long,” President Gabriel Boric of Chile said  during  a  ceremony  on Wednesday in which he signed a presidential decree to codify the plan. “This is not a favor to the families. It is a duty to society as a whole to deliver the answers the country deserves and needs.”  \n\nThe measure marks the first time since the end of the Pinochet regime that the Chilean government has tried to find those who went missing — an effort that until now has largely fallen to the surviving family members, mainly women, who protested, went on hunger  strikes  and  took  their cases to court. So far, only through these judicial cases have burial sites been identified.  \n\n“The state took them away, and it is the state that has to be responsible for reparation, justice and sustaining  the  search,”  Luis Cordero, Chile’s minister of justice and human rights, said in an interview with The New York Times. Two of Mr. Cordero’s great-uncles were abducted in 1973 and never found.  \n\nOther South American countries under military rule in the 1970s and ’80s have had mixed success in recovering the remains of their disappeared. Forensics teams  in  Argentina  recovered more 1,400 bodies and identified 800 of them. In Brazil, efforts to find 210 people who went missing have had scant results. The Paraguayan agency given the task of finding and identifying its 336 disappeared has discovered only 34. The plan will centralize and digitize the enormous volumes of judicial case files and other archives scattered  across  government Continued on Page A9  \n\n# Drones Explode Inflation Cools, Deep in Russia; But Slow Pace Kyiv Is Hit, Too Creates Pitfalls  \n\n# By ANDREW E. KRAMER and VICTORIA KIM  \n\nKYIV, Ukraine — A wave of exploding drones was launched in six regions of Russia overnight Wednesday, Russian officials said, damaging  four  military  cargo planes at an airfield 30 miles from the border with Estonia, a NATO member, in an apparent sign that Ukraine was increasingly capable of  striking  back  deep  inside Moscow’s territory.  \n\nAround the same time, Russia unleashed an aerial assault on at least three regions of Ukraine, officials in Ukraine said, including one of the most significant barrages the Kyiv region has experienced in months. Ukraine’s air force said it had shot down 43 of 44 incoming missiles and drones.  \n\ndefense missiles shook Kyiv, the capital,  around  5  a.m.  Serhiy Popko, head of the Kyiv regional military administration, said that two people in the city had been killed by falling debris.  \n\n# By JEANNA SMIALEK  \n\nPresident Biden has openly celebrated recent inflation reports, and  Federal  Reserve  officials have also breathed a sigh of relief as rapid price gains show signs of losing steam.  \n\nBut the pressing question now is whether that pace of progress toward slower price increases — one that was long awaited and very welcome — can persist.  \n\nThe Fed’s preferred inflation measure, the Personal Consumption Expenditures index, is expected to tick up to 4.2 or 4.3 percent in a report on Thursday, after volatile food and fuel costs are stripped out.  \n\nThat would be an increase from 4.1 percent for the core measure in June. And while it would still be down considerably from a peak of 5.4 percent last summer, such a reading would underscore that inflation remains stubbornly above the Fed’s 2 percent goal and that its path back to normal is proving bumpy.  \n\n![](images/image_2.jpg)  \n\n![](images/image_3.jpg)  \n\nFrom top, damage in Florida from Hurricane Idalia, which was downgraded to a tropical storm by Wednesday evening: Horseshoe Beach; Cedar Key, a group of tiny islands; and Crystal River.  \n\n# HURRICANE SLAMSCOASTAL REG",
    "chunk_order_index": 0,
    "full_doc_id": "doc-bb0412a2fbe4240b877fea8a4a61de2a"
  },
  "chunk-c0919034a37719e4aa88dc48eaa5c4a4": {
    "tokens": 1200,
    "content": "reading would underscore that inflation remains stubbornly above the Fed’s 2 percent goal and that its path back to normal is proving bumpy.  \n\n![](images/image_2.jpg)  \n\n![](images/image_3.jpg)  \n\nFrom top, damage in Florida from Hurricane Idalia, which was downgraded to a tropical storm by Wednesday evening: Horseshoe Beach; Cedar Key, a group of tiny islands; and Crystal River.  \n\n# HURRICANE SLAMSCOASTAL REGIONS IN WEST FLORIDA  \n\nTWO DIE DURING STORM  \n\nState Spared Worst, but Now South Carolina Faces Danger  \n\n# By PATRICIA MAZZEI and THOMAS FULLER  \n\nKEATON BEACH, Fla. — Hurricane Idalia, the first major storm to pummel Florida this season, brought a surge of seawater on Wednesday that flooded neighborhoods  along  much  of  the state’s western coast and lacerating winds that cut power and leveled trees. Two people died in traffic accidents that the police linked to the harsh conditions. Rescuers pulled  scores  of  people  from homes that were taking on water. But the damage inflicted by Idalia, which was a Category 3 hurricane when it made landfall on Wednesday morning, could have been far worse. By a stroke of meteorological good fortune, the hurricane came ashore in a marshy and thinly populated part of Florida, southeast of Tallahassee.  \n\nHardest hit were sparse fishing and beach towns scattered along the Big Bend, the crook in the state that connects the Panhandle to the Florida peninsula.  \n\n“It came through — the whole ocean,”  said  Donna  Knight,  a clammer in Cedar Key, Fla., a conglomeration of tiny islands connected by bridges that juts three miles into the Gulf of Mexico. Ms. Knight described a night of howling winds, frightening bangs and flying debris. A Category 3 hurricane has winds between 111 and 129 miles per hour.  \n\n“We should have gotten off the island,” she said early Wednesday afternoon.  \n\nBy Wednesday evening, Idalia had been downgraded to a tropical storm, charging across Georgia and South Carolina, but the danger had not passed. Forecasters in Charleston, S.C., warned of “dangerous  coastal  inundation”  in lower South Carolina.  \n\nAlong the Florida coast, every last foot of elevation seemed crucial for avoiding the worst effects of the storm.  \n\nNot long after the storm had passed, Doug Nicholson, a resident of Crystal River, a coastal city south of Cedar Key, watched floodwaters rise along his street. His home is 13 feet above sea level, he noted. But his neighbors were on lower ground and bracing for the water to rush “right through their entire house,” he said.  \n\nIdalia generated distressingly familiar  scenes  of  residential streets turned to rivers and windbattered homes. But the damage was much smaller than that of Hurricane Ian last year, which made landfall in populous Southwest Florida and was responsible for 150 deaths — many of them from drowning during an enormous storm surge — and over \\$112 billion in damage. Ian was the state’s deadliest storm since 1935. Gov.  Ron  DeSantis  said  on Wednesday  that  Idalia  had knocked out power for 250,000 residents, but that the road conditions in the state were “probably Continued on Page A11  \n\nThe assault in Russia came after months of Moscow’s deadly missile  and  drone  strikes  on Ukrainian  cities,  infrastructure and  military  targets.  While Ukrainian officials did not claim responsibility for the overnight strikes on Russian soil, in keeping with standard practice, they have made it increasingly clear that they view taking the war to ordinary Russians as a legitimate tactic against Moscow’s invasion.  \n\n“We all went through these attacks  by  Russia,”  Oleksandr Continued on Page A8  \n\nMost economists are not hugely concerned. They still expect inflation to ease later this year and into 2024  as  pandemic  disruptions fade and as consumers become less willing to accept ever-higher prices for goods and services. American shoppers are already feeling the squeeze of both shrinking savings and higher Fed interest rates.  \n\nBut as price increases slow in fits and starts, they are keeping economic officials wary.  \n\nBig uncertainties loom, includContinued on Page A12  \n\n# Built on Rainbows, an Ice Cream Sensation Teeters Under a Cloud  \n\n# By JULIA MOSKIN  \n\nIt was all rainbows and unicorns for a while. But like many fun ideas, Big Gay Ice Cream has wound up in debt and in court. With a rollicking rise that leveraged queer identity as a brand strategy, the New York City-based soft-serve  chain  opened  seven shops in the Northeast and landed its products in supermarkets nationwide. The company now is down to just one location. On Friday, a founder and partner, Doug Quint, filed a lawsuit in New York State Supreme Court accusing  another  partner,  Jon Chapski,  of  mismanaging  the company and fraudulently collecting government loans during the pandemic.  \n\nOn Tuesday afternoon, through  \n\n# A Legal Fight to Control  \n\nthe ‘Big Gay’ Brand a spokesperson, Mr. Chapski said only that he was reviewing the lawsuit with his lawyer and would respond “when appropriate.” In 2009, when the Big Gay Ice Cream Truck first rolled into the annual Brooklyn Pride parade, it caught a wave of pop culture that included hits like “RuPaul’s Drag Race,” Lady Gaga’s “Born This Way” and “Orange Is the New Black,” and marked a national shift that culminated in the legalization of marriage for same-sex couples  across  the  country  in 2015.  \n\nContinued on Page A16 INTERNATIONAL A4-9",
    "chunk_order_index": 1,
    "full_doc_id": "doc-bb0412a2fbe4240b877fea8a4a61de2a"
  },
  "chunk-21b84fe92d92da4a7ae0e8f5ec340b32": {
    "tokens": 538,
    "content": "“when appropriate.” In 2009, when the Big Gay Ice Cream Truck first rolled into the annual Brooklyn Pride parade, it caught a wave of pop culture that included hits like “RuPaul’s Drag Race,” Lady Gaga’s “Born This Way” and “Orange Is the New Black,” and marked a national shift that culminated in the legalization of marriage for same-sex couples  across  the  country  in 2015.  \n\nContinued on Page A16 INTERNATIONAL A4-9 Dying Fish in a Storied River The biggest die-off in living memory on the Cowichan River in Canada might be traced to climate change. PAGE A4 Gabon’s Military Declares Coup President Ali Bongo Ondimba was detained hours after being declared the winner of a disputed election.  PAGE A9  \n\n![](images/image_4.jpg)  \n\n# NATIONAL A10-17  \n\nBiden Explains the Benefits President Biden is putting a policy that lowers drug costs at the center of his re-election campaign. It’s effective — if people know the policy exists. PAGE A12 Racing to Tap Clean Energy The U.S. has enough geothermal energy to power the entire country. Some are trying to unlock it by using techniques from the fracking boom. PAGE A13 Concerns About McConnell For the second time this summer, Mitch McConnell, the Senate minority leader, froze in front of reporters, intensifying questions about his future. PAGE A12 THURSDAY STYLES D1-6 Drenched in Fashion Designers like to create the illusion of wetness in their creations, as with the necklace and earrings above.  PAGE D4 Sharing the Spotlight Morgan Riddle draws a lot of attention at pro tennis matches, where she cheers for Taylor Fritz, her boyfriend. PAGE D5  \n\n![](images/image_5.jpg)  \n\n# BUSINESS B1-5  \n\nCreating Power and Confusion Many carmakers are abandoning the current charging systems for their electric vehicles and shifting to the Tesla plug. Why are they doing that, and what will it mean? PAGE B1 A Lift for Sagging CNN Mark Thompson, who oversaw periods of growth at The New York Times and the BBC, has been named the network’s new chairman and editor in chief as it enters a pivotal period. PAGE B1  \n\n# OPINION A18-19  \n\n# Nicholas Kristof  \n\nPAGE A19  \n\n![](images/image_6.jpg)  \n\n# SPORTS B6-8  \n\nWhat You Don’t See on TV The commute, the fight for court time and the sponsorship commitments make the life of a tennis player demanding during the U.S. Open. PAGE B6",
    "chunk_order_index": 2,
    "full_doc_id": "doc-bb0412a2fbe4240b877fea8a4a61de2a"
  }
}