{
    "image_1": [
        {
            "entity_name": "IMAGE_1_MOTORCYCLE-2.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'person'. The entity features are as follows:Person Features:- Gender: Male- Skin Color: Light- Hairstyle: Not visible- Clothing: Wearing a long, tattered coat that appears to be made of a heavy fabric, possibly leather or canvas; the coat is dirty and worn, suggesting it has been used extensively or for a long time- Posture: The person is in an action pose, with one leg raised as if stepping over or onto something; the other leg is bent at the knee, providing support and balance- Accessories: Wearing boots that appear to be sturdy and well-worn, suitable for rough terrain or combatOverall, the character gives off a rugged, adventurous vibe, possibly a traveler or warrior who has faced many challenges."
        },
        {
            "entity_name": "IMAGE_1_PERSON-0.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'person'. The entity features are as follows:Person Features:- Gender: Male- Skin Color: Light skin tone- Hairstyle: Short hair, not clearly visible due to the hat- Facial Expression: Not clearly visible due to the angle and hat- Age: Appears to be an adult- Clothing: Wearing a camouflage outfit, including a jacket with multiple pockets and a matching hat; brown boots- Accessories: Holding a smartphone in both hands- Posture: Sitting down, legs apart, leaning slightly forwardOverall, the person appears to be engaged with the smartphone, possibly checking messages or using an application. The camouflage attire suggests that he might be involved in outdoor activities or military service."
        },
        {
            "entity_name": "IMAGE_1_PERSON-1.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'person'. The entity features are as follows:Person Features:- Gender: Male- Skin Color: Dark skin tone- Hairstyle: Short hair, partially covered by a camouflage-patterned cap- Facial Expression: Not visible due to the angle and lighting- Age: Appears to be an adult- Clothing: Wearing a full-body camouflage uniform with a blue armband on the left arm; black boots- Posture: Crouching or kneeling position, with one knee on the ground and the other leg bent at the knee; hands resting on the thigh of the bent leg- Accessories: Wearing gloves and a belt with pouchesOverall, the character appears to be in a tactical or military setting, possibly engaged in an operation or training exercise."
        },
        {
            "entity_name": "IMAGE_1_PERSON-3.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'person'. The entity features are as follows:Person Features:- Gender: Male- Skin Color: Dark skin- Hairstyle: Short hair, styled in a mohawk with the sides shaved- Facial Expression: Eyes closed, mouth slightly open, appearing to be shouting or calling out- Age: Appears to be an adult male- Clothing: Wearing a camouflage military uniform with a blue armband on the left arm- Posture: Kneeling on one knee, with the other leg bent and foot flat on the ground; arms raised, hands cupped around the mouth, suggesting he is shouting or calling outOverall, the character gives off a sense of urgency or distress, possibly in a combat or emergency situation."
        },
        {
            "entity_name": "IMAGE_1",
            "entity_type": "ORI_IMG",
            "description": "The image depicts a scene of destruction and desolation in a village that has been retaken during Ukraine’s counteroffensive. The setting is an abandoned building with a partially collapsed roof, exposing the sky through the damaged structure. The walls are made of brick and have large windows, some of which are broken or missing. The ground is littered with debris, including twisted metal sheets and other rubble. Three soldiers are present in the scene. One soldier is sitting on a large tire, smoking a cigarette, while another is kneeling nearby, possibly using a mobile device. The third soldier is seated on a piece of machinery or equipment, also appearing to be resting or taking a break. The overall atmosphere conveys a sense of tension and fatigue, as the soldiers take a momentary respite amidst the ruins. The background includes a fence made of corrugated metal sheets, some of which are bent and damaged, adding to the sense of destruction. The soldiers are dressed in camouflage uniforms, indicating their military role in the ongoing conflict."
        },
        {
            "entity_name": "SOLDIER 1",
            "entity_type": "PERSON",
            "description": "Sitting on a tire, wearing camouflage uniform, holding a cigarette."
        },
        {
            "entity_name": "SOLDIER 2",
            "entity_type": "PERSON",
            "description": "Sitting on the ground, wearing camouflage uniform, looking at a device."
        },
        {
            "entity_name": "SOLDIER 3",
            "entity_type": "PERSON",
            "description": "Sitting on a tire, wearing camouflage uniform, resting."
        },
        {
            "entity_name": "RUINED BUILDING",
            "entity_type": "GEO",
            "description": "A building with a collapsed roof and damaged walls."
        },
        {
            "entity_name": "TIRE",
            "entity_type": "OBJECT",
            "description": "Large tire used as a seat by the soldiers."
        },
        {
            "entity_name": "DEVICE",
            "entity_type": "OBJECT",
            "description": "An electronic device being held by Soldier 2."
        }
    ],
    "image_2": [
        {
            "entity_name": "IMAGE_2",
            "entity_type": "ORI_IMG",
            "description": "The image depicts a striking art installation located in a grand, white-walled room with a large, circular skylight at the top. The installation consists of a dense aggregation of red, glove-like objects that appear to be made of a soft material, possibly fabric or rubber. These gloves are densely packed and form a mound that fills the lower half of the image. Interspersed among the gloves are black, thorny branches that add a contrasting texture and color to the scene. The overall atmosphere is one of intensity and perhaps unease, given the unusual combination of elements and the overwhelming presence of the gloves. The stark white walls and ceiling provide a dramatic backdrop that highlights the vivid red of the gloves and the dark, spiky branches."
        },
        {
            "entity_name": "RED GLOVES INSTALLATION",
            "entity_type": "EVENT",
            "description": "An art installation consisting of numerous red gloves arranged in a mound-like structure, interspersed with black thorny branches."
        },
        {
            "entity_name": "DOME CEILING",
            "entity_type": "GEO",
            "description": "A large, white, domed ceiling with a central skylight that allows natural light to illuminate the space."
        }
    ],
    "image_3": [
        {
            "entity_name": "IMAGE_3_BENCH-3.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'object'. The entity features are as follows:Object Features:- Name: Sign or banner- Color: The text is in white and blue, with a red underline emphasizing the word \"STOP\". The background is a gradient of blue shades.- Shape: Rectangular- Size: Appears to be large enough to be easily readable from a distance, suggesting it might be used for public display or protest.- Material: Likely made of fabric or plastic, typical materials for banners or signs.- Possible function: This object appears to be a protest sign or banner, intended to convey a strong message against the mistreatment or neglect of Native children. The bold, capitalized text and the use of contrasting colors (white text on a blue background) are designed to grab attention and communicate urgency.Overall, the sign is a powerful visual tool aimed at raising awareness and advocating for the rights and welfare of Native children."
        },
        {
            "entity_name": "IMAGE_3_PERSON-0.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'person'. The entity features are as follows:Person Features:- Gender: Female- Hairstyle: Short, layered hair with a side parting, light brown in color- Eyes: Not clearly visible due to the angle and lighting- Expression: Neutral or focused expression- Age: Appears to be an adult woman- Clothing: Wearing a dark-colored top, possibly black or deep blue- Accessories: Holding a microphone close to her mouth with her right hand, suggesting she might be singing or speaking- Posture: Standing upright, slightly leaning forward, which is typical for someone performing or speaking into a microphoneOverall, the character appears to be engaged in a performance or public speaking event."
        },
        {
            "entity_name": "IMAGE_3_PERSON-1.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'person'. The entity features are as follows:Person Features:- Gender: Male- Hairstyle: Long hair, dark, styled with a braid and adorned with a headband featuring feathers and beads- Eyes: Not visible due to the angle and shadowing- Expression: Neutral, with a serious or contemplative demeanor- Age: Appears to be an adult male- Clothing: Wearing a long-sleeved shirt in a light pink or salmon color; the sleeves are rolled up to the elbows- Accessories: Large, round earrings; a necklace that appears to have multiple strands and possibly beads or other decorative elements- Posture: Standing with arms crossed over the chest, suggesting a pose of confidence or contemplationOverall, the character gives off a traditional or cultural vibe, possibly representing a figure from Native American heritage."
        },
        {
            "entity_name": "IMAGE_3_PERSON-2.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'person'. The entity features are as follows:Person Features:- Gender: Female- Hairstyle: Long hair, light brown, naturally falling with some hair pinned with a clip- Eyes: Blue, large and expressive- Expression: Smiling, appears friendly and joyful- Age: Appears to be a young woman- Clothing: Wearing a white shirt with the sleeves rolled up, revealing the wrists; paired with blue overalls, with dark blue straps; light blue sneakers on her feet- Accessories: Orange shoulder bag on her right shoulder; brown belt tied around the waist- Holding: Holding a vintage-style camera with both hands, the camera is black and silver, with a large lens, appearing professionalOverall, the character gives off a youthful, lively vibe with a touch of artistic flair."
        },
        {
            "entity_name": "IMAGE_3",
            "entity_type": "ORI_IMG",
            "description": "The image depicts two women standing in front of a building that appears to be the Supreme Court, based on its architectural style. Both women are holding signs with the text 'STOP STEALING NATIVE KIDS' and 'PROTECT ICWA'. The woman on the left has long hair and is wearing a dark jacket over a purple scarf. She is holding her sign with both hands. The woman on the right has long hair as well, is wearing sunglasses, and is dressed in a pink top. She is holding her sign with one hand. The background shows the columns and facade of the Supreme Court building, indicating that this is likely a protest or demonstration related to Native American child welfare issues."
        },
        {
            "entity_name": "WOMAN 1",
            "entity_type": "PERSON",
            "description": "A woman with long hair, wearing a scarf and holding a protest sign."
        },
        {
            "entity_name": "WOMAN 2",
            "entity_type": "PERSON",
            "description": "A woman with long hair, wearing sunglasses and a pink top, holding a protest sign."
        },
        {
            "entity_name": "PROTEST SIGN 1",
            "entity_type": "OBJECT",
            "description": "A sign that reads 'STOP STEALING NATIVE KIDS PROTECT ICWA' held by Woman 1."
        },
        {
            "entity_name": "PROTEST SIGN 2",
            "entity_type": "OBJECT",
            "description": "A sign that reads 'STOP STEALING NATIVE KIDS PROTECT ICWA' held by Woman 2."
        }
    ],
    "image_4": [
        {
            "entity_name": "IMAGE_4",
            "entity_type": "ORI_IMG",
            "description": "The image depicts an indoor scene of a shopping mall with a modern and sleek design. The floor is tiled with a pattern of black and white squares, creating a striking contrast. On the left side of the image, there is a sign that reads 'NORDSTROM' in capital letters, indicating the presence of the Nordstrom store. A person is seen walking towards the Nordstrom entrance, which is illuminated by warm lighting, creating a welcoming atmosphere. The right side of the image shows a closed-off area with a metallic rolling shutter door, suggesting it might be a closed or under-construction section of the mall. The ceiling features recessed lighting and a geometric design, adding to the contemporary feel of the space. The overall atmosphere is clean, well-lit, and organized, typical of a high-end shopping mall."
        },
        {
            "entity_name": "NORDSTROM",
            "entity_type": "ORGANIZATION",
            "description": "A retail store with a visible sign and entrance, located in a shopping mall."
        },
        {
            "entity_name": "SHOPPING MALL",
            "entity_type": "GEO",
            "description": "An indoor commercial space with tiled floors, featuring multiple stores and walkways."
        },
        {
            "entity_name": "PERSON",
            "entity_type": "PERSON",
            "description": "An individual walking towards the Nordstrom store, dressed in dark clothing."
        }
    ],
    "image_5": [
        {
            "entity_name": "IMAGE_5",
            "entity_type": "ORI_IMG",
            "description": "The image depicts a golf course scene, specifically a hole on a golf course. The foreground shows a sandy area with sparse grass, leading up to a well-maintained green. To the right of the green is a sand bunker, and there is another bunker located further back on the left side of the fairway. The fairway itself is bordered by tall grass and shrubs, creating a natural boundary. In the background, there are trees and a sign indicating the hole number, which is '4'. The overall atmosphere is serene and picturesque, typical of a golf course setting."
        },
        {
            "entity_name": "GOLF COURSE",
            "entity_type": "GEO",
            "description": "A well-maintained golf course with a green, sand bunkers, and surrounding trees."
        },
        {
            "entity_name": "SAND BUNKERS",
            "entity_type": "OBJECT",
            "description": "Areas of sand designed to challenge golfers on the golf course."
        },
        {
            "entity_name": "TREES",
            "entity_type": "GEO",
            "description": "Green trees bordering the golf course, providing a natural boundary."
        },
        {
            "entity_name": "PATHWAY",
            "entity_type": "GEO",
            "description": "A narrow pathway leading towards the green on the golf course."
        }
    ],
    "image_6": [
        {
            "entity_name": "IMAGE_6_PERSON-0.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'person'. The entity features are as follows:Person Features:- Gender: Female- Hairstyle: Short, light brown bob with bangs- Eyes: Not visible due to the angle and lighting- Expression: Neutral, possibly contemplative or focused- Age: Appears to be a young adult- Clothing: Wearing a patterned shirt with a mix of colors including pink, yellow, and white- Posture: Sitting, with one arm resting on a surfaceOverall, the character gives off a calm and focused vibe."
        },
        {
            "entity_name": "IMAGE_6",
            "entity_type": "ORI_IMG",
            "description": "The image features a person with short, light brown hair styled in a bob cut. The individual is wearing a patterned garment with a mix of colors and designs, including geometric shapes and possibly floral elements. The background includes a large, colorful mural or painting that depicts a stylized face with prominent eyes and a serene expression. The mural has a blend of earthy tones and vibrant colors, creating a warm and artistic atmosphere. The person appears to be seated or standing in front of the mural, contributing to a relaxed and contemplative mood."
        },
        {
            "entity_name": "WOMAN",
            "entity_type": "PERSON",
            "description": "A woman with short brown hair, wearing a patterned top, looking to the side."
        },
        {
            "entity_name": "PAINTING",
            "entity_type": "OBJECT",
            "description": "A painting with abstract designs and colors in the background."
        }
    ]
}