{
    "image_1": {
        "entity_name": "Liz Truss",
        "entity_type": "PERSON",
        "description": "Liz Truss is a British politician who has been chosen to replace Prime Minister Boris Johnson, leading a country in economic crisis.",
        "reason": "The image shows Liz Truss shaking hands with Andrew Stephenson, the Conservative Party chairman, at party headquarters. This aligns with the text which mentions that Liz Truss has been chosen as the new Prime Minister of the United Kingdom.",
        "matched_chunk_entity_name": "LIZ TRUSS"
    },
    "image_2": {
        "entity_name": "BEAVERS",
        "entity_type": "GEO",
        "description": "Beavers are seen as both a nuisance and a tool for climate resilience in Nevada, helping with water management and reducing the impact of droughts and floods.",
        "reason": "The image clearly shows a beaver swimming in a calm body of water, which aligns with the description of beavers in the text. The text mentions that beavers are beneficial for water management and climate resilience in Nevada, which is reflected in the serene and natural environment depicted in the image.",
        "matched_chunk_entity_name": "BEAVERS"
    },
    "image_3": {
        "entity_name": "West Indian Revelry",
        "entity_type": "EVENT",
        "description": "A cultural event in Brooklyn that returned after two years of scaled-back celebrations due to Covid-19.",
        "reason": "The image depicts a vibrant and energetic parade scene, which aligns with the description of West Indian revelry returning to Brooklyn after being scaled back due to Covid-19. The participants are dressed in colorful costumes and engaged in lively dance movements, embodying the spirit of celebration and cultural pride.",
        "matched_chunk_entity_name": "West Indian Revelry"
    },
    "image_4": {
        "entity_name": "Whales",
        "entity_type": "GEO",
        "description": "Whales are marine mammals that share songs from Australia to Ecuador, with their melodies not taking long to migrate across oceans.",
        "reason": "The image clearly shows a humpback whale breaching out of the ocean, which aligns with the description of whales in the text information.",
        "matched_chunk_entity_name": "Whales"
    },
    "image_5": {
        "entity_name": "U.S. Open",
        "entity_type": "EVENT",
        "description": "U.S. Open is a tennis event where Frances Tiafoe beat the No. 2 seed and 22-time Grand Slam singles champion, Rafael Nadal.",
        "reason": "The image clearly shows a male tennis player in action during a match, which aligns with the description of the U.S. Open event mentioned in the text.",
        "matched_chunk_entity_name": "U.S. Open"
    }
}