{
    "image_1": [
        {
            "merged_entity_name": "Liz Truss",
            "entity_type": "PERSON",
            "description": "Liz Truss is a British politician who has been chosen to replace Prime Minister Boris Johnson, leading a country in economic crisis. She is set to become Prime Minister of the United Kingdom, facing significant economic and political challenges. She will be formally anointed by Queen Elizabeth II at Balmoral Castle in Scotland.",
            "source_image_entities": [
                "WOMAN"
            ],
            "source_text_entities": [
                "LIZ TRUSS"
            ]
        }
    ],
    "image_2": [
        {
            "merged_entity_name": "BEAVER",
            "entity_type": "ANIMAL",
            "description": "Beavers, also known as 'beaver believers', are seen as helpers and furry weapons of climate resilience in Nevada. They are wild, swimming rodents that build dams and ponds, which help with water management, reducing the impact of droughts and floods. Beavers' landscape-altering activities disrupt agriculture but also provide benefits such as maintaining water supply for cattle during droughts, slowing the torrent of water during heavy rains, protecting hay crops, and creating wetlands that clean water, birth new meadows, and create a buffer against wildfires.",
            "source_image_entities": [
                "BEAVER"
            ],
            "source_text_entities": [
                "BEAVERS"
            ]
        },
        {
            "merged_entity_name": "WATER",
            "entity_type": "GEO",
            "description": "Water is a critical resource in northeastern Nevada, especially for properties like Cottonwood Ranch. Beavers' dams and ponds help manage water supply, which is crucial during droughts and heavy rains. These beaver-altered landscapes maintain water for cattle, slow the torrent of water during heavy rains, and clean water in the created wetlands.",
            "source_image_entities": [
                "WATER"
            ],
            "source_text_entities": [
                "BEAVER POOLS"
            ]
        }
    ],
    "image_3": [
        {
            "merged_entity_name": "STREET PARADE",
            "entity_type": "EVENT",
            "description": "A festive event taking place on a city street, with a crowd of spectators watching the performance, known as West Indian revelry which returned to Brooklyn after two years of scaled-back celebrations due to Covid-19.",
            "source_image_entities": [
                "STREET PARADE"
            ],
            "source_text_entities": [
                "WEST INDIAN REVELRY"
            ]
        }
    ],
    "image_4": [
        {
            "merged_entity_name": "WHALE",
            "entity_type": "ANIMAL",
            "description": "A humpback whale breaching out of the ocean, an impressive display of marine life that also shares songs across vast ocean distances.",
            "source_image_entities": [
                "WHALE"
            ],
            "source_text_entities": [
                "WHALES"
            ]
        }
    ],
    "image_5": [
    ]
}