{
  "chunk-af7e26a7374b68f94f07bbc33b1e514e": {
    "tokens": 1200,
    "content": "# Che Neu llork Cimes  \n\nVOL. CLXXI . . . No. 59,470  \n\n© 2022  The New York Times Company  \n\nNEW YORK, THURSDAY, JUNE 30, 2022  \n\n\\$3.00  \n\n# Rifts Abound Over Enforcing Abortion Bans  \n\nTexas Group Pressured Police in First Salvo  \n\n# By J. DAVID GOODMAN  \n\nHOUSTON — Deep rifts have emerged among the hundreds of elected district attorneys who will be charged with enforcing the expanding restrictions on abortion, creating a Balkanized new legal system within states that are banning the procedure.  \n\nDozens of Democratic prosecutors who represent liberal pockets in  conservative  states  already have vowed to resist bans by refusing to bring charges against abortion providers. But in many rural areas and outlying suburbs, conservative  prosecutors  have said they will enforce their state bans.  \n\nAn opening salvo came this week, just days after the Supreme Court struck down the right to abortion, when a prominent antiabortion group in Texas urged the police and prosecutors in Dallas and Houston to open criminal investigations into three abortion clinics that the group said were preparing to violate the law by scheduling abortions.  \n\n“It is your duty to uphold the law and investigate crimes,” the group, Texas Right to Life, said in its letter, in which it claimed to have phone recordings of clinic employees. “We urge you and your officers to investigate this abortion clinic.”  \n\nThe demand was quickly made moot when a judge temporarily blocked attempts to resurrect the state’s long-dormant, century-old abortion law in the weeks before a new  ban  takes  effect,  but  it marked the beginning of an explosive new battle over abortion in America: How prosecutors and the police will enforce laws that criminalize abortion in two dozen states, some of them carrying Continued on Page A18  \n\n# An Island of Access  \n\n![](images/image_1.jpg)  \n\n# NATO Retools Its Mission For Moscow’s Aggression  \n\nResponding to Putin’s Invasion of Ukraine and Strategic ‘Challenge’ of Beijing  \n\nMADRID — Faced with a newly aggressive Russia, NATO leaders on Wednesday outlined a muscular new vision that names Moscow as the military alliance’s primary adversary but also, for the first time, declares China to be a strategic “challenge.”  \n\nIt was a fundamental shift for an alliance that was born in the Cold War but came to view a postSoviet Russia as a potential ally, and did not focus on China at all. But that was before Feb. 24, when  Russian  forces  poured across the border into Ukraine, and Chinese leaders pointedly did not join in the global condemnation that followed.  \n\n“The deepening strategic partnership between the People’s Republic of China and the Russian Federation and their mutually reinforcing attempts to undercut the rules-based  international  order run counter to our values and interests,” NATO leaders said in a new  mission  statement  issued during their summit in Madrid. The announcement came on a day when a top U.S. intelligence official said victory in Ukraine was not yet in Russia’s grasp, the two  sides  said  they  had  exchanged more than 200 prisoners of war, and a Ukrainian official said, “There are battles everywhere.”  \n\nIn a flurry of steps at the summit in Madrid, which ends Thursday, President Biden and other NATO leaders sought to respond to President Vladimir V. Putin’s resurgent and bellicose Russia. Just before publishing the mission statement, they extended formal membership invitations to the until-now nonaligned Nordic countries Finland and Sweden, paving the way for NATO’s most significant enlargement in more than a decade. “In a moment when Putin has  \n\n# and MICHAEL D. SHEAR  \n\nshattered peace in Europe and attacked the very tenets of the rulesbased order, the United States and our allies — we’re going to step up,” Mr. Biden said. “We’re stepping up.”  \n\nThe secretary-general of NATO, Jens Stoltenberg, announced that thousands of new troops would be deployed in eight countries on NATO’s eastern flank. And Mr. Biden said that Washington would deploy an Army garrison headquarters and a field support battalion in Poland, the first U.S. forces  permanently  located  on NATO’s eastern flank. China offered a chilly response  \n\n“We oppose certain elements clamoring  for  NATO’s  involvement in Asia Pacific, or an Asia Pacific version of NATO based on military  alliance,”  said  China’s ambassador to the United Nations, Zhang Jun. “The outdated Cold War script must not be reenacted in Asia Pacific. The turmoil in parts of the world must not be allowed in Asia Pacific.” For his part, Mr. Putin kept his attention in Central Asia, where Continued on Page A6  \n\n![](images/image_2.jpg)  \n\n“We’re stepping up,” President Biden said of NATO’s shift.  \n\n# Brazilians Tap A Black Market In Abortion Pills  \n\n# By STEPHANIE NOLEN  \n\nRIO DE JANEIRO — Last November,  Xaiana,  a  23-year-old college  student  in  northern Brazil,  began  exchanging  text messages with a drug dealer in the south of the country. Following the dealer’s instructions, she transferred  1,500  reais  (\\$285), her living expenses for several months. Then, she waited three agonizing weeks for the arrival in the mail of a blister pack of eight unmarked white pills.  \n\nWhen she took them, they had the effect she was hoping for: She underwent a medication abortion at home with her boyfriend, end  \n\n# McKinsey’s Sway Pervaded the Opioid Industry  \n\n# By CHRIS HAMBY and MICHAEL FORSYTHE  \n\nIn patches of rural Appalachia and the Rust Belt, the health authorities were sounding alarms that a powerful pain",
    "chunk_order_index": 0,
    "full_doc_id": "doc-1981b90a047910739f4a69dc16e68ed1"
  },
  "chunk-56696889ce13522c71485b671e1a26e2": {
    "tokens": 1200,
    "content": "three agonizing weeks for the arrival in the mail of a blister pack of eight unmarked white pills.  \n\nWhen she took them, they had the effect she was hoping for: She underwent a medication abortion at home with her boyfriend, end  \n\n# McKinsey’s Sway Pervaded the Opioid Industry  \n\n# By CHRIS HAMBY and MICHAEL FORSYTHE  \n\nIn patches of rural Appalachia and the Rust Belt, the health authorities were sounding alarms that a powerful painkiller called Opana had become the drug of choice among people abusing prescription pills.  \n\nIt was twice as potent as OxyContin,  the  painkiller  widely blamed for fueling the opioid crisis, and was relatively easy to dissolve and inject. By 2015, government investigations and scientific publications had linked its misuse to clusters of disease, including a rare  and  life-threatening  blood disorder and an H.I.V. outbreak in Indiana.  \n\nOpana’s manufacturer, the  \n\n# Tips to Boost Sales and  \n\n# Handle Regulators  \n\npharmaceutical company Endo, had scaled back promotion of the drug. But months later, the company abruptly changed course, refocusing resources on the drug by assigning more sales representatives.  \n\nThe push was known internally as the Sales Force Blitz — and it was conducted with consultants at McKinsey & Company, who had been hired by Endo to provide marketing  advice  about  its chronic-pain medicines and other products.  \n\nThe untold story of McKinsey’s work for Endo was among the revelations found by The New York Times in a repository of more than 100,000 documents obtained by a coalition of state attorneys general in a legal settlement related to McKinsey’s opioid work. Much has been disclosed over the years about McKinsey’s relationship with Purdue Pharma, including the consulting firm’s recommendation  that  the  drug maker “turbocharge” its sales of OxyContin. But The Times found that the firm played a far deeper and broader role in advising clients involved in the opioid crisis than was publicly disclosed. The newly released McKinsey records  include  more  than  15 years of emails, slide presentaContinued on Page A12  \n\n# Aide’s Testimony Reveals Friction Between Parallel Jan. 6 Inquiries  \n\nThis article is by Glenn Thrush, Luke Broadwater and Michael S. Schmidt.  \n\nWASHINGTON — The explosive testimony of a former Trump White House aide on Tuesday may have increased the likelihood of new prosecutions stemming from the attack on the Capitol, but it also bared lingering conflicts between  the  Justice  Department and congressional investigators. The federal prosecutors working on the case watched the aide’s appearance  before  the  House committee  investigating  the Jan. 6, 2021, riot and were just as astonished by her account of former President Donald J. Trump’s increasingly desperate bid to hold on to power as other viewers. The panel did not provide them with videos or transcripts of her taped interviews with committee members  beforehand,  according  to several  officials,  leaving  them feeling blindsided.  \n\nThe testimony from the aide, Cassidy Hutchinson, who worked for Mr. Trump’s final chief of staff, Mark Meadows, came at a critical moment in parallel investigations that will soon converge, and possibly  collide,  as  the  committee wraps up a public inquiry geared for maximum political effect and Continued on Page A15  \n\ning an eight-week pregnancy. But Xaiana kept bleeding for weeks, an unusual but not rare complication. “It was like a murder scene every time I had a shower,” she said. She was afraid to get help because it is illegal for a woman in Brazil to use the drug, misoprostol, to trigger an abortion. If she went to a clinic, she feared, the staff might figure out she had induced the abortion and report her. The penalty for having an abortion in Brazil is up to three years in jail.  \n\n“It’s the loneliest feeling I’ve ever felt in my life,” she said, asking to be identified only by her first name out of fear of prosecution.  \n\nAfter seven weeks, she went to a women’s clinic and admitted to having terminated a pregnancy. She was given a simple cauterization, and no one reported her.  \n\nContinued on Page A19  \n\n![](images/image_3.jpg)  \n\n# Egypt Destroys Nile Houseboats  \n\nThe settings for divas’ debauched salons and famous films, they are suddenly vanishing. Page A8.  \n\n# Truck With Doomed Migrants Slipped Past U.S. Checkpoint  \n\nThis article is by James Dobbins, J. David Goodman and Miriam Jordan. SAN ANTONIO — A tractortrailer that ended up in San Antonio with more than 50 dead or dying migrants passed through a federal  immigration  checkpoint inside the United States without being inspected, a top Mexican official said on Wednesday. The truck crossed the checkpoint, operated by the Border Patrol, shortly before 3 p.m. on Monday as it drove north along Interstate 35 from the border region, the official, Francisco Garduño Yáñez, the head of Mexico’s National Institute of Migration, said at a news conference that featured images of the truck and its driver at the checkpoint.  \n\nThe Mexican official also said that the rig had driven by a Border Patrol station in the town of Cotulla; that station does not operate a highway checkpoint.  \n\nThe  truck  stopped  roughly three hours later along a desolate road just off the highway, with the people inside either dead or struggling to stay alive.  \n\n“I didn’t get her name or think to ask where she came from,” said Roberto Quintero, who came upon Continued on Page A20  \n\n# ARTS C1-6  \n\n# NATIONAL A10-21  \n\n# INTERNATIONAL A4-9",
    "chunk_order_index": 1,
    "full_doc_id": "doc-1981b90a047910739f4a69dc16e68ed1"
  },
  "chunk-ef6a6d3bb7f334100425a940b949728c": {
    "tokens": 532,
    "content": "town of Cotulla; that station does not operate a highway checkpoint.  \n\nThe  truck  stopped  roughly three hours later along a desolate road just off the highway, with the people inside either dead or struggling to stay alive.  \n\n“I didn’t get her name or think to ask where she came from,” said Roberto Quintero, who came upon Continued on Page A20  \n\n# ARTS C1-6  \n\n# NATIONAL A10-21  \n\n# INTERNATIONAL A4-9  \n\n# THURSDAY STYLES D1-6  \n\n# BUSINESS B1-10  \n\nOrlando Museum Chief Fired Aaron De Groft’s ouster came after the F.B.I. seized 25 paintings attributed to Basquiat as part of an inquiry.  PAGE C1 Conan Gray Feels It All The 23-year-old who got his start on YouTube is reintroducing himself with a new LP, “Superache.” PAGE C1 R. Kelly Sentenced to 30 Years The prison term is the culmination of the R&B star’s stunning downfall, after increasingly heinous accusations from women grew over decades.  PAGE A20 Hunting for a Tiny Pest Several new species of ticks, carrying frightening new diseases, have expanded their turf to New York. PAGE A10 SPORTS B11-13 A Soccer Power Is Shaken The Premier League club Chelsea, which sold for billions, came with accusations of a toxic culture. PAGE B13 Painful Quest for Justice Ukrainian officials face daunting challenges in trying to prosecute Russian soldiers who raped women in occupied villages near Kyiv. PAGE A7  \n\n20 Convicted in Paris Rampage The verdict capped a 10-month trial on the 2015 Islamic State terrorist spree that left 130 people dead. PAGE A5 OBITUARIES B14-15 Hero in the Fight for Iwo Jima Hershel Williams, the last living recipient of the Medal of Honor for bravery during World War II, was 98.  PAGE B14 Fashionably Masculine Though gender fluidity is here to stay, this was not its moment on the runways of Paris, Guy Trebay writes.  PAGE D5 For Luxurious Tastes Joey Wölffer, an owner of a winery, has been busy turning her rosés into symbols of a Hamptons lifestyle. PAGE D1 High Rates Cool Home Sales As the Fed tries to tame inflation, costly mortgage rates are pricing people out of the housing market. PAGE B1 Workers Want to Fight Back As assaults at stores have increased, some retail employees are tired of fearing for their safety. PAGE B1  \n\n![](images/image_4.jpg)",
    "chunk_order_index": 2,
    "full_doc_id": "doc-1981b90a047910739f4a69dc16e68ed1"
  }
}