{
    "image_1": {
        "image_id": 1,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (5)/images/image_1.jpg",
        "caption": [],
        "footnote": [],
        "context": "The ‘What am I to do?’ exclaimed Alice, looking about in great perplexity, as first one round head, and then the other, rolled down from her shoulder, and lay like a heavy lump in her lap. ‘I don’t think it ever happened before, that any one had to take care of two Queens asleep at once! No, not in all the History of England––it couldn’t, you know, because there never was more than one Queen at a time. Do wake up, you heavy things!’ she went on in an impatient tone; but there was no answer but a gentle snoring. Alice, as she tried to obey the first direction: ‘and I don’t know any soothing lullabies.’ ‘I must do it myself, then,’ said the Red Queen, and she began:–– ‘Hush-a-by lady,\\* in Alice’s lap! Till the feast’s ready, we’ve time for a nap. When the feast’s over, we’ll go to the ball–– Red Queen, and White Queen, and Alice, and all! ‘And now you know the words,’ she added, as she put her head down on Alice’s other shoulder, ‘just sing it through to me. I’m getting sleepy, too.’ In another moment both Queens were fast asleep, and snoring loud. ",
        "chunk_order_index": 0,
        "chunk_id": "chunk-9750becd2fd0312aa542638d707f5333",
        "description": "The image is a black-and-white illustration depicting a whimsical scene from the story of Alice in Wonderland. At the center, Alice stands with a surprised and somewhat bewildered expression, wearing a dress and a crown, holding a scepter. On either side of her are two large, round-headed figures resembling queens, each adorned with crowns and dressed in elaborate clothing. The queen on the left appears to be asleep, leaning heavily against Alice, while the queen on the right is also slumped over, contributing to the sense of weight and burden that Alice seems to be carrying. The background features tall grasses and wildflowers, adding to the fantastical and dreamlike atmosphere of the scene. The overall mood conveyed is one of confusion and absurdity, as Alice finds herself in an unexpected and surreal situation.",
        "segmentation": true
    },
    "image_2": {
        "image_id": 2,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (5)/images/image_2.jpg",
        "caption": [],
        "footnote": [],
        "context": "‘Shouldn’t do that––shouldn’t do ‘Nothing!’ Alice said impatiently. ‘I’ve been knocking at it!’ ‘I speaks English, doesn’t I?’ the Frog went on. ‘Or are you deaf? What did it ask you?’ ‘I don’t know what you mean,’ she said. ‘To answer the door?’ he said. ‘What’s it been asking of?’ He was so hoarse that Alice could scarcely hear him. The Frog looked at the door with his large dull eyes for a minute: then he went nearer and rubbed it with his thumb, as if he were trying whether the paint would come off: then he looked at Alice. a bang. Alice knocked and rang in vain for a long time; but at last a very old Frog, who was sitting under a tree, got up and hobbled slowly towards her: he was dressed in bright yellow, and had enormous boots on. ‘What is it, now?’ the Frog said in a deep hoarse whisper. Alice turned round, ready to find fault with anybody. ‘Where’s the servant whose business it is to answer the door?’ she began angrily. ‘Which door?’ said the Frog. Alice almost stamped with irritation at the slow drawl in which he spoke. ‘This door, of course!’ ",
        "chunk_order_index": 0,
        "chunk_id": "chunk-9750becd2fd0312aa542638d707f5333",
        "description": "The image is a black-and-white illustration depicting a scene from the story of Alice in Wonderland. The main characters are Alice and a frog-like creature. Alice, dressed in a Victorian-style dress with a crown on her head, stands to the right of the image. She appears to be speaking or shouting at the door, which has an inscription above it reading 'Queen Alice.' The door is ornate with intricate designs and a knocker shaped like a frog's head. To the left of the door stands a frog-like creature, dressed in a bright yellow outfit with large boots, holding a cane. The creature has a solemn expression and is looking towards Alice. The background features a detailed archway with decorative patterns. The overall atmosphere conveys a sense of frustration and confusion, as Alice tries to get the door opened while the frog-like creature seems indifferent or slow to respond.",
        "segmentation": true
    },
    "image_3": {
        "image_id": 3,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (5)/images/image_3.jpg",
        "caption": [],
        "footnote": [],
        "context": "cut any one you’ve been introduced to. Remove the joint!’ And the waiters carried it ‘Certainly not,’ the Red Queen said, very decidedly: ‘it isn’t etiquette to ‘You look a little shy: let me introduce you to that leg of mutton,’ said the Red Queen. ‘Alice Mutton: Mutton— Alice.’\\* The leg of mutton got up in the dish and made a little bow to Alice; and Alice returned the bow, not knowing whether to be frightened or amused. ‘May I give you a slice?’ she said, taking up the knife and fork, and looking from one Queen to the other. ‘I should never have known who were the right people to invite!’ There were three chairs at the head of the table: the Red and White Queens had already taken two of them, but the middle one was empty. Alice sat down in it, rather uncomfortable at the silence, and longing for some one to speak. At last the Red Queen began. ‘You’ve missed the soup and fish,’ she said. ‘Put on the joint!’ And the waiters set a leg of mutton before Alice, who looked at it rather anxiously, as she had never had to carve a joint before. ",
        "chunk_order_index": 1,
        "chunk_id": "chunk-2a3717ac065f6ad01b3124f32e78c06f",
        "description": "The image is a black-and-white illustration depicting a whimsical and surreal scene. The main figure appears to be a leg of mutton, which is anthropomorphized with a head and arms. The leg of mutton is standing on a plate, wearing what looks like a hat or a flower on its head, and it has a somewhat dignified posture. It is holding a small object in one hand, possibly a napkin or a piece of paper. The background is abstract, with indistinct shapes and lines that suggest a chaotic or dreamlike setting. The overall atmosphere is one of absurdity and fantasy, fitting the context of a story where food items come to life and interact with human characters.",
        "segmentation": false
    },
    "image_4": {
        "image_id": 4,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (5)/images/image_4.jpg",
        "caption": [
            "mischief––but the Queen was no longer at her side––she had suddenly dwindled down to the size of a little doll, and was now on the table, merrily running round and round after her own shawl, which was trailing behind her. "
        ],
        "footnote": [],
        "context": "The Red Queen made no resistance whatever: only her face grew very small, and her eyes got large and green: and She took her off the table as she spoke, and shook her backwards and forwards with all her might.\\*  At any other time, Alice would have felt surprised at this, but she was far too much excited to be surprised at anything now. ‘As for you,’ she repeated, catching hold of the little creature in the very act of jumping over a bottle which had just lighted upon the table, ‘I’ll shake you into a kitten,\\* that I will!’ was not a moment to be lost. Already several of the guests were lying down in the dishes, and the soup-ladle was walking up the table towards Alice’s chair, and beckoning to her impatiently to get out of its way. ‘I ca’n’t stand this any longer!’ she cried, as she jumped up and seized the tablecloth with both hands: one good pull, and plates, dishes, guests, and candles came crashing down together in a heap on the floor. ‘And as for you,’ she went on, turning fiercely upon the Red Queen, whom she considered as the cause of all the ",
        "chunk_order_index": 2,
        "chunk_id": "chunk-57ecabaffbbbd171f873099939c6d4bb",
        "description": "The image is a black-and-white illustration depicting a chaotic scene from a fairy tale. The central figure is a young girl with long hair, wearing a dress and a crown, who appears to be in motion, possibly running or jumping. She is surrounded by various objects that seem to be floating or falling, including plates, dishes, and candles. There are also several small creatures, resembling insects or fairies, flying around her. The background is filled with more objects, such as vases and fruits, adding to the sense of disorder. The overall atmosphere is one of whimsy and chaos, typical of a fantastical narrative. The girl's posture and the movement of the objects suggest a dynamic and energetic scene.",
        "segmentation": true
    },
    "image_5": {
        "image_id": 5,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (5)/images/image_5.jpg",
        "caption": [
            "CHAPTER X ",
            "shaking "
        ],
        "footnote": [],
        "context": "‘Your Red Majesty shouldn’t purr so loud,’ Alice said, rubbing her eyes, and addressing the kitten, respectfully, yet with some severity. ‘You woke me out of oh! such a nice which dreamed it? CHAPTER XII and it really was a kitten, after all. CHAPTER XI  The Red Queen made no resistance whatever: only her face grew very small, and her eyes got large and green: and still, as Alice went on shaking her, she kept on growing shorter––and fatter––and softer––and rounder––and— She took her off the table as she spoke, and shook her backwards and forwards with all her might.\\* good pull, and plates, dishes, guests, and candles came crashing down together in a heap on the floor. ‘And as for you,’ she went on, turning fiercely upon the Red Queen, whom she considered as the cause of all the  At any other time, Alice would have felt surprised at this, but she was far too much excited to be surprised at anything now. ‘As for you,’ she repeated, catching hold of the little creature in the very act of jumping over a bottle which had just lighted upon the table, ‘I’ll shake you into a kitten,\\* that I will!’ ",
        "chunk_order_index": 2,
        "chunk_id": "chunk-57ecabaffbbbd171f873099939c6d4bb",
        "description": "The image is a black-and-white illustration of a character that appears to be a queen, given the crown with a large ball on top. The queen has a round face and is depicted in a dynamic pose, as if she is being shaken or jolted. She is wearing a long dress with a pattern that resembles checkered squares, and her arms are extended outward, with one hand pointing forward. Her expression seems to convey surprise or distress. The background is minimalistic, with no distinct features other than the shadowing that suggests movement and depth. The overall atmosphere of the image conveys a sense of chaos or sudden change, fitting the context of Alice shaking the Red Queen into a kitten.",
        "segmentation": true
    },
    "image_6": {
        "image_id": 6,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (5)/images/image_6.jpg",
        "caption": [
            "waking "
        ],
        "footnote": [],
        "context": "It is a very inconvenient habit of kittens (Alice had once made the remark) that, whatever you say to them, they always purr. ‘If they would only purr for “yes,” and mew for “no,” or any rule of ‘Your Red Majesty shouldn’t purr so loud,’ Alice said, rubbing her eyes, and addressing the kitten, respectfully, yet with some severity. ‘You woke me out of oh! such a nice dream! And you’ve been along with me, Kitty––all through the Looking-Glass world. Did you know it, dear?’ which dreamed it? CHAPTER XII and it really was a kitten, after all. CHAPTER XI too much excited to be surprised at anything now. ‘As for you,’ she repeated, catching hold of the little creature in the very act of jumping over a bottle which had just lighted upon the table, ‘I’ll shake you into a kitten,\\* that I will!’  She took her off the table as she spoke, and shook her backwards and forwards with all her might.\\* The Red Queen made no resistance whatever: only her face grew very small, and her eyes got large and green: and still, as Alice went on shaking her, she kept on growing shorter––and fatter––and softer––and rounder––and— ",
        "chunk_order_index": 2,
        "chunk_id": "chunk-57ecabaffbbbd171f873099939c6d4bb",
        "description": "The image is a black-and-white illustration depicting a kitten being held upside down by a human hand. The kitten appears to be in a state of distress or discomfort, with its eyes wide open and its body stretched out. The kitten's fur is dark, and its posture suggests it is being shaken or jostled. The background is minimalistic, with vertical lines that give the impression of a striped pattern or possibly a curtain. The overall atmosphere conveyed by the image is one of tension and discomfort, as the kitten seems to be experiencing an unpleasant situation.",
        "segmentation": true
    },
    "image_7": {
        "image_id": 7,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (5)/images/image_7.jpg",
        "caption": [
            "toilet, ‘when will Dinah have finished with your White Majesty, I wonder? That must be the reason you were so untidy in my dream.——Dinah! Do you know that you’re scrubbing a White Queen? Really, it’s most disrespectful of you! "
        ],
        "footnote": [],
        "context": "‘By the way, Kitty, if only you’d been really with me in my dream, there was one thing you would have enjoyed——I had such a quantity of poetry said to me, all about fishes! Tomorrow morning you shall have a ‘And what did Dinah turn to, I wonder?’ she prattled on, as she settled comfortably down, with one elbow on the rug, and her chin in her hand, to watch the kittens. ‘Tell me, Dinah, did you turn to Humpty Dumpty? I think you did–– however, you’d better not mention it to your friends just yet, for I’m not sure. afterwards to her sister: ‘it turned away its head, and pretended not to see it: but it looked a little ashamed of itself, so I think it must have been the Red Queen.’) ‘Sit up a little more stiffly, dear!’ Alice cried with a merry laugh. ‘And curtsey while you’re thinking what to––what to purr. It saves time, remember!’ And she caught it up and gave it one little kiss, ‘just in honour of its having been a Red Queen.’ ‘Snowdrop, my pet!’ she went on, looking over her shoulder at the White Kitten, which was still patiently undergoing its ",
        "chunk_order_index": 3,
        "chunk_id": "chunk-6aab66b5b7be2b283a71fab75e36f621",
        "description": "The image is a black-and-white illustration from the classic children's book 'Alice in Wonderland.' It depicts Alice, a young girl with long hair, kneeling on the ground. She is holding a large, fluffy cat under her arm with one hand and a small object, possibly a piece of food or a toy, in the other hand. The cat appears to be a raccoon-like creature with a striped tail. To the right of Alice, there is another cat sitting on the ground, looking up at her with a curious expression. The background features a tall, ornate table or pedestal with intricate designs. The overall atmosphere of the image is whimsical and fantastical, capturing the surreal and dreamlike quality of the story. The illustration style is detailed and expressive, with careful attention to the textures and expressions of the characters.",
        "segmentation": true
    }
}