{
  "chunk-9750becd2fd0312aa542638d707f5333": {
    "tokens": 1200,
    "content": "‘A little kindness––and putting her hair in papers\\*––would do wonders with her—  \n\nThe White Queen gave a deep sigh, and laid her head on Alice’s shoulder. ‘I am so sleepy!’ she moaned.  \n\n‘She’s tired, poor thing!’ said the Red Queen. ‘Smoothe her hair––lend  her  your  nightcap––and  sing  her  a  soothing lullaby.’  \n\n‘I haven’t got a nightcap with me,’ said Alice, as she tried to obey the first direction: ‘and I don’t know any soothing lullabies.’  \n\n‘I must do it myself, then,’ said the Red Queen, and she began:––  \n\n‘Hush-a-by lady,\\* in Alice’s lap! Till the feast’s ready, we’ve time for a nap. When the feast’s over, we’ll go to the ball–– Red Queen, and White Queen, and Alice, and all!  \n\n‘And now you know the words,’ she added, as she put her head down on Alice’s other shoulder, ‘just sing it through to me. I’m getting sleepy, too.’ In another moment both Queens were fast asleep, and snoring loud.  \n\n![](images/image_1.jpg)  \n\n‘What am I to do?’ exclaimed Alice, looking about in great perplexity, as first one round head, and then the other, rolled down from her shoulder, and lay like a heavy lump in her lap. ‘I don’t think it ever happened before, that any one had to take care of two Queens asleep at once! No, not in all the History of England––it couldn’t, you know, because there never was more than one Queen at a time. Do wake up, you heavy things!’ she went on in an impatient tone; but there was no answer but a gentle snoring.  \n\nThe snoring got more distinct every minute, and sounded more like a tune: at last she could even make out words, and she listened so eagerly that, when the two great heads suddenly vanished\\* from her lap, she hardly missed them.  \n\nShe was standing before an arched doorway, over which were the words ‘QUEEN ALICE’ in large letters, and on each side of the arch there was a bell-handle; one was marked ‘Visitors’ Bell,’ and the other ‘Servants’ Bell.’  \n\n‘I’ll wait till the song’s over,’ thought Alice, ‘and then I’ll ring the––the––which bell must I ring?’ she went on, very much puzzled by the names. ‘I’m not a visitor, and I’m not a servant. There ought to be one marked “Queen,” you know—  \n\nJust then the door opened a little way, and a creature with a long beak put its head out for a moment and said ‘No admittance till the week after next!’ and shut the door again with a bang.  \n\nAlice knocked and rang in vain for a long time; but at last a very old Frog, who was sitting under a tree, got up and hobbled slowly towards her: he was dressed in bright yellow,  \n\nand had enormous boots on. ‘What is it, now?’ the Frog said in a deep hoarse whisper. Alice turned round, ready to find fault with anybody.   \n‘Where’s the servant whose business it is to answer the door?’   \nshe began angrily. ‘Which door?’ said the Frog. Alice almost stamped with irritation at the slow drawl in   \nwhich he spoke. ‘This door, of course!’  \n\n![](images/image_2.jpg)  \n\nThe Frog looked at the door with his large dull eyes for a minute: then he went nearer and rubbed it with his thumb, as if he were trying whether the paint would come off: then he looked at Alice.  \n\n‘To answer the door?’ he said. ‘What’s it been asking of?’ He was so hoarse that Alice could scarcely hear him.  \n\n‘I don’t know what you mean,’ she said.  \n\n‘I speaks English, doesn’t I?’ the Frog went on. ‘Or are you deaf? What did it ask you?’  \n\n‘Nothing!’  Alice  said  impatiently.  ‘I’ve  been  knocking at it!’  \n\n‘Shouldn’t  do  that––shouldn’t  do  that——’  the  Frog muttered. ‘Wexes it, you know.’ Then he went up and gave the door a kick with one of his great feet. ‘You let it alone, he panted out, as he hobbled back to his tree, ‘and it’ll let you alone, you know.’  \n\nAt this moment the door was flung open, and a shrill voice was heard singing:––  \n\n‘To the Looking-Glass world\\* it was Alice that said “I’ve a sceptre in hand, I’ve a crown on my head. Let the Looking-Glass creatures, whatever they be Come and dine with the Red Queen, the White Queen, and me!” ’  \n\nAnd hundreds of voices joined in the chorus:–– ‘Then fill up the glasses as quick as you can, And sprinkle the table with buttons and bran: Put cats in the coffee, and mice in the tea–– And welcome Queen Alice with thirty-times-three!’\\*  \n\nThen followed a confused noise of cheering, and Alice thought to herself ‘Thirty times three makes ninety. I wonder if any one’s counting?’ In a minute there was silence again, and the same shrill voice sang another verse:––  \n\n‘“O Looking-Glass creatures,” quoth Alice, “draw near! ’Tis an honour to see me, a favour to hear: ’Tis a privilege high to have dinner and tea Along with the Red Queen, the White Queen, and me!” ’",
    "chunk_order_index": 0,
    "full_doc_id": "doc-9049e42081712810c363fff6ac1324b1"
  },
  "chunk-2a3717ac065f6ad01b3124f32e78c06f": {
    "tokens": 1200,
    "content": "confused noise of cheering, and Alice thought to herself ‘Thirty times three makes ninety. I wonder if any one’s counting?’ In a minute there was silence again, and the same shrill voice sang another verse:––  \n\n‘“O Looking-Glass creatures,” quoth Alice, “draw near! ’Tis an honour to see me, a favour to hear: ’Tis a privilege high to have dinner and tea Along with the Red Queen, the White Queen, and me!” ’ Then came the chorus again:–– ‘Then fill up the glasses with treacle and ink, Or anything else that is pleasant to drink: Mix sand with the cider, and wool with the wine–– And welcome Queen Alice with ninety-times-nine!’  \n\n‘Ninety times nine!’ Alice repeated in despair. ‘Oh, that’ll never be done! I’d better go in at once——’ and in she went, and there was a dead silence the moment she appeared.  \n\nAlice glanced nervously along the table, as she walked up the large hall,\\* and noticed that there were about fifty guests, of all kinds: some were animals, some birds, and there were even a few flowers among them. ‘I’m glad they’ve come without waiting to be asked,’ she thought: ‘I should never have known who were the right people to invite!’  \n\nThere were three chairs at the head of the table: the Red and White Queens had already taken two of them, but the middle one was empty. Alice sat down in it, rather uncomfortable at the silence, and longing for some one to speak.  \n\nAt last the Red Queen began. ‘You’ve missed the soup and fish,’ she said. ‘Put on the joint!’ And the waiters set a leg of mutton before Alice, who looked at it rather anxiously, as she had never had to carve a joint before.  \n\n![](images/image_3.jpg)  \n\n‘You look a little shy: let me introduce you to that leg of mutton,’ said the  Red  Queen.  ‘Alice Mutton: Mutton— Alice.’\\* The leg of mutton got  up  in  the  dish  and made a little bow to Alice; and  Alice  returned  the bow, not knowing whether to be frightened or amused. ‘May I give you a slice?’ she  said,  taking  up  the knife and fork, and looking from one Queen to the other.  \n\n‘Certainly not,’ the Red Queen  said,  very  decidedly: ‘it isn’t etiquette to  \n\ncut any one you’ve been introduced to. Remove the joint!’ And the waiters carried it off, and brought a large plum-pudding in its place.  \n\n‘I wo’n’t be introduced to the pudding, please,’ Alice said rather hastily, ‘or we shall get no dinner at all. May I give you some?’  \n\nBut the Red Queen looked sulky, and growled ‘Pudding Alice: Alice——Pudding. Remove the pudding!’, and the waiters took it away so quickly that Alice couldn’t return its bow.  \n\nHowever, she didn’t see why the Red Queen should be the only one to give orders; so, as an experiment, she called out ‘Waiter! Bring back the pudding!’, and there it was again in a moment, like a conjuring-trick. It was so large that she couldn’t help feeling a little shy with it, as she had been with the mutton: however, she conquered her shyness by a great effort, and cut a slice and handed it to the Red Queen.  \n\n‘What impertinence!’ said the Pudding. ‘I wonder how you’d like it, if I were to cut a slice out of you, you creature!’  \n\nIt spoke in a thick, suety sort of voice, and Alice hadn’t a word to say in reply: she could only sit and look at it and gasp.  \n\n‘Make a remark,’ said the Red Queen: ‘it’s ridiculous to leave all the conversation to the pudding!  \n\n‘Do you know, I’ve had such a quantity of poetry repeated to me to-day,’ Alice began, a little frightened at finding that, the moment she opened her lips, there was dead silence, and all eyes were fixed upon her; ‘and it’s a very curious thing, I think––every poem was about fishes in some way. Do you know why they’re so fond of fishes, all about here?’  \n\nShe spoke to the Red Queen, whose answer was a little wide of the mark. ‘As to fishes,’ she said, very slowly and solemnly, putting her mouth close to Alice’s ear, ‘her White Majesty knows a lovely riddle––all in poetry––all about fishes. Shall she repeat it?’  \n\n‘Her Red Majesty’s very kind to mention it,’ the White Queen murmured into Alice’s other ear, in a voice like the cooing of a pigeon. ‘It would be such a treat! May I?’  \n\n‘Please do,’ Alice said very politely.  \n\nThe White Queen laughed with delight, and stroked Alice’s cheek. Then she began:  \n\n‘“First, the fish must be caught.” That is easy: a baby, I think, could have caught it. “Next, the fish must be bought.” That is easy: a penny, I think, would have bought it. “Now cook me the fish!” That is easy, and will not take more than a minute. “Let it lie in a dish!” That is easy, because it already is in it. “Bring it here! Let me sup!” It is easy to set such a dish on the table. “Take the dish-cover up!” Ah, that is so hard that I fear I’m unable! For it holds it like glue–– Holds the lid",
    "chunk_order_index": 1,
    "full_doc_id": "doc-9049e42081712810c363fff6ac1324b1"
  },
  "chunk-57ecabaffbbbd171f873099939c6d4bb": {
    "tokens": 1200,
    "content": "penny, I think, would have bought it. “Now cook me the fish!” That is easy, and will not take more than a minute. “Let it lie in a dish!” That is easy, because it already is in it. “Bring it here! Let me sup!” It is easy to set such a dish on the table. “Take the dish-cover up!” Ah, that is so hard that I fear I’m unable! For it holds it like glue–– Holds the lid to the dish, while it lies in the middle: Which is easiest to do, Un-dish-cover the fish, or dishcover the riddle?’  \n\n‘Take a minute to think about it, and then guess,’\\* said the Red Queen. ‘Meanwhile, we’ll drink your health––Queen Alice’s health!’ she screamed at the top of her voice, and all the guests began drinking it directly, and very queerly they managed it: some of them put their glasses upon their heads like extinguishers,\\* and drank all that trickled down their faces––others upset the decanters, and drank the wine as it ran off the edges of the table––and three of them (who looked like kangaroos) scrambled into the dish of roast mutton, and began eagerly lapping up the gravy, ‘just like pigs in a trough!’ thought Alice.  \n\n‘You ought to return thanks in a neat speech,’ the Red Queen said, frowning at Alice as she spoke.  \n\n‘We must support you, you know,’ the White Queen whispered, as Alice got up to do it, very obediently, but a little frightened.  \n\n‘Thank you very much,’ she whispered in reply, ‘but I can do quite well without.’ ‘That wouldn’t be at all the thing,’ the Red Queen said very decidedly: so Alice tried to submit to it with a good grace. (‘And they did push so!’ she said afterwards, when she was telling her sister the history of the feast. ‘You would have thought they wanted to squeeze me flat!’)  \n\nIn fact it was rather difficult for her to keep in her place while she made her speech: the two Queens pushed her so, one on each side, that they nearly lifted her up into the air. ‘I rise to return thanks——’ Alice began: and she really did rise as she spoke, several inches; but she got hold of the edge of the table, and managed to pull herself down again.  \n\n‘Take care of yourself!’ screamed the White Queen, seizing Alice’s hair with both her hands. ‘Something’s going to happen!’  \n\nAnd then (as Alice afterwards described it) all sorts of things happened in a moment. The candles all grew up to the ceiling, looking something like a bed of rushes with fireworks at the top. As to the bottles, they each took a pair of plates, which they hastily fitted on as wings, and so, with forks for legs, went fluttering about in all directions: ‘and very like birds they look,’ Alice thought to herself, as well as she could in the dreadful confusion that was beginning.  \n\nAt this moment she heard a hoarse laugh at her side, and turned to see what was the matter with the White Queen; but, instead of the Queen, there was the leg of mutton sitting in the chair. ‘Here I am!’ cried a voice from the soup-tureen,\\* and Alice turned again, just in time to see the Queen’s broad good-natured face grinning at her for a moment over the edge of the tureen, before she disappeared into the soup.  \n\nThere was not a moment to be lost. Already several of the guests were lying down in the dishes, and the soup-ladle was walking up the table towards Alice’s chair, and beckoning to her impatiently to get out of its way.  \n\n‘I  ca’n’t  stand  this  any longer!’  she  cried,  as  she jumped up and seized the tablecloth with both hands: one good pull, and plates, dishes, guests, and candles came  crashing  down  together in a heap on the floor. ‘And as for you,’ she went on, turning fiercely upon the Red Queen, whom she considered as the cause of all the  \n\n![](images/image_4.jpg)  \nmischief––but the Queen was no longer at her side––she had suddenly dwindled down to the size of a little doll, and was now on the table, merrily running round and round after her own shawl, which was trailing behind her.  \n\nAt any other time, Alice would have felt surprised at this, but she was far too much excited to be surprised at anything now. ‘As for you,’ she repeated, catching hold of the little creature in the very act of jumping over a bottle which had just lighted upon the table, ‘I’ll shake you into a kitten,\\* that I will!’  \n\n![](images/image_5.jpg)  \nCHAPTER X   \nshaking  \n\nShe took her off the table as she spoke, and shook her backwards and forwards with all her might.\\*  \n\nThe Red Queen made no resistance whatever: only her face grew very small, and her eyes got large and green: and still, as Alice went on shaking her, she kept on growing shorter––and fatter––and softer––and rounder––and—  \n\n![](images/image_6.jpg)  \nwaking  \n\n# CHAPTER XI  \n\nand it really was a kitten, after all.  \n\n# CHAPTER XII  \n\nwhich dreamed it?  \n\n‘Your Red Majesty shouldn’t purr so loud,’ Alice said, rubbing her eyes, and addressing the kitten, respectfully, yet with some severity. ‘You woke me out of oh! such a nice dream! And you’ve been along with me,",
    "chunk_order_index": 2,
    "full_doc_id": "doc-9049e42081712810c363fff6ac1324b1"
  },
  "chunk-6aab66b5b7be2b283a71fab75e36f621": {
    "tokens": 1200,
    "content": "––and softer––and rounder––and—  \n\n![](images/image_6.jpg)  \nwaking  \n\n# CHAPTER XI  \n\nand it really was a kitten, after all.  \n\n# CHAPTER XII  \n\nwhich dreamed it?  \n\n‘Your Red Majesty shouldn’t purr so loud,’ Alice said, rubbing her eyes, and addressing the kitten, respectfully, yet with some severity. ‘You woke me out of oh! such a nice dream! And you’ve been along with me, Kitty––all through the Looking-Glass world. Did you know it, dear?’  \n\nIt is a very inconvenient habit of kittens (Alice had once made the remark) that, whatever you say to them, they always purr. ‘If they would only purr for “yes,” and mew for “no,” or any rule of that sort,’ she had said, ‘so that one could keep up a conversation! But how can you talk with a person if they always say the same thing?’  \n\nOn this occasion the kitten only purred: and it was impossible to guess whether it meant ‘yes’ or ‘no.’  \n\nSo Alice hunted among the chessmen on the table till she had found the Red Queen: then she went down on her knees on the hearth-rug, and put the kitten and the Queen to look at each other. ‘Now, Kitty!’ she cried, clapping her hands triumphantly. ‘Confess that was what you turned into!’  \n\n(‘But it wouldn’t look at it,’ she said, when she was explaining the thing afterwards to her sister: ‘it turned away its head, and pretended not to see it: but it looked a little ashamed of itself, so I think it must have been the Red Queen.’)  \n\n‘Sit up a little more stiffly, dear!’ Alice cried with a merry laugh. ‘And curtsey while you’re thinking what to––what to purr. It saves time, remember!’ And she caught it up and gave it one little kiss, ‘just in honour of its having been a Red Queen.’  \n\n‘Snowdrop, my pet!’ she went on, looking over her shoulder at the White Kitten, which was still patiently undergoing its  \n\n![](images/image_7.jpg)  \ntoilet, ‘when will Dinah have finished with your White Majesty, I wonder? That must be the reason you were so untidy in my dream.——Dinah! Do you know that you’re scrubbing a White Queen? Really, it’s most disrespectful of you!  \n\n‘And what did Dinah turn to, I wonder?’ she prattled on, as she settled comfortably down, with one elbow on the rug, and her chin in her hand, to watch the kittens. ‘Tell me, Dinah, did you turn to Humpty Dumpty? I think you did–– however, you’d better not mention it to your friends just yet, for I’m not sure.  \n\n‘By the way, Kitty, if only you’d been really with me in my dream, there was one thing you would have enjoyed——I had such a quantity of poetry said to me, all about fishes! Tomorrow morning you shall have a real treat. All the time you’re eating  your  breakfast,  I’ll  repeat  “The  Walrus  and  the Carpenter” to you; and then you can make believe it’s oysters, dear!  \n\n‘Now, Kitty, let’s consider who it was that dreamed it all. This is a serious question, my dear, and you should not go on licking your paw like that––as if Dinah hadn’t washed you this morning! You see, Kitty, it must have been either me or the Red King. He was part of my dream, of course––but then I was part of his dream, too! Was it the Red King, Kitty? You were his wife, my dear, so you ought to know— Oh, Kitty, do help to settle it! I’m sure your paw can wait!’ But the provoking kitten only began on the other paw, and pretended it hadn’t heard the question.  \n\nWhich do you think it was?  \n\nA boat, beneath a sunny sky\\* Lingering onward dreamily In an evening of July––  \n\nChildren three that nestle near, Eager eye and willing ear, Pleased a simple tale to hear–– Long has paled that sunny sky: Echoes fade and memories die: Autumn frosts have slain July.  \n\nStill she haunts me, phantomwise, Alice moving under skies Never seen by waking eyes.  \n\nChildren yet, the tale to hear, Eager eye and willing ear, Lovingly shall nestle near.  \n\nIn a Wonderland they lie, Dreaming as the days go by, Dreaming as the summers die:  \n\nEver drifting down the stream–– Lingering in the golden gleam–– Life, what is it but a dream?\\*  \n\n# This page intentionally left blank  \n\n# CHRISTMAS-GREETINGS  \n\n[from a fairy to a child] Lady dear, if Fairies may For a moment lay aside Cunning tricks and elfish play, ’Tis at happy Christmas-tide.  \n\nWe have heard the children say–– Gentle children, whom we love–– Long ago, on Christmas Day, Came a message from above.  \n\nStill, as Christmas-tide comes round, They remember it again–– Echo still the joyful sound ‘Peace on earth, good-will to men!’  \n\nYet the hearts must childlike be Where such heavenly guests abide;   \nUnto children, in their glee, All the year is Christmas-tide!  \n\nThus, forgetting tricks and play For a moment, Lady dear, We would wish you, if we may, Merry Christmas, glad New Year!  \n\nChristmas, 1867.  \n\n# TO ALL CHILD-READERS OF",
    "chunk_order_index": 3,
    "full_doc_id": "doc-9049e42081712810c363fff6ac1324b1"
  },
  "chunk-278bf97f0570063328a8f07ec2d2ac1a": {
    "tokens": 1200,
    "content": ", They remember it again–– Echo still the joyful sound ‘Peace on earth, good-will to men!’  \n\nYet the hearts must childlike be Where such heavenly guests abide;   \nUnto children, in their glee, All the year is Christmas-tide!  \n\nThus, forgetting tricks and play For a moment, Lady dear, We would wish you, if we may, Merry Christmas, glad New Year!  \n\nChristmas, 1867.  \n\n# TO ALL CHILD-READERS OF ‘ALICE’S ADVENTURES IN WONDERLAND’  \n\n# Dear Children,  \n\nAt Christmas-time a few grave words are not quite out of place, I hope, even at the end of a book of nonsense––and I want to take this opportunity of thanking the thousands of children who have read ‘Alice’s Adventures in Wonderland,’ for the kindly interest they have taken in my little dream-child.  \n\nThe thought of the many English firesides where happy faces have smiled her a welcome, and of the many English children to whom she has brought an hour of (I trust) innocent amusement, is one of the brightest and pleasantest thoughts of my life. I have a host of young friends already, whose names and faces I know––but I cannot help feeling as if, through ‘Alice’s Adventures’ I had made friends with many many other dear children, whose faces I shall never see.  \n\nTo all my little friends, known and unknown, I wish with all my heart, ‘A Merry Christmas and a Happy New Year.’ May God bless you, dear children, and make each Christmastide, as it comes round to you, more bright and beautiful than the last––bright with the presence of that unseen Friend, who once on earth blessed little children––and beautiful with memories of a loving life, which has sought and found that truest kind of happiness, the only kind that is really worth the having, the happiness of making others happy too!  \n\nYour affectionate Friend, Lewis Carroll Christmas, 1871  \n\n# AN EASTER GREETING TO EVERY CHILD WHO LOVES ‘ALICE ’  \n\n# Dear Child,  \n\nPlease to fancy, if you can, that you are reading a real letter, from a real friend whom you have seen, and whose voice you can seem to yourself to hear wishing you, as I do now with all my heart, a happy Easter.  \n\nDo you know that delicious dreamy feeling when one first wakes on a summer morning, with the twitter of birds in the air, and the fresh breeze coming in at the open window when, lying lazily with eyes half shut, one sees as in a dream green boughs waving, or waters rippling in a golden light? It is a pleasure very near to sadness, bringing tears to one’s eyes like a beautiful picture or poem. And is not that a Mother’s gentle hand that undraws your curtains, and a Mother’s sweet voice that summons you to rise? To rise and forget, in the bright sunlight, the ugly dreams that frightened you so when all was dark——to rise and enjoy another happy day, first kneeling to thank that unseen Friend, who sends you the beautiful sun?  \n\nAre these strange words from a writer of such tales as ‘Alice’? And is this a strange letter to find in a book of nonsense? It may be so. Some perhaps may blame me for thus mixing together things grave and gay; others may smile and think it odd that any one should speak of solemn things at all, except in church and on a Sunday: but I think––nay, I am sure––that some children will read this gently and lovingly, and in the spirit in which I have written it.  \n\nFor I do not believe God means us thus to divide life into two halves——to wear a grave face on Sunday, and to think it out-ofplace to even so much as mention Him on a week-day. Do you think He cares to see only kneeling figures, and to hear only tones of prayer——and that He does not also love to see the lambs leaping in the sunlight, and to hear the merry voices of the children, as they roll among the hay? Surely their innocent laughter is as sweet in His ears as the grandest anthem that ever rolled up from the ‘dim religious light’ of some solemn cathedral?  \n\nAnd if I have written anything to add to those stores of innocent and healthy amusement that are laid up in books for the children I love so well, it is surely something I may hope to look back upon without shame and sorrow (as how much of life must then be recalled!) when my turn comes to walk through the valley of shadows.  \n\nThis Easter sun will rise on you, dear child, feeling your ‘life in every limb,’ and eager to rush out into the fresh morning air and many an Easter-day will come and go, before it finds you feeble and gray-headed, creeping wearily out to bask once more in the sunlight——but it is good, even now, to think sometimes of that great morning when the ‘Sun of Righteousness shall arise with healing in his wings.’  \n\nSurely your gladness need not be the less for the thought that you will one day see a brighter dawn than this— when lovelier sights will meet your eyes than any waving trees or rippling waters— when angel-hands shall undraw your curtains, and sweeter tones than ever loving Mother breathed shall wake you to a new and glorious day— and when all the sadness, and the sin, that darkened life on this little earth, shall be forgotten like the dreams of a night that is past!  \n\nYour affectionate friend, Lewis  Carroll  \n\nEaster, 1876  \n\n# APPENDIX  \n\n# THE WASP IN A WIG  \n\nThis episode was cut from the galley-proofs of Through the Looking-Glass. It would have appeared on p. 223",
    "chunk_order_index": 4,
    "full_doc_id": "doc-9049e42081712810c363fff6ac1324b1"
  },
  "chunk-b18e70ce850126f3c12bb1f48b3fe0e6": {
    "tokens": 1200,
    "content": "Mother breathed shall wake you to a new and glorious day— and when all the sadness, and the sin, that darkened life on this little earth, shall be forgotten like the dreams of a night that is past!  \n\nYour affectionate friend, Lewis  Carroll  \n\nEaster, 1876  \n\n# APPENDIX  \n\n# THE WASP IN A WIG  \n\nThis episode was cut from the galley-proofs of Through the Looking-Glass. It would have appeared on p. 223 of this edition, following the line ‘A very few steps brought her to the edge of the brook’. See the Introduction, p. xxviii, and note to p. 223.  \n\n. . . and she was just going to spring over, when she heard a deep sigh, which seemed to come from the wood behind her.  \n\n‘There’s somebody very unhappy there,’ she thought, looking anxiously back to see what was the matter. Something like a very old man (only that his face was more like a wasp) was sitting on the ground, leaning against a tree, all huddled up together, and shivering as if he were very cold.  \n\n‘I don’t think I can be of any use to him,’ was Alice’s first thought, as she turned to spring over the brook:––‘but I’ll just ask him what’s the matter,’ she added, checking herself on the very edge. ‘If I once jump over, everything will change, and then I can’t help him.’  \n\nSo she went back to the Wasp––rather unwillingly, for she was very anxious to be a Queen.  \n\n‘Oh, my old bones, my old bones!’ he was grumbling as Alice came up to him.  \n\n‘It’s rheumatism, I should think,’ Alice said to herself, and she stooped over him, and said very kindly, ‘I hope you’re not in much pain?’  \n\nThe Wasp only shook his shoulders, and turned his head away. ‘Ah, dreary me!’ he said to himself.  \n\n‘Can I do anything for you?’ Alice went on. ‘Aren’t you rather cold here?’  \n\n‘How you go on!’ the Wasp said in a peevish tone. ‘Worrity, worrity! There never was such a child!’  \n\nAlice felt rather offended at this answer, and was very nearly walking on and leaving him, but she thought to herself ‘Perhaps it’s only pain that makes him so cross.’ So she tried once more.  \n\n‘Won’t you let me help you round to the other side? You’ll be out of the cold wind there.’  \n\nThe Wasp took her arm, and let her help him round the tree, but when he got settled down again he only said, as before, ‘Worrity, worrity! Can’t you leave a body alone?’  \n\n‘Would you like me to read you a bit of this?’ Alice went on, as she picked up a newspaper which had been lying at his feet.  \n\n‘You may read it if you’ve a mind to,’ the Wasp said, rather sulkily. ‘Nobody’s hindering you, that $I$ know of.’  \n\nSo Alice sat down by him, and spread out the paper on her knees, and began. ‘Latest News. The Exploring Party have made another tour in the Pantry, and have found five new lumps of white sugar, large and in fine condition. In coming back––’  \n\n‘Any brown sugar?’ the Wasp interrupted.  \n\nAlice hastily ran her eye down the paper and said ‘No. It says nothing about brown.’  \n\n‘No brown sugar!’ grumbled the Wasp. ‘A nice exploring party!’  \n\n‘In coming back,’ Alice went on reading, ‘they found a lake of treacle. The banks of the lake were blue and white, and looked like china. While tasting the treacle, they had a sad accident: two of their party were engulphed––  \n\n‘Were what?’ the Wasp asked in a very cross voice.  \n\n‘En-gulph-ed,’  Alice  repeated,  dividing  the  word  into syllables.  \n\n‘There’s no such word in the language!’ said the Wasp.  \n\n‘It’s in this newspaper, though,’ Alice said a little timidly.  \n\n‘Let it stop there!’ said the Wasp, fretfully turning away his head.  \n\nAlice put down the newspaper. ‘I’m afraid you’re not well, she said in a soothing tone. ‘Can’t I do anything for you?’  \n\n‘It’s all along of the wig,’ the Wasp said in a much gentler voice.  \n\n‘Along of the wig?’ Alice repeated, quite pleased to find that he was recovering his temper.  \n\n‘You’d be cross too, if you’d a wig like mine,’ the Wasp went on. ‘They jokes at one. And they worrits one. And then I gets cross. And I gets cold. And I gets under a tree. And I gets a yellow handkerchief. And I ties up my face––as at the present.’  \n\nAlice looked pityingly at him. ‘Tying up the face is very good for the toothache,’ she said.  \n\n‘And it’s very good for the conceit,’ added the Wasp.  \n\nAlice didn’t catch the word exactly. ‘Is that a kind of toothache?’ she asked.  \n\nThe Wasp considered a little. ‘Well, no,’ he said: ‘it’s when you hold up your head––so––without bending your neck.’  \n\n‘Oh, you mean stiff-neck,’ said Alice.  \n\nThe Wasp said ‘That’s a new-fangled name. They called it conceit in my time.’  \n\n‘Conceit isn",
    "chunk_order_index": 5,
    "full_doc_id": "doc-9049e42081712810c363fff6ac1324b1"
  },
  "chunk-35f2b9d6a44f824a682ddbc55383fed2": {
    "tokens": 1200,
    "content": "added the Wasp.  \n\nAlice didn’t catch the word exactly. ‘Is that a kind of toothache?’ she asked.  \n\nThe Wasp considered a little. ‘Well, no,’ he said: ‘it’s when you hold up your head––so––without bending your neck.’  \n\n‘Oh, you mean stiff-neck,’ said Alice.  \n\nThe Wasp said ‘That’s a new-fangled name. They called it conceit in my time.’  \n\n‘Conceit isn’t a disease at all,’ Alice remarked.  \n\n‘It is, though,’ said the Wasp: ‘wait till you have it, and then you’ll know. And when you catches it, just try tying a yellow handkerchief round your face. It’ll cure you in no time!’  \n\nHe untied the handkerchief as he spoke, and Alice looked at his wig in great surprise. It was bright yellow like the handkerchief, and all tangled and tumbled about like a heap of seaweed. ‘You could make your wig much neater,’ she said, ‘if only you had a comb.  \n\n‘What, you’re a Bee, are you?’ the Wasp said, looking at her with more interest. ‘And you’ve got a comb. Much honey?’  \n\n‘It isn’t that kind,’ Alice hastily explained. ‘It’s to comb hair with––your wig’s so very rough, you know.’  \n\n‘I’ll tell you how I came to wear it,’ the Wasp said. ‘When I was young, you know, my ringlets used to wave––’  \n\nA curious idea came into Alice’s head. Almost every one she had met had repeated poetry to her, and she thought she would try if the Wasp couldn’t do it too. ‘Would you mind saying it in rhyme?’ she asked very politely.  \n\n‘It ain’t what I’m used to,’ said the Wasp: ‘however I’ll try; wait a bit.’ He was silent for a few moments, and then began again– ‘When I was young, my ringlets waved And curled and crinkled on my head: And then they said “You should be shaved, And wear a yellow wig instead.”  \n\nBut when I followed their advice, And they had noticed the effect, They said I did not look so nice As they had ventured to expect.  \n\nThey said it did not fit, and so It made me look extremely plain: But what was I to do, you know? My ringlets would not grow again.  \n\nSo now that I am old and gray, And all my hair is nearly gone, They take my wig from me and say “How can you put such rubbish on?”  \n\nAnd still, whenever I appear, They hoot at me and call me “Pig!” And that is why they do it, dear, Because I wear a yellow wig.  \n\n‘I’m very sorry for you,’ Alice said heartily: ‘and I think if your wig fitted a little better, they wouldn’t tease you quite so much.  \n\n‘Your wig fits very well,’ the Wasp murmured, looking at her with an expression of admiration: ‘it’s the shape of your head as does it. Your jaws ain’t well shaped, though––I should think you couldn’t bite well?’  \n\nAlice began with a little scream of laughter, which she turned into a cough as well as she could. At last she managed to say gravely, ‘I can bite anything I want.’  \n\n‘Not with a mouth as small as that,’ the Wasp persisted. ‘If you was a-fighting, now––could you get hold of the other one by the back of the neck?’  \n\n‘I’m afraid not,’ said Alice.  \n\n‘Well, that’s because your jaws are too short,’ the Wasp went on: ‘but the top of your head is nice and round.’ He took off his own wig as he spoke, and stretched out one claw towards Alice, as if he wished to do the same for her, but she kept out of reach, and would not take the hint. So he went on with his criticisms.  \n\n‘Then your eyes––they’re too much in front, no doubt. One would have done as well as two, if you must have them so close––’  \n\nAlice did not like having so many personal remarks made on her, and as the Wasp had quite recovered his spirits, and was getting very talkative, she thought she might safely leave him. ‘I think I must be going on now,’ she said. ‘Good-bye.’  \n\n‘Good-bye, and thank-ye,’ said the Wasp, and Alice tripped down the hill again, quite pleased that she had gone back and given a few minutes to making the poor old creature comfortable.  \n\n# This page intentionally left blank  \n\n# EXPLANATORY NOTES  \n\n# ABBREVIATIONS  \n\nAAU Alice’s Adventures under Ground (1886)   \nAAW Alice’s Adventures in Wonderland   \nBatey Mavis Batey, The World of Alice (Norwich: Pitkin, 1998)   \nGoldthwaite John Goldthwaite, The Natural History of Make-Believe (New York: Oxford University Press, 1996)   \nGuiliano Edward Guiliano (ed.), Lewis Carroll: A Celebration (New York: Clarkson N. Potter, 1981)   \nLCPB Stuart Dodgson Collingwood, The Lewis Carroll Picture Book (London: T. Fisher Unwin, 1899)   \nLLLC Stuart Dodgson Collingwood The Life and Letters of Lewis Carroll (Rev. C. L. Dodgson) (London: T. Fisher Unwin, 1899)   \nLG Through the Looking-Glass   \nMG Martin Gardner, The Annotated Alice: The Definitive",
    "chunk_order_index": 6,
    "full_doc_id": "doc-9049e42081712810c363fff6ac1324b1"
  },
  "chunk-32a70e155bc19b6114950f509f09868c": {
    "tokens": 1200,
    "content": "Clarkson N. Potter, 1981)   \nLCPB Stuart Dodgson Collingwood, The Lewis Carroll Picture Book (London: T. Fisher Unwin, 1899)   \nLLLC Stuart Dodgson Collingwood The Life and Letters of Lewis Carroll (Rev. C. L. Dodgson) (London: T. Fisher Unwin, 1899)   \nLG Through the Looking-Glass   \nMG Martin Gardner, The Annotated Alice: The Definitive Edition (New York: Norton, 2000)   \nODNB Oxford Dictionary of National Biography   \nOpies Iona and Peter Opie, The Oxford Dictionary of Nursery Rhymes (Oxford: Clarendon Press, 1973)   \nRLG notes from, or adapted from, Roger Lancelyn Green’s World’s Classics edition of the ‘Alice’ books (Oxford: Oxford University Press, 1982)  \nRP Robert Phillips (ed.), Aspects of Alice (Harmondsworth: Penguin, 1974)   \nSOED Shorter Oxford English Dictionary  \n\n1 [Title: Alice’s Adventures in Wonderland]: in a postscript to a letter to Tom Taylor (later editor of Punch) (10 June 1864), Dodgson debated the title:  \n\nI first thought of ‘Alice’s Adventures under Ground,’ but that was pronounced too like a lesson-book, in which instructions about mines would be administered in the form of a grill; then I took ‘Alice’s Golden Hour’ but that I gave up, having a dark suspicion that there is already a book called ‘Lily’s Golden Hours’. Here are the other names I have thought of  \n\nOf these I at present prefer ‘Alice’s Adventures in Wonderland’. In spite of your ‘morality’, I want something sensational.  \n\nBy ‘grill’ Dodgson presumably means the litanies that composed many nineteenth-century children’s books (and see note to p. 227). (The SOED does not give ‘grill’ as ‘to subject to severe questioning, US’ until 1928.)  \n\nHe was almost right about his ‘dark suspicions’: there was a book called Lilian’s Golden Hours by Eliza Meteyard $\\left(\\mathrm{{\\bf1}}8\\mathrm{{1}}6{-}79\\right)$ , illustrated by Absolon, 1857. Meteyard was an advocate of women’s rights. Golden Hours––A Magazine for Sunday Reading, edited by W. M. Whittemore, ran monthly from January $\\operatorname{I}864$ to December $\\phantom{-}\\mathbf{I}884$ .  \n\n3 Prima . . . Secunda . . . Tertia: Alice and her sisters: Prima is Lorina Charlotte Liddell (11 May 1849–29 October 1930); Secunda, Alice Pleasance Liddell (4 May 1852–15 November 1934); Tertia, Edith Mary Liddell (23 January $\\operatorname{I}854{-}26$ June 1876).  \n\n5 on the Stage: Alice in Wonderland. A Musical Dream Play, in Two Acts, for Children and Others by Henry Savile Clarke, with music by Walter Slaughter, opened at the Prince of Wales theatre in London on 23 December 1886. It ran for fifty performances and toured the provinces. Dodgson provided some extra materials, and wrote an article, ‘ “Alice” on the Stage’, in The Theatre (April 1887), which partly restates the story of the first telling, and is in part an effusive review. (In $\\phantom{0}{\\mathrm{18}}77$ a proposed collaboration with Arthur Sullivan was unsuccessful.)  \n\n6 the Nursery ‘Alice’: The Nursery ‘Alice’ . . . with Text Adapted to Nursery Readers was written by Dodgson between 28 December 1888 and 20 February $\\mathbf{\\deltaI}889$ . It was published, with ‘twenty coloured enlargements from Tenniel’s Illustrations’, in 1890; experts think that these were not coloured by Tenniel, although a Diary entry of 29 March $\\mathbf{I}885$ refers to ‘twenty pictures [that] are now being coloured by Mr Tenniel’. Roger Lancelyn Green, in The Diaries of Lewis Carroll (London: Cassell, 1955; New York: Oxford University Press, 1954), describes it as ‘this charming book . . . As a book for children under five it is only surpassed by the best of Beatrix Potter’ (ii. 469). Critics more usually regard it as the antithesis of the acerbic Potter style.  \n\n9 a White Rabbit: variously identified as Dr Spooner, by William Empson (RP, 415), as Dr Henry Wentworth Acland, ‘who was involved in the building of the Oxford Natural History Museum’, by Jo Elwyn Jones and J. Francis Gladstone (The Alice Companion (Basingstoke: Macmillan, 1998), $5{-}6,\\,{\\mathrm{185}}{-}7)$ ), and as Lord Newry, an undergraduate at Christ Church, by John Goldthwaite (pp. 146–53). A rabbit is mentioned in one line of the third chapter of George MacDonald’s Phantastes, a Faerie Romance (1858), the first of many motifs in that book that also occur in the ‘Alice’ books.  \n\n10 ‘orange $M A R M A L A D E$ :  according  to  her  grandson,  Lorinda Liddell, Alice’s mother and wife of the Dean of Christ Church, gave the original recipe for the most famous Oxford Marmalade (‘Frank Cooper’s’) to Mrs Cooper. She may have obtained it from the Dean",
    "chunk_order_index": 7,
    "full_doc_id": "doc-9049e42081712810c363fff6ac1324b1"
  },
  "chunk-31add99ad83c3bebc7331bd6daa3e815": {
    "tokens": 1200,
    "content": "astes, a Faerie Romance (1858), the first of many motifs in that book that also occur in the ‘Alice’ books.  \n\n10 ‘orange $M A R M A L A D E$ :  according  to  her  grandson,  Lorinda Liddell, Alice’s mother and wife of the Dean of Christ Church, gave the original recipe for the most famous Oxford Marmalade (‘Frank Cooper’s’) to Mrs Cooper. She may have obtained it from the Dean’s mother, who belonged to the Lyon family (later Bowes-Lyon). Elizabeth Bowes-Lyon was the mother of Queen Elizabeth II (RLG). even if I fell off the top of the house: Dodgson was not alone in his black humour: Beatrix Potter’s The Tale of Peter Rabbit (1902) contains a death joke on the second page.  \n\n11 right through the earth: MG points out (p. 13) that, ‘ignoring air resistance and the coriolis force’, it would take an object just over 42 minutes to fall through the earth. Compare Dodgson’s use of the number 42 elsewhere (see note to p. 105). Dinah: a tabby cat owned by the Liddell children; she and her kittens appear in the first chapter of Through the Looking-Glass. She was named from a popular folk song, later a music-hall song, ‘Villikins [or, in various versions, Villikens or Vilikins or Young Vilikins or Wilkins or Willikins] and his Dinah’. The tune was ‘Toorali oorali oorali ay’.  \n\n12 all made of . . . golden key: the Grimms’ Fairy Tales feature a final fragment, ‘The Golden Key’, and Perrault’s ‘Bluebeard’ is centred on a key: Maria Tatar points out that nineteenth-century dramatizations of that story ‘bore subtitles such as . . . “The Hazards of Female Curiosity” ’ (The Annotated Classic Fairy Tales (New York: Norton, 2002), 151). Alice’s key was possibly suggested by George MacDonald’s poem ‘The Golden Key’, published in Victoria Regis (1861). MacDonald also wrote a story, ‘The Golden Key’, which was published in Dealings with the Fairies (1867), which Dodgson may have seen in manuscript. It begins: ‘There was a boy who used to sit in the twilight and listen to his great-aunt’s stories. She told him that if he could reach the place where the end of the rainbow stands he would find there a golden key. “And what is the key for?” the boy would ask. “What is it the key of? What will it open?” “That nobody knows,” his aunt would reply.  \n\n13 How she longed . . . through the doorway: there have been suggestions that this is an image of birth, or a metaphor for Dodgson’s exclusion from the Deanery garden, or from the Garden of Eden. The garden had long been used in literature––and in children’s books––as a symbol of a place of security and growth. A notable expression of this is in Frances Hodgson Burnett’s The Secret Garden (1911), which also involves a key.  \n\nEchoes of this scene occur in T. S. Eliot’s ‘Burnt Norton’ (1935) (Four Quartets, 1943): ‘. . . Down the passage which we did not take| Towards the door we never opened|Into the rose-garden.’ One of similar echoes in The Family Reunion (1939) also alludes, perhaps, to the crow that frightens Tweedledee and Tweedledum in $_{L G}$ (p. 172):  \n\nI only looked through the little door When the sun was shining on the rose-garden: And heard in the distance tiny voices And then the black raven flew over.  \n\n(Act 2, Scene 2)  \n\n15 ‘eat me ’: Humphry Carpenter interprets ‘eat me’ and ‘drink me’ as ‘Alice’s anti-Communion’, a parody of the Eucharist which is ‘a negation of the Christian concept of the nature of human beings. Alice is the victim of a mindless, Godless universe’ (Secret Gardens (1985; London: Unwin, 1987), 66, 67).  \n\n16 [Illustration]: Batey (p. 9) notes the resemblance between the longnecked Alice and the brass firedogs in the fireplaces in the Hall in Christ Church.  \n\n17 a large fan: in $A A U.$ , the rabbit is carrying a nosegay.  \n\n18 Ada . . . Mabel: in $A A U$ these were Gertrude and Florence, cousins of the Liddell children. Dodgson described Gertrude as ‘the youngest Liddell . . . she has quite the most lovely face I ever saw in a child’ (MG, 157).  \n\n19 at that rate: Gardner cites Alexander L. Taylor’s suggestion that Alice will never get to 20 because $\\mathbf{\\epsilon}_{4}^{\\epsilon}$ times 5 actually is 12 in a number system using a base of 18. Four times 6 is 13 in a system with a base of 21. If we continue this progression, always increasing the base by 3, our products keep increasing by one until we reach 20, where for the first time the scheme breaks down. Four times 13 is not 20 (in a number-system with a base of $^{42}$ ), but ${\\bf\\nabla}^{\\ast}{\\bf\\Phi}_{\\bf I}\\cap\\mathcal{I}^{\\bf>}$ followed",
    "chunk_order_index": 8,
    "full_doc_id": "doc-9049e42081712810c363fff6ac1324b1"
  },
  "chunk-a7cda2c1622dc67fc0e7e968126cdb3a": {
    "tokens": 1200,
    "content": "13 in a system with a base of 21. If we continue this progression, always increasing the base by 3, our products keep increasing by one until we reach 20, where for the first time the scheme breaks down. Four times 13 is not 20 (in a number-system with a base of $^{42}$ ), but ${\\bf\\nabla}^{\\ast}{\\bf\\Phi}_{\\bf I}\\cap\\mathcal{I}^{\\bf>}$ followed by whatever symbol is adopted for “10”’ (MG, 23, and see Taylor, The White Knight: A Study of C. L. Dodgson (Edinburgh: Oliver and Boyd, 1952), 47).  \n\nHow doth the little crocodile: a parody of the first two stanzas of Song XX ‘Against Idleness and Mischief’ by Isaac Watts $\\left(\\mathbf{I}674^{-\\mathbf{I}}748\\right)$ from his Divine Songs Attempted in Easy Language for the Use of Children (1715), 29. The book remained popular well into the nineteenth century. The original reads:  \n\nHow doth the little busy Bee Improve each shining Hour, And gather Honey all the day From ev’ry opening Flower!  \n\nHow skilfully she builds her Cell! How neat she spreads the Wax! And labours hard to store it well With the sweet Food she makes.  \n\n20 the cause of this was the fan: in $A A U,$ , it is the Rabbit’s nosegay that causes her to shrink.  \n\nand in that case . . . to p. 21, a railway-station: not in $A A U.$  \n\nAlice had been to the seaside once in her life: Alice Liddell visited Llandudno in $\\operatorname{r}86\\operatorname{I}$ , and Dean Liddell built a house there in $\\phantom{-}\\mathrm{I}865$ .Dodgson, despite Llandudno’s protestations, did not visit.  \n\nbathing-machines: small changing-huts on wheels, common in Victorian seaside towns. They were drawn by horses into the sea so that bathers could change and enter the water unobserved. In The Hunting of the Snark the Bellman explains ways of identifying ‘the warranted genuine Snark’:  \n\nThe fourth is its fondness for bathing machines, Which it constantly carries about,   \nAnd believes that they add to the beauty of scenes–– A sentiment open to doubt.  \n\n21 it was only a mouse: the mouse may well caricature Miss Prickett, the Liddells’ governess. Mary Prickett $\\left(\\mathbf{I}\\,8_{33-\\mathbf{I}\\,9\\mathbf{I}\\,3}\\right)$ married Charles Foster, a wine merchant, and became landlady of the Mitre Hotel (now a listed building dating from c.1630, 18 High Street, Oxford). On 17 May $\\phantom{0}\\mathbf{I}\\phantom{0}\\!\\!\\!85\\phantom{0}$ , Dodgson wrote in his Diary that his interest in the children was being ‘construed by some men into attentions to the governess, Miss Prickett’, and decided to avoid the children to save embarrassment. Karoline Leach (In the Shadow of the Dreamchild: $_{\\textit{A}}$ New Understanding of Lewis Carroll (London: Peter Owen 1999)) argues that this is part of the evidence that Dodgson was not, in fact, interested in young girls at all, but older women (including Mrs Liddell).  \n\nher brother: Alice Liddell’s elder brother was Harry––Edward Henry $\\left(\\mathbf{\\Omega}\\mathbf{1}847{-}\\mathbf{I9}\\mathbf{I1}\\right)$ . Dodgson tutored him briefly in $\\operatorname{I}856$ .  \nLatin Grammar: probably that by Benjamin Hall Kennedy, first published $\\mathrm{I}843$ (RLG).   \n(Alice thought . . . O mouse!): not in AAU.   \nthe first sentence in her French lesson-book: this is the first sentence of the first lesson in La Bagatelle: Intended to introduce children of  \n\nthree or four years old to some knowledge of the French language (1804) (RLG).  \n\n22 show you our cat Dinah: Shane Leslie (1933), in an article now widely regarded as satirical, suggested that $A A W$ was a ‘secret history’ of the Oxford Movement––Dinah is the ‘Catholic enemy’ of the church mouse . . . ‘the Duchess is Bishop Wilberforce, the Cheshire Cat, who sits aloft and grins, is a likely skit on Cardinal Wiseman’ (RP, 259, 260) and so on.  \n\n23 there was a Duck . . . other curious creatures: the Duck was the Revd Robinson Duckworth $\\left(\\mathbf{I}834^{-\\mathbf{I}9\\mathbf{I}\\mathbf{I}}\\right)$ , fellow of Trinity College, Oxford; later canon of Westminster. Dodgson inscribed a copy of the facsimile $A A U$ (1886): ‘The Duck from the Dodo’. Dodgson, like most of his siblings, had a lifelong speech impediment or stammer (hence ‘Do-do-Dodgson’), which may have restricted his work in the Church and affected his lecturing. There appears to be no truth in the suggestion that his stammer was less troublesome when he was with children. The Lory was Alice’s sister, Lorinda (a Lory is an Australasian parrot), and the Eaglet probably Alice",
    "chunk_order_index": 9,
    "full_doc_id": "doc-9049e42081712810c363fff6ac1324b1"
  },
  "chunk-1ac1e1694b48c30c4372e7b337b9fd0c": {
    "tokens": 1200,
    "content": "Dodo’. Dodgson, like most of his siblings, had a lifelong speech impediment or stammer (hence ‘Do-do-Dodgson’), which may have restricted his work in the Church and affected his lecturing. There appears to be no truth in the suggestion that his stammer was less troublesome when he was with children. The Lory was Alice’s sister, Lorinda (a Lory is an Australasian parrot), and the Eaglet probably Alice’s sister Edith.  \n\n25 “William the Conqueror . . . insolence of his Normans”: a quotation from Havilland Chepmell’s $_{\\textit{A}}$ Short Course of History (1862) which Miss Prickett was using with the Liddell children.  \n\n26 Caucus-race: a sardonic commentary on committee work, probably aimed at Oxford disputes. A caucus is a meeting designed to pull political strings. In 1866, Dodgson published a satirical pamphlet on The Elections to the Hebdominal Council, which contained in a footnote ‘I never go to a caucus without reluctance: I never write a canvassing letter without a feeling of repugnance to my task’ (LCPB, 82).  \n\nWhat I was going to say . . . quite dry again: this story exists in three versions. The first is a diary entry for Tuesday, 17 June 1862, describing an expedition downriver to Nuneham:  \n\nDuckworth (of Trinity) and Ina, Alice, and Edith came with us . . . About a mile above Nuneham heavy rain came on, and after bearing it a short time I settled that we had better leave the boat and walk; three miles of this drenched us pretty well. I went on first with the children, as they could walk much faster than Elizabeth, and took them to the only house I knew in Sandford, Mrs Broughton’s, where Ranken lodges. I left them with her to get their clothes dried, and went off to find a vehicle, but none was to be had there, so on the others arriving, Duckworth and I walked on to Iffley, whence we sent them a fly. We all had tea in my rooms about $8\\%$ after which I took the children home, and we adjourned to Bayne’s rooms for music and singing, ‘Adelaida,’ etc.  \n\nIn Alice’s Adventures under Ground, this becomes:  \n\n‘I only meant to say,’ said the Dodo in a rather offended tone, ‘that I know of a house near here, where we could get the young lady and the rest of the party dried, and then we could listen comfortably to the story which I think you were good enough to promise to tell us,’ bowing gravely to the mouse.  \n\nThe mouse made no objection to this, and the whole party moved along the river bank, (for the pool had by this time begun to flow out of the hall, and the edge of it was fringed with rushes and forgetme-nots,) in a slow procession, the Dodo leading the way. After a time the Dodo became impatient, and, leaving the Duck to bring up the rest of the party, moved on at a quicker pace with Alice, the Lory, and the Eaglet, and soon brought them to a little cottage, and there they sat snugly by the fire, wrapped up in blankets, until the rest of the party had arrived, and they were all dry again. (pp. $^{26-7,}$ )  \n\n26 in the pictures of him: a minor mystery: no commentators have been able to trace such images.  \n\ncomfits: seeds, nuts, spices or (dried) fruit covered with layers of sugar, including sugar-plums. Lynne Vallone (Disciplines of Virtue (New Haven: Yale University Press, 1995), 107) detects a pun––Alice is dis-comfited.  \n\n27 [Illustration]: the ape in the background has caused speculation that it may refer to the Darwinian Thomas Huxley’s encounter with the Bishop of Oxford, Samuel Wilberforce, in 1860, when he said that he would rather be descended from a monkey than a bishop. As Batey (p. 16) points out, Dodgson took a photograph of Huxley afterwards. Tenniel used a very similar image in a Punch cartoon in $\\phantom{0}\\mathrm{I}856$ ,satirizing ‘King Bomba’ (King Ferdinand II of the Two Sicilies) (see Michael Hancher, ‘Punch and Alice: Through Tenniel’s LookingGlass’, in Guiliano, 46).  \n\n28 something like this: in $A A U.$ , this poem was completely different, and began,  \n\nWe lived beneath the mat Warm and snug and fat But one woe, $\\&$ that Was the cat!  \n\n29 ‘Oh, do let me help to undo it!’: Dodgson used this phrase at the head of the appendix to $_{\\textit{A}}$ Tangled Tale, which appeared in The Monthly Packet ‘as a serial’ from April $\\mathbf{1880}$ , and in book form in $\\mathbf{I}\\,88_{5}$ . The introductory verses to the book are addressed to his ‘beloved pupil’ and certainly seem to refer to Alice Liddell:  \n\nThen onward! Let the voice of Fame From Age to Age repeat thy story, Till thou hast won thyself a name Exceeding even Euclid’s glory.  \n\n30 ‘I wish I hadn’t mentioned . . . finish his story: the equivalent paragraph in $A A U$ reads:  \n\nShe sat for some",
    "chunk_order_index": 10,
    "full_doc_id": "doc-9049e42081712810c363fff6ac1324b1"
  },
  "chunk-3dfdaad3d1d3cd66221c833c43b96b99": {
    "tokens": 1200,
    "content": "I}\\,88_{5}$ . The introductory verses to the book are addressed to his ‘beloved pupil’ and certainly seem to refer to Alice Liddell:  \n\nThen onward! Let the voice of Fame From Age to Age repeat thy story, Till thou hast won thyself a name Exceeding even Euclid’s glory.  \n\n30 ‘I wish I hadn’t mentioned . . . finish his story: the equivalent paragraph in $A A U$ reads:  \n\nShe sat for some while sorrowful and silent, but she was not long before she recovered her spirits, and began talking to herself again as usual: ‘I do wish some of them had stayed a little longer! and I was getting to be such friends with them––really the Lory and I were almost like sisters! and so was that dear little Eaglet! And then the Duck and the Dodo! How nicely the Duck sang to us as we came along through the water: and if the Dodo hadn’t known the way to that nice little cottage, I don’t know when we should have got dry again––’ and there is no knowing how long she might have prattled on in this way, if she had not suddenly caught the sound of pattering feet.  \n\n31 The Duchess: in $A A U$ she is ‘the Marchioness’.  \n\nMary Ann: Anne Clark suggests that she may be the parlour maid of the photographer Julia Margaret Cameron (who, with her hands stained with chemicals, would have worn gloves) (Ann Clark, Lewis Carroll: A Biography (London: Dent, 1979), 134).  \n\n33 there’s no room to grow up any more here: James R. Kincaid suggests that this shows (the real) Alice’s unproblematic acceptance of growing up and growing away from Dodgson, and compares this with the problematic non-growth of ‘Peter Pan’ (Child-Loving: The Erotic Child and Victorian Culture (New York and London: Routledge, 1992), 290).  \n\n34 Digging for apples: ‘Irish apples’ was, and occasionally is, a slang term for potatoes. This may also be a play on pommes de terre.  \n\n37 The poor little Lizard, Bill: Kenneth Grahame, in ‘The Headswoman’, The Yellow Book (October 1894), refers to him: ‘ “Beg pardon, your worship,” put in Master Robinet, the tanner, who had been sitting with  a  petrified,  Bill-the-Lizard  sort  of  expression  during  the speechifying: “but are we to understand as how this here young lady is going to be the public executioner of this here town?” ’  \n\n40 [Illustration]: in The Nursery ‘Alice’, Alice encounters the large Blue Caterpillar: ‘And do you see its long nose and chin? At least, they look exactly like a nose and chin, don’t they? But they really are two of its legs. You know a Caterpillar has got quantities of legs: you can see more of them, further down.’ Tenniel also provided the Caterpillar with academic sleeves.  \n\n42 “You are old, Father William”: a parody of Robert Southey’s ‘The Old Man’s Comforts and How He Gained Them’, first published in The Annual Anthology, 1 (1799).  \n\nYou are old, Father William, the young man cried, The few locks which are left you are grey; You are hale, Father William, a hearty old man, Now tell me the reason, I pray. In the days of my youth, Father William replied, I remember’d that youth would fly fast, And abused not my health and my vigour at first, That I never might need them at last.  \n\nIn deference to the Kaiser, the first German translation read: ‘Ihr seid alt, Vater Martin’ (Derek Hudson, Lewis Carroll: An Illustrated Biography (1954; rev. edn., London: Constable, 1976), 130).  \n\nDodgson used the poem again in $\\phantom{-}\\mathbf{I}876$ as the basis for an acrostic poem addressed to Adelaide Paine, which begins:  \n\n‘Are you deaf? Father William!’ the young man said, ‘Did you hear what I told you just now? ‘Excuse me for shouting! Don’t waggle your head ‘Like a blundering, sleepy old cow! . . .  \n\n43 one shilling the box: in $A A U$ it cost 5 shillings (RLG).  \n\n45 [Illustration]: the structure in the right background is an eel-weir–– wicker baskets to trap eels (Hancher in Guiliano, $4^{\\mathbf{I}-3})$ . Batey (pp. 16–17) points out that there were such traps in the backwater at Godstow, where Dodgson and the Liddell girls had their picnics.  \n\n46 will make you grow shorter: in $A A U,$ , the Caterpillar remarks: ‘the top will make you grow taller, and the stalk will make you grow shorter’, and Alice then picks the mushroom and ‘carefully broke it in two, taking the stalk in one hand, and the top in the other’ and nibbling appropriately. It is perhaps not surprising that in the 1960s (especially) the hookah and the magic mushroom suggested a connection between Alice’s psychedelic experiences and the drug culture.  \n\n47 ‘Serpent!’: William Empson noted in ‘Alice in Wonderland: The Child as Swain’: ‘Alice knows several reasons why she should object to growing up, and does not at all like being an obvious angel, a head out of contact with its body that has to come down from the sky",
    "chunk_order_index": 11,
    "full_doc_id": "doc-9049e42081712810c363fff6ac1324b1"
  },
  "chunk-646d3d443db6bc9b3a4cbffdf146fb7d": {
    "tokens": 1200,
    "content": "appropriately. It is perhaps not surprising that in the 1960s (especially) the hookah and the magic mushroom suggested a connection between Alice’s psychedelic experiences and the drug culture.  \n\n47 ‘Serpent!’: William Empson noted in ‘Alice in Wonderland: The Child as Swain’: ‘Alice knows several reasons why she should object to growing up, and does not at all like being an obvious angel, a head out of contact with its body that has to come down from the sky and gets mistaken for a Paradisal serpent of the knowledge of good and evil, and by the pigeon of the Annunciation, too’ (RP, 414). Rose Lovell-Smith, in ‘Eggs and Serpents: Natural History Reference in Lewis Carroll’s Scene of Alice and the Pigeon’, Children’s Literature, 35 (2007), 27–53, thinks it is better read ‘in the context of Victorian depictions of the struggle for survival in nature’ and a common ‘eggthief’ topos (p. 36).  \n\n49 As she said this: in $A A U$ this sentence continues at the end of the AAW’s Chapter VII when Alice notices the tree with the door in it (p. 68). Chapters VI and VII are additions.  \n\n50 [Illustration]: Tenniel’s illustration may have been influenced by the work of the French caricaturist ‘J. J. Grandville’ (Jean-Ignace-Isadore Gérard, $_{\\mathrm{I}}803{-}47)$ who portrayed human bodies with animal heads, often for the French satirical magazine Charivari (for many years Punch bore the subtitle The London Charivari).  \n\n52 a large kitchen: in children’s literature, kitchens are very often symbols of warmth, food, and security––as, for example, in Kenneth Grahame’s The Wind in the Willows (1908, ch. 4); the empty kitchen is particularly desolating, as in E. Nesbit’s The Railway Children (1906, ch. 4). In Dodgson’s version, everything is violent, unstable, and unsettling;  for  another  dysfunctional  kitchen,  compare  Emily Brontë’s Wuthering Heights $\\phantom{0}_{\\cdot}\\mathrm{I}847$ , ch. 1).  \n\nthe Duchess: Tenniel’s drawing resembles––at least in the headdress–– the Flemish Quinten Massy’s $_{\\textit{A}}$ Grotesque Old Woman (c.1525–30) (National Gallery, London). Michael Hancher (The Tenniel Illustrations to the ‘Alice’ Books (Columbus, Ohio: Ohio State University Press, 1985)) [available on line, Ohio State University Press Open Access Initiative] discusses, exhaustively, other candidates (pp. $40{-}7,$ ).  \n\n53 too much pepper: Marina Warner (No Go the Bogeyman (London: Chatto and Windus, 1998), 153) suggests that Harry Graham had this scene in mind in his Ruthless Rhymes for Heartless Homes (1899):  \n\nNurse, who peppered baby’s face (She mistook it for a muffin) . . . Mother, seeing baby blinded, Said ‘Oh nurse, how absent-minded!’ ‘It’s a Cheshire-Cat’: ‘to grin like a Cheshire-cat’ is an old English saying, of obscure origin. Dodgson may well have followed a discussion in Notes and Queries (1850–2––at his death his library included over a hundred volumes of this journal) which suggested, among other theories, that it was because Cheshire cheese was made in the shape of a cat. The Liddell coat of arms featured three snarling leopards, and, as Cohen notes, ‘the leopards from Cardinal Wolsey’s coat of arms that graces the fabric of Christ Church . . . are known as “Ch Ch cats”’ (Morton N. Cohen, Lewis Carroll: A Biography (London and Basingstoke: Macmillan, 1995), 136).  \n\nAlso, Dodgson was born in Cheshire, and in St Peter’s church, Croft-on-Tees, where his father was rector, ‘on the south side of the chancel you will see a fourteenth-century triple sedilia––three stone arches with seats for the priest, deacon, and sub-deacon. On the right side of the sedilia is the carved face of a cat which appears to be smiling’ (Charlie Lovett, Lewis Carroll’s England: An Illustrated Guide for the Literary Tourist (London: White Stone Publishing/The Lewis Carroll Society, 1998), 9–10).  \n\nKaren McGavock, ‘Lewis Carroll and the Deconstruction of Childhood’, feels that Dodgson ‘parodies the role of the omniscient narrator through the Cheshire Cat’ (Rosie Finlay and Sébastien Salbayre (eds.), Histoires d’Enfant, Histoires d’Enfance (Tours: Presses Universitaires François Rabelais, 2007), 44). Goldthwaite (pp. $84\\mathrm{-}5.$ )regards the cat as Dodgson: sympathetic to Alice, helpful, and omniscient. Alderson suggests that Dodgson’s use of it ‘may stem from his reading of The Water Babies since the evanescent beast was not present in his first draft of the story’ (Charles Kingsley, The Water Babies, ed. Brian Alderson (Oxford: Oxford University Press, 1995), 213).  \n\n54 Speak roughly to your little boy: a parody of ‘Speak Gently’ by David Bates, published in the Philadelphia Inquirer in $\\phantom{-}\\mathrm{",
    "chunk_order_index": 12,
    "full_doc_id": "doc-9049e42081712810c363fff6ac1324b1"
  },
  "chunk-a4f08092bc9df8e56cc41e32fc3d8522": {
    "tokens": 1200,
    "content": "erson suggests that Dodgson’s use of it ‘may stem from his reading of The Water Babies since the evanescent beast was not present in his first draft of the story’ (Charles Kingsley, The Water Babies, ed. Brian Alderson (Oxford: Oxford University Press, 1995), 213).  \n\n54 Speak roughly to your little boy: a parody of ‘Speak Gently’ by David Bates, published in the Philadelphia Inquirer in $\\phantom{-}\\mathrm{I}\\,845$ , and in Sharpe’s London Magazine in $\\phantom{-}\\mathrm{I}845$ which was edited by Frank Smedley, a minor novelist, and a collaborator of Edmund Yates, of the magazine The Train. He was the cousin of Dodgson’s cousin, Menella Bute Smedley (ODNB). The third stanza reads:  \n\nSpeak gently to the little child! Its love be sure to gain; Teach it in accents soft and mild–– It may not long remain.  \n\nDodgson added extra dialogue for Savile Clarke’s stage production, and an extra verse for the cook:  \n\nBoil it so easily, Mix it so greasily, Stir it so sneezily, One! Two!! Three!!!  \n\n56 neither more nor less than a pig: in an example of historical speculation, RLG cites C. W. Scott-Giles, Fitzalan Pursuivant of Arms Extraordinary, who suggests that this might be a reference to Richard III, son of Richard Duke of York, who was called ‘the hog’ in political lampoons. The Duke in $A A W$ does not appear: Richard Duke of York was living in retirement at the time of his son’s birth. At the end of $A A W$ the Queen has the gardeners paint the white roses (of York) red (the Lancastrian colour).  \n\n57 they’re both mad: ‘mad as a Hatter’ is first recorded in Blackwood’s Magazine in 1829, and in Canada in The Clockmaker by Thomas Chandler Haliburton in $\\mathbf{I}\\,836$ , and is thought to come from the fact that mercurous nitrate, used in hat-making, produced chorea (St Vitus’s Dance) and other neurological effects. Dodgson may have based his Hatter on an Oxford eccentric, Theophilus Carter, who resembled the prime minister, Gladstone, and who invented ‘the Alarm Clock Bed’, which tipped its occupant out (it was exhibited at the Great Exhibition at London’s Crystal Palace in $\\boldsymbol{\\mathrm{I}}\\,\\boldsymbol{8}_{5}\\boldsymbol{\\mathrm{I}}$ ). He was a cabinetmaker with a shop at $48$ High Street, Oxford. Tenniel may have sketched him from life. However, Bishop T. B. Strong wrote: ‘I do not think Dodgson observed people enough to construct his characters in that way [from life]’ (‘Mr Dodgson: Lewis Carroll at Oxford’, The Times, 27 January 1932).  \n\nThe philosopher Bertrand Russell bore some resemblance to the Hatter, and he and his contemporaries, the philosophers J. M. E. McTaggart and G. E. Moore, were known in Cambridge as the Mad Tea Party of Trinity.  \n\n‘As mad as a March Hare’ is an old English saying, first recorded $c.1500$ , referring to the belief that hares behave oddly in the mating season.  \n\n$58$ as this is May: Alice Liddell’s birthday was 4 May; talking to the Mad Hatter, Alice gives the date as the fourth (p. 62), and when she is talking to Humpty Dumpty (p. 188) in $_{L G}$ ––which is set on 4 November (p. 125)––she says that she is ‘seven years and six months’.  \n\n60 ‘Why is a raven like a writing-desk?’: Dodgson supplied an answer in the Preface dated December 1896 (see p. 6). ‘Because it can produce a few notes, though they are very flat; and it is never put with the wrong end in front!’ MG (p. 72) cites a claim that Dodgson originally spelled ‘never’ as ‘nevar’––‘raven’ (almost) spelled backwards: thus ‘it is nevar put with the wrong end in front!’ (Denis Crutch, ‘A Note on the Hatter’s riddle’, Jabberwocky, 25 $(\\xi/\\mathrm{I})$ (winter 1976), 32). The Pennyroyal Edition, text edited by Selwyn Goodacre (West Hadfield, Mass.:  Pennyroyal  Press,  1982),  prints  ‘nevar’.  The  American Cyclopedia of Puzzles (1914) suggested a different answer to the riddle: ‘because Poe wrote on both’.  \n\n62 ‘Two days wrong!’: Alexander L. Taylor (in The White Knight, 57) points out that if the Hatter’s watch measures time by the phases of the moon, on $\\mathbf{\\epsilon}_{4}^{\\epsilon}$ May 1862, there was exactly two days’ difference between the two ways of reckoning the date . . . There can be no doubt that Dodgson consulted an almanac.’  \n\n63 Twinkle, twinkle, little bat!: a parody of Jane Taylor’s $(\\scriptstyle{\\mathrm{178}}3-\\scriptstyle{\\mathrm{I}}\\,824)$ ‘The Star’ from Rhymes for the Nursery (1806), which begins  \n\nTwinkle, twinkle, little star, How I wonder what you are! Up above the world so high, Like a",
    "chunk_order_index": 13,
    "full_doc_id": "doc-9049e42081712810c363fff6ac1324b1"
  },
  "chunk-7d153d892430a97620900f9a71949f67": {
    "tokens": 1200,
    "content": "the date . . . There can be no doubt that Dodgson consulted an almanac.’  \n\n63 Twinkle, twinkle, little bat!: a parody of Jane Taylor’s $(\\scriptstyle{\\mathrm{178}}3-\\scriptstyle{\\mathrm{I}}\\,824)$ ‘The Star’ from Rhymes for the Nursery (1806), which begins  \n\nTwinkle, twinkle, little star, How I wonder what you are! Up above the world so high, Like a diamond in the sky.  \n\nThe daughter of Professor Bartholomew Price, Dodgson’s tutor and friend, claimed that ‘bat’ was Price’s nickname, and that this reference was included as a compliment.  \n\n65 Elsie, Lacie, and Tillie: the three little/Liddell sisters: Elsie is a pun on Lorinda Charlotte’s initials, ‘Lacie’ is an anagram of Alice, and Tillie is an abbreviation of Matilda, Edith’s nickname.  \n\n66 treacle-well: medicinal springs in Oxfordshire were known as ‘treacle wells’––treacle meaning ‘balm’ (and see Introduction, p. xxxvi).  \n\n67 into the teapot: a ‘favourite artificial nest’ for pet dormice is said to have been an old teapot filled with moss or dried grass (Marghanita Laski, Times Literary Supplement, 6 May 1965). Charlotte M. Yonge (John Keble’s Parish, 1898) remarks that ‘the smooth round dormouse (or sleep-mouse, as the children call it) is a favourite gift imprisoned  \n\nin an old tea-pot’ (RLG).   \n70 Alice was rather doubtful . . . to p. 71, and waited: not in $A A U.$ .  \n71 [Illustration]: the dome in the background is the Oxford Botanic Garden’s water lily house. the Knave of Hearts: Goldthwaite (p. 144) detects another selfportrait of Dodgson: ‘not only is the Knave the nicest person in the book; he is the only nice person in the book’.   \n72 only a pack of cards: Dodgson had invented a card game, ‘Court Circular’, for the Liddell children, which he had printed in January 1860 (revised April 1862). crimson with fury: in his article ‘ “Alice” on the Stage’ (1881) Dodgson wrote: ‘I pictured to myself the Queen of Hearts as a sort of embodiment of ungovernable passion––a blind and aimless Fury’ (LCPB, 171).   \n73 ‘Can you play croquet?’: Dodgson often played croquet with the Liddell sisters in the Deanery garden, and had invented a new version of the game, Castle Croquet (privately printed 4 May 1863) (LCPB, ${\\bf27I{-}4})$ (RLG). flamingoes: ostriches in AAU.   \n74 about once in a minute . . . to p. 82, cost them their lives: not in $A A U.$ .  \n75 I should have croqueted the Queen’s hedgehog: to croquet is to drive away a ball, after hitting it with one’s own, by placing the two in contact and striking one’s own with the mallet (SOED).  \n\n76 ‘A cat may look at a king’: proverb first recorded in J. Heywood, Dialogue of Proverbs (1546).  \n\n79 camomile: an oil extracted from camomile flowers, administered as a cure for stomach and other complaints and as a sleep aid; often as an ingredient in herbal tea. At the end of Beatrix Potter’s The Tale of Peter Rabbit (1902): ‘I am sorry to say that Peter was not very well during the evening. His mother put him to bed, and made some camomile tea; and she gave a dose of it to Peter! “One table-spoonful to be taken at bed-time.” ’  \n\nmoral, if only you can find it: Dodgson used much the same expression in his pamphlet on The New Belfry of Christ Church, Oxford (1872): ‘Everything has a moral if you choose to look for it’ (LCPB, 117). ‘There’s a moral in everything, if we would only avail ourselves of it,’ is a saying of the less than estimable Louisa Chick, sister of Paul Dombey senior in Dickens’s Dombey and Son (ch. 2) $\\left(\\mathrm{{I}}\\,846{-}8\\right)$ .  \n\n80 ’tis love, that makes the world go round!: originally the refrain of a French folk song, which is quoted by Charles Kingsley in The WaterBabies (ch. 2): ‘C’est l’amour . . . Qui fait la monde à la ronde’. The Duchess is quoting from a popular translation, ‘The Dawn of Love’, Birmingham, c.1820. Goldthwaite (pp. 113–14) sees this as Dodgson satirizing Kingsley. sounds will take care of themselves: from the English proverb: ‘Take care of the pence and the pounds will take care of themselves’, attributed  to  William  Lowndes  (1652–1724),  Secretary  to  the Treasury. Suzanne Holthuis, ‘Alice in Wonderland: Aspects of Intertextuality’ in Rachel Fordyce (ed.), Semiotics and Linguistics in Alice’s Worlds (Berlin: de Gruyter, 1994), 134, describes this sentence as ‘a prototype of lexical substitutions and play on words preserving the phonological structure’.   \n81 ‘It’s a mineral, I think",
    "chunk_order_index": 14,
    "full_doc_id": "doc-9049e42081712810c363fff6ac1324b1"
  },
  "chunk-3b6a32f2d29f2d90aaf24eabd31edb32": {
    "tokens": 1200,
    "content": "Lowndes  (1652–1724),  Secretary  to  the Treasury. Suzanne Holthuis, ‘Alice in Wonderland: Aspects of Intertextuality’ in Rachel Fordyce (ed.), Semiotics and Linguistics in Alice’s Worlds (Berlin: de Gruyter, 1994), 134, describes this sentence as ‘a prototype of lexical substitutions and play on words preserving the phonological structure’.   \n81 ‘It’s a mineral, I think’: the first reference in the ‘Alice’ books to a Victorian parlour game, ‘Animal, Vegetable, or Mineral?’ or ‘Twenty Questions’. It is referred to in Gilbert and Sullivan’s The Pirates of Penzance $(\\mathrm{r}\\,879)$ , in the Major-General’s song: ‘I’ve information vegetable, animal and mineral’. The Lion refers to it in $_{L G}$ (206). as pigs have to fly: traditional Scots proverb, recorded by John Withal, $\\mathbf{I}\\,586$ .  \n82 Mock Turtle Soup: an eighteenth-century substitute for green turtle soup, based on a calf’s head and Madeira wine, although there are many modern variants––in the USA, oxtail is used. The Mock Turtle’s calf’s head and feet in the illustration on p. 85 were suggested to Tenniel by Canon Duckworth.  \n\n83 a Gryphon: or griffin––a classical (Greek) monster––the crest of Trinity College, Oxford. On 1 August 1862, Dodgson went to the Deanery ‘and remained a short time, for me to write the names in the books for crests etc. which I have given to Alice and Edith’. Donald Thomas points out that ‘When The Oxford Companion to Classical Literature was published in 1937, it directed the reader in search of an image of the monster to “Tenniel’s illustrations of the Gryphon in ‘Alice in Wonderland’”’ (Lewis Carroll: A Portrait with Background (London: John Murray, 1996), 158).  \n\n84 ‘Hjckrrh!’: Jo Elwyn Jones and Francis Gladstone detect a reference to Ruskin in the Gryphon’s exclamation, deriving it from John (Jh) Ruskin (Rk), and the remaining letters ‘Chr’ from ‘Ruskin’s pet-name to his child-friends . . . St Chrysostom’. ‘Our critics’, they observe, ‘find this argument strained’ (The Alice Companion, 13).  \n\n‘Yes, we went to school in the sea . . .’ to p. 88 he went on again: not in AAU.  \n\n86 Drawling-master: RLG detects a private joke: John Ruskin, who had been a ‘gentleman-commoner’ studying at Christ Church (graduated 1836), taught the Liddell sisters drawing, once a week. Some of the caricatures of Ruskin (for example, in Punch, 18 December 1880)–– and some photographs––give him conger-eel-like characteristics. In a letter  to  E.  Gertrude  Thompson  (24  January  1869)  Dodgson described him as ‘numbering among my friends’. Ruskin (like Dodgson) has been suspected or accused of (latent) paedophilia by his biographers.  \n\nReeling and Writhing . . . Laughing and Grief: puns on usual educational subjects, Reading, Writing, Addition, Subtraction, Multiplication, Division, History, Geography, Drawing, Sketching, Painting in Oils, Latin, and Greek (RLG).  \n\n88 a Lobster-Quadrille: a parody of the quadrille, an early form of squaredance, which was fashionable. On 3 July 1862, Dodgson lunched at the Deanery, and noted that ‘the three sang “Sally Come Up” with great spirit’. ‘Sally Come Up’ was a song ‘in the blackface minstrel tradition’, which, as Norman Cazden, Herbert Haufrecht, and Norman Studer note in Folk Songs of the Catskills (Albany: SUNY Press, 1982), was designed to ridicule the ugly, and negroes in particular. The sheet music was published in England in $\\phantom{0}\\mathbf{I}\\,859$ , and the least offensive of the verses reads:  \n\nSally come up, Oh, Sally come down, Oh Sally, come twist your heels around. De old man, he’s gone down to town, Oh, Sally, come down de middle.  \n\nDodgson parodied this in AAU:  \n\nSalmon come up! Salmon go down! Salmon come twist your tail around! Of all the fishes in the sea There’s none so good as Salmon!  \n\n90 very slowly and sadly . . . p. 94, will you, old fellow?: not in $A A U$ ‘Will you walk a little faster?’: this poem replaces $A A U8$ ‘Salmon come up!’. It is a parody of Mary Howitt’s ‘The Spider and the Fly’, first published in The New Year’s Gift, and Juvenile Souvenir (1829):  \n\n‘Will you walk into my parlour?’ said the Spider to the Fly, ‘’Tis the prettiest little parlour that ever you did spy; The way into my parlour is up a winding stair, And I have many curious things to show when you are there.’ ‘Oh no, no,’ said the little Fly, ‘to ask me is in vain, For who goes up your winding stair can ne’er come down again.’  \n\n91 They have their tails in their mouths: whiting, a white fish of the cod family, stocks of which",
    "chunk_order_index": 15,
    "full_doc_id": "doc-9049e42081712810c363fff6ac1324b1"
  },
  "chunk-54019744681456bee075bb1dd5dee115": {
    "tokens": 1200,
    "content": "the Fly, ‘’Tis the prettiest little parlour that ever you did spy; The way into my parlour is up a winding stair, And I have many curious things to show when you are there.’ ‘Oh no, no,’ said the little Fly, ‘to ask me is in vain, For who goes up your winding stair can ne’er come down again.’  \n\n91 They have their tails in their mouths: whiting, a white fish of the cod family, stocks of which have declined in recent years. Collingwood (LLLC, 402) prints an account of Dodgson’s visit to a children’s writer, Miss M. E. Manners, in $\\mathbf{\\sigma}_{\\mathbf{I}}880$ , where he said: ‘When I wrote that, I believed that whiting really did have their tails in their mouths, but I have since been told that fishmongers put the tail through the eye, not in the mouth at all.’ Thus prepared, the whiting were then fried in breadcrumbs. blacking: shoe polish.  \n\n92 ‘Don’t you mean “purpose”?’: Goldthwaite (p. 91) thinks that the purpose|porpoise pun is an attack on Charles Kingsley’s didacticism.   \n93 ’Tis the voice of the Lobster: a parody of Isaac Watts, ‘The Sluggard’ from ‘A Slight Specimen of Moral Songs’ in Divine Songs, $46\\mathrm{-}7$ :  \n\n’Tis the Voice of the Sluggard. I hear him complain You have wak’d me too soon, I must slumber again. As the Door on its Hinges, so he on his Bed, Turns his Sides and his Shoulders, and his heavy Head.  \n\nAs noted in the ‘Preface to the Seventy-ninth Thousand’ (p. 5) the second four lines of the first stanza (When the sands . . .) and the last six lines of the second (The Panther took pie crust . . .) of Dodgson’s parody were added for Savile Clarke’s play and then added to the book (RLG).  \n\n94 ‘It’s the first position in dancing’: in which the heels are together and the toes turned out (as in the illustration on p. 93).  \n\nI passed by his garden: the third stanza of ‘The Sluggard’ (see note to p. 93) begins:  \n\nI past by his Garden, and saw the wild Bryar The Thorn and the Thistle grow broader and higher: (p. 47)  \n\nFor William Boyd’s Songs from Alice’s Adventures in Wonderland (1870) Dodgson added two lines:  \n\nWhile the duck and the Dodo, the lizard and cat, Were swimming in milk round the brim of a hat.  \n\n95 Beautiful Soup, so rich and green: a parody of ‘Beautiful Star’, which Dodgson heard Alice and Edith Liddell sing on 1 August 1862. The song was written in $\\phantom{-}\\mathbf{I}\\,\\phantom{0}855$ by James M. Sayles (harmonized and arranged by Henry Tucker, Albany [NY], J. Hidley). One British edition, published by Chas. Sheard and Co, London, attributed it to S. M. Sayles, in a series ‘Favourite American Melodies Sung by the Christy Minstrels’. It begins:  \n\nBeautiful star in heav’n so bright   \nSoftly falls thy silv’ry light,   \nAs thou movest from earth so far,   \nStar of the evening, beautiful star, Beau––ti-ful star, Beau––ti-ful star,   \nStar-r of the eve-ning, Beautiful, beautiful star.  \n\nBatey (p. 25) points out that when turtle soup was on the menu, ‘Christ Church children were allowed to ride on the live turtles around the kitchen’.  \n\n96 who stole the tarts ?: Kimberley Reynolds and Nicola Humble, in Victorian Heroines (Hemel Hempstead: Harvester Wheatsheaf, 1993), 129, point out that the trial scene ‘with its innuendoes about sexual intrigue in the palace, revealed in the Knave’s verse-letter . . . and its atmosphere of amoral chaos lurking beneath the familiar furniture of Victorian bourgeois life . . . owes a clear debt to the sensation novel’. Goldthwaite (pp. $_{146-53}$ decodes the whole trial as an allegory of ‘the Lord Newry affair’ (casting the White Rabbit as Newry), suggesting that Newry, a rowing companion of Dodgson, and a friend of the Liddell family, impugned Dodgson’s character, leading to Mrs Liddell’s estrangement from Dodgson in $\\operatorname{I}86_{3}$ .Dodgson is the innocent Knave of Hearts.  \n\nwhen they arrived . . . to p. 109 ‘You’re nothing but a pack of cards!’: not in AAU.  \n\n98 she made some tarts: the first six lines of four twelve-line stanzas from The European Magazine (April $\\mathbf{I}782\\$ ): the others deal with the court cards of the other suits (see Opies, $359\\mathrm{-}60)$ .  \n\n103 alice’s evidence: David Rudd (Enid Blyton and the Mystery of Children’s Literature (Basingstoke: Macmillan, 2000), 70–1) notes that the final scene of the first Noddy book, Noddy Goes to Toyland (1949), is an echo of this scene. He also notes that in the ‘Noddy’ books there is ‘much sub-Carrollian word-play",
    "chunk_order_index": 16,
    "full_doc_id": "doc-9049e42081712810c363fff6ac1324b1"
  },
  "chunk-01e7bbe78a096b59d7713f1813d32ec1": {
    "tokens": 1200,
    "content": "$359\\mathrm{-}60)$ .  \n\n103 alice’s evidence: David Rudd (Enid Blyton and the Mystery of Children’s Literature (Basingstoke: Macmillan, 2000), 70–1) notes that the final scene of the first Noddy book, Noddy Goes to Toyland (1949), is an echo of this scene. He also notes that in the ‘Noddy’ books there is ‘much sub-Carrollian word-play . . . [as when] . . . Noddy says, “I can’t add up. I can’t add down either.” ’  \n\nwith the edge of her skirt: this has been seen as part of the symbolic empowerment of Alice (and females).  \n\n105 Rule Forty-two: a favourite number of Dodgson’s. There are 42 illustrations in $A A W$ and $_{L G}$ was originally planned to have 42, rather than 50; 42 is the age of the narrator in Phantasmagoria (1869)––the narrator finds a ghost in his house:  \n\n‘No doubt,’ said I, ‘they settled who Was fittest to be sent: Yet still to choose a brat like you, To haunt a man of forty-two Was no great compliment!’  \n\nIn $_{L G}$ (198) the White King sends 4207 horses (7 is a factor of 42) (MG, 120), Alice’s age in Looking-Glass is 7 years and 6 months $(7\\times6=42)$ , it would take 42 minutes to fall through the earth (see note to p. 11)––and many other connections have been noted.  \n\nIn The Hunting of the Snark, the preface mentions Rule 42 of the Naval Code: ‘No one shall speak to the Man at the Helm.’ In Fit the First (stanza 7), the Beaver  \n\n. . . had forty-two boxes, all carefully packed, With his name painted clearly on each: But since he omitted to mention the fact, They were all left behind on the beach.  \n\nDouglas Adams, in his Hitch Hiker’s Guide to the Galaxy series, chose 42 as the answer to the secret of the universe, claiming it to be purely arbitrary.  \n\n106 They told me you had been to her: a version of a poem Dodgson published in Comic Times, 8 September 1855. Although that poem was titled ‘She’s All My Fancy Painted $\\operatorname{Him}^{\\gamma}$ , after the first line of William Mee’s sentimental and tragic ‘Alice Gray’ (music by Mrs P. Millard), it is not a parody of that poem, and no source has been traced. The coincidence of the name ‘Alice’ has not been overlooked.  \n\n110 such a curious dream!: casting the story as a dream indicates the limits of the freedom and power that Alice has been given and is widely thought by critics to undercut the effect of the book. It is a common device in children’s literature: for example, Mrs Molesworth’s The Cuckoo Clock $\\left(\\phantom{\\,}\\!\\!\\!\\Pi^{8}77\\right)$ or John Masefield’s The Box of Delights (1935).  \n\nand this was her dream: the sentimentalizing of Alice, and the adult rationalization of her dream, has produced a lot of critical speculation as to Dodgson’s relationship to fantasy. In $A A U,$ , the sister’s dream is far more personal:  \n\nShe saw an ancient city, and a quiet river winding near it along the plain, and up the stream went slowly gliding a boat with a merry party of children on board––she could hear their voices and laughter like music over the water––and among them was another little Alice, who sat listening with bright eager eyes to a tale that was being told, and she listened for the words of the tale, and lo! it was the dream of her own little sister. So the boat wound slowly along, beneath the bright summer-day, with its merry crew and its music of voices and laughter, till it passed round one of the many turnings of the stream, and she saw it no more. (pp. 89–90)  \n\n# THROUGH THE LOOKING-GLASS  \n\n112 [Frontispiece]: the picture of the White Knight and Alice has a slight resemblance to Sir John Everett Millais’s painting, $_{\\textit{A}}$ Dream of the Past: Sir Isumbras at the Ford $\\mathrm{i}\\,857$ : Lady Lever Art Gallery, Port Sunlight).  \n\n113 [Title: Through the Looking-Glass and What Alice Found There]: the title was apparently suggested by Dodgson’s friend Henry Parry Liddon. On 12 January 1869, Dodgson noted in his Diary: ‘Finished and sent off to Macmillan the first chapter of Behind the LookingGlass, and what Alice Saw There’; at proof stage it was Looking-Glass House and what Alice saw there. The device was apparently suggested to Dodgson through a meeting with a cousin, Alice Raikes, probably while he was staying at his Uncle Skeffington’s house in August 1868. John Ringo has written a science fiction series beginning with Into the Looking-Glass (Riverdale, NY: Baen, 2005): other volumes include Vorpal Blade (2007) and Manxome Foe (2008).  \n\n114 [The Chess Board]: on 30 August $\\phantom{}_{\\mathrm{1}}8\\gamma8.$ , Dodgson complained to Macmillan that in a copy of the 42nd thousand of Through the Looking-Glass, the Kings had been omitted. The reply (10 September 1878) suggested",
    "chunk_order_index": 17,
    "full_doc_id": "doc-9049e42081712810c363fff6ac1324b1"
  },
  "chunk-55fcfb5920f7632c67368b324569f666": {
    "tokens": 1200,
    "content": "(Riverdale, NY: Baen, 2005): other volumes include Vorpal Blade (2007) and Manxome Foe (2008).  \n\n114 [The Chess Board]: on 30 August $\\phantom{}_{\\mathrm{1}}8\\gamma8.$ , Dodgson complained to Macmillan that in a copy of the 42nd thousand of Through the Looking-Glass, the Kings had been omitted. The reply (10 September 1878) suggested that this may have happened when the preliminary matter  was  transferred  to  electrotype  in  the  22nd  thousand (Morton N. Cohen and Anita Gandolfo, Lewis Carroll and the House of Macmillan (Cambridge: Cambridge University Press, 1987)). (Scholarly opinions differ on this.)  \n\n115 dramatis personæ: MG (p. 136) notes that the Bishops (who are not mentioned in the book, probably because of Dodgson’s religious scruples) are identified with Sheep, Aged Man, Walrus and Crow, ‘though for no discernable reason’.  \n\n116 pleasance: Dodgson altered this from ‘pleasures’ in the proofs.  \n\n117 not worth buying: on 21 November 1893, Dodgson wrote to Macmillan: ‘Having promised to give a copy of Through the Looking-Glass to a lady-friend, and having no copies on hand, I wrote to you for 6. They arrived this morning . . . Of the 50 pictures, 26 are over-printed, 8 of them being so much as to be quite spoiled . . . On no consideration whatsoever must any more of this impression [the 60th thousand] be sold [60 had been] . . . the 940 copies must be at once destroyed, and the book must be “out of print” for the present . . . Evidently there has been gross carelessness’ (Cohen and Gandolfo, Lewis Carroll and the House of Macmillan, 292–3). The ‘Preface to the Sixty-First Thousand’ points out that ‘fresh electrotypes have been taken from the wood-blocks’.  \n\n118 the chess-problem: opinion varies as to whether the game is correct, eccentric, or impossible, technically. In literary terms, its oddity may be explained by Alice’s limited perspective as pawn (she only speaks to pieces that are in squares adjacent to hers), or to the eccentric rules of the looking-glass world. Moves are noted on the following pages. In her old age, Alice Liddell Hargreaves recalled that ‘Much of Through the Looking-Glass is made up of [Dodgson’s stories] particularly the ones to do with chessmen, which are dated by the period when we were excitedly learning chess’ (‘Alice’s Recollections of Carrollian Days, as Told to her Son’, Cornhill Magazine, 73 (July 1932), in Morton N. Cohen (ed.), Lewis Carroll: Interviews and Recollections (London: Palgrave Macmillan, 1989), 84). In May 1910, The British Chess Magazine, 30 (181) published a game by Donald M. Liddell which ‘reproduces the whole story’ in 68 moves.  \n\n123 had nothing to do with it: Kathleen Tillotson (‘Lewis Carroll and the Kitten on the Hearth’, English, $8/45$ (1950), 136–8) argues that Dodgson was recollecting a parody of Dickens’s The Cricket on the Hearth in ‘Advice to an Intending Serialist’ by William Edmondstoune Aytoun, Blackwood’s Magazine, 60 (November $\\phantom{-}\\mathrm{I}\\,845$ ), 590–605 (RLG).  \n\nworsted: ‘a fine and soft yarn spun of long-staple wool combed to lay the fibres parallel’ (SOED).  \n\n125 what to-morrow is: Guy Fawkes’ Day was celebrated with a big bonfire in Peckwater Quadrangle at Christ Church on $5$ November. $A A W$ takes place exactly six months before. Critics have noted the balance between the summery atmosphere of the beginning and end of $A A W$ and the snow of $_{L G}$ . Alice’s account of the boys collecting sticks demonstrates her cloistered life.  \n\nSnowdrop: said to be a cat belonging to Mary, second daughter of George MacDonald (William Raeper, George MacDonald (Tring: Lion, 1987), 172).  \n\n127 the Red Queen: in his article ‘ “Alice” on the Stage’ (1881) Dodgson wrote that he pictured her as a Fury of a different type from the Queen of Hearts: ‘her passion must be cold and calm; she must be formal and strict, yet not unkindly; pedantic to the tenth degree, the concentrated essence of all governesses!’ (LCPB, 171).  \n\n130 the White Queen: Dodgson wrote that the White Queen seemed ‘to my dreaming fancy, gentle, stupid, fat and pale; helpless as an infant; and with a slow, maundering, bewildered air about her just suggesting imbecility, but never quite passing into it; that would be, I think, fatal to any comic effect she might otherwise produce’ (LCPB, 171). He also compares her to a character in Wilkie Collins’s novel No Name (1862): ‘Mrs. Wragg [sic] and the White Queen might have been twin-sisters’––although Mrs Wragge is 6 feet 3 inches tall:  \n\nThe figure terminated at its upper extremity in a large, smooth, white round face like",
    "chunk_order_index": 18,
    "full_doc_id": "doc-9049e42081712810c363fff6ac1324b1"
  },
  "chunk-56192b4e5eeed7940eaef812454e4928": {
    "tokens": 1200,
    "content": "into it; that would be, I think, fatal to any comic effect she might otherwise produce’ (LCPB, 171). He also compares her to a character in Wilkie Collins’s novel No Name (1862): ‘Mrs. Wragg [sic] and the White Queen might have been twin-sisters’––although Mrs Wragge is 6 feet 3 inches tall:  \n\nThe figure terminated at its upper extremity in a large, smooth, white round face like a moon, encircled by a cap and green ribbons, and dimly irradiated by eyes of mild and faded blue, which looked straight-forward into vacancy, and took not the smallest notice . . . ‘Mrs Wragge is not deaf,’ explained the Captain. ‘She’s only a little slow. Constitutionally torpid––if I may use the expression.’  \n\nKimberley Reynolds and Nicola Humble (in Victorian Heroines, 129) parallel Alice’s ministrations to the Queen with Magdalen’s ministrations to Mrs Wragge in No Name: ‘the kindness and sympathy shown by the intelligent, active young woman to the less capable old woman has precisely the same emotional tone in each case’.  \n\n131 My imperial kitten!: who is later ‘too young to play’––this may be an in-joke reference to George MacDonald’s eldest daughter, Lilia (Raeper, George Macdonald, 171).  \n\n134 Jabberwocky: on 24 January 1868, Dodgson enquired of Macmillan about the cost of preparing ‘reverse’ woodblocks, and by 31 January 1869 he had decided that ‘it will be too troublesome for the reader to have 2 pages of “reverse” type to make out, and that we had better limit it to one or 2 stanzas’ (Cohen and Gandolfo, Lewis Carroll and the House of Macmillan, 59, 77).  \n\nThe first four lines appeared in the last of the Rectory MS magazines, Mischmasch in 1855, with ‘learned’ footnotes. According to Collingwood (LLLC, 143) Dodgson ‘composed this poem while staying with his cousins, the Misses Wilcox, at Whitburn, near Sunderland. To while away an evening the whole party sat down to a game of verse-making, and “Jabberwocky” was his contribution’–– although it is not clear whether this visit was in 1855, 1867, or some other date. It may be based on a poem translated by Dodgson’s cousin,  Menella  Bute  Smedley,  ‘The  Shepherd  of  the  Giant Mountains’ (Sharpe’s London Magazine, 7 and 20 March, $\\phantom{0}\\mathrm{I}846\\phantom{.0}$ ,which has the line ‘Come to my heart, my true and gallant son’ and is described in Kipling’s bitter autobiographical story ‘Baa Baa Black Sheep’, in Wee Willie Winkie (1888):  \n\nHe put the brown book in the cupboard where his school-books lived and accidentally tumbled out a venerable volume, without covers, labelled Sharpe’s Magazine. There was the most portentous picture of a Griffin on the first page, with verses below. The Griffin carried off one sheep a day from a German village, till a man came with a ‘falchion’ and split the Griffin open. Goodness only knew what a falchion was, but there was the Griffin and his history was an improvement upon the eternal Cat.  \n\n‘This,’ said Punch, ‘means things, and now I will know all about everything in all the world.’ He read till the light failed, not understanding a tithe of the meaning, but tantalised by glimpses of new worlds hereafter to be revealed.  \n\n‘What is a “falchion”? What is a “e-wee lamb”? What is a “base ussurper”? What is a “verdant mead”?’ he demanded, with flushed cheeks, at bedtime, of the astonished Aunty Rosa.  \n\n‘Say your prayers and go to sleep,’ she replied, and that was all the help Punch then or afterwards found at her hands in the new and delightful exercise of reading.  \n\n‘Jabberwocky’ also became something of an in-joke at Oxford. In February $\\phantom{0}\\mathrm{I}\\!\\left8\\!\\right72$ , Dr Robert Scott, Dean of Rochester (and the collaborator on the Greek Lexicon with Dean Liddell), published an article in Macmillan’s Magazine, ‘The Jabberwock Traced to its True Source’––which was said to be from the German, ‘Der Jammerwoch’: this begins  \n\nEs brillig war. Die schlichte Toven Wirrten und wimmelten in Waben Scott also wrote to Dodgson:  \n\nAre we to suppose, after all, that the Saga of Jabberwocky is one of the universal heirlooms which the Aryan race at its dispersion carried with it from the great cradle of the family? You must really consult Max Müller about this. [Müller was a founder of the discipline of Comparative Religion, and Taylorian Professor of Modern European Languages and Professor of Comparative Philology at Oxford. And honorary member of Christ Church.  \n\nDodgson had photographed him and his family (see MG, 390).] It begins to be probable that the origo originalissima may be discovered in Sanscrit, and that we shall by and by have a Iabrivokaveda. The hero will turn out to be the Sun-god in one of his Avatars; and the TumTum tree the",
    "chunk_order_index": 19,
    "full_doc_id": "doc-9049e42081712810c363fff6ac1324b1"
  },
  "chunk-09ebff6728b93caa8d7ec08490174a6b": {
    "tokens": 1200,
    "content": "Taylorian Professor of Modern European Languages and Professor of Comparative Philology at Oxford. And honorary member of Christ Church.  \n\nDodgson had photographed him and his family (see MG, 390).] It begins to be probable that the origo originalissima may be discovered in Sanscrit, and that we shall by and by have a Iabrivokaveda. The hero will turn out to be the Sun-god in one of his Avatars; and the TumTum tree the great as Ygdradsil of the Scandinavian mythology. (LLLC, 143)  \n\nCollingwood quotes a Latin translation, made by A. A. Vansittart of Trinity College, Cambridge, in $\\phantom{0}\\mathbf{I}\\&\\ \\mathbf{\\sigma}_{72}$ , which begins thus:  \n\nCœsper erat: tunc lubriciles utravia circum Urgebant gyros gimbiculosque tophi and  is  complete  with  a  glossary  of  Latin  portmanteau  words (LLLC, 143).  \n\nDodgson’s uncle, Hassard Dodgson, produced a version ‘Rendered into Latin Elegiacs’ which begins:  \n\nHora aderat briligi. Nuc et Slythæia Tova Plurima gyrabant gymbilitare vabo; (LCPB, 364)  \n\nTranslations have appeared in many other languages, including Esperanto and Klingon, parodies, and several spell-checked versions (‘Twas billing and the slithery toes . . .’).  \n\nJames Reaney (Lewis Carroll’s Alice Through the Looking-Glass Adapted for the Stage (Erin, Ont.: The Porcupine’s Quill, 1994), 127) points out that these lines are reminiscent of genuine Anglo-Saxon poetry. In Beowulf, the monster Grendel ‘came stalking in the dusky night’: ‘cóm on wanre niht’ (l. 702). Not only that, he was satiated: ‘wælfylle’ (l. 125)––and ‘him of éagum stód | ligge gelícost léohht unfaéger’: ‘from his eyes came a horrible light, most like a flame’ (l. 726).  \n\nGiven that Dodgson devotes some time to lampooning textual scholars in the person of Humpty-Dumpty and his interpretation of ‘Jabberwocky’ in Chapter VI (pp. 191–3), it is (perhaps) surprising that so much scholarly ink has been spilt on interpreting genuine nonsense (one gloss on ‘Tumtum’, for example, cites the three meanings given by the Oxford English Dictionary, and concludes that ‘none seems to have any connection’). Words are glossed here only where some explanation is provided by Dodgson. Humpty-Dumpty’s definition of ‘portmanteau word’ (p. 192)––‘two meanings packed into one word’––has entered the language.  \n\nbrillig: spelt ‘bryllyg’ in Mischmasch: the meaning given is ‘(derived from the verb to $B R Y L$ or broil). “the time of broiling dinner, i.e. the close of the afternoon.” ’ Humpty-Dumpty agrees.  \n\nslithy toves: in the preface to The Hunting of the Snark (1876), Dodgson wrote: ‘As this poem is to some extent connected with the lay of the Jabberwock, let me take this opportunity of answering a question that has often been asked me, how to pronounce “slithy toves”. The “i” in “slithy” is long, as in “writhe”; and “toves” is pronounced so as to rhyme with “groves”.’ Mischmasch glosses ‘Slithy’ as ‘(compounded of $S L I M Y$ and lithe.) “Smooth and active” ’, and ‘Tove’ as ‘A species of Badger. They had smooth white hair, long hind legs, and short horns like a stag; lived chiefly on cheese.’ (Humpty-Dumpty adds that they nest under sundials.)  \n\ngyre and gymble: Mischmasch: ‘gyre verb (derived from gyaour or giaour, “a  dog”)  to  scratch  like  a  dog’; ‘gymble  (whence gimblet). To screw out holes in anything.  \n\nwabe: Mischmasch: ‘(derived from the verb to $S\\,W A B$ or soak) “the side of a hill” (from its being soaked by the rain)’.  \n\nmimsy: Mischmasch: ‘(whence mimserable and miserable) “unhappy” ’. Dodgson uses it again in The Hunting of the Snark (7. 9) when a Bandersnatch, with frumious jaws, attacks the Banker:  \n\nDown he sat in his chair––ran his hands through his hair–– And chanted in mimsiest tones   \nWords whose utter inanity proved his insanity, While he rattled a couple of bones.  \n\nborogoves: Mischmasch: ‘An extinct kind of Parrot. The [sic] have no wings, beaks turned up, and made their nests under sun-dials. Lived on veal.’ In the preface to The Hunting of the Snark, Dodgson added: ‘Again, the first “o” in “Borogoves” is pronounced like the $\\mathbf{\\omega}^{\\ast}\\mathbf{o}^{\\ast}$ in “borrow”. I have heard people try to give it the sound of the “o” in “",
    "chunk_order_index": 20,
    "full_doc_id": "doc-9049e42081712810c363fff6ac1324b1"
  },
  "chunk-afcc6de68aaa9067315e4163cd645d58": {
    "tokens": 1200,
    "content": "rot. The [sic] have no wings, beaks turned up, and made their nests under sun-dials. Lived on veal.’ In the preface to The Hunting of the Snark, Dodgson added: ‘Again, the first “o” in “Borogoves” is pronounced like the $\\mathbf{\\omega}^{\\ast}\\mathbf{o}^{\\ast}$ in “borrow”. I have heard people try to give it the sound of the “o” in “worry”. Such is Human Perversity.’ The borogove in Tenniel’s picture is said to have originated in a stuffed bird sent from South America to Dodgson’s friend, the Revd W. D. Parish, vicar of Selmeston, Sussex. The bird disintegrated considerably on the journey but ‘the late Vicar had its head and long legs mounted on a stand. It was shown to Lewis Carroll who became infatuated with it and a picture of this curious looking “make-up” was printed in his book Through the Looking-Glass’ (obituary of W. D. Parish, Sussex Daily News, 24 September 1904) (RLG).  \n\nmome: mischmasch: ‘(hence solemome, solemone and solemn). “Grave” ’.  \n\nraths: Mischmasch: ‘A species of land turtle. Head erect; mouth like a shark; fore legs curved out so that the animal walked on it’s [sic] knees; smooth green body: lived on swallows and oysters.’ Or, says Humpty-Dumpty, a green pig.  \n\noutgrabe: Mischmasch: ‘past tense of the verb to outgribe (it is connected with the old verb to grike or shrike, from which are derived “shriek” and “creak”). “Squeaked.” ’ Dodgson used the word again in The Hunting of the Snark (5. 10):  \n\nThe Beaver had counted with scrupulous care, Attending to every word: But it fairly lost heart, and outgrabe in despair When the third repetition occurred.  \n\nHence, Dodgson wrote: ‘the literal English of the passage is “It was evening and the smooth active badgers were scratching and boring holes in the hill side; all unhappy were the parrots; and the grave turtles squeaked out.” There were probably sundials on top of the hill, and the “borogoves” were afraid that their nests would be undermined. The hill was probably full of the nests of “raths”, which ran out squeaking with fear on hearing the “toves” scratching outside. This is an obscure, but yet deeply affecting, relic of ancient poetry’ $(L C P B,\\,_{37}{-}8)$ .  \n\nJabberwock: Collingwood (LLLC, 274) reports that around $\\phantom{-}\\mathbf{I}884$ Dodgson was asked by ‘the Fourth class of the Girl’s [sic] Latin School at Boston, U. S.’ if they might call their magazine The Jabberwock. He gave them permission, and wrote: ‘He finds that the Anglo-Saxon word “wocer” or “wocor” signifies “offspring” or “fruit.” Taking “jabber” in its ordinary acceptation of “excited and voluble discussion,” that would give the meaning of “the result of much excited discussion”. Whether this phrase will have any application to the projected periodical, it will be for the future historian of American literature to determine.’ Michael Bakewell (Lewis Carroll: $_{\\textit{A}}$ Biography (London: Heinemann, 1996), 285) reports that in one of the issues that the girls sent him there was a limerick: ‘There was an old deacon of Lynn | Who confessed he was given to sin . . .’ ‘Dodgson was not amused . . . and he forbade them to send any more copies.’ Night of the Jabberwock by Fredric Brown (1950) is a comedy thriller narrated by a small-town newspaper man who is a Carroll enthusiast. The book is suffused by Carrollian references, but they are only incidental to the ingenious plot. In contrast, in ‘Mimsy Were the Borogoves’, a science-fiction story by Lewis Padgett (Henry Kuttner and C. L. Moore) first published in Astounding Science-Fiction (1943), ‘Jabberwocky’ is mathematical code that allows travel to other dimensions. It was filmed as The Last Mimzy in 2007 (dir. Robert Shaye). In Graham Masterton’s horror novel, Mirror (London: Sphere, 1988), which uses several elements of Through the LookingGlass, the Jabberwock is the mirror image of Satan. The narrator buys a mirror which is part of Satan’s plan to destroy the world, and this is explained by reference to ‘an unpublished commentary on Unusual Properties of Looking-Glasses’ by Dodgson, in which he claims to have had a near-death experience that showed that in the lookingglass world ‘not just writing, and pictures, but Christian mortality itself had been turned from left to right. Inside the mirror was . . . the ante-room of Hell itself’ (pp. 232–3).  \n\nJubjub: this bird also appears in The Hunting of the Snark as (‘that desperate bird’ (4. 18) ), and in Fit the Fifth:  \n\nThen a scream, shrill and high, rent the shuddering sky, And they knew that some danger was near:   \nThe Beaver turned pale to the tip of its tail, And even the Butcher felt queer. (5.6)",
    "chunk_order_index": 21,
    "full_doc_id": "doc-9049e42081712810c363fff6ac1324b1"
  },
  "chunk-257c5fba8cf3d64256f8a7c14293bbb3": {
    "tokens": 1200,
    "content": "-room of Hell itself’ (pp. 232–3).  \n\nJubjub: this bird also appears in The Hunting of the Snark as (‘that desperate bird’ (4. 18) ), and in Fit the Fifth:  \n\nThen a scream, shrill and high, rent the shuddering sky, And they knew that some danger was near:   \nThe Beaver turned pale to the tip of its tail, And even the Butcher felt queer. (5.6)   \n‘’Tis the voice of the Jubjub!’ he suddenly cried (5.8)   \n‘Its flavour when cooked is more exquisite far Than mutton, or oysters, or eggs:   \n(Some think it keeps best in an Ivory jar, And some, in mahogany kegs:)’  \n\nfrumious: in the preface to The Hunting of the Snark, Dodgson wrote: ‘take the two words “fuming” and “furious”. Make up your mind that you will say both words, but leave it unsettled which you will say first. Now, open your mouth and speak. If your thoughts incline ever so little towards “fuming”, you will say “fumingfurious”; if they turn, by even a hair’s breadth, towards “furious”, you will say “furious-fuming”; but if you have that rarest of gifts, a perfectly balanced mind, you will say “frumious.” ’  \n\nBandersnatch: Mollie Hardwick’s mystery novel, The Bandersnatch (1989), about a kidnapping, uses a good deal of Carrollian reference, although this is not instrumental to the plot. In Ed McBain’s ‘87th Precinct’ novel, The Frumious Bandersnatch (2004), also about a kidnapping, Bandersnatch is a new music album: one of the characters, who has never heard of Lewis Carroll, observes that ‘it sounds somewhat pornographic’. RLG notes that ‘bandar’ means ‘monkey’ in Hindi, and that ‘Bandarsnatch’ would ‘so well describe Kaa or Bagheera’ in Kipling’s The Jungle Book.  \n\nvorpal: Graham Masterton in Mirror (1988), 234 suggests that it has a quasi-biblical origin: that Satan can only be destroyed with a sword engraved with the words ‘Victory Over Ruin, Pestilence, And Lust’.  \n\nuffish: Dodgson wrote to his ‘child friend’ Maud Standen, on 18 December $\\phantom{0}\\mathrm{I}8\\overline{{77}}$ : ‘I did make an explanation once for “uffish thought.” It seems to suggest a state of mind when the voice is gruffish, the manner roughish, and the temper huffish.’ In The Hunting of the Snark (4. 1) ‘The Bellman looked uffish’.  \n\nburbled: in the same letter, Dodgson wrote ‘if you take the three verbs “bleat”, “murmur” and “warble”, and select the bits I have underlined, it certainly makes “burble”: though I am afraid I can’t distinctly remember having made it that way’.  \n\nsnicker-snack: probably from ‘snickersnee’, a large knife or, in The Mikado, Act 2, a cutlass, with which Ko-ko decapitates a criminal (1885), and possibly from Thackeray’s ballad, ‘Little Billee’ (‘There were three sailors in Bristol City, | Who took a boat and went to sea’); when gorging Jack and guzzling Jimmy decide to eat little Billee:  \n\nWhen Bill he heard this information,   \nHe used his pocket-handkerchie.   \n‘First let me say my catechism   \nWhich my poor mother taught to me.’   \n‘Make haste! make haste!’ says guzzling Jimmy, While Jack pulled out his snickersnee.  \n\ngalumphing: now part of the language; Dodgson used it in The Hunting of the Snark (4. 17): ‘The Beaver went simply galumphing about’; it was certainly part of Arthur Ransome’s child characters’ vocabulary. Two examples from Swallowdale (1931): ‘Titty came galumphing down’ (p. 285); ‘a thought . . . that would have made the able-seaman galumph’ (p. 355).  \n\nbeamish: variant of ‘beaming’ (OED: from 1530), and see The Hunting of the Snark, 3. 10: ‘But oh, beamish nephew’. If Kipling’s Stalky and Co (1899) is any indication, ‘burble’ and ‘frabjous’ passed into the argot of the public schools. When Stalky suggests putting a dead cat under the floorboards of a rival dormitory: ‘ “Come to my arms, my beamish boy,” carolled M’Turk, and they fell into each other’s arms dancing. “Oh, frabjous day! Calloo, callay!” ’ (‘An Unsavoury Interlude’). However, this is virtually the only point in the book at which specific Carrollian language is used.  \n\n135 [Illustration]: Tenniel may have been influenced by Paolo Uccello’s St George and the Dragon (c.1470).  \n\n137 the garden of live flowers: the idea of the garden of live flowers may have been taken from, or have been a parody of, Tennyson’s ‘Maud’ (1855):  \n\nThere has fallen a splendid tear From the passion-flower at the gate. She is coming, my dove, my dear; She",
    "chunk_order_index": 22,
    "full_doc_id": "doc-9049e42081712810c363fff6ac1324b1"
  },
  "chunk-1893b5937ec87e15eec396aa293995c3": {
    "tokens": 1200,
    "content": "is used.  \n\n135 [Illustration]: Tenniel may have been influenced by Paolo Uccello’s St George and the Dragon (c.1470).  \n\n137 the garden of live flowers: the idea of the garden of live flowers may have been taken from, or have been a parody of, Tennyson’s ‘Maud’ (1855):  \n\nThere has fallen a splendid tear From the passion-flower at the gate. She is coming, my dove, my dear; She is coming, my life, my fate;  \n\nThe red rose cries, ‘She is near, she is near;’ And the white rose weeps, ‘She is late;’ The larkspur listens, ‘I hear, I hear;’ And the lily whispers, ‘I wait.’  \n\n138 ‘O Tiger-lily!’: Collingwood (LLLC, 150–1) noted: ‘In his original manuscript the bad-tempered flower . . . was the passion-flower; the sacred origin of the name never struck him, until it was pointed out to him by a friend, when he at once changed it into the tiger-lily. Another friend asked him if the final scene was based upon the triumphal conclusion of “Pilgrim’s Progress.” He repudiated the idea, saying that he would consider such trespassing on holy ground as highly irreverent.’  \n\n139 the Rose: probably Alice’s younger sister, Rhoda Caroline Anne Liddell $\\left(\\mathbf{\\mathbb{I}}858\\mathrm{-}\\mathbf{\\mathbb{I}}947\\right)$ .  \n\n140 a Violet: probably Alice’s youngest sister, Violet Constance Liddell (1864–1927).  \n\n141 one of the kind that has nine spikes: in $\\operatorname{I}897$ , Dodgson changed this from the original ‘She’s one of the thorny kind’, which may identify the Red Queen with the governess Miss Prickett, whose nickname was ‘Pricks’, and instead refers to the chess-queen’s crown. along the gravel-walk: a parody of the first two lines of a stanza from ‘Maud’:  \n\nShe is coming, my own, my sweet; Were it ever so airy a tread  \n\n142 face to face with the Red Queen: Alice is on square ${\\mathrm{Q}}_{2}$ .  \n\n143 little hill: biographers have suggested that this chapter is based on a visit $(4^{-}7$ April 1863) by Dodgson to the Liddell children who were on holiday at Charlton Kings, near Cheltenham, during which they walked on Leckhampton Hill, and looked down at the chequered landscape. (This is the only point in the book where Alice, the pawn, can see more than is in her immediate vicinity.)  \n\n[Illustration]: Alice was in the foreground of Tenniel’s original illustration; he removed her at Dodgson’s request (Bakewell, Lewis Carroll: A Biography, 193).  \n\n147 she was gone: Red Queen to $\\mathrm{KR4}$ .  \n\n149 the first of the six little brooks: Alice to $\\mathrm{Q}_{4}$ (this is her first move, which is two squares).  \n\na thousand pounds a minute!: possibly a reference to contemporary advertisements for Beecham’s Pills (a laxative): ‘worth a guinea a box’.  \n\n150 the gentleman sitting opposite to her: a caricature of Benjamin Disraeli––as William Empson (RP, 402) described him: ‘dressed in newspapers––the  new  man  who  gets  on  by  self-advertisement,  the newspaper-fed man who believes in progress’, while the goat is possibly Gladstone. Alice’s hat and muff are very similar to those in John Everett Millais’s (1829–96) painting My First Sermon (1863); the general layout of the picture resembles Augustus Leopold Egg’s (1816–63) The Travelling Companions (1862).  \n\n151 as she’s got a head on her: a reference to the Queen’s head on postage stamps (Victorian slang).  \n\n152 the Goat’s beard: Collingwood $(L L L C,\\ 147{-}9)$ , reproduces a letter from Tenniel to Dodgson (1 June $\\phantom{0}\\mathrm{I}\\!\\left8\\!\\!\\-\\!\\!\\phantom{0}\\!\\!\\!\\!\\rightleftharpoons\\!\\!\\!\\phantom{\\mathrm{I}\\!\\!}\\overline{{0}}$ ): ‘My dear Dodgson. I think that when the jump occurs in the Railway scene you might very well make Alice lay hold of the Goat’s beard as being the object nearest to her hand––instead of the old lady’s hair. The jerk would naturally throw them together.’  \n\nshe found herself sitting quietly under a tree: Alice to ${\\bf Q}_{4}$ .  \n\nthe Gnat: Kincaid (Child-Loving, 297) thinks that the Gnat, like the Dodo in $A A W,$ and the White Knight in $_{L G}$ , represents Dodgson himself. The Gnat’s ‘soft and persistent attempts to woo Alice to come join us and be a child again . . . finally dwindles to conversation about death’. Empson concurs: ‘at first it sounds tiny because it means so little to her’ (RP, 417).  \n\n153 raisin burning in brandy: snapdragon (or flapdragon) was an old game, usually played at Christmas, when players tried to snatch raisins out of a dish of burning brandy, and eat them while still alight. There is a reference to it in Love’s Labour’s Lost (v. i): ‘Costard:",
    "chunk_order_index": 23,
    "full_doc_id": "doc-9049e42081712810c363fff6ac1324b1"
  },
  "chunk-c745977b98810393181ca2a060f151fa": {
    "tokens": 1200,
    "content": "to conversation about death’. Empson concurs: ‘at first it sounds tiny because it means so little to her’ (RP, 417).  \n\n153 raisin burning in brandy: snapdragon (or flapdragon) was an old game, usually played at Christmas, when players tried to snatch raisins out of a dish of burning brandy, and eat them while still alight. There is a reference to it in Love’s Labour’s Lost (v. i): ‘Costard: Oh they have lived long on the alms-basket of words. I marvel thy master hast not eaten thee for a word; for thou art not so long by the head as honorificabilitudinitatibus; thou art easier swallowed than a flapdragon.’ It is defined in Johnson’s Dictionary, and appears in Dickens’s The Pickwick Papers (1836), and Trollope’s Orley Farm (1861).   \n154 Frumenty: medieval dish of cracked or hulled wheat boiled in milk, with sugar, and cinnamon and other spices.   \n156 begins with $L\\langle\\rangle$ either Lily, the pawn whose part Alice has taken, or a quiet in-joke––rather nostalgic, as Dodgson had lost touch with the Liddells as a family friend.   \n1 $5\\,8$ they must be: Dodgson clearly intended ‘they must be | tweedledum and tweedledee’ as a couplet. A full stop was introduced, in error, in the $\\mathbf{1897}$ edition.   \n159 tweedledum and tweedledee: the Opies ${\\big(}{\\mathfrak{p}}.\\ 4{\\mathbf{I}}8{\\big)}$ trace the nursery rhyme to 1805, and attribute the names to John Byrom in a verse about a feud between Bononcini and Handel:  \n\nSome say, compar’d to Bononcini, That Mynheer Handel’s but a Ninny; Others aver, that he to Handel Is scarcely fit to hold a Candle: Strange all this difference should be ’Twixt Tweedle-dum and Tweedle-dee!  \n\n(There are other candidates!)  \n\n160 That’s logic: Dodgson’s first reference to writing about logic appears in his Diary, 6 September 1855, and in February $\\mathbf{\\delta}_{\\mathbf{I}}8\\mathbf{0}6$ he published Symbolic Logic, Part 1: Elementary, ‘a fascinating mental recreation for the young’. See Robin Wilson, Lewis Carroll in Numberland: His Fantastical Mathematical Logical Life (London: Allen Lane, 2008), 171–98.  \n\n161 “Here we go round the mulberry bush”: traditional game rhyme for a ‘ring dance’.  \n\n161 “The Walrus and the Carpenter”: the Walrus was probably suggested by a stuffed walrus in the Sunderland Museum, which Dodgson had known since childhood (RLG). For the other character, Tenniel at first objected to drawing a Carpenter, ‘but finally preferred him to either of the two dactylic replacements that Dodgson had obligingly offered, “Baronet”, or “Butterfly” ’ (Guiliano, 40). The poem follows the metre and style of Thomas Hood’s ‘The Dream of Eugene Aram’ (The Gem, 1829) which begins:  \n\n’Twas in the prime of summer time, An evening calm and cool,   \nAnd four and twenty happy boys Came bounding out of school:   \nThere were some that ran and some that leapt Like troutlets in a pool.  \n\n(RLG)  \n\nHowever, in a letter to his uncle, Hassard Dodgson, on 14 May 1872, Dodgson says ‘I had no particular poem in my mind.’  \n\nMichael Hancher notes (Guiliano, $3^{8-40)}$ that Tenniel was illustrating a satire in Punch called ‘Reversing the Proverb’ (4 June $\\mathbf{I}864.$ )while he was working on $A A W,$ , in which ‘the reform-minded Lord Chancellor, Lord Bethel, discusses the proverb “A shell for him, a shell for thee | The oyster is the lawyer’s fee.”’. The verse ends:  \n\nAgain he smiled, so says the fable, And drew his chair up near the table, When all the Oysters, seen and hid, Cried ‘Eat, and welcome.’ And he did.  \n\n‘Lewis Carroll’ was John Lennon’s favourite author; the song ‘I am the Walrus’ was recorded 5–29 September 1967. ‘Lennon later regretted picking the Walrus after re-reading Carroll’s poem and realising that he was “the bad guy” ’ (Ian MacDonald, Revolution in the Head: The Beatles’ Records and the Sixties (London: Pimlico, 2005), 268).  \n\n162 close at hand: originally ‘hand in hand’. Tenniel suggested the change.   \n165 [Illustration]: Hancher (Guiliano, 34, 36) points out that this picture is ‘a recasting of Tenniel’s cartoon of the English beef admonishing the German sausages under the gaze of the French wine’ (9 January $\\operatorname{I}864.$ ).   \n166 [Illustration]: Hancher (Guiliano, $37^{-0}$ ) notes the close resemblance between the Carpenter and an oyster-eating lawyer in a Tenniel cartoon ‘Law and Lunacy, Or A Glorious Oyster Season for the Lawyers’ (25 January 1862). They’d eaten every one: for Savile Clarke’s stage version of the ‘Alice’ books, Dodgson wrote extra verses with a moral touch:  \n\nThe Carpenter",
    "chunk_order_index": 24,
    "full_doc_id": "doc-9049e42081712810c363fff6ac1324b1"
  },
  "chunk-62a741e9dab3efae6e171434ad8d43f8": {
    "tokens": 1200,
    "content": "I}864.$ ).   \n166 [Illustration]: Hancher (Guiliano, $37^{-0}$ ) notes the close resemblance between the Carpenter and an oyster-eating lawyer in a Tenniel cartoon ‘Law and Lunacy, Or A Glorious Oyster Season for the Lawyers’ (25 January 1862). They’d eaten every one: for Savile Clarke’s stage version of the ‘Alice’ books, Dodgson wrote extra verses with a moral touch:  \n\nThe Carpenter he ceased to sob; The Walrus ceased to weep; They’d finished all the oysters; And they laid them down to sleep–– And of their craft and cruelty The punishment to reap.  \n\nThe punishment consists of one ghost-oyster sitting on the chest of the Carpenter, a second stamping on the Walrus; a third dances a hornpipe.  \n\n169 only a rattle: the illustration contains a visual pun (supplied by Tenniel) of the wrong sort of rattle (a watchman’s rattle rather than a  child’s  rattle).  Dodgson  complained  to  Henry  Savile  Clarke (29 November 1886) that ‘Mr Tenniel has introduced a false “reading” in his picture’.   \n173 wool and water: the Beatles’ ‘Lucy in the Sky with Diamonds’ (from Sgt Pepper’s Lonely Hearts Club Band, 1967) ‘took its atmosphere from [this] hallucinatory chapter . . . The Alice books were canonised by the [1960s] counterculture for their surreal wit and drug-dream undertones’ (MacDonald, Revolution in the Head, 240). Dodgson’s picture is included on the cover of the album. came running wildly through the wood: White Queen to $\\mathrm{QB4}$ .  \n174 never jam to-day: MG (p. 196) points out that this may be a play on the Latin iam/jam––iam meaning ‘now’, but only in the past and future tenses. The present tense is nunc. The phrase has become proverbial.  \n\n178 crossed the little brook: Alice to $\\mathrm{Q}_{5}$ .  \n\n178 wrapped herself up in wool: White Queen to QB5. in a shop: Tenniel’s illustration is of a grocer’s shop, 83 St Aldate’s, Oxford, now ‘Alice’s Shop: the Old Sheep Shop’ (with a clone branch in Craven Terrace, London).   \n179 Things flow  about  . . .  quite  used  to  it:  MG  (p.  201)  quotes  a suggestion that Dodgson may have been inspired by a passage from Blaise Pascal’s Pensées (Jeffrey Stern, ‘Lewis Carroll and Blaise Pascal (1623–62)’, Jabberwocky, 54 (12/2) (spring 1983), $35^{-8}\\mathrm{,}$ ). Equally, the American surrealist artist Edward Gorey may have had this episode in mind in his The Sinking Spell (1964). teetotum: a cube-shaped spinning-top with letters on four sides. SOED: ‘the letters were orig. the initials of Latin words, viz. T totum [all], A aufer [carry off], D depone [deposit], N nihil [nothing]’.   \n180 ‘Feather!’: turning the blades of the oars horizontally while drawing them back for the next stroke. catching a crab: catching the oar in the water unintentionally.   \n181 and such beauties!: Elizabeth Sewell (The Field of Nonsense (London: Chatto and Windus, 1952), 107) felt that one of the dangers that beauty has for nonsense is that ‘the beholder’s detachment and indifference are no longer intact, and the dream side of the mind comes into play’. This is the first instance in the Alice books (the second is Alice’s farewell to the White Knight (p. 222) ) when ‘at once the atmosphere of the work is impaired and the passages threaten to break the fabric of the Nonsense universe . . . In each passage the dream almost wins, but the writer recovers himself just in time to save his world from disruption by the forces admitted by beauty.’   \n183 two are cheaper than one: a reference to the practice at Christ Church that if an undergraduate ‘ordered one boiled egg he was served with two, but one was invariably bad’ (Elma K. Paget, Henry Luke Paget (London: Longmans Green, 1939), 62) (RLG). to the other end of the shop: White Queen to KB8.   \n$\\mathrm{{\\bfI}}84\\$ here’s a little brook!: Alice to Q6.   \n185 humpty dumpty: ‘a short, dumpy, hump-shouldered person; short and fat’ (SOED, 1785). The Opies (pp. 213–16) trace the first manuscript of this riddle to $c.1803$ , and it may derive from a game much earlier than this. Forms of this riddle exist all over Europe. Bryan Talbot suggests (in Alice in Sunderland (London: Cape, 2007), 167) that Dodgson may have been satirizing George Hudson, the ‘railway king . . . who mirrors his prodigious girth, pompous attitude, royal toadying and refusal to acknowledge his inevitable fall into bankruptcy’. J. B. Priestley, on the other hand, sees him as $\\mathbf{\\omega}_{\\mathbf{a}}$ prophetic figure, and Lewis Carroll, in drawing him, was satirizing a race of  \n\ncritics that did not then exist’ (I, For One (London: John Lane The Bodley Head",
    "chunk_order_index": 25,
    "full_doc_id": "doc-9049e42081712810c363fff6ac1324b1"
  },
  "chunk-83d6ac720d12142a42b70917264fd6a0": {
    "tokens": 1200,
    "content": "‘railway king . . . who mirrors his prodigious girth, pompous attitude, royal toadying and refusal to acknowledge his inevitable fall into bankruptcy’. J. B. Priestley, on the other hand, sees him as $\\mathbf{\\omega}_{\\mathbf{a}}$ prophetic figure, and Lewis Carroll, in drawing him, was satirizing a race of  \n\ncritics that did not then exist’ (I, For One (London: John Lane The Bodley Head, 1923), 193).  \n\n189 un-birthday present: in the Disney film, the song ‘A Very Merry UnBirthday’ is sung by the Mad Hatter and the March Hare (Ed Wynn and Jerry Colonna).  \n\n190 ‘When I use a word’: Humpty-Dumpty’s view of language at this point is a rather solipsistic version of the views of modern linguisticians–– words only ‘mean’ what the language community decides, rather than having intrinsic meanings or intrinsic power (as opposed to his view of what Alice’s name means). In an appendix to his Symbolic Logic (1896), ‘Addressed to Teachers’, Dodgson tackled the ‘ “Existential Import” of Propositions’:  \n\nThe logicians ‘speak of the Copula of a Proposition “with bated breath” almost as if it were a living, conscious, Entity, capable of declaring for itself what it chose to mean, and that we, poor human creatures, had nothing to do but to ascertain what was it’s sovereign will and pleasure and submit to it.  \n\nIn opposition to this view, I maintain that any writer of a book is fully authorised in attaching any meaning he likes to any word or phrase he intends to use. If I find an author saying, at the beginning of his book, “Let it be understood that by the word ‘black’ I shall always mean ‘white’, and that by the word ‘white’ I shall always mean ‘black’,” I meekly accept his ruling, however injudicious I may think it.  \n\n192 like a portmanteau: ‘portmanteau word’ has entered the language, and portmanteau words were essential to James Joyce’s Finnegans Wake. Examples are: ‘Hear we here her first poseproem of suora unto suora? Alicious, twinstreams, twinewstraines, through alluring glass or alas in jumboland?’ (London: Faber and Faber, 1939, 528). [illustration]: Dodgson objected to the original version of this picture. Tenniel wrote to the engravers, the Dalziel brothers: ‘Will you please clear away the ear of the central animal . . . Mr Dodgson sees a second face, the ears forming the snout’ (Michael Bakewell, Lewis Carroll: A Biography (London: Heinemann, 1996), 193).   \n194 In winter, when the fields are white: MG (p. 216) suggests that the  \n\ninspiration for this poem (it does not seem to be a parody) might be ‘Summer Days’ by Wathen Mark Wilks Call, a freethinker (1817–90), which begins:  \n\nIn summer, when the days were long, We walked, two friends, in field and wood  \n\n196 one of his fingers to shake: it was the custom of the aristocracy to offer only two fingers for a ‘handshake’ with the ‘lower orders’; HumptyDumpty takes this to an extreme.  \n\n199 [illustration]: Tenniel’s battle scene mimics many such in contemporary popular history books, and bears some resemblance to panels in St Fridewide’s window in Christ Church, by Edward Burne-Jones.  \n\n200 Anglo-Saxon attitudes: a pun on attitudes physical and social, said to be based on an exaggerated style of English drawing (ninth–eleventh centuries). Its immediate inspiration may have been theatricals in Christ Church noted in Dodgson’s Diary (5 December 1863), at which the Liddells were present and ‘a particular point was made of Anglo-Saxon costumes, settings, etc’ (RLG). The expression is now idiomatic, and was the title of a novel by Angus Wilson (1956). Batey (p. 27) suggests that Tenniel’s illustration was based on the Caedmon Genesis (c. ad 1000) in the Bodleian Library, displayed in $\\mathbf{1}86_{3}$ .  \n\nHaigha: apart from the pun, Dodgson may have been alluding to an expert on the Saxons, Revd Daniel Henry Haigh, who contributed to Memorials of King Alfred (1863), and founded the church of SS Thomas and Edmund of Canterbury, in Birmingham $\\left(\\mathrm{{\\bfI}}\\,848\\right)$ .  \n\n‘I love my love with an $H^{\\ast}$ : a popular Victorian extempore word-game.  \n\n201 sal-volatile: smelling salts: a mixture of ammonium carbonate in alcohol and ammonium in water, with aromatics such as lemon oil and lavender oil.  \n\nNobody walks slower than you: some commentators detect an echo of Ulysses’ stratagem when he and his men were captured by Polyphemus, the Cyclops (Odyssey, 9): Ulysses tells him that his name is Noman, and when he is asleep, they put out his eye with a stake: the other Cyclops respond to his cries: ‘ “Surely no man is carrying off your sheep? Surely no man is trying to kill you either by fraud or by force?” But Polyphemus shouted to them from inside the cave: “No man is killing me by fraud. No man is killing me by",
    "chunk_order_index": 26,
    "full_doc_id": "doc-9049e42081712810c363fff6ac1324b1"
  },
  "chunk-411bcc25dda3b88a9ed2520aef2dc1be": {
    "tokens": 1200,
    "content": "Cyclops (Odyssey, 9): Ulysses tells him that his name is Noman, and when he is asleep, they put out his eye with a stake: the other Cyclops respond to his cries: ‘ “Surely no man is carrying off your sheep? Surely no man is trying to kill you either by fraud or by force?” But Polyphemus shouted to them from inside the cave: “No man is killing me by fraud. No man is killing me by force.” “Then” said they, “if no man is attacking you, you must be ill . . .” ’ (Samuel Butler’s translation, 1900).  \n\n202 fighting for the crown: Alice quotes the first two verses of an old nursery rhyme first recorded 1709. An alternative second verse appeared in a chapbook c.1806 (Opies, 269):  \n\nAnd when he had beat him out, He beat him in again; He beat him three times over, His power to maintain.  \n\nThe verses are thought to refer to the Union of England and Scotland under King James I and VI, and possibly to hostilities after the Hanoverian succession (1714). On the Royal Coat of Arms of the United Kingdom, the shield is supported by two creatures, the Lion representing England on the left, and the Unicorn (chained) Scotland on the right. On the Royal Coat of Arms of Scotland, the positions are reversed. The Unicorn was adopted in the fourteenth century by Robert III as part of the Royal Seal. Dodgson noted in his Diary that the Liddell children were collecting crests and sticking them in books (1 August 1862).  \n\n203 only give them oyster-shells: another reference to what remains after the lawyers have taken their fee (see note to p. 161).  \n\n204 about eighty-seven times: the choice of number may well be arbitrary, but  it  happens  to  be  the  number  of  a  particularly  apposite Shakespearean sonnet, which begins  \n\nFarewell, thou art too dear for my possessing  \n\nand ends  \n\nThus have I had thee, as a dream doth flatter, In sleep a king, but waking no such matter.  \n\nHow fast those Queens can run!: a reference to Queens in chess, who can move in any direction for any number of (unimpeded) squares. White Queen to QB8.  \n\n205 twice as natural!: Dodgson substituted ‘twice’ for the ‘quite’ of the traditional saying, and this has become common usage (MG, 228).  \n\n206 [illustration]: critics have taken the Lion and the Unicorn to represent Gladstone and Disraeli; Michael Hancher regards them as representing England and Scotland (Guiliano, $45^{-7}.$ ).  \n\nanimal––or vegetable––or mineral?: a second reference to the Victorian parlour game.  \n\n207 across the little brook: Alice to $\\mathrm{_{Q}}_{7}$ .  \n\n209 came galloping down upon her: Red Knight to K2. Goldthwaite (p. 122) sees the Red Knight as Charles Kingsley ‘met as an equal on the jousting-ground of comedy’.  \n\nWhite Knight: commonly identified as a self-portrait of Dodgson, other candidates include Don Quixote and Tenniel. Judith Bloomingdale (‘Alice as Anima: the image of Woman in Carroll’s Classic’) goes further: ‘As absurd hero of his age, the White Knight sums up the history of western civilisation: he is at once Christ, St George, the Knight of the Grail, Lancelot, Don Quixote, and finally modern man . . . [Alice] sees in her Knight’s “gentle foolish face” . . . the face of the Lord of Life’ (RP, 449). In 1892, Dodgson wrote on a game he had made for a child-friend: ‘Olive Butler, from the White Knight, Nov. 21, $\\mathbf{I}\\,892^{\\circ}$ .  \n\n211 mounted and galloped off: White Knight takes Red Knight.  \n\n211 a glorious victory: Janis Lull points out (Guiliano, 102) that we should recall Humpty Dumpty’s definition of ‘glory’ as a ‘nice knock-down argument’.  \n\nThat’s the end of my move: the beginning of a complex piece of selfportraiture. Elizabeth Sewell (Field of Nonsense, 149) points out that this scene breaks another rule about nonsense––that there should be no relationships. ‘When the Nonsense writer is detached and in control of his material, our play goes along beautifully; but the minute he loses his detachment we also become implicated, and the atmosphere changes at once, generating emotion or a sense of the reality and earnestness of what is going on instead of that state of security, freedom and purely mental delight which is proper to the game. We are acted upon instead of acting.’ The White Knight stands out because ‘not one individual is kind to the child the whole way through both stories, with the possible exception of the White Knight, who at least is not unkind’ (ibid. 113).  \n\n216 sugar-loaf: in the late nineteenth century sugar was usually sold in solid cones called sugar-loaves.  \n\n218 The name of the song is called: commentators have made this sequence of establishing linguistic precision rather more difficult than it is. It can be reduced to:  \n\nThe name is called . . .   \nThe name really is . . .   \nThe song is called . . .   \nThe song really is . . .  \n\nSurprisingly for Dodgson, there is, however, a logical mistake here or, as Roger W. Holmes (‘The Philosopher’s Alice in Wonderland’, Antioch Review (Summer",
    "chunk_order_index": 27,
    "full_doc_id": "doc-9049e42081712810c363fff6ac1324b1"
  },
  "chunk-2a7a33134ad5d213e9a6499b2d65953a": {
    "tokens": 1200,
    "content": "The name of the song is called: commentators have made this sequence of establishing linguistic precision rather more difficult than it is. It can be reduced to:  \n\nThe name is called . . .   \nThe name really is . . .   \nThe song is called . . .   \nThe song really is . . .  \n\nSurprisingly for Dodgson, there is, however, a logical mistake here or, as Roger W. Holmes (‘The Philosopher’s Alice in Wonderland’, Antioch Review (Summer 1959) ) has it, ‘Carroll was definitely pulling our leg’ (RP, 206). The Knight says, ‘ “The song really is . . .” ’ and then gives another name for it. The song really is what he sings (see also Robert D. Sutherland, Language and Lewis Carroll (The Hague: Mouton, 1970), 118–20).  \n\n219 mild blue eyes: Isa Bowman, in The Story of Lewis Carroll: Told for Young People by the Real Alice in Wonderland Miss Isa Bowman (London: Dent, 1899; reprinted as Lewis Carroll as I Knew Him (New York: Dover, 1972) ), wrote: ‘When I knew him his hair was silvery-grey, rather longer than it was the fashion to wear, and his eyes were a deep blue’ (Cohen (ed.), Lewis Carroll: Interviews and Recollections, 90).  \n\n“I give thee all, I can no more”: Alice refers to Thomas Moore’s (1779– 1852) ‘My Heart and Lute’, music by Sir Henry Rowley Bishop $\\left(\\scriptstyle{\\mathrm{1786-I855}}\\right)$ (who was Professor of Music at Oxford $\\left(\\mathrm{{\\bfI}}\\,848\\right)$ and also wrote ‘There’s No Place Like Home’).  \n\nI give thee all––I can no more–– Though poor the off’ring be; My heart and lute are all the store That I can bring to thee . . .  \n\n219 I’ll tell thee everything I can: this poem (rather unkindly) parodies the garrulous narrators in Wordsworth’s poems concerned with country people. The prime target is ‘Resolution and Independence’ (Poems in Two Volumes, 1807), in which the narrator asks the old leech gatherer what he does twice, while musing on life:  \n\n‘What kind of work is that which you pursue? This is a lonesome place for one like you.’ He answered me with pleasure and surprise, And there was, while he spake, a fire about his eyes . . .  \n\n(95–8)  \n\nThe old man still stood talking by my side, But now his voice to me was like a stream Scarce heard . . .  \n\nAnd now, not knowing what the old man had said, My question eagerly did I renew, ‘How is it that you live, and what is it you do?’  \n\nHe with a smile did then his words repeat .  \n\n(124–7)  \n\nThe verse form, however, is the same as another bucolic poem, ‘The Thorn’ (Lyrical Ballads, 1798), which has been much ridiculed for lines such as  \n\nAnd to the left, three yards beyond, You see a little muddy pond Of water, never dry. I’ve measured it from side to side; ’Tis three feet long and two feet wide.  \n\nIt also contains the lines ‘I’ll tell you everything I know’ (105), ‘I’ll give you the best help I can’ (111), ‘I’ll tell you all I know’ (114), ‘No more I know––I wish I did|And I would tell it all to you’ (155–6), ‘There’s no-one knows, as I have said’ (162), ‘I cannot tell, but some will say’ (214).  \n\nDodgson’s original version began:  \n\nI met an aged, aged man Upon the lonely moor:   \nI knew I was a gentleman, And he was but a boor.   \nSo I stopped and roughly questioned him, ‘Come, tell me how you live!’   \nBut his words impressed my ear no more Than if it were a sieve.  \n\nDodgson also used this version as part of a playful verse-writing contest with Lionel, Tennyson’s second son, Easter 1862 (LLLC, 92).  \n\n220 Rowland’s Macassar-Oil: the most famous brand of hair oil in the nineteenth century, made from oil supposedly imported from what is now Indonesia. Lord Byron (who used it) wrote, in his sardonic (alleged) description of his wife in Don Juan (1819),  \n\nIn virtues nothing earthly could surpass her, Save thine ‘incomparable oil’, Macassar! (ii. xvii. 135–6)  \n\nFrom this oil is derived ‘antimacassar’, a piece of fabric draped over the back of a seat to keep heads from marking it.  \n\n221 limed twigs: birdlime, a sticky substance made from holly or other plants, was used to catch small birds. Hansom-cabs: a two-wheel cab, patented by Joseph A. Hansom in   \n1836. Menai bridge: either the bridge built by Thomas Telford between the North Wales mainland and Anglesey, which opened in $\\phantom{-}\\mathbf{I}826$ (Dodgson had crossed it on a family holiday to Beaumaris when he was about 10 years old), or Robert Stephenson’s tubular railway bridge, the ‘Britannia’ bridge, completed in $\\boldsymbol{\\mathrm{~I850~}}$ .  \n222 then you’ll be a Queen: when pawns",
    "chunk_order_index": 28,
    "full_doc_id": "doc-9049e42081712810c363fff6ac1324b1"
  },
  "chunk-613e5cb4a8a112218a5174ee72b132e5": {
    "tokens": 1200,
    "content": "the bridge built by Thomas Telford between the North Wales mainland and Anglesey, which opened in $\\phantom{-}\\mathbf{I}826$ (Dodgson had crossed it on a family holiday to Beaumaris when he was about 10 years old), or Robert Stephenson’s tubular railway bridge, the ‘Britannia’ bridge, completed in $\\boldsymbol{\\mathrm{~I850~}}$ .  \n222 then you’ll be a Queen: when pawns in a game of chess reach the final rank on the board, they become queens.   \nreached the turn: White Knight to $\\mathrm{KB5}$ .  \n\n223 edge of the brook: at which point, in the galley-proofs there was an extra episode, ‘The Wasp in a Wig’ (reprinted in the Appendix to this edition). In June 1974 the proof sheets appeared in a catalogue issued by the London auctioneers Sotheby’s, with the note that they had been ‘bought at the sale of the author’s furniture, personal effects, and library, Oxford, $\\mathbf{\\deltaI}898^{\\circ}$ . A limited edition was published in 1977 by the Lewis Carroll Society of North America, edited by Martin Gardner. Dodgson’s acquiescence to the cut may also have been because he realized that the ‘Wasp’ episode repeats the idea of Alice leaving an old man, which he had explored in the previous scene, with the  White  Knight––and  also  sours  the  idyllic  and  nostalgic atmosphere that he had created (and see Robert Dupree, ‘The White Knight’s Whiskers and the Wasp’s Wig in Through the Looking-Glass’, in Guiliano, 112–22).  \n\nas she bounded across: Alice reaches Q8.  \n\n224 one on each side: Red Queen to K1.  \n\n226 [illustration]: note the frame under the crinoline skirts: Michael Hancher (Guiliano, 33) notes that ‘Punch waged a relentless war against the vanity and vulgarity of crinoline, then the current fashion’.  \n\n227 ‘Can you answer useful questions?’: this episode is a parody of the ‘instructive’  question-and-answer  sessions  often  introduced  into nineteenth-century children’s novels. Alicia Catherine Mant’s The Cottage in the Chalk Pit (1822) is typical:  \n\n‘What can it be?’ Exclaimed all the children at once.   \n‘Crystals, of some sort,’ replied Mrs Gardiner; ‘but I cannot define it nearer . . .’   \n‘What did you mean by geological just now, mamma’ said Edward, who had been thinking it over, ever since his mother had made use of the word some little time before.   \n‘It is an adjective from Geology,’ replied Mrs Gardiner; ‘and Geology means that science which “embraces the study of the earth in general . . .” ’  \n\n228 fiddle-de-dee: since $\\mathbf{I}784$ synonymous with ‘Nonsense!’ (RLG).  \n\n230 putting her hair in papers: curl-papers, round which the hair was wrapped overnight to produce ‘corkscrew curls’ (RLG). Hush-a-by lady: parody of what the Opies (p. 61) call ‘the best-known lullaby both in England and America’. It is first recorded in Mother Goose’s Melody $(c.1765)$ and the tune is a variant of ‘Lillibulero’ (or ‘Lilliburlero’).   \n231 suddenly vanished: the Queens ‘castle’.   \n232 [Illustration]: Batey suggests (p. 9) that this is the door of Christ Church Chapter House. The original illustration showed Alice in a crinoline, rather resembling a chess piece; Dodgson objected. Tenniel also used this Romanesque arch in drawings for Punch (Guiliano, 43).   \n233 To the Looking-Glass world . . .: parody of Sir Walter Scott’s song ‘Bonnie Dundee’, from his play The Doom of Devorgoil (1830), ii. ii. The first stanza and chorus:  \n\nTo the Lords of Convention ’twas Claver’se [Claverhouse] who spoke, ‘Ere the King’s crown shall fall there are crowns to be broke; So let each Cavalier who loves honour and me,  \n\nCome follow the bonnet of Bonny Dundee.  \n\nCome fill up my cup, come fill up my can. Come saddle your horses and call up your men; Come open the West Port, and let me gang free, And it’s room for the bonnets of Bonny Dundee!’  \n\n233 thirty-times-three: Bryan Talbot suggests (Alice in Sunderland, 166) that Dodgson, who often visited Sunderland, may be recalling a verse on a Sunderland souvenir bowl $(c.1835)$ depicting Thomas Paine’s iron bridge (1796) over the River Wear:  \n\nThen fill up the bumper, Britannia appears . . .   \nKing William we hail with three times three cheers.  \n\n234 walked up the large hall: Alice castles.  \n\nMutton——Alice: one of Dodgson’s distant relatives was Sir Richard Houghton, at whose table ‘King James I is supposed to have solemnly “knighted” the loin of beef’. Derek Hudson (Lewis Carroll: An Illustrated Biography, 34) suggests that this legendary incident may have inspired Alice’s introduction to the leg of mutton.  \n\n236 and then guess: the answer to the riddle is ‘an oyster’.  \n\nextinguishers: candle extinguishers, cups made of metal or porcelain, often  conical.  The  Royal  Worcester  company  started  making extinguishers in the",
    "chunk_order_index": 29,
    "full_doc_id": "doc-9049e42081712810c363fff6ac1324b1"
  },
  "chunk-8904c58890eb3be63f00c6f36bd5a224": {
    "tokens": 444,
    "content": "solemnly “knighted” the loin of beef’. Derek Hudson (Lewis Carroll: An Illustrated Biography, 34) suggests that this legendary incident may have inspired Alice’s introduction to the leg of mutton.  \n\n236 and then guess: the answer to the riddle is ‘an oyster’.  \n\nextinguishers: candle extinguishers, cups made of metal or porcelain, often  conical.  The  Royal  Worcester  company  started  making extinguishers in the 1850s.  \n\n237 from the soup-tureen: White Queen to QR6.  \n\n239 shake  you  into  a  kitten:  MG  (p.  266)  suggests  that  ‘this  is Alice’s capture of the Red Queen. It results in a legitimate checkmate of the Red King, who has slept throughout the entire chess problem without moving.  \n\n240 with all her might: Alice takes Red Queen and wins.  \n\n245 a boat, beneath a sunny sky: an acrostic poem, the first letters of each line spelling Alice Pleasance Liddell. It has echoes of Wordsworth’s ‘Lines written near Richmond, upon the Thames, at Evening (Lyrical Ballads, 1798):  \n\nHow rich the wave in front, impressed With evening twilight’s summer hues, While, facing this the crimson west, The boat her silent path pursues!  \n\nLife, what is it but a dream?: many critics have noted an echo of the English nursery rhyme. However, the most commonly quoted version of the lyrics (‘Row, row, row your boat | Gently down the stream. | Merrily, merrily, merrily, merrily | Life is but a dream) are attributed to Eliphalet Oram Lyte $\\left(\\mathbf{1}842{-}\\mathbf{I}9\\mathbf{I}3\\right)$ who set them to music (The Franklin Square Song Collection, New York, 1881). The epigraph to chapter XXV of MacDonald’s Phantastes is from Novalis: ‘Our life is no dream, but it ought to become one, and perhaps will.’",
    "chunk_order_index": 30,
    "full_doc_id": "doc-9049e42081712810c363fff6ac1324b1"
  }
}