{
    "image_1": [
    ],
    "image_2": [
        {
            "merged_entity_name": "TEXT KERNELS",
            "entity_type": "OBJECT",
            "description": "Components of the system that process text information from the instruction, which are 1x1 kernels generated from the instruction representation, used in the convolution process to create text-conditioned feature maps.",
            "source_image_entities": [
                "TEXT KERNELS"
            ],
            "source_text_entities": [
                "TEXT KERNEL"
            ]
        },
        {
            "merged_entity_name": "SOFTMAX",
            "entity_type": "OBJECT",
            "description": "A function used in the system to convert scores into probabilities, which is applied to the feature map to generate the probability distribution over the goal location, including a learned scalar bias term for events where the goal is out of sight.",
            "source_image_entities": [
                "SOFTMAX"
            ],
            "source_text_entities": [
                "SOFTMAX"
            ]
        },
        {
            "merged_entity_name": "GOAL LOCATION L_G",
            "entity_type": "GEO",
            "description": "The specific location within the image identified as the goal based on the instruction, which is the predicted destination in the environment, inferred from the max probability in the probability distribution generated by LINGUNET.",
            "source_image_entities": [
                "GOAL LOCATION L_G"
            ],
            "source_text_entities": [
                "GOAL LOCATION"
            ]
        },
        {
            "merged_entity_name": "GOAL MASKS M1, M2, M3",
            "entity_type": "OBJECT",
            "description": "Masks highlighting areas of the image that are relevant to the goal, which are computed based on the predicted goal location and used as input to an RNN for action generation.",
            "source_image_entities": [
                "GOAL MASKS M1, M2, M3"
            ],
            "source_text_entities": [
                "GOAL MASK"
            ]
        }
    ],
    "image_3": [
        {
            "merged_entity_name": "LANI",
            "entity_type": "ORGANIZATION",
            "description": "LANI is a dataset designed to evaluate an agent's ability to follow navigation instructions in an environment with landmarks. It consists of 6,000 paragraphs, with 4.7 mean instructions per paragraph, 24.6 mean actions per instruction, 12.1 mean tokens per instruction, and a vocabulary size of 2,292. The agent's task is to follow a sequence of instructions specifying a path in an environment with multiple landmarks. The environment is a fenced, square, grass field with randomly placed landmarks, and the agent can take four types of discrete actions: FORWARD, TURNRIGHT, TURNLEFT, and STOP. Agent performance is evaluated using task completion accuracy and stop distance error.",
            "source_image_entities": [
                "LANI"
            ],
            "source_text_entities": [
                "LANI"
            ]
        },
        {
            "merged_entity_name": "CHAI",
            "entity_type": "ORGANIZATION",
            "description": "CHAI is a dataset that combines both navigation and simple manipulation in a complex, simulated household environment. It consists of 1,596 paragraphs, with 7.7 mean instructions per paragraph, 54.5 mean actions per instruction, 8.4 mean tokens per instruction, and a vocabulary size of 1,018. The CHAI corpus uses the CHALET simulator, a 3D house simulator that provides multiple houses, each with multiple rooms, supporting moving between rooms, picking and placing objects, and opening and closing cabinets and similar containers. Objects can be moved between rooms, and the environment supports a variety of actions for navigation and manipulation tasks.",
            "source_image_entities": [
                "CHAI"
            ],
            "source_text_entities": [
                "CHAI"
            ]
        }
    ],
    "image_4": [
    ],
    "image_5": [
    ],
    "image_6": [
        {
            "merged_entity_name": "LANI",
            "entity_type": "ORGANIZATION",
            "description": "LANI is an event or task designed to evaluate an agent's ability to follow navigation instructions in an environment with landmarks. It contains a dataset with 123 spatial relations between locations, 36 conjunctions of two or more locations, 65 temporal coordinations of sub-goals, 94 constraints on the shape of trajectory, 32 co-references, and 2 comparatives.",
            "source_image_entities": [
                "LANI"
            ],
            "source_text_entities": [
                "\"LANI\""
            ]
        },
        {
            "merged_entity_name": "CHAI",
            "entity_type": "ORGANIZATION",
            "description": "CHAI is an organization that combines navigation and manipulation tasks in a simulated household environment, using the CHALET simulator. It contains a dataset with 52 spatial relations between locations, 5 conjunctions of two or more locations, 68 temporal coordinations of sub-goals, 0 constraints on the shape of trajectory, 18 co-references, and 0 comparatives.",
            "source_image_entities": [
                "CHAI"
            ],
            "source_text_entities": [
                "\"CHAI\"",
                "\"CHAI\""
            ]
        }
    ],
    "image_7": [],
    "image_8": [
        {
            "entity_name": "LANI",
            "entity_type": "GEO",
            "description": "LANI is an event or task designed to evaluate an agent's ability to follow navigation instructions in an environment with landmarks. It is also an organization involved in evaluating the performance of approaches in task completion and stop distance accuracy.",
            "source_image_entities": ["LANI"],
            "source_text_entities": ["LANI", "LANI"]
          },
          {
            "entity_name": "CHAI",
            "entity_type": "GEO",
            "description": "CHAI is an organization that combines navigation and manipulation tasks in a simulated household environment, using the CHALET simulator. It also represents a different environment or task in the table and is involved in evaluating the performance of approaches in stop distance and manipulation accuracy.",
            "source_image_entities": ["CHAI"],
            "source_text_entities": ["CHAI", "CHAI", "CHAI"]
          },
          {
            "entity_name": "STOP",
            "entity_type": "METHOD",
            "description": "STOP is a method listed in the table with performance metrics on both LANI and CHAI datasets. It is also a baseline event used for comparison in performance metrics such as stop distance.",
            "source_image_entities": ["STOP"],
            "source_text_entities": ["STOP"]
          },
          {
            "entity_name": "RANDOMWALK",
            "entity_type": "METHOD",
            "description": "RANDOMWALK is a method listed in the table with performance metrics on both LANI and CHAI datasets. It is also a baseline event used for comparison in performance metrics.",
            "source_image_entities": ["RANDOMWALK"],
            "source_text_entities": ["RANDOMWALK"]
          },
          {
            "entity_name": "MOSTFREQUENT",
            "entity_type": "METHOD",
            "description": "MOSTFREQUENT is a method listed in the table with performance metrics on both LANI and CHAI datasets. It is also a baseline event used for comparison in performance metrics.",
            "source_image_entities": ["MOSTFREQUENT"],
            "source_text_entities": ["MOSTFREQUENT"]
          },
          {
            "entity_name": "MISRA17",
            "entity_type": "METHOD",
            "description": "MISRA17 is a method from 2017 listed in the table with performance metrics on both LANI and CHAI datasets. It is also an approach that is compared with others in terms of task completion accuracy on LANI.",
            "source_image_entities": ["MISRA17"],
            "source_text_entities": ["MISRA17"]
          },
          {
            "entity_name": "CHAPLOT18",
            "entity_type": "METHOD",
            "description": "CHAPLOT18 is a method from 2018 listed in the table with performance metrics on both LANI and CHAI datasets. It is also an approach that is compared with others in terms of task completion accuracy on LANI.",
            "source_image_entities": ["CHAPLOT18"],
            "source_text_entities": ["CHAPLOT18"]
          }
    ],
    "image_9": [
        {
            "merged_entity_name": "LANI",
            "entity_type": "GEO",
            "description": "LANI is a dataset used for evaluating performance, with metrics SD (Success Distance) and TC (Task Completion). LANI is also an organization involved in evaluating the performance of approaches in task completion and stop distance accuracy.",
            "source_image_entities": [
                "LANI"
            ],
            "source_text_entities": [
                "LANI"
            ]
        },
        {
            "merged_entity_name": "CHAI",
            "entity_type": "GEO",
            "description": "CHAI is a dataset used for evaluating performance, with metrics SD (Success Distance) and MA (Metric Accuracy). CHAI is an organization that has developed a corpus combining navigation and simple manipulation in a simulated household environment, and is involved in evaluating the performance of approaches in stop distance and manipulation accuracy.",
            "source_image_entities": [
                "CHAI"
            ],
            "source_text_entities": [
                "CHAI"
            ]
        }
    ],
    "image_10": [
    ],
    "image_11": [
    ],
    "image_12": [
    ]
}