{
    "image_1": [
        {
            "entity_name": "IMAGE_1",
            "entity_type": "ORI_IMG",
            "description": "The image is a map of the United States, specifically focusing on the Midwest region. The map highlights Illinois in yellow and marks abortion providers with orange squares. The text indicates that Illinois expects an influx of patients as neighboring states restrict the procedure after the reversal of Roe v. Wade. The map shows that abortion bans are in effect in Arkansas, Kentucky, Missouri, and Wisconsin, while Ohio and Tennessee ban the procedure after six weeks. Lawmakers in Iowa, Indiana, and Michigan may also seek bans. The inset map provides data on abortion patients who traveled to Illinois in 2020 from surrounding states: Wisconsin (531), Michigan (56), Ohio (less than 50), Indiana (1,878), Kentucky (142), Tennessee (108), Missouri (6,578), Arkansas (74), and Iowa (71). The main map uses different shades of gray to represent other states, with darker shades indicating states where clinics could close. The overall atmosphere conveyed by the image is one of concern and urgency regarding access to abortion services."
        },
        {
            "entity_name": "ILLINOIS",
            "entity_type": "GEO",
            "description": "A state in the United States, highlighted in yellow on the map. It is expected to see an influx of patients seeking abortion services due to neighboring states restricting the procedure after the reversal of Roe v. Wade."
        },
        {
            "entity_name": "WISCONSIN",
            "entity_type": "GEO",
            "description": "A state in the United States, marked with a grey square indicating that abortion providers could close."
        },
        {
            "entity_name": "MICHIGAN",
            "entity_type": "GEO",
            "description": "A state in the United States, marked with a grey square indicating that abortion providers could close."
        },
        {
            "entity_name": "INDIANA",
            "entity_type": "GEO",
            "description": "A state in the United States, marked with a grey square indicating that abortion providers could close."
        },
        {
            "entity_name": "OHIO",
            "entity_type": "GEO",
            "description": "A state in the United States, marked with a grey square indicating that abortion providers could close."
        },
        {
            "entity_name": "KENTUCKY",
            "entity_type": "GEO",
            "description": "A state in the United States, marked with a grey square indicating that abortion providers could close."
        },
        {
            "entity_name": "MISSOURI",
            "entity_type": "GEO",
            "description": "A state in the United States, marked with a grey square indicating that abortion providers could close."
        },
        {
            "entity_name": "ARKANSAS",
            "entity_type": "GEO",
            "description": "A state in the United States, marked with a grey square indicating that abortion providers could close."
        },
        {
            "entity_name": "TENNESSEE",
            "entity_type": "GEO",
            "description": "A state in the United States, marked with a grey square indicating that abortion providers could close."
        },
        {
            "entity_name": "IOWA",
            "entity_type": "GEO",
            "description": "A state in the United States, marked with a grey square indicating that abortion providers could close."
        }
    ],
    "image_2": [
        {
            "entity_name": "IMAGE_2_PERSON-0.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'person'. The entity features are as follows:Person Features:- Gender: Male- Hairstyle: Short, light brown hair, neatly combed- Facial Expression: Smiling, appears friendly and approachable- Age: Appears to be a middle-aged man- Clothing: Wearing a dark suit with a white dress shirt and a blue tie; the suit jacket has a notched lapel- Posture: Standing upright with one hand in his pocket, giving off a confident and relaxed demeanorOverall, the individual presents a professional and polished appearance."
        },
        {
            "entity_name": "IMAGE_2_PERSON-2.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'person'. The entity features are as follows:Person Features:- Gender: Male- Skin Color: Fair- Hairstyle: Short, white hair with a side parting- Facial Expression: Smiling, appears friendly and approachable- Age: Appears to be an older adult- Clothing: Wearing a dark blue suit with a white dress shirt and a blue tie; the suit jacket has a pocket square- Posture: Standing with one hand in his pocket and the other slightly raised, giving a relaxed yet formal appearanceOverall, the individual exudes a sense of professionalism and warmth."
        },
        {
            "entity_name": "IMAGE_2_PERSON-4.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'person'. The entity features are as follows:Person Features:- Gender: Male- Hairstyle: Short, dark hair with a side parting- Facial Expression: Neutral, possibly mid-speech or in motion- Age: Appears to be middle-aged- Clothing: Wearing a dark suit with a white dress shirt and a patterned tie; the suit jacket is being held in one hand, suggesting he might be in the process of putting it on or taking it off- Posture: Standing sideways, with one arm bent and the other holding the jacket, giving an impression of movement or transitionOverall, the individual appears to be dressed formally, possibly for a professional or formal event."
        },
        {
            "entity_name": "IMAGE_2_PERSON-5.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'person'. The entity features are as follows:Person Features:- Gender: Male- Skin Color: Light- Hairstyle: Short, dark hair with a receding hairline- Facial Expression: Neutral, with a slight frown and lips pressed together- Age: Appears to be middle-aged or older- Clothing: Wearing a dark blue suit with a white dress shirt and a patterned tie; the suit jacket has a notched lapel- Posture: Standing upright, hands by his sides, giving an impression of formality and seriousnessOverall, the individual appears to be dressed in formal business attire, suggesting a professional or official context."
        },
        {
            "entity_name": "IMAGE_2",
            "entity_type": "ORI_IMG",
            "description": "The image shows three men standing closely together, all dressed in formal attire. The man on the left is wearing a dark suit with a light blue tie and glasses. He has short, gray hair and is smiling broadly. The man in the middle is also in a dark suit with a blue tie and has white hair. He appears to be speaking or laughing, with his mouth open and one hand gesturing towards his chest. The man on the right is wearing a dark suit with a red tie and has short, dark hair. He is looking at the man in the middle with a slight smile. The background is a solid blue color, which suggests that this might be an official event or conference. The overall atmosphere conveyed by the image is one of camaraderie and positive interaction among the individuals."
        },
        {
            "entity_name": "JENS STOLTENBERG",
            "entity_type": "PERSON",
            "description": "Former Prime Minister of Norway, current Secretary General of NATO. He is smiling and standing on the left side of the image."
        },
        {
            "entity_name": "JOE BIDEN",
            "entity_type": "PERSON",
            "description": "President of the United States. He is in the middle, laughing and appears to be engaged in a conversation with Jens Stoltenberg and Pedro Sánchez."
        },
        {
            "entity_name": "PEDRO SÁNCHEZ",
            "entity_type": "PERSON",
            "description": "Prime Minister of Spain. He is standing on the right side of the image, smiling and looking at Joe Biden."
        }
    ],
    "image_3": [
        {
            "entity_name": "IMAGE_3_BOAT-1.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'object'. The entity features are as follows:Object Features:- Name: Aerospace component- Color: Predominantly metallic silver with red and white accents- Shape: Complex, elongated structure with multiple sections and components- Size: Appears to be a large-scale component, likely several meters in length- Material: Metal, possibly aluminum or steel, with some plastic or composite parts- Possible function: This appears to be a section of an aircraft or spacecraft, possibly a fuselage segment. It includes structural elements, wiring, and possibly engine or propulsion components. The red and white parts could be insulation or protective coverings for sensitive equipment.Overall, this object is a sophisticated aerospace component, designed for high-performance applications in aviation or space exploration."
        },
        {
            "entity_name": "IMAGE_3_BOAT-0.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'object'. The entity features are as follows:Object Features:- Name: House- Color: Predominantly blue with white accents- Shape: Rectangular with a pitched roof and multiple levels- Size: Appears to be a multi-story building, possibly two or three stories high- Material: Likely constructed from wood or a similar material, given the visible texture and style- Possible function: Residential, potentially used as a home or a small apartment complex- Other significant characteristics: The house features multiple balconies with decorative railings, windows with shutters, and a covered porch area. The design suggests a tropical or coastal architectural style, possibly Caribbean or Mediterranean."
        },
        {
            "entity_name": "IMAGE_3_BOAT-2.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'object'. The entity features are as follows:Object Features:- Name: Building- Color: Primarily white with a beige roof- Shape: Rectangular, multi-story structure- Size: Appears to be a mid-sized building, possibly three or four stories high- Material: Likely constructed from concrete and metal, typical of urban buildings- Possible function: Residential or commercial use, given the balconies and windows which suggest living spaces or offices- Other significant characteristics: The building has multiple balconies, some with railings, and several windows. There is an air conditioning unit visible on one of the balconies, indicating modern amenities. The structure appears to be part of a larger complex, as there are other buildings adjacent to it."
        },
        {
            "entity_name": "IMAGE_3_BOAT-3.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'object'. The entity features are as follows:Object Features:- Name: Building- Color: Predominantly white with some blue and yellow accents- Shape: Rectangular, multi-storied structure with a flat roof- Size: Appears to be a large building, possibly several stories high- Material: Likely made of concrete or stone, with windows and balconies- Possible Function: Residential or commercial use, given the presence of multiple floors and windowsOverall, the building appears to be a typical urban structure, possibly used for living or business purposes."
        },
        {
            "entity_name": "IMAGE_3",
            "entity_type": "ORI_IMG",
            "description": "The image depicts a serene scene along the Nile River in Egypt. The river is calm and reflective, with several houseboats docked along its banks. The houseboats are painted in various colors, with one prominently featuring blue and white hues. On the right side of the image, there is a modern high-rise building, while on the left, there are lush green trees and palm trees. In the background, the skyline of a city can be seen, with a minaret visible in the distance. A small boat with passengers is seen moving along the river, adding a sense of activity to the otherwise tranquil setting. The overall atmosphere conveyed by the image is one of peacefulness and tranquility, with the natural beauty of the river and the urban landscape coexisting harmoniously."
        },
        {
            "entity_name": "NILE RIVER",
            "entity_type": "GEO",
            "description": "A wide river flowing through the city, with boats and houseboats along its banks."
        },
        {
            "entity_name": "HOUSEBOATS",
            "entity_type": "OBJECT",
            "description": "Blue and white houseboats docked along the riverbank, featuring balconies and windows."
        },
        {
            "entity_name": "BOAT",
            "entity_type": "OBJECT",
            "description": "A boat with a canopy and passengers on board, moving along the river."
        },
        {
            "entity_name": "CITYSCAPE",
            "entity_type": "GEO",
            "description": "Urban landscape with modern buildings, including high-rise structures and a mosque in the distance."
        },
        {
            "entity_name": "PALM TREES",
            "entity_type": "GEO",
            "description": "Tall palm trees lining the riverbank, adding greenery to the urban environment."
        }
    ],
    "image_4": [
        {
            "entity_name": "IMAGE_4_VASE-2.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'object'. The entity features are as follows:Object Features:- Name: Jar- Color: The jar itself is transparent, allowing the contents to be visible. The contents appear to be a pale yellow-green.- Shape: The jar is cylindrical with a wider base and a narrower top, typical of many jars designed for preserving or storing food items.- Size: The jar appears to be of medium size, suitable for home use in preserving or storing food.- Material: The jar is made of glass, which is common for food storage due to its non-reactive properties and ability to be sealed tightly.- Possible Function: This jar is likely used for preserving or storing food items, such as pickles, jams, or other preserves. The pale yellow-green color of the contents suggests it might contain pickled vegetables or a similar preserved food item.Overall, the jar appears to be a standard household item used for food preservation, with a clear design that allows the contents to be easily seen."
        },
        {
            "entity_name": "IMAGE_4_VASE-3.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'object'. The entity features are as follows:Object Features:- Name: Packet of snacks- Color: The packaging is primarily yellow with red accents.- Shape: Rectangular, typical of snack packets.- Size: Appears to be a standard size for a single-serving snack packet.- Material: Made of paper or plastic, commonly used for food packaging.- Possible function: Contains snacks, likely intended for consumption as a quick, portable food item.Overall, the packet appears designed for convenience and easy access, suitable for on-the-go snacking."
        },
        {
            "entity_name": "IMAGE_4_VASE-1.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'object'. The entity features are as follows:Object Features:- Name: Packet of tea bags- Color: The packaging is primarily yellow with green accents, featuring images of lemon slices and tea leaves.- Shape: Rectangular packet- Size: Standard size for a packet of tea bags, suitable for retail sale.- Material: The packet appears to be made of cardboard with a plastic inner lining for the tea bags.- Possible function: Contains tea bags for brewing tea, specifically a variety that includes lemon flavoring, as suggested by the imagery on the packaging.Overall, the object is a commercial product designed for consumer use in making tea."
        },
        {
            "entity_name": "IMAGE_4_VASE-0.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'object'. The entity features are as follows:Object Features:- Name: Bottle- Color: The bottle is primarily transparent, with a yellow liquid inside.- Shape: The bottle has a cylindrical shape with a narrow neck and a wider base. It tapers slightly towards the top.- Size: The bottle appears to be of a standard size for a beverage container, likely around 200-500 ml.- Material: The bottle is made of glass, which is evident from its transparency and reflective surface.- Possible function: Given the shape and the liquid inside, it is likely used for storing and serving beverages, possibly a type of oil or vinegar.- Other significant characteristics: The bottle has a label on it, which is partially visible and seems to have text and possibly a logo, indicating it might be a commercial product. The liquid inside is bright yellow, suggesting it could be olive oil or another type of cooking oil."
        },
        {
            "entity_name": "IMAGE_4",
            "entity_type": "ORI_IMG",
            "description": "The image shows four glass bottles arranged in a row on a wooden tray. Each bottle is filled with a different liquid, ranging from light to dark shades of amber and red. The bottles are transparent, allowing the viewer to see the liquids inside clearly. The first bottle from the left contains a bright red liquid, the second has a golden-yellow liquid, the third holds a darker amber liquid, and the fourth is filled with a clear liquid. The background is blurred but appears to be an outdoor setting with greenery and sunlight filtering through, creating a warm and inviting atmosphere. The overall scene suggests a display of different types of beverages or oils, possibly for tasting or showcasing."
        },
        {
            "entity_name": "BOTTLES",
            "entity_type": "OBJECT",
            "description": "Four glass bottles of varying liquid colors placed on a wooden tray. The liquids are red, amber, yellow, and clear."
        },
        {
            "entity_name": "WOODEN TRAY",
            "entity_type": "OBJECT",
            "description": "A rectangular wooden tray holding the four glass bottles."
        },
        {
            "entity_name": "BACKGROUND",
            "entity_type": "GEO",
            "description": "A blurred background with greenery and sunlight, suggesting an outdoor setting."
        }
    ]
}