{
    "image_1": [
        {
            "merged_entity_name": "Al-Shifa Hospital",
            "entity_type": "ORGANIZATION",
            "description": "Al-Shifa Hospital is a medical facility in Gaza where people, including a young girl, an injured man, and a woman wearing a headscarf, are waiting for treatment amidst a crisis. The hospital is overwhelmed with wounded patients and running out of vital supplies.",
            "source_image_entities": [
                "MEDICAL FACILITY"
            ],
            "source_text_entities": [
                "AL-SHIFA HOSPITAL"
            ]
        },
        {
            "merged_entity_name": "Gaza",
            "entity_type": "GEO",
            "description": "Gaza is a geographic location and the origin of the rocket attacks and gunmen. It is also where the Al-Shifa Hospital is located, and the area is facing a dire humanitarian crisis with more than 300,000 people homeless and two million residents facing critical shortages of food, water, and fuel.",
            "source_image_entities": [],
            "source_text_entities": [
                "GAZA"
            ]
        },
        {
            "merged_entity_name": "Hamas",
            "entity_type": "ORGANIZATION",
            "description": "Hamas is an armed Palestinian group controlling the Gaza territory and responsible for the attack on Israel, which has led to a significant crisis in the region, including the situation at the Al-Shifa Hospital.",
            "source_image_entities": [],
            "source_text_entities": [
                "HAMAS"
            ]
        },
        {
            "merged_entity_name": "Medical Staff at Al-Shifa Hospital",
            "entity_type": "ORGANIZATION",
            "description": "The medical staff at Al-Shifa Hospital, wearing white coats and gloves, are attending to patients in the background amidst the crisis, including a young girl, an injured man, and a woman wearing a headscarf.",
            "source_image_entities": [
                "MEDICAL STAFF"
            ],
            "source_text_entities": [
                "AL-SHIFA HOSPITAL"
            ]
        }
    ],
    "image_2": [
        {
            "merged_entity_name": "Israel Ziv",
            "entity_type": "PERSON",
            "description": "Israel Ziv, a retired Israeli Army general, was seen wearing a military uniform with a star insignia on his shoulder, as he responded to the attack by Hamas, grabbing his weapon and heading to the conflict zone.",
            "source_image_entities": [
                "MAN"
            ],
            "source_text_entities": [
                "ISRAEL ZIV"
            ]
        },
        {
            "merged_entity_name": "Military Personnel",
            "entity_type": "ORGANIZATION",
            "description": "Group of individuals in the background wearing yellow vests and helmets, indicating they are part of a military or rescue operation, likely related to the Israel Defense Forces.",
            "source_image_entities": [
                "MILITARY PERSONNEL"
            ],
            "source_text_entities": [
                "ISRAEL DEFENSE FORCES"
            ]
        },
        {
            "merged_entity_name": "Gaza",
            "entity_type": "GEO",
            "description": "Gaza is a geographic location and the origin of the rocket attacks and gunmen mentioned in the text, as well as the location of Al-Shifa Hospital and the crisis affecting its residents.",
            "source_image_entities": [
                "TREES"
            ],
            "source_text_entities": [
                "GAZA",
                "AL-SHIFA HOSPITAL"
            ]
        },
        {
            "merged_entity_name": "Hamas",
            "entity_type": "ORGANIZATION",
            "description": "Hamas is an armed Palestinian group controlling the Gaza territory, responsible for the attack on Israel, with gunmen pouring across the border and launching a barrage of rockets.",
            "source_image_entities": [],
            "source_text_entities": [
                "HAMAS"
            ]
        }
    ],
    "image_3": [
        {
            "merged_entity_name": "ISRAEL DEFENSE FORCES SOLDIERS",
            "entity_type": "ORGANIZATION",
            "description": "Soldiers of the Israel Defense Forces, including SOLDIER 1 and SOLDIER 2, are in military uniform, holding rifles, and standing near a HUMVEE in the background.",
            "source_image_entities": [
                "SOLDIER 1",
                "SOLDIER 2",
                "HUMVEE",
                "BACKGROUND SOLDIERS"
            ],
            "source_text_entities": [
                "ISRAEL DEFENSE FORCES"
            ]
        },
        {
            "merged_entity_name": "GAZA CRISIS",
            "entity_type": "EVENT",
            "description": "The crisis in Gaza involves a power plant shutdown, lack of resources, and overwhelmed hospitals, with the United Nations describing the situation as 'absolutely horrible'. It is also the origin of attacks on Israel and the location where Hamas is in control.",
            "source_image_entities": [],
            "source_text_entities": [
                "GAZA",
                "HAMAS",
                "GAZA’S ONLY POWER PLANT",
                "300,000 HOMELESS IN BATTERED GAZA AS FOOD RUNS LOW",
                "2 MILLION RESIDENTS"
            ]
        },
        {
            "merged_entity_name": "HAMAS ATTACK ON ISRAEL",
            "entity_type": "EVENT",
            "description": "Hamas conducted an attack near the Israeli border, resulting in the death of more than 1,200 Israeli civilians, injury of over 6,600 others, and the kidnapping of about 150 hostages.",
            "source_image_entities": [],
            "source_text_entities": [
                "HAMAS",
                "1,200 ISRAELI CIVILIANS",
                "6,600 OTHERS",
                "150 HOSTAGES"
            ]
        },
        {
            "merged_entity_name": "ISRAELI MILITARY RESPONSE",
            "entity_type": "EVENT",
            "description": "In response to the Hamas attack, Israel is preparing for military operations, with the call-up of 360,000 reservists and the United States stepping up its weapons shipments to Israel.",
            "source_image_entities": [],
            "source_text_entities": [
                "ISRAEL",
                "360,000 RESERVISTS",
                "UNITED STATES"
            ]
        }
    ],
    "image_4": [
        {
            "merged_entity_name": "MOVING TRUCK",
            "entity_type": "ORGANIZATION",
            "description": "A large moving truck with its back door open, containing various items including a couch and boxes, where several people are engaged in different activities.",
            "source_image_entities": [
                "MOVING TRUCK"
            ],
            "source_text_entities": []
        },
        {
            "merged_entity_name": "MAN ON COUCH",
            "entity_type": "PERSON",
            "description": "A person sitting on a brown couch inside the moving truck, wearing glasses and a light blue t-shirt, one of several individuals present in the moving truck.",
            "source_image_entities": [
                "MAN ON COUCH"
            ],
            "source_text_entities": []
        },
        {
            "merged_entity_name": "WOMAN",
            "entity_type": "PERSON",
            "description": "A person wearing a grey t-shirt and purple leggings, holding a box, standing in the back of a moving truck, one of several individuals present in the moving truck.",
            "source_image_entities": [
                "WOMAN"
            ],
            "source_text_entities": []
        },
        {
            "merged_entity_name": "MAN STANDING",
            "entity_type": "PERSON",
            "description": "A person standing next to the woman, wearing a black t-shirt with colorful shorts, looking at the man on the couch, one of several individuals present in the moving truck.",
            "source_image_entities": [
                "MAN STANDING"
            ],
            "source_text_entities": []
        }
    ],
    "image_5": [
        {
            "entity_name": "FTX Chief's Fraud Trial",
            "entity_type": "Event",
            "description": "The FTX Chief's Fraud Trial is an event revealing the dissolving of Mr. Bankman-Fried's inner circle as friends turn against him, with personal dynamics playing a vital role in the case.",
            "source_image_entities": [
                "BORDER WALL"
            ],
            "source_text_entities": [
                "FTX CHIEF’S FRAUD TRIAL"
            ]
        },
        {
            "entity_name": "FTX",
            "entity_type": "Organization",
            "description": "FTX is the cryptocurrency exchange founded by Sam Bankman-Fried, which collapsed and is now the subject of a fraud trial, with its headquarters located in the Bahamas.",
            "source_image_entities": [],
            "source_text_entities": [
                "FTX",
                "FTX"
            ]
        },
        {
            "entity_name": "Sam Bankman-Fried",
            "entity_type": "Person",
            "description": "Sam Bankman-Fried is the Chief of FTX and is involved in a fraud trial, with his inner circle dissolving as allies turn against him.",
            "source_image_entities": [],
            "source_text_entities": [
                "MR. BANKMAN-FRIED"
            ]
        },
        {
            "entity_name": "Bahamas",
            "entity_type": "Geo",
            "description": "The Bahamas is the location of FTX's headquarters, where Sam Bankman-Fried lived and worked with his inner circle.",
            "source_image_entities": [
                "FIELD"
            ],
            "source_text_entities": [
                "BAHAMAS",
                "BAHAMAS"
            ]
        }
    ],
    "image_6": [
        {
            "merged_entity_name": "FTX Chief’s Fraud Trial",
            "entity_type": "Event",
            "description": "The FTX Chief’s Fraud Trial is an event that reveals the dissolving of Mr. Bankman-Fried's inner circle as friends turn against him, involving personal dynamics between Mr. Bankman-Fried and his former allies.",
            "source_image_entities": [
                "WOMAN",
                "SUNGLASSES",
                "EARRINGS",
                "SMILE"
            ],
            "source_text_entities": [
                "FTX CHIEF’S FRAUD TRIAL",
                "MR. BANKMAN-FRIED",
                "ADAM YEDIDIA",
                "BAHAMAS"
            ]
        }
    ]
}