{
    "chunk-98d95707f40b79a368caec49392e1376": [
        {
            "entity_name": "Israel Ziv",
            "entity_type": "PERSON",
            "description": "A retired Israeli Army general who responded to the attack by Hamas, grabbing his weapon and heading to the conflict zone. He is also known for driving headlong into the battle zone armed only with a pistol, organizing a confused group of soldiers into a fighting unit, and overseeing evacuations.",
            "source_entities": [
                "ISRAEL ZIV"
            ]
        },
        {
            "entity_name": "Gaza",
            "entity_type": "GEO",
            "description": "A geographic location and the origin of the rocket attacks and gunmen from Hamas. It is also where more than 300,000 Palestinians are homeless due to the conflict, and two million residents are facing critical shortages of food, water, and fuel.",
            "source_entities": [
                "GAZA"
            ]
        },
        {
            "entity_name": "Hamas",
            "entity_type": "ORGANIZATION",
            "description": "An armed Palestinian group controlling the Gaza territory and responsible for the attack on Israel. It is compared to the Islamic State by Prime Minister Benjamin Netanyahu and is targeted for dismantlement by the Israeli government to ensure it can never threaten Israel again.",
            "source_entities": [
                "HAMAS",
                "ISLAMIC ORGANIZATION"
            ]
        },
        {
            "entity_name": "Israel",
            "entity_type": "GEO",
            "description": "The geographic location experiencing attacks from Gaza and preparing for military operations. It is also the nation's military forces mentioned in the context of the conflict with Hamas.",
            "source_entities": [
                "ISRAEL"
            ]
        },
        {
            "entity_name": "Benjamin Netanyahu",
            "entity_type": "PERSON",
            "description": "The Prime Minister of Israel, making statements about the government's stance against Hamas and comparing it to the Islamic State. He is also standing with the U.S. secretary of state, Antony J. Blinken, during his statement.",
            "source_entities": [
                "BENJAMIN NETANYAHU"
            ]
        },
        {
            "entity_name": "Al-Shifa Hospital",
            "entity_type": "ORGANIZATION",
            "description": "A medical facility in Gaza where people are waiting for treatment amidst a crisis, including those affected by the conflict and the humanitarian crisis.",
            "source_entities": [
                "AL-SHIFA HOSPITAL"
            ]
        },
        {
            "entity_name": "Unity Government",
            "entity_type": "ORGANIZATION",
            "description": "The governing body in Israel that must approve military plans against Hamas, with no disagreement on the need to dismantle Hamas to ensure it can never threaten Israel again.",
            "source_entities": [
                "UNITY GOVERNMENT"
            ]
        },
        {
            "entity_name": "Humanitarian Crisis in Gaza",
            "entity_type": "EVENT",
            "description": "An event describing the crisis in Gaza where more than 300,000 people are homeless, and two million residents are facing critical shortages of food, water, and fuel due to the conflict with Israel.",
            "source_entities": [
                "300,000 HOMELESS IN BATTERED GAZA AS FOOD RUNS LOW",
                "2 MILLION RESIDENTS"
            ]
        },
        {
            "entity_name": "Gaza’s Only Power Plant",
            "entity_type": "ORGANIZATION",
            "description": "An infrastructure in Gaza that stopped generating electricity due to lack of fuel, shutting down everything from lights to refrigerators, and contributing to the humanitarian crisis in the region.",
            "source_entities": [
                "GAZA’S ONLY POWER PLANT"
            ]
        }
    ],
    "chunk-79eb66b6cbdaf087e4ad7b3bf672849b": null,
    "chunk-9d37bbb4b3c7376a078f84ed34cca9f6": [
        {
            "entity_name": "FTX Chief’s Fraud Trial",
            "entity_type": "EVENT",
            "description": "The FTX Chief’s Fraud Trial is an event that reveals the dissolving of Mr. Bankman-Fried's inner circle as friends turn against him, involving the organization FTX and its Chief, Mr. Bankman-Fried.",
            "source_entities": [
                "FTX CHIEF’S FRAUD TRIAL",
                "FTX",
                "MR. BANKMAN-FRIED"
            ]
        },
        {
            "entity_name": "McClain’s Death",
            "entity_type": "EVENT",
            "description": "McClain’s Death is the event where Elijah McClain died, leading to a trial and a split ruling, with one officer convicted and another acquitted.",
            "source_entities": [
                "MCCLAIN’S DEATH",
                "ELIJAH MCCLAIN"
            ]
        },
        {
            "entity_name": "Ecuador’s Presidential Election",
            "entity_type": "EVENT",
            "description": "Ecuador’s Presidential Election is the upcoming event where Daniel Noboa is a leading candidate, as a businessman whose family empire includes a global banana brand.",
            "source_entities": [
                "ECUADOR’S PRESIDENTIAL ELECTION",
                "DANIEL NOBOA"
            ]
        },
        {
            "entity_name": "Herstory",
            "entity_type": "EVENT",
            "description": "Herstory is a six-decade survey of Judy Chicago's work, which has opened at the New Museum, showcasing the feminist artist's extensive contributions to art.",
            "source_entities": [
                "HERSTORY",
                "JUDY CHICAGO"
            ]
        },
        {
            "entity_name": "U.S. Open",
            "entity_type": "EVENT",
            "description": "U.S. Open is a tennis event where Gauff recently won, marking a significant achievement in her career and propelling her to ensure she doesn’t become a one-hit wonder.",
            "source_entities": [
                "U.S. OPEN",
                "GAUFF"
            ]
        }
    ]
}