{
    "chunk-13741fb1d335b6a8a60c106410d51dbd": [
        {
            "entity_name": "BRITAIN (LONDON, WALES)",
            "entity_type": "GEO",
            "description": "Britain, including London and Wales, is the geographical area affected by the heatwave described in the text, with various locations and institutions mentioned. It experienced temperatures close to triple digits Fahrenheit, with the hottest mark ever recorded in Wales.",
            "source_entities": [
                "BRITAIN",
                "LONDON",
                "WALES"
            ]
        },
        {
            "entity_name": "EUROPE (FRANCE, CAMBRIDGE)",
            "entity_type": "GEO",
            "description": "Europe is mentioned as the region battling fires and experiencing a heatwave that affects Britain. It includes France, where wildfires are being battled, and Cambridge, noted for holding the record temperature of 101.7 degrees Fahrenheit in July 2019.",
            "source_entities": [
                "EUROPE",
                "FRANCE",
                "CAMBRIDGE"
            ]
        },
        {
            "entity_name": "NAJUMA SMITH-POLLARD (BLACK CHURCH)",
            "entity_type": "PERSON",
            "description": "Najuma Smith-Pollard is a pastor at a Black church in Los Angeles, involved in discussions about abortion rights with Vice President Kamala Harris and other faith leaders.",
            "source_entities": [
                "NAJUMA SMITH-POLLARD",
                "BLACK CHURCH"
            ]
        },
        {
            "entity_name": "SUPREME COURT (ROE V. WADE)",
            "entity_type": "ORGANIZATION",
            "description": "The Supreme Court is mentioned for its role in overturning Roe v. Wade, impacting abortion rights and leading to discussions among faith leaders and politicians.",
            "source_entities": [
                "SUPREME COURT",
                "ROE V. WADE"
            ]
        },
        {
            "entity_name": "BIDEN ADMINISTRATION (UNITED STATES)",
            "entity_type": "ORGANIZATION",
            "description": "The Biden administration, representing the United States, is involved in the global tax agreement and is mentioned in the context of securing votes in Congress. It faced opposition from Senator Joe Manchin III, which effectively scuttled the tax agenda.",
            "source_entities": [
                "BIDEN ADMINISTRATION",
                "UNITED STATES"
            ]
        },
        {
            "entity_name": "PORT LLIGAT (SALVADOR DALÍ, SPANISH SEASCAPE)",
            "entity_type": "GEO",
            "description": "Port Lligat is the Mediterranean town where Moises Tibau is a fisherman and where Salvador Dalí composed some of his paintings, inspiring the term 'Spanish Seascape'. The location may see the construction of a wind farm.",
            "source_entities": [
                "PORT LLIGAT",
                "SALVADOR DALÍ",
                "SPANISH SEASCAPE"
            ]
        },
        {
            "entity_name": "WIND FARM (DALÍ)",
            "entity_type": "EVENT",
            "description": "The Wind Farm event refers to the government's approval of constructing a huge floating wind farm offshore in the Spanish Seascape that inspired Salvador Dalí.",
            "source_entities": [
                "WIND FARM",
                "DALÍ"
            ]
        }
    ],
    "chunk-9fcbc6d539c0abc23da7139c6d352ed0": [
        {
            "entity_name": "Bucha (Kyiv)",
            "entity_type": "GEO",
            "description": "Bucha is a suburb of Kyiv, Ukraine, that has become synonymous with Russian savagery during the war. The Stanislavchuk family, including Yehor, Natasha, Sasha, Tasya, and Lyudmila, experienced the war in Bucha firsthand.",
            "source_entities": [
                "BUCHA",
                "KYIV",
                "YEHOR STANISLAVCHUK",
                "NATASHA STANISLAVCHUK",
                "SASHA STANISLAVCHUK",
                "TASYA STANISLAVCHUK",
                "LYUDMILA STANISLAVCHUK"
            ]
        },
        {
            "entity_name": "Stanislavchuk Family",
            "entity_type": "PERSON",
            "description": "The Stanislavchuk family, comprising of Yehor, Natasha, Sasha, Tasya, and Lyudmila, are residents of Bucha and experienced the war firsthand.",
            "source_entities": [
                "STANISLAVCHUK FAMILY",
                "YEHOR STANISLAVCHUK",
                "NATASHA STANISLAVCHUK",
                "SASHA STANISLAVCHUK",
                "TASYA STANISLAVCHUK",
                "LYUDMILA STANISLAVCHUK"
            ]
        }
    ],
    "chunk-a8f90295aaccaf7f3e20ceeb3b367df0": [
        {
            "entity_name": "Covid-19",
            "entity_type": "EVENT",
            "description": "An ongoing pandemic event causing significant global impact, with new waves and variants affecting public health responses. The current variant is considered the most transmissible of the pandemic, leading to surges in cases across the United States, including in cities like Chicago where the warning level was raised to 'high', and Louisiana where cases are likened to a 'downpour within a surge'.",
            "source_entities": [
                "\"COVID-19\"",
                "\"EXPERTS\""
            ]
        }
    ]
}