{
    "image_1": {
        "image_id": 1,
        "image_path": "./fusion_research/fusion_dataset/paper/D18-1334/images/image_1.jpg",
        "caption": [
            "Table 1: Overview of annotated parallel sentences per language pair "
        ],
        "footnote": [],
        "context": "We conducted a more focused analysis on one of the subcorpora (EN–FR) with respect to the percentage of sentences uttered by males/females for various age groups to obtain a better grasp of what kind of data we are using for training. As can be seen from Figure 1, with the exception of the youngest age group (20–30), which represents only a very small percentage of the total amount of sentences $(0.71\\%)$ , more male data is available in all age groups. Furthermore, when looking at the entire dataset, $67.39\\%$ of the sentences are produced by male speakers. Moreover, almost half  able to retrieve demographic annotations (gender, age, etc.). An overview of the language pairs as well as the amount of annotated parallel sentences per language pair is given in Table 1. 3.1 Analysis of the EN–FR Annotated Dataset We first analysed the distribution of male and female sentence in our data. In the 10 different datasets we experimented with, the percentage of sentences uttered by female speakers is very similar, ranging between $32\\%$ and $33\\%$ . This similarity can be explained by the fact that Europarl is largely a multilingual corpus with a big overlap between the different language pairs. ",
        "chunk_order_index": 1,
        "chunk_id": "chunk-cbcb65bafbe05cd25427e239e5d03d4e",
        "description": "The image is a table labeled 'Table 1: Overview of annotated parallel sentences per language pair'. The table is divided into two main columns: 'Languages' and '# sents'. Each row represents a different language pair, with the first column listing the language pairs (e.g., EN-BG, EN-CS, EN-DA, etc.) and the second column providing the number of sentences for each pair. The language pairs include combinations of English (EN) with various other languages such as Bulgarian (BG), Czech (CS), Danish (DA), German (DE), Greek (EL), Spanish (ES), Estonian (ET), Finnish (FI), French (FR), Hungarian (HU), Italian (IT), Lithuanian (LT), Latvian (LV), Dutch (NL), Polish (PL), Portuguese (PT), Romanian (RO), Slovak (SK), Slovenian (SL), and Swedish (SV). The number of sentences varies significantly across the language pairs, ranging from 306,380 for EN-BG to 1,440,620 for EN-FR. Notable data points include EN-DA with 1,421,197 sentences, EN-DE with 1,296,843 sentences, and EN-ES with 1,419,507 sentences. The table provides a comprehensive overview of the distribution of annotated parallel sentences across different language pairs.",
        "segmentation": false
    },
    "image_2": {
        "image_id": 2,
        "image_path": "./fusion_research/fusion_dataset/paper/D18-1334/images/image_2.jpg",
        "caption": [
            "Figure 1: Percentage of female and male speakers per age group "
        ],
        "footnote": [],
        "context": "We carried out a set of experiments on 10 language pairs (the ones for which we compiled more than $500\\mathrm{k}$ annotated Europarl parallel sentences): EN–DE, EN–FR, EN–ES, EN–EL, EN–PT, EN– FI, EN–IT, EN–SV, EN–NL and EN–DA. We augmented every sentence with a tag on the English source side, identifying the gender of the speaker, as illustrated in (1). This approach for encoding sentence-specific information for NMT 4.1 Datasets 4 Experimental Setup The analysis shows that indeed, there is a gender unbalance in the Europarl dataset, which will be reflected in the translations that MT systems trained on this data produce. the percentage of sentences uttered by males/females for various age groups to obtain a better grasp of what kind of data we are using for training. As can be seen from Figure 1, with the exception of the youngest age group (20–30), which represents only a very small percentage of the total amount of sentences $(0.71\\%)$ , more male data is available in all age groups. Furthermore, when looking at the entire dataset, $67.39\\%$ of the sentences are produced by male speakers. Moreover, almost half of the total number of sentences are uttered by the 50–60 age group $(43.76\\%)$ . ",
        "chunk_order_index": 1,
        "chunk_id": "chunk-cbcb65bafbe05cd25427e239e5d03d4e",
        "description": "The image is a bar chart titled 'Percentage of female and male speakers per age group'. The x-axis represents different age groups, ranging from 20-30 to 80-90. The y-axis represents the percentage, ranging from 0% to 100%. Each age group has two bars representing the percentage of male and female speakers. The colors used are orange for males and blue for females. The exact percentages for each age group are as follows: For the 20-30 age group, the percentage of female speakers is approximately 65%, and for male speakers, it is approximately 35%. For the 30-40 age group, the percentage of female speakers is approximately 40%, and for male speakers, it is approximately 60%. For the 40-50 age group, the percentage of female speakers is approximately 35%, and for male speakers, it is approximately 65%. For the 50-60 age group, the percentage of female speakers is approximately 30%, and for male speakers, it is approximately 70%. For the 60-70 age group, the percentage of female speakers is approximately 25%, and for male speakers, it is approximately 75%. For the 70-80 age group, the percentage of female speakers is approximately 20%, and for male speakers, it is approximately 80%. For the 80-90 age group, the percentage of female speakers is approximately 15%, and for male speakers, it is approximately 85%. The chart clearly shows a trend where the percentage of male speakers increases with age, while the percentage of female speakers decreases.",
        "segmentation": false
    },
    "image_3": {
        "image_id": 3,
        "image_path": "./fusion_research/fusion_dataset/paper/D18-1334/images/image_3.jpg",
        "caption": [],
        "footnote": [],
        "context": "tions.3 There are cases where the gender-informed (TAG) system improves over the baseline (BASE) due to better agreement. Interestingly, in (2) the French female form of vice-president (vicepr´esidente) appears in the translation produced by the BASE system while the male form is Table 3: BLEU-scores on EN–FR comparing the baseline (EN) and the tagged systems (EN–TAG) on 4 different test sets: a test set containing only male data (M), only female data (F), 1st person male data (M1) and first person female data (F1). All the improvements of the EN-TAG system are statistically significant $(\\mathsf{p}<0.5)$ , as indicated by \\*.  even verb forms can be marked by the gender of the speaker. Since, according to the literature, women and men also make use of different syntactic constructions and make different word choices, we also tested the approach on other languages that do not have morphological agreement with the gender of the speaker such as Danish (DA), Dutch (NL), Finnish (FI), German (DE) and Swedish (SV).  First, we wanted to see how our tagged systems performed on the general test set compared to the baseline. In Table 2, the BLEU scores for 10 baseline and 10 gender-enhanced NMT systems are presented. ",
        "chunk_order_index": 2,
        "chunk_id": "chunk-95b2a04ae931a71128605bcf04096dad",
        "description": "The image is a table comparing BLEU scores for machine translation systems from English (EN) to various target languages, both with and without gender tagging. The table has two main columns: 'Systems' and two sub-columns under each system for 'EN' and 'EN-TAG'. The rows represent different target languages: FR (French), ES (Spanish), EL (Greek), IT (Italian), PT (Portuguese), DA (Danish), DE (German), FI (Finnish), SV (Swedish), and NL (Dutch). Each row contains the BLEU scores for the baseline system (EN) and the gender-tagged system (EN-TAG). For example, for French (FR), the EN score is 37.82, and the EN-TAG score is 39.26 with an asterisk indicating statistical significance. Similarly, for Italian (IT), the EN score is 31.46, and the EN-TAG score is 31.75 with an asterisk. The table highlights improvements in BLEU scores for some languages when using gender tagging.",
        "segmentation": false
    },
    "image_4": {
        "image_id": 4,
        "image_path": "./fusion_research/fusion_dataset/paper/D18-1334/images/image_4.jpg",
        "caption": [],
        "footnote": [],
        "context": "tions.3 There are cases where the gender-informed (TAG) system improves over the baseline (BASE) due to better agreement. Interestingly, in (2) the French female form of vice-president (vicepr´esidente) appears in the translation produced by the BASE system while the male form is Table 3: BLEU-scores on EN–FR comparing the baseline (EN) and the tagged systems (EN–TAG) on 4 different test sets: a test set containing only male data (M), only female data (F), 1st person male data (M1) and first person female data (F1). All the improvements of the EN-TAG system are statistically significant $(\\mathsf{p}<0.5)$ , as indicated by \\*. even verb forms can be marked by the gender of the speaker. Since, according to the literature, women and men also make use of different syntactic constructions and make different word choices, we also tested the approach on other languages that do not have morphological agreement with the gender of the speaker such as Danish (DA), Dutch (NL), Finnish (FI), German (DE) and Swedish (SV).  First, we wanted to see how our tagged systems performed on the general test set compared to the baseline. In Table 2, the BLEU scores for 10 baseline and 10 gender-enhanced NMT systems are presented.  ",
        "chunk_order_index": 2,
        "chunk_id": "chunk-95b2a04ae931a71128605bcf04096dad",
        "description": "The image is a table comparing BLEU-scores on EN–FR translations between the baseline (EN) and the tagged systems (EN–TAG) across four different test sets: FR (M), FR (F), FR (M1), and FR (F1). The rows represent the test sets, while the columns show the scores for the EN and EN–TAG systems. The scores are as follows: for FR (M), EN has a score of 37.58 and EN–TAG has a score of 38.71 with an asterisk indicating statistical significance; for FR (F), EN has a score of 37.75 and EN–TAG has a score of 38.97 with an asterisk; for FR (M1), EN has a score of 39.00 and EN–TAG has a score of 39.66 with an asterisk; for FR (F1), EN has a score of 37.32 and EN–TAG has a score of 38.57 with an asterisk. All improvements of the EN–TAG system over the EN system are statistically significant, as indicated by the asterisks.",
        "segmentation": false
    }
}