{
    "chunk-eca7c8b51cdc6605b35d4d74e1abbeca": [
        {
            "entity_name": "Shannon.AI (DEPARTMENT OF COMPUTER SCIENCE AND TECHNOLOGY, ZHEJIANG UNIVERSITY)",
            "entity_type": "ORGANIZATION",
            "description": "Shannon.AI is the organization associated with the authors of the paper on dice loss for data-imbalanced NLP tasks, and it is also affiliated with the Department of Computer Science and Technology at Zhejiang University.",
            "source_entities": [
                "SHANNON.AI",
                "DEPARTMENT OF COMPUTER SCIENCE AND TECHNOLOGY, ZHEJIANG UNIVERSITY"
            ]
        }
    ],
    "chunk-096a72ddb578bd7e2bf9d3bf311b60ea": null,
    "chunk-1afe5e18c92916d2e8ce4e398d2ac8ad": null,
    "chunk-9d638435649353ad7eb68149e9db8dcc": null,
    "chunk-6dd1be559a398018f09dad69b307eede": [
        {
            "entity_name": "BERT",
            "entity_type": "ORGANIZATION",
            "description": "BERT is a model developed by Devlin et al., 2018, used as the backbone for experiments in part-of-speech tagging and named entity recognition tasks.",
            "source_entities": [
                "BERT",
                "DEVLIN ET AL., 2018"
            ]
        },
        {
            "entity_name": "Chinese Treebank",
            "entity_type": "ORGANIZATION",
            "description": "Chinese Treebank is the organization responsible for creating the CTB5, CTB6 datasets used in part-of-speech tagging experiments, and is associated with Xue et al., 2005.",
            "source_entities": [
                "CHINESE TREEBANK",
                "XUE ET AL., 2005"
            ]
        },
        {
            "entity_name": "Wall Street Journal",
            "entity_type": "ORGANIZATION",
            "description": "Wall Street Journal is the organization that provided the English dataset used in part-of-speech tagging experiments, and is associated with Ritter et al., 2011.",
            "source_entities": [
                "WALL STREET JOURNAL",
                "RITTER ET AL., 2011"
            ]
        },
        {
            "entity_name": "CTB5/CTB6",
            "entity_type": "GEO",
            "description": "CTB5 and CTB6 are Chinese POS datasets used in part-of-speech tagging experiments, created by the Chinese Treebank organization.",
            "source_entities": [
                "CTB6",
                "UD1.4",
                "CHINESE TREEBANK"
            ]
        },
        {
            "entity_name": "OntoNotes",
            "entity_type": "GEO",
            "description": "OntoNotes datasets, including OntoNotes4.0, OntoNotes5.0, are used in named entity recognition experiments, and are associated with Pradhan et al., 2011 and Pradhan et al., 2013.",
            "source_entities": [
                "ONTONOTES4.0",
                "MSRA",
                "CONLL2003",
                "ONTONOTES5.0",
                "PRADHAN ET AL., 2011",
                "PRADHAN ET AL., 2013"
            ]
        },
        {
            "entity_name": "Dynamic Sigmoid Cross-Entropy (DSC)",
            "entity_type": "CONCEPT",
            "description": "DSC refers to the Dynamic Sigmoid Cross-Entropy loss function used in the experiments, replacing MLE and compared with Focal Loss and Dice Loss.",
            "source_entities": [
                "DSC",
                "MLE",
                "FOCAL LOSS",
                "DICE LOSS"
            ]
        }
    ],
    "chunk-ba8731394946285e9c56ecf440d2094d": [
        {
            "entity_name": "BERT",
            "entity_type": "ORGANIZATION",
            "description": "BERT is a model developed by Devlin et al. (2018) that scores each candidate span to predict answers in question answering tasks. It is used as a baseline in various experiments.",
            "source_entities": [
                "BERT",
                "DEVLIN ET AL., 2018"
            ]
        },
        {
            "entity_name": "XLNet",
            "entity_type": "ORGANIZATION",
            "description": "XLNet is a model proposed by Yang et al. (2019) that uses a generalized autoregressive pretraining method to learn bidirectional contexts. It is used as a baseline in various experiments.",
            "source_entities": [
                "XLNET",
                "YANG ET AL., 2019"
            ]
        },
        {
            "entity_name": "SQuAD",
            "entity_type": "EVENT",
            "description": "SQuAD refers to the Stanford Question Answering Dataset, which includes SQuAD v1.1 and SQuAD v2.0, used for evaluating question answering models.",
            "source_entities": [
                "SQUAD V1.1",
                "SQUAD V2.0",
                "RAJPURKAR ET AL., 2016, 2018"
            ]
        },
        {
            "entity_name": "DSC",
            "entity_type": "ORGANIZATION",
            "description": "DSC refers to the proposed loss function that has been shown to improve performance in question answering and paraphrase identification tasks. It is compared with MLE in various studies.",
            "source_entities": [
                "DSC",
                "MLE"
            ]
        },
        {
            "entity_name": "Spacy",
            "entity_type": "ORGANIZATION",
            "description": "Spacy is a tool used for retrieving entity mentions and replacing them with new ones by linking mentions to their corresponding entities in DBpedia, utilized in data augmentation techniques.",
            "source_entities": [
                "SPACY",
                "DBPEDIA"
            ]
        },
        {
            "entity_name": "MRC and PI Tasks",
            "entity_type": "EVENT",
            "description": "MRC task refers to the machine reading comprehension task, which involves predicting answer spans in a given passage based on a question. PI task refers to the paraphrase identification task, which involves identifying whether two sentences have the same meaning.",
            "source_entities": [
                "MRC TASK",
                "PI TASK"
            ]
        },
        {
            "entity_name": "Data Augmentation Techniques",
            "entity_type": "EVENT",
            "description": "Data augmentation techniques include positive augmentation, negative augmentation, negative downsampling, and positive and negative augmentation, used to create balanced or imbalanced datasets for training.",
            "source_entities": [
                "DATASETS IMBALANCED TO DIFFERENT EXTENTS",
                "POSITIVE AUGMENTATION",
                "NEGATIVE AUGMENTATION",
                "NEGATIVE DOWNSAMPLING",
                "POSITIVE AND NEGATIVE AUGMENTATION"
            ]
        }
    ],
    "chunk-0a3be01b9d7564716773010993d3694a": null,
    "chunk-678bfa4737c32acd8e5ddf48b77e1439": [
        {
            "entity_name": "IEEE Transactions on Neural Networks",
            "entity_type": "ORGANIZATION",
            "description": "IEEE Transactions on Neural Networks is the publisher of the paper on Ramoboost and is also known as a publication outlet for research in the field of neural networks.",
            "source_entities": [
                "IEEE TRANSACTIONS ON NEURAL NETWORKS"
            ]
        },
        {
            "entity_name": "arXiv",
            "entity_type": "ORGANIZATION",
            "description": "arXiv is the platform where the preprints of the papers on Quoref and Learning to teach were published, serving as a repository for academic papers in various fields.",
            "source_entities": [
                "ARXIV",
                "ARXIV"
            ]
        },
        {
            "entity_name": "2015 IEEE International Conference on Computer Vision (ICCV)",
            "entity_type": "EVENT",
            "description": "The 2015 IEEE International Conference on Computer Vision (ICCV) is the event where the paper on Fast R-CNN was presented, and it is one of the leading conferences in the field of computer vision.",
            "source_entities": [
                "2015 IEEE INTERNATIONAL CONFERENCE ON COMPUTER VISION (ICCV)"
            ]
        },
        {
            "entity_name": "2014 IEEE Conference on Computer Vision and Pattern Recognition",
            "entity_type": "EVENT",
            "description": "The 2014 IEEE Conference on Computer Vision and Pattern Recognition is the event where the paper on Rich feature hierarchies was presented, and it is a major conference for research in computer vision and pattern recognition.",
            "source_entities": [
                "2014 IEEE CONFERENCE ON COMPUTER VISION AND PATTERN RECOGNITION"
            ]
        }
    ]
}