{
  "chunk-6975851757c6446b3d125faf6e138fff": {
    "tokens": 1200,
    "content": "\"All the News That's Fit to Print\"  \n\n# Che Neu Hlork Cimes  \n\nVOL. CLXXII . . . No. 59,575  \n\n© 2022  The New York Times Company NEW YORK, THURSDAY, OCTOBER 13, 2022  \n\n\\$3.00  \n\n# West Speeding Aid to Ukraine For Air Defense  \n\nCurrent Shield Works, but Has Some Holes  \n\nThis  article  is  by  Michael Schwirtz,  Lara  Jakes and  Eric Schmitt.  \n\nKYIV, Ukraine — In just two days this week, Russian forces fired more than 100 cruise missiles  and  dozens  of  exploding drones at cities across Ukraine, many more than the nation’s aging air defenses were ever expected  to  encounter.  And  yet fewer than half made it to their targets, Ukrainian officials say. Ukraine’s success in knocking down those projectiles, and the death  and  destruction  caused wherever  missiles  slipped through, have reinvigorated calls by officials in Kyiv for Western countries to provide more sophisticated defensive weapons systems. At a meeting at NATO headquarters in Brussels on Wednesday, the United States and other allies readily agreed, pledging to rapidly provide the weaponry.  \n\nOn Monday, the first day of the bombardment, the country’s air defenses took out more than half Continued on Page A9  \n\nGermany began delivery of four units of a missile defense system so advanced even its own forces have yet to use it. The Netherlands promised millions of dollars in air-defense missiles, and President Emmanuel Macron of France said his country would send “radars, systems and anti-air missiles.”  \n\nBut for all the gaps made clear by the bombardment, which killed at least 19 people and scarred some two dozen Ukrainian cities, Ukrainian patchwork air defenses have proved to be one of the great successes of the war, and among the  most  unexpected.  And Ukraine’s response to the attacks underscored how far the air defense units have come since President Vladimir V. Putin ordered his forces to invade on Feb. 24.  \n\nAnd a day after the Biden administration said it was working to speed up delivery of two advanced missile systems, Defense Secretary Lloyd J. Austin III said, “The systems will be provided as A German IRIS-T air defense system. Ukraine is getting four.  \n\n# Reluctance to Fire Employees Could Help Stabilize Economy  \n\n![](images/image_1.jpg)  \nA grave prepared for a military funeral in Bucha on Wednesday. Ukrainian forces remain on the offensive against Russian troops.  \n\nfast as we can physically get them there.”  \n\n![](images/image_2.jpg)  \n\n# In Long View, Biden Strategy  \n\nChina “is the only country with both the intent to reshape the international  order  and,  increasingly, the economic, diplomatic, Continued on Page A18  \n\nPresident Biden declared on Wednesday that the overwhelming challenge for the United States in the coming years would be “outcompeting China and restraining Russia” while focusing on restoring  a  damaged  democracy  at home.  \n\nIn his 48-page national security strategy, which every new administration is required to issue, Mr. Biden made clear that over the long term he was more worried about China’s moves to “layer authoritarian governance with a revisionist foreign policy” than he was about a declining, battered Russia. More than six months after the invasion of Ukraine, the Russian  military  appears  less fearsome than it did when the first drafts of the document circulated in the White House in December. “Russia and the P.R.C. pose different  challenges,”  Mr.  Biden wrote, using the abbreviation for the People’s Republic of China. “Russia  poses  an  immediate threat to the free and open international system, recklessly flouting the basic laws of the international order today, as its brutal war  of  aggression  against Ukraine has shown.”  \n\n# By DAVID E. SANGER  \n\n# The Hidden Hand Guiding Conservative Causes  \n\nMillions of dollars in television advertisements blasting schools for teaching critical race theory and  assailing  corporations  like BlackRock, Uber and American Airlines for catering to “woke politicians.”  \n\nA lawsuit pending before the Supreme Court to radically reshape how federal elections are conducted.  Complaints  against President Biden for violating election law and against school districts that allow information to be withheld from parents about children’s gender identities. These  initiatives  were  advanced in the past year or so by a handful of new or reconfigured  \n\n![](images/image_3.jpg)  \n\n# A Daring Addiction Strategy  \n\n# By KENNETH P. VOGEL  \n\nconservative groups — each with their own leadership and mission. Behind  the  scenes,  though, these groups have something in common: They are part of an ambitious coalition developed in recent years by the conservative activist Leonard A. Leo, who until now has been best known for his role in pushing the appointments of conservative judges to the center  of  the  Republican  Party’s agenda.  \n\n# Millions Flow Through Network Assembled by Veteran Activist  \n\nMost of the initiatives were financially supported, or in some cases launched, by an opaque, sprawling network shaped by Mr. Leo and funded by wealthy patrons,  usually  through  anonymous donations that critics call “dark money.”  \n\nAn investigation by The New York Times of Mr. Leo’s activities reveals new details of how he has built that network, with relatively little public attention, into one of the best-funded and most sophisticated operations in American politics, giving him extraordinary influence as he pushes a broad array  of  hot-button  conservative causes and seeks to counter what he sees as an increasing leftward Continued on Page A14  \n\n# By JEANNA SMIALEK and SYDNEY EMBER  \n\nRhode Island aims to prevent overdoses with supervised",
    "chunk_order_index": 0,
    "full_doc_id": "doc-33edd04ab59a99003aa2214d572e9f54"
  },
  "chunk-482a673ea465bed4ba268da1d3fef2fa": {
    "tokens": 1200,
    "content": "Times of Mr. Leo’s activities reveals new details of how he has built that network, with relatively little public attention, into one of the best-funded and most sophisticated operations in American politics, giving him extraordinary influence as he pushes a broad array  of  hot-button  conservative causes and seeks to counter what he sees as an increasing leftward Continued on Page A14  \n\n# By JEANNA SMIALEK and SYDNEY EMBER  \n\nRhode Island aims to prevent overdoses with supervised drug consumption sites. Cristina Ramsey, left, who died after a long battle with drugs, felt such programs might have helped her. Page A12.  \n\n# SANDY HOOK LIES WILL COST JONESABOUT \\$1 BILLION  \n\nVICTORY FOR FAMILIES  \n\nDecision Strikes Blow to Culture of Conspiracy Theories in U.S.  \n\n# By ELIZABETH WILLIAMSON  \n\nWATERBURY, Conn. — The families  of  eight  Sandy  Hook shooting victims on Wednesday won nearly \\$1 billion in damages from the Infowars fabulist Alex Jones, a devastating blow against his empire and a message from the jury that his lies and those of his followers have crippling consequences.  \n\nMr. Jones, who for years said the 2012 Sandy Hook shooting that killed 20 first graders and six educators in Newtown, Conn., was a government hoax, now faces financial ruin. But it is unclear how much money the families will ultimately collect.  \n\nThe families and their lawyers sat in stunned silence as the court clerk read one by one the sums awarded to each of 15 plaintiffs in the  case.  After  court  was  adjourned, they hugged one another quietly, weeping.  \n\nThe largest award went to Robbie Parker, who received \\$120 million. For years on his Infowars show and website, Mr. Jones singled out Mr. Parker, whose daughter Emilie died at Sandy Hook, as an actor whose televised tribute to Emilie a day after her death was “disgusting.”  \n\nMr. Parker, who has endured online  abuse,  harassment  and death threats since, formed the centerpiece  of  the  Connecticut case. “Every day in that courtroom, we got up on the stand and we told the truth,” he said. “Telling the truth shouldn’t be so hard, and it shouldn’t be so scary.”  \n\nMr. Parker added, in a nod to Mr. Jones’s followers, “For anybody that still chooses to listen to that man, just ask yourself, what has he ever given you?”  \n\nIn all likelihood Mr. Jones does not  have  the  money  to  pay Wednesday’s award. In August a forensic economist estimated that Mr. Jones’s empire was worth a maximum of \\$270 million, but that same month Mr. Jones put his parent company, Free Speech Systems, into bankruptcy. Mr. Jones claimed that a debt of \\$54 million — owed to a company he controls — had made him insolvent.  \n\nBut Mr. Jones’s annual revenues have topped \\$50 million in recent years from hawking diet supplements, survivalist gear and gun paraphernalia on his broadcasts. He has also used the Connecticut trial as well as a trial this past summer in Texas — in which he was ordered to pay two Sandy Hook parents about \\$50 million — to solicit donations to his legal fund and boost his product sales. The Sandy Hook families have challenged  the  bankruptcy  in court, saying the filing is an effort  \n\nMr. Jones, unrepentant, livestreamed the jury’s verdict on Wednesday on his Infowars show. “They covered up what really happened, and now I’m the devil,” Continued on Page A20  \n\nPROVO,  Utah —Chad Pritchard and his colleagues are trying everything to staff their pizza shop and bistro, and as they do, they have turned to a new tactic: They avoid firing employees at all costs.  \n\nInfractions  that  previously would have led to a quick dismissal no longer do at the chef’s two places, Fat Daddy’s Pizzeria and Bistro  Provenance.  Consistent transportation issues have ceased to be a deal breaker. Workers who show up drunk these days are sent home to sober up.  \n\ntown at the base of the Rocky Mountains where unemployment is near the lowest in the nation at 1.9 percent, have no room to lose workers.  Bistro  Provenance, which opened in September, has been unable to hire enough employees to open for lunch at all, or for dinner on Sundays and Mondays. The workers it has are often new to the industry, or young: On a recent Wednesday night, a 17- year-old could be found torching a crème brûlée.  \n\nDown the street, Mr. Pritchard’s pizza shop is now relying on an Continued on Page A20  \n\n# New York Finds Hasidic School Fails to Offer a Basic Education  \n\n# By ELIZA SHAPIRO and BRIAN M. ROSENTHAL  \n\nNew York State officials have determined that a private Hasidic Jewish boys’ school in Brooklyn is violating the law by failing to provide a basic education, a ruling that could signal profound challenges for scores of Hasidic religious schools that have long resisted government oversight. The ruling marks the first time that the state has taken action against  such  a  school,  one  of scores of private Hasidic yeshivas across New York that provide robust religious instruction in Yiddish but few lessons in English and math and virtually none in science, history or social studies. It also served as a stern rebuke of the administration of Mayor  \n\n# Signals Challenges for Scores of Others  \n\nEric Adams, whose Education Department this summer reported to the state that, in its judgment, the yeshiva was complying with a law requiring private schools",
    "chunk_order_index": 1,
    "full_doc_id": "doc-33edd04ab59a99003aa2214d572e9f54"
  },
  "chunk-0b097e6b27b26671e36d5035451e7f67": {
    "tokens": 621,
    "content": "such  a  school,  one  of scores of private Hasidic yeshivas across New York that provide robust religious instruction in Yiddish but few lessons in English and math and virtually none in science, history or social studies. It also served as a stern rebuke of the administration of Mayor  \n\n# Signals Challenges for Scores of Others  \n\nEric Adams, whose Education Department this summer reported to the state that, in its judgment, the yeshiva was complying with a law requiring private schools to offer an  education  comparable  with what is offered in public schools. The decision, issued last week by the state education commissioner, Betty Rosa, stemmed from a 2019 lawsuit brought by a parent against  the  school,  Yeshiva Mesivta Arugath Habosem, which enrolls  about  500  boys  in Williamsburg, Brooklyn. The ruling requires the yeshiva  \n\n![](images/image_4.jpg)  \n\n# NATIONAL A12-22  \n\nMore Access to New Boosters Federal regulators authorized the shots for children as young as 5 to bolster protection against the now-dominant version of the coronavirus. PAGE A15  \n\n![](images/image_5.jpg)  \n\n# BUSINESS B1-5  \n\nMass Testing Strained in China There are no signs that Beijing plans to rethink a cornerstone of its “zero Covid” policy even as the bills pile up and infections keep spreading. PAGE B1  \n\n![](images/image_6.jpg)  \n\n# INTERNATIONAL A4-10  \n\nExplaining a Wildlife Drop A study found a 69 percent fall in global wildlife from 1970 to 2019, but it may not mean exactly what you think.  PAGE A10 Policy Change on Migrants A new program will provide a narrow legal pathway to the United States for up to 24,000 Venezuelans. PAGE A6 Staff Failed Trainee, Navy Says Kyle Mullen’s fellow SEAL candidates tried to get help for him as his health declined but were repeatedly rebuffed, a report on his death found.  PAGE A19 Avoiding Talk of Abortion G.O.P. candidates have been changing their positions, erasing references from their websites and trying to focus on other topics on the trail. PAGE A16 Back to the Office, and 2010 A survey of return-to-work outfits at Brookfield Place shows that men’s suits are stuck in the Obama years.  PAGE D3 A Fake Heiress in a Walk-Up Released from jail, Anna Sorokin talks about her first night of house arrest in her new Manhattan apartment. PAGE D1  \n\nSPORTS B6-9   \nA Liberating Run   \nWith a new division for nonbinary   \nrunners, the Chicago Marathon gave one athlete a reason to come home.   \nSports of The Times. PAGE B9  \n\n# Lydia Polgreen  \n\nPAGE A25  \n\nARTS C1-6 Connecting All That Jazz The dancer LaTasha Barnes invites the audience into a social dance and music space in a joyous program that dissolves imposed boundaries. PAGE C5",
    "chunk_order_index": 2,
    "full_doc_id": "doc-33edd04ab59a99003aa2214d572e9f54"
  }
}