{
    "image_1": [
    ],
    "image_2": [
        {
            "merged_entity_name": "WINOMT",
            "entity_type": "EVENT",
            "description": "WinoMT is the challenge set created by concatenating Winogender and WinoBias datasets for evaluating gender bias in machine translation, containing 3,888 instances and is equally balanced between male and female genders, as well as between stereotypical and nonstereotypical gender-role assignments.",
            "source_image_entities": [
                "WINOMT"
            ],
            "source_text_entities": [
                "WINOMT"
            ]
        },
        {
            "merged_entity_name": "WINOGENDER",
            "entity_type": "EVENT",
            "description": "Winogender is a dataset used in the study for evaluating gender bias in machine translation, containing 720 examples, equally divided among male, female, and neutral genders.",
            "source_image_entities": [
                "WINOGENDER"
            ],
            "source_text_entities": [
                "WINOGENDER"
            ]
        },
        {
            "merged_entity_name": "WINOBIAS",
            "entity_type": "EVENT",
            "description": "WinoBias is a dataset used in the study for evaluating gender bias in machine translation, containing 3168 examples, with a focus on bias analysis, including 1582 male and 1586 female examples.",
            "source_image_entities": [
                "WINOBIAS"
            ],
            "source_text_entities": [
                "WINOBIAS"
            ]
        }
    ],
    "image_3": [],
    "image_4": [
    ],
    "image_5": [
        {
            "merged_entity_name": "Spanish",
            "entity_type": "GEO",
            "description": "Spanish is a Romance language tested in the WinoMT challenge set for gender bias in machine translation, with 67% accuracy for stereotypical and 46% for non-stereotypical.",
            "source_image_entities": [
                "ES"
            ],
            "source_text_entities": [
                "SPANISH"
            ]
        },
        {
            "merged_entity_name": "French",
            "entity_type": "GEO",
            "description": "French is a Romance language tested in the WinoMT challenge set for gender bias in machine translation, with 80% accuracy for stereotypical and 54% for non-stereotypical. French has a contracted determiner used for both masculine and feminine nouns, contributing to ambiguity in gender identification.",
            "source_image_entities": [
                "FR"
            ],
            "source_text_entities": [
                "FRENCH"
            ]
        },
        {
            "merged_entity_name": "Italian",
            "entity_type": "GEO",
            "description": "Italian is a Romance language tested in the WinoMT challenge set for gender bias in machine translation, with 52% accuracy for stereotypical and 30% for non-stereotypical. Italian has a contracted determiner used for both masculine and feminine nouns, contributing to ambiguity in gender identification.",
            "source_image_entities": [
                "IT"
            ],
            "source_text_entities": [
                "ITALIAN"
            ]
        },
        {
            "merged_entity_name": "Russian",
            "entity_type": "GEO",
            "description": "Russian is a Slavic language tested in the WinoMT challenge set for gender bias in machine translation, with 44% accuracy for stereotypical and 33% for non-stereotypical.",
            "source_image_entities": [
                "RU"
            ],
            "source_text_entities": [
                "RUSSIAN"
            ]
        },
        {
            "merged_entity_name": "Hebrew-speaking region",
            "entity_type": "GEO",
            "description": "Hebrew is a Semitic language tested in the WinoMT challenge set for gender bias in machine translation, with 76% accuracy for stereotypical and 38% for non-stereotypical. Gender for certain words in Hebrew cannot be distinguished without diacritics, leading to ambiguity in morphological analysis.",
            "source_image_entities": [
                "HE"
            ],
            "source_text_entities": [
                "HEBREW"
            ]
        },
        {
            "merged_entity_name": "Germany",
            "entity_type": "GEO",
            "description": "German is a Germanic language tested in the WinoMT challenge set for gender bias in machine translation, with 69% accuracy for stereotypical and 57% for non-stereotypical. German's similarity to the English source language may explain the better performance of translation systems in German.",
            "source_image_entities": [
                "DE"
            ],
            "source_text_entities": [
                "GERMAN"
            ]
        }
    ],
    "image_6": [
        {
            "entity_name": "Russian",
            "entity_type": "GEO",
            "description": "Russian is a Slavic language tested in the WinoMT challenge set for gender bias in machine translation. The country represented in the table has an original score of 37.7 and an adjusted score of 48.9, showing an increase of +11.2.",
            "source_image_entities": [
                "RU"
            ],
            "source_text_entities": [
                "RUSSIAN"
            ]
        },
        {
            "entity_name": "Ukrainian",
            "entity_type": "GEO",
            "description": "Ukrainian is a Slavic language tested in the WinoMT challenge set for gender bias in machine translation. The country represented in the table has an original score of 38.4 and an adjusted score of 42.9, showing an increase of +4.5.",
            "source_image_entities": [
                "UK"
            ],
            "source_text_entities": [
                "UKRAINIAN"
            ]
        }
    ],
    "image_7": [
    ]
}