{
    "image_1": {
        "image_id": 1,
        "image_path": "./fusion_research/fusion_dataset/novel/Harry Potter and the Sorcerers Stone Illustrated Edition (J. K. Rowling, Jim Kay (Illustrator)) (3)/images/image_1.jpg",
        "caption": [],
        "footnote": [],
        "context": "There were a hundred and forty-two staircases at Hogwarts: wide, sweeping ones; narrow, rickety ones; some that led somewhere diŀerent  Whispers followed Harry from the moment he left his dormitory the next day. People lining up outside classrooms stood on tiptoe to get a look at him, or doubled back to pass him in the corridors again, staring. Harry wished they wouldn’t, because he was trying to concentrate on Łnding his way to classes. “Next to the tall kid with the red hair.” “Wearing the glasses?” “Did you see his face?” “Did you see his scar?” “Where?” here, look.” “T to him, telling him he must transfer to Slytherin at once, because it was his destiny. Harry told the turban he didn’t want to be in Slytherin; it got heavier and heavier; he tried to pull it oŀ but it tightened painfully— and there was Malfoy, laughing at him as he struggled with it —then Malfoy turned into the hook-nosed teacher, Snape, whose laugh became high and cold—there was a burst of green light and Harry woke, sweating and shaking. He rolled over and fell asleep again, and when he woke next day, he didn’t remember the dream at all. ",
        "chunk_order_index": 0,
        "chunk_id": "chunk-9dadbfebe82888df47146dd339d5b7d8",
        "description": "The image is an illustration featuring a collection of potion bottles arranged on a surface. The central bottle, which is prominently displayed and has a label reading 'CHAPTER EIGHT THE POTIONSMaster', is blue with a skull-shaped stopper. Surrounding this central bottle are various other potion bottles in different shapes, sizes, and colors. To the left of the central bottle, there is a red bottle with a spiral pattern, a green bottle with a zigzag pattern, and a pink bottle with a bat-like figure on it. To the right, there is a green bottle with a cork stopper and another bottle with a bat-like figure. The background is a muted beige color, giving the scene an old, mystical atmosphere. The overall mood conveyed by the image is one of mystery and magic, fitting the theme of potions and alchemy.",
        "segmentation": true
    },
    "image_2": {
        "image_id": 2,
        "image_path": "./fusion_research/fusion_dataset/novel/Harry Potter and the Sorcerers Stone Illustrated Edition (J. K. Rowling, Jim Kay (Illustrator)) (3)/images/image_2.jpg",
        "caption": [],
        "footnote": [],
        "context": "He “Typical,” said Harry darkly. “Just what I always wanted. To make a fool of myself on a broomstick in front of Malfoy.” arry had never believed he would meet a boy he hated more than Dudley, but that was before he met Draco Malfoy. Still, Łrst-year GryŃndors only had Potions with the Slytherins, so they didn’t have to put up with Malfoy much. Or at least, they didn’t until they spotted a notice pinned up in the GryŃndor common room that made them all groan. Flying lessons would be starting on Thursday—and GryŃndor and Slytherin would be learning together. emptied vault seven hundred and thirteen, if you could call it emptying, taking out that grubby little package. Had that been what the thieves were looking for?  As Harry and Ron walked back to the castle for dinner, their pockets weighed down with rock cakes they’d been too polite to refuse, Harry thought that none of the lessons he’d had so far had given him as much to think about as tea with Hagrid. Had Hagrid collected that package just in time? Where was it now? And did Hagrid know something about Snape that he didn’t want to tell Harry? ",
        "chunk_order_index": 4,
        "chunk_id": "chunk-06ffa77db0e92bff5a14316d020c91e0",
        "description": "The image depicts a serene and mystical night scene set in a mountainous landscape. The sky is dominated by a full moon, casting a soft glow over the entire scene. The mountains in the background are shrouded in mist, adding to the ethereal atmosphere. Below the mountains, there is a calm lake reflecting the moonlight, creating a mirror-like effect on the water's surface. In the foreground, there is a stone bridge with a railing, partially visible at the bottom of the image. The overall mood of the image is one of tranquility and mystery, evoking a sense of quiet anticipation. Superimposed on the image is the text 'CHAPTER NINE THE MIDNIGHT DUEL', suggesting that this image is likely an illustration for a chapter in a book, possibly related to a magical or fantasy theme.",
        "segmentation": false
    },
    "image_3": {
        "image_id": 3,
        "image_path": "./fusion_research/fusion_dataset/novel/Harry Potter and the Sorcerers Stone Illustrated Edition (J. K. Rowling, Jim Kay (Illustrator)) (3)/images/image_3.jpg",
        "caption": [],
        "footnote": [],
        "context": "“It’s either really valuable or really dangerous,” said Ron. “Or both,” said Harry. alfoy couldn’t believe his eyes when he saw that Harry and Ron were still at Hogwarts the next day, looking tired but perfectly cheerful. Indeed, by the next morning Harry and Ron thought that meeting the three-headed dog had been an excellent adventure, and they were quite keen to have another one. In the meantime, Harry Łlled Ron in about the package that seemed to have been moved from Gringotts to Hogwarts, and they spent a lot of time wondering what could possibly need such heavy protection. with yourselves. We could all have been killed—or worse, expelled. Now, if you don’t mind, I’m going to bed.” Ron stared after her, his mouth open. “No, we don’t mind,” he said. “You’d think we dragged her along, wouldn’t you?” But Hermione had given Harry something else to think about as he climbed back into bed. The dog was guarding something....What had Hagrid said? Gringotts was the safest place in the world for something you wanted to hide—except perhaps Hogwarts. It looked as though Harry had found out where the grubby little package from vault seven hundred and thirteen was. ",
        "chunk_order_index": 10,
        "chunk_id": "chunk-a1edc245201e7be1315ca83becb21d74",
        "description": "The image features a vibrant and festive Halloween-themed illustration. At the center is a large, orange pumpkin with a green stem, surrounded by lush green leaves and vines that give a sense of a garden or pumpkin patch. The pumpkin has the text 'CHAPTER TEN HALLOWEEN' written in bold, black letters across its surface. To the right of the pumpkin, there is a cartoonish black spider with a round body and eight legs, peeking out from behind the pumpkin. The background is a light, watercolor-like texture, adding to the whimsical and playful atmosphere of the image. The overall mood conveyed is one of fun and celebration, typical of Halloween festivities.",
        "segmentation": true
    },
    "image_4": {
        "image_id": 4,
        "image_path": "./fusion_research/fusion_dataset/novel/Harry Potter and the Sorcerers Stone Illustrated Edition (J. K. Rowling, Jim Kay (Illustrator)) (3)/images/image_4.jpg",
        "caption": [],
        "footnote": [],
        "context": "Hardly anyone had seen Harry The Quidditch season had begun. On Saturday, Harry would be playing in his Łrst match after weeks of training: GryŃndor versus Slytherin. If GryŃndor won, they would move up into second place in the House Championship. s they entered November, the weather turned very cold. The mountains around the school became icy gray and the lake like chilled steel. Every morning the ground was covered in frost. Hagrid could be seen from the upstairs windows defrosting broomsticks on the Quidditch Łeld, bundled up in a long moleskin overcoat, rabbit fur gloves, and enormous beaverskin boots. They had reached the portrait of the Fat Lady. “Pig snout,” they said and entered. The common room was packed and noisy. Everyone was eating the food that had been sent up. Hermione, however, stood alone by the door, waiting for them. There was a very embarrassed pause. Then, none of them looking at each other, they all said “Thanks,” and hurried oŀ to get plates. But from that moment on, Hermione Granger became their friend. There are some things you can’t share without ending up liking each other, and knocking out a twelve-foot mountain troll is one of them. ",
        "chunk_order_index": 16,
        "chunk_id": "chunk-878321cda172e837d623121153d946e9",
        "description": "The image features a golden, spherical object with intricate designs and patterns, resembling the Snitch from the game of Quidditch. The sphere is adorned with two sets of wings on either side, giving it an appearance of flight. The background is a light blue sky with subtle cloud patterns, adding to the airy and dynamic atmosphere. Overlaid on the image are the words 'CHAPTER ELEVEN QUIDDITCH' in bold, black text, indicating the title of a chapter likely from a book related to the Harry Potter series. The overall mood conveyed by the image is one of excitement and anticipation, fitting the theme of a Quidditch match.",
        "segmentation": true
    },
    "image_5": {
        "image_id": 5,
        "image_path": "./fusion_research/fusion_dataset/novel/Harry Potter and the Sorcerers Stone Illustrated Edition (J. K. Rowling, Jim Kay (Illustrator)) (3)/images/image_5.jpg",
        "caption": [],
        "footnote": [],
        "context": "No one could wait for the holidays to start. While the GryŃndor common room and the Great Hall had roaring Łres, the drafty corridors hristmas was coming. One morning in mid-December, Hogwarts woke to Łnd itself covered in several feet of snow. The lake froze solid and the Weasley twins were punished for bewitching several snowballs so that they followed Quirrell around, bouncing oŀ the back of his turban. The few owls that managed to battle their way through the stormy sky to deliver mail had to be nursed back to health by Hagrid before they could ły oŀ again. I see one, Hagrid, I’ve read all about them! You’ve got to keep eye contact, and Snape wasn’t blinking at all, I saw him!” “I’m tellin’ yeh, yer wrong!” said Hagrid hotly. “I don’ know why Harry’s broom acted like that, but Snape wouldn’ try an’ kill a student! Now, listen to me, all three of yeh—yer meddlin’ in things that don’ concern yeh. It’s dangerous. You forget that dog, an’ you forget what it’s guardin’, that’s between Professor Dumbledore an’ Nicolas Flamel—” “Aha!” said Harry, “so there’s someone called Nicolas Flamel involved, is there?” Hagrid looked furious with himself. ",
        "chunk_order_index": 20,
        "chunk_id": "chunk-97c5554d758d6bd130f3b2ae2923a9cd",
        "description": "The image is an illustration for Chapter Twelve titled 'The Mirror of Erised' from the book 'Harry Potter and the Sorcerer's Stone'. The scene depicts a snowy, gothic-style corridor with icicles hanging from the ornate stone arches and windows. The architecture features intricate carvings and gargoyles, adding to the mystical atmosphere. In the foreground, there is a large black spider crawling on the snow-covered ground. The overall mood of the image is cold and eerie, with the snow and icicles emphasizing the wintry setting. The text overlay in the center reads 'CHAPTER TWELVE THE MIRROR OF ERISED', which indicates the chapter title. The background shows a glimpse of a window with a view of more snow outside, enhancing the winter theme.",
        "segmentation": true
    }
}