{
  "chunk-9dadbfebe82888df47146dd339d5b7d8": {
    "tokens": 1200,
    "content": "A loud, rude sound, like the air being let out of a balloon, answered.  \n\n“Do you want me to go to the Bloody Baron?”  \n\nThere was a pop, and a little man with wicked, dark eyes and a wide mouth appeared, łoating cross-legged in the air, clutching the walking sticks.  \n\n“Oooooooh!” he said, with an evil cackle. “Ickle Firsties! What fun!”  \n\nHe swooped suddenly at them. They all ducked.  \n\n“Go away, Peeves, or the Baron’ll hear about this, I mean it!” barked Percy.  \n\nPeeves stuck out his tongue and vanished, dropping the walking sticks on Neville’s head. They heard him zooming away, rattling coats of armor as he passed.  \n\n“You want to watch out for Peeves,” said Percy, as they set oŀ again. “The Bloody Baron’s the only one who can control him, he won’t even listen to us prefects. Here we are.”  \n\nAt the very end of the corridor hung a portrait of a very fat woman in a pink silk dress.  \n\n“Password?” she said.  \n\n“Caput  Draconis,”  said  Percy,  and  the  portrait  swung forward to reveal a round hole in the wall. They all scrambled through it—Neville needed a leg up—and found themselves in the GryŃndor common room, a cozy, round room full of squashy armchairs.  \n\nPercy  directed  the  girls  through  one  door  to  their dormitory and the boys through another. At the top of a spiral staircase—they were obviously in one of the towers—they found their beds at last: Łve four-posters hung with deep red, velvet curtains. Their trunks had already been brought up. Too tired to talk much, they pulled on their pajamas and fell into bed.  \n\n“Great food, isn’t it?” Ron muttered to Harry through the hangings. “Get oŀ, Scabbers! He’s chewing my sheets.”  \n\nHarry was going to ask Ron if he’d had any of the treacle tart, but he fell asleep almost at once.  \n\nPerhaps Harry had eaten a bit too much, because he had a very strange dream. He was wearing Professor Quirrell’s turban, which kept talking to him, telling him he must transfer to Slytherin at once, because it was his destiny. Harry told the turban he didn’t want to be in Slytherin; it got heavier and heavier; he tried to pull it oŀ but it tightened painfully— and there was Malfoy, laughing at him as he struggled with it —then Malfoy turned into the hook-nosed teacher, Snape, whose laugh became high and cold—there was a burst of green light and Harry woke, sweating and shaking.  \n\nHe rolled over and fell asleep again, and when he woke next day, he didn’t remember the dream at all.  \n\n![](images/image_1.jpg)  \n\n# “T  \n\nhere, look.”  \n\n“Where?”  \n\n“Next to the tall kid with the red hair.”   \n“Wearing the glasses?”   \n“Did you see his face?”   \n“Did you see his scar?”  \n\nWhispers followed Harry from the moment he left his dormitory the next day. People lining up outside classrooms stood on tiptoe to get a look at him, or doubled back to pass him in the corridors again, staring. Harry wished they wouldn’t, because he was trying to concentrate on Łnding his way to classes.  \n\nThere  were  a  hundred  and  forty-two  staircases  at Hogwarts: wide, sweeping ones; narrow, rickety ones; some that led somewhere diŀerent on a Friday; some with a vanishing step halfway up that you had to remember to jump. Then there were doors that wouldn’t open unless you asked politely, or tickled them in exactly the right place, and doors that weren’t really doors at all, but solid walls just pretending. It was also very hard to remember where anything was, because it all seemed to move around a lot. The people in the portraits kept going to visit each other, and Harry was sure the coats of armor could walk.  \n\nThe ghosts didn’t help, either. It was always a nasty shock when one of them glided suddenly through a door you were trying to open. Nearly Headless Nick was always happy to point new GryŃndors in the right direction, but Peeves the Poltergeist was worth two locked doors and a trick staircase if you met him when you were late for class. He would drop wastepaper baskets on your head, pull rugs from under your feet, pelt you with bits of chalk, or sneak up behind you, invisible, grab your nose, and screech, “GOT YOUR CONK!”  \n\nEven worse than Peeves, if that was possible, was the caretaker, Argus Filch. Harry and Ron managed to get on the wrong side of him on their very Łrst morning. Filch found them trying to force their way through a door that unluckily turned out to be the entrance to the out-of-bounds corridor on the third łoor. He wouldn’t believe they were lost, was sure they were trying to break into it on purpose, and was threatening to lock them in the dungeons when they were rescued by Professor Quirrell, who was passing.  \n\nFilch owned a cat called Mrs. Norris, a scrawny, dust-colored creature with bulging, lamplike eyes just like Filch’s. She patrolled the corridors alone. Break a rule in front of her, put just one toe out of line, and she’d whisk oŀ",
    "chunk_order_index": 0,
    "full_doc_id": "doc-6408de1ccca0fa2fd39f62dfe301feff"
  },
  "chunk-18cbb397bb76a1068749476b4ea1264f": {
    "tokens": 1200,
    "content": ", was sure they were trying to break into it on purpose, and was threatening to lock them in the dungeons when they were rescued by Professor Quirrell, who was passing.  \n\nFilch owned a cat called Mrs. Norris, a scrawny, dust-colored creature with bulging, lamplike eyes just like Filch’s. She patrolled the corridors alone. Break a rule in front of her, put just one toe out of line, and she’d whisk oŀ for Filch, who’d appear, wheezing, two seconds later. Filch knew the secret passageways of the school better than anyone (except perhaps the Weasley twins) and could pop up as suddenly as any of the ghosts. The students all hated him, and it was the dearest ambition of many to give Mrs. Norris a good kick.  \n\nAnd then, once you had managed to Łnd them, there were the classes themselves. There was a lot more to magic, as Harry quickly found out, than waving your wand and saying a few funny words.  \n\nThey had to study the night skies through their telescopes every  Wednesday  at  midnight  and  learn  the  names  of diŀerent stars and the movements of the planets. Three times a week they went out to the greenhouses behind the castle to study Herbology, with a dumpy little witch called Professor Sprout, where they learned how to take care of all the strange plants and fungi, and found out what they were used for.  \n\nEasily the most boring class was History of Magic, which was the only one taught by a ghost. Professor Binns had been very old indeed when he had fallen asleep in front of the staŀroom Łre and got up next morning to teach, leaving his body behind him. Binns droned on and on while they scribbled down names and dates, and got Emeric the Evil and Uric the Oddball mixed up.  \n\nProfessor Flitwick, the Charms teacher, was a tiny little wizard who had to stand on a pile of books to see over his desk. At the start of their Łrst class he took the roll call, and when he reached Harry’s name he gave an excited squeak and toppled out of sight.  \n\nProfessor McGonagall was again diŀerent. Harry had been quite right to think she wasn’t a teacher to cross. Strict and clever, she gave them a talking-to the moment they sat down in her Łrst class.  \n\n“TransŁguration  is  some  of  the  most  complex  and dangerous magic you will learn at Hogwarts,” she said. “Anyone messing around in my class will leave and not come back. You have been warned.”  \n\nThen she changed her desk into a pig and back again. They were all very impressed and couldn’t wait to get started, but soon realized they weren’t going to be changing the furniture into animals for a long time. After taking a lot of complicated notes, they were each given a match and started trying to turn it into a needle. By the end of the lesson, only Hermione Granger had made any diŀerence to her match; Professor McGonagall showed the class how it had gone all silver and pointy and gave Hermione a rare smile.  \n\nThe class everyone had really been looking forward to was Defense Against the Dark Arts, but Quirrell’s lessons turned out to be a bit of a joke. His classroom smelled strongly of garlic, which everyone said was to ward oŀ a vampire he’d met in Romania and was afraid would be coming back to get him one of these days. His turban, he told them, had been given to him by an African prince as a thank-you for getting rid of a troublesome zombie, but they weren’t sure they believed this story. For one thing, when Seamus Finnigan asked eagerly to hear how Quirrell had fought oŀ the zombie, Quirrell went pink and started talking about the weather; for another, they had noticed that a funny smell hung around the turban, and the Weasley twins insisted that it was stuŀed full of garlic as well, so that Quirrell was protected wherever he went.  \n\nHarry was very relieved to Łnd out that he wasn’t miles behind everyone else. Lots of people had come from Muggle families and, like him, hadn’t had any idea that they were witches and wizards. There was so much to learn that even people like Ron didn’t have much of a head start.  \n\nFriday was an important day for Harry and Ron. They Łnally managed to Łnd their way down to the Great Hall for breakfast without getting lost once.  \n\n“What have we got today?” Harry asked Ron as he poured sugar on his porridge.  \n\n“Double Potions with the Slytherins,” said Ron. “Snape’s Head of Slytherin House. They say he always favors them— we’ll be able to see if it’s true.”  \n\n“Wish  McGonagall  favored  us,”  said  Harry.  Professor McGonagall was head of GryŃndor House, but it hadn’t stopped her from giving them a huge pile of homework the day before.  \n\nJust then, the mail arrived. Harry had gotten used to this by now, but it had given him a bit of a shock on the Łrst morning, when about a hundred owls had suddenly streamed into the Great Hall during breakfast, circling the tables until they saw their owners, and dropping letters and packages onto their laps.  \n\nHedwig  hadn’t  brought  Harry  anything  so  far.  She sometimes łew in to nibble his ear and have a bit of toast before going",
    "chunk_order_index": 1,
    "full_doc_id": "doc-6408de1ccca0fa2fd39f62dfe301feff"
  },
  "chunk-3dc93d8c481fb13958a7fe6d6aeca60b": {
    "tokens": 1200,
    "content": "mail arrived. Harry had gotten used to this by now, but it had given him a bit of a shock on the Łrst morning, when about a hundred owls had suddenly streamed into the Great Hall during breakfast, circling the tables until they saw their owners, and dropping letters and packages onto their laps.  \n\nHedwig  hadn’t  brought  Harry  anything  so  far.  She sometimes łew in to nibble his ear and have a bit of toast before going oŀ to sleep in the owlery with the other school owls. This morning, however, she łuttered down between the marmalade and the sugar bowl and dropped a note onto Harry’s plate. Harry tore it open at once. It said, in a very untidy scrawl:  \n\n# Dear Harry,  \n\nI know you get Friday afternoons off, so would you like to come and have a cup of tea with me around three? I want to hear all about your first week. Send us an answer back with Hedwig.  \n\nHagrid  \n\nHarry borrowed Ron’s quill, scribbled Yes, please, see you later on the back of the note, and sent Hedwig oŀ again.  \n\nIt was lucky that Harry had tea with Hagrid to look forward to, because the Potions lesson turned out to be the worst thing that had happened to him so far.  \n\nAt the start-of-term banquet, Harry had gotten the idea that Professor Snape disliked him. By the end of the Łrst Potions lesson, he knew he’d been wrong. Snape didn’t dislike Harry— he hated him.  \n\nPotions lessons took place down in one of the dungeons. It was colder here than up in the main castle, and would have been  quite  creepy  enough  without  the  pickled  animals łoating in glass jars all around the walls.  \n\nSnape, like Flitwick, started the class by taking the roll call, and like Flitwick, he paused at Harry’s name.  \n\n“Ah, yes,” he said softly, “Harry Potter. Our new—celebrity.”  \n\nDraco Malfoy and his friends Crabbe and Goyle sniggered behind their hands. Snape Łnished calling the names and looked up at the class. His eyes were black like Hagrid’s, but they had none of Hagrid’s warmth. They were cold and empty and made you think of dark tunnels.  \n\n“You are here to learn the subtle science and exact art of potion-making,” he began. He spoke in barely more than a whisper,  but  they  caught  every  word—like  Professor McGonagall, Snape had the gift of keeping a class silent without eŀort. “As there is little foolish wand-waving here, many of you will hardly believe this is magic. I don’t expect you will really understand the beauty of the softly simmering cauldron with its shimmering fumes, the delicate power of liquids that creep through human veins, bewitching the mind, ensnaring the senses....I can teach you how to bottle fame, brew glory, even stopper death—if you aren’t as big a bunch of dunderheads as I usually have to teach.”  \n\nMore silence followed this little speech. Harry and Ron exchanged looks with raised eyebrows. Hermione Granger was on the edge of her seat and looked desperate to start proving that she wasn’t a dunderhead.  \n\n“Potter!” said Snape suddenly. “What would I get if I added powdered root of asphodel to an infusion of wormwood?”  \n\nPowdered root of what to an infusion of what? Harry glanced at Ron, who looked as stumped as he was; Hermione’s hand had shot into the air.  \n\n“I don’t know, sir,” said Harry.  \n\nSnape’s lips curled into a sneer.  \n\n“Tut, tut—fame clearly isn’t everything.”  \n\nHe ignored Hermione’s hand.  \n\n“Let’s try again. Potter, where would you look if I told you to Łnd me a bezoar?”  \n\nHermione stretched her hand as high into the air as it would go without her leaving her seat, but Harry didn’t have the faintest idea what a bezoar was. He tried not to look at Malfoy, Crabbe, and Goyle, who were shaking with laughter.  \n\n“I don’t know, sir.”  \n\n“Thought you wouldn’t open a book before coming, eh, Potter?”  \n\nHarry forced himself to keep looking straight into those cold eyes. He had looked through his books at the Dursleys’, but did Snape expect him to remember everything in One Thousand Magical Herbs and Fungi?  \n\nSnape was still ignoring Hermione’s quivering hand.  \n\n“What is the diŀerence, Potter, between monkshood and wolfsbane?”  \n\nAt this, Hermione stood up, her hand stretching toward the dungeon ceiling.  \n\n“I don’t know,” said Harry quietly. “I think Hermione does, though, why don’t you try her?”  \n\nA few people laughed; Harry caught Seamus’s eye, and Seamus winked. Snape, however, was not pleased.  \n\n“Sit  down,”  he  snapped  at  Hermione.  “For  your information, Potter, asphodel and wormwood make a sleeping potion so powerful it is known as the Draught of Living Death.  \n\nA bezoar is a stone taken from the stomach of a goat and it will save  you  from  most  poisons.  As  for  monkshood  and wolfsbane, they are the same plant, which also goes by the name of aconite. Well? Why aren’t you all copying that down?”  \n\nThere was a sudden rummaging",
    "chunk_order_index": 2,
    "full_doc_id": "doc-6408de1ccca0fa2fd39f62dfe301feff"
  },
  "chunk-abaa098db0fa87e0b8bd3d1f836f6047": {
    "tokens": 1200,
    "content": ", asphodel and wormwood make a sleeping potion so powerful it is known as the Draught of Living Death.  \n\nA bezoar is a stone taken from the stomach of a goat and it will save  you  from  most  poisons.  As  for  monkshood  and wolfsbane, they are the same plant, which also goes by the name of aconite. Well? Why aren’t you all copying that down?”  \n\nThere was a sudden rummaging for quills and parchment. Over the noise, Snape said, “And a point will be taken from GryŃndor House for your cheek, Potter.”  \n\nThings didn’t improve for the GryŃndors as the Potions lesson continued. Snape put them all into pairs and set them to mixing up a simple potion to cure boils. He swept around in his long black cloak, watching them weigh dried nettles and crush snake fangs, criticizing almost everyone except Malfoy, whom he seemed to like. He was just telling everyone to look at the perfect way Malfoy had stewed his horned slugs when clouds of acid green smoke and a loud hissing Łlled the dungeon. Neville had somehow managed to melt Seamus’s cauldron into a twisted blob, and their potion was seeping across the stone łoor, burning holes in people’s shoes. Within seconds, the whole class was standing on their stools while Neville, who had been drenched in the potion when the cauldron collapsed, moaned in pain as angry red boils sprang up all over his arms and legs.  \n\n“Idiot boy!” snarled Snape, clearing the spilled potion away with one wave of his wand. “I suppose you added the porcupine quills before taking the cauldron oŀ the Łre?”  \n\nNeville whimpered as boils started to pop up all over his nose.  \n\n“Take him up to the hospital wing,” Snape spat at Seamus. Then he rounded on Harry and Ron, who had been working next to Neville.  \n\n“You—Potter—why didn’t you tell him not to add the quills? Thought he’d make you look good if he got it wrong, did you? That’s another point you’ve lost for GryŃndor.”  \n\nThis was so unfair that Harry opened his mouth to argue, but Ron kicked him behind their cauldron.  \n\n“Don’t push it,” he muttered, “I’ve heard Snape can turn very nasty.”  \n\nAs they climbed the steps out of the dungeon an hour later, Harry’s mind was racing and his spirits were low. He’d lost two points for GryŃndor in his very Łrst week—why did Snape hate him so much?  \n\n“Cheer up,” said Ron, “Snape’s always taking points oŀ Fred and George. Can I come and meet Hagrid with you?”  \n\nAt Łve to three they left the castle and made their way across the grounds. Hagrid lived in a small wooden house on the edge of the forbidden forest. A crossbow and a pair of galoshes were outside the front door.  \n\nWhen Harry knocked they heard a frantic scrabbling from inside and several booming barks. Then Hagrid’s voice rang out, saying, “Back, Fang—back.”  \n\nHagrid’s big, hairy face appeared in the crack as he pulled the door open.  \n\n“Hang on,” he said. “Back, Fang.”  \n\nHe let them in, struggling to keep a hold on the collar of an enormous black boarhound.  \n\nThere was only one room inside. Hams and pheasants were hanging from the ceiling, a copper kettle was boiling on the open Łre, and in the corner stood a massive bed with a patchwork quilt over it.  \n\n“Make yerselves at home,” said Hagrid, letting go of Fang, who bounded straight at Ron and started licking his ears. Like Hagrid, Fang was clearly not as Łerce as he looked.  \n\n“This is Ron,” Harry told Hagrid, who was pouring boiling water into a large teapot and putting rock cakes onto a plate.  \n\n“Another Weasley, eh?” said Hagrid, glancing at Ron’s freckles. “I spent half me life chasin’ yer twin brothers away from the forest.”  \n\nThe rock cakes were shapeless lumps with raisins that almost broke their teeth, but Harry and Ron pretended to be enjoying them as they told Hagrid all about their Łrst lessons. Fang rested his head on Harry’s knee and drooled all over his robes.  \n\nHarry and Ron were delighted to hear Hagrid call Filch “that old git.”  \n\n“An’ as fer that cat, Mrs. Norris, I’d like ter introduce her to Fang sometime. D’yeh know, every time I go up ter the school, she follows me everywhere? Can’t get rid of her—Filch puts her up to it.”  \n\nHarry told Hagrid about Snape’s lesson. Hagrid, like Ron, told Harry not to worry about it, that Snape liked hardly any of the students.  \n\n“But he seemed to really hate me.”  \n\n“Rubbish!” said Hagrid. “Why should he?”  \n\nYet Harry couldn’t help thinking that Hagrid didn’t quite meet his eyes when he said that.  \n\n“How’s yer brother Charlie?” Hagrid asked Ron. “I liked him a lot—great with animals.”  \n\nHarry wondered if Hagrid had changed the subject on purpose. While Ron told Hagrid all about Charlie’s work with dragons, Harry picked up a piece of paper that was lying on the table under the tea cozy. It was a cutting from the Daily Prophet:  \n\n# GRINGOTTS BREAK-IN LATEST  \n\nInvestigations continue into the break-in at Gr",
    "chunk_order_index": 3,
    "full_doc_id": "doc-6408de1ccca0fa2fd39f62dfe301feff"
  },
  "chunk-06ffa77db0e92bff5a14316d020c91e0": {
    "tokens": 1200,
    "content": "he said that.  \n\n“How’s yer brother Charlie?” Hagrid asked Ron. “I liked him a lot—great with animals.”  \n\nHarry wondered if Hagrid had changed the subject on purpose. While Ron told Hagrid all about Charlie’s work with dragons, Harry picked up a piece of paper that was lying on the table under the tea cozy. It was a cutting from the Daily Prophet:  \n\n# GRINGOTTS BREAK-IN LATEST  \n\nInvestigations continue into the break-in at Gringotts on 31 July, widely believed to be the work of Dark wizards or witches unknown.  \n\nGringotts goblins today insisted that nothing had been taken. The vault that was searched had in fact been emptied the same day.  \n\n“But we’re not telling you what was in there, so keep your noses out if you know what’s good for you,” said a Gringotts spokesgoblin this afternoon.  \n\nHarry remembered Ron telling him on the train that someone had tried to rob Gringotts, but Ron hadn’t mentioned the date.  \n\n“Hagrid!” said Harry, “that Gringotts break-in happened on my birthday! It might’ve been happening while we were there!”  \n\nThere was no doubt about it, Hagrid deŁnitely didn’t meet Harry’s eyes this time. He grunted and oŀered him another rock cake. Harry read the story again. The vault that was searched had in fact been emptied earlier that same day. Hagrid had emptied vault seven hundred and thirteen, if you could call it emptying, taking out that grubby little package. Had that been what the thieves were looking for?  \n\nAs Harry and Ron walked back to the castle for dinner, their pockets weighed down with rock cakes they’d been too polite to refuse, Harry thought that none of the lessons he’d had so far had given him as much to think about as tea with Hagrid. Had Hagrid collected that package just in time? Where was it now? And did Hagrid know something about Snape that he didn’t want to tell Harry?  \n\n![](images/image_2.jpg)  \n\narry had never believed he would meet a boy he hated more than Dudley, but that was before he met Draco Malfoy. Still, Łrst-year GryŃndors only had Potions with the Slytherins, so they didn’t have to put up with Malfoy much. Or at least, they didn’t until they spotted a notice pinned up in the GryŃndor common room that made them all groan. Flying lessons would be starting on Thursday—and GryŃndor and Slytherin would be learning together.  \n\n“Typical,” said Harry darkly. “Just what I always wanted. To make a fool of myself on a broomstick in front of Malfoy.”  \n\nHe had been looking forward to learning to ły more than anything else.  \n\n“You don’t know that you’ll make a fool of yourself,” said Ron reasonably. “Anyway, I know Malfoy’s always going on about how good he is at Quidditch, but I bet that’s all talk.”  \n\nMalfoy certainly did talk about łying a lot. He complained loudly about Łrst years never getting on the House Quidditch teams and told long, boastful stories that always seemed to end with him narrowly escaping Muggles in helicopters. He wasn’t the only one, though: the way Seamus Finnigan told it, he’d  spent  most  of  his  childhood  zooming  around  the countryside on his broomstick. Even Ron would tell anyone who’d listen about the time he’d almost hit a hang glider on Charlie’s old broom. Everyone from wizarding families talked about  Quidditch  constantly.  Ron  had  already  had  a  big argument with Dean Thomas, who shared their dormitory, about soccer. Ron couldn’t see what was exciting about a game with only one ball where no one was allowed to ły. Harry had caught Ron prodding Dean’s poster of West Ham soccer team, trying to make the players move.  \n\nNeville had never been on a broomstick in his life, because his grandmother had never let him near one. Privately, Harry felt she’d had good reason, because Neville managed to have an extraordinary number of accidents even with both feet on the ground.  \n\nHermione Granger was almost as nervous about łying as Neville was. This was something you couldn’t learn by heart out of a book—not that she hadn’t tried. At breakfast on Thursday she bored them all stupid with łying tips she’d gotten out of a library book called Quidditch Through the Ages. Neville was hanging on to her every word, desperate for anything that might help him hang on to his broomstick later, but everybody else was very pleased when Hermione’s lecture was interrupted by the arrival of the mail.  \n\nHarry  hadn’t  had  a  single  letter  since  Hagrid’s  note, something that Malfoy had been quick to notice, of course. Malfoy’s eagle owl was always bringing him packages of sweets  from  home,  which  he  opened  gloatingly  at  the Slytherin table.  \n\nA barn owl brought Neville a small package from his grandmother. He opened it excitedly and showed them a glass ball the size of a large marble, which seemed to be full of white smoke.  \n\n“It’s a Remembrall!” he explained. “Gran knows I forget things—this tells you if there’s something you’ve forgotten to do. Look, you hold it tight like this and if it turns red—oh...” His face  fell,  because  the  Remembrall  had  suddenly  glowed scarlet, “...you’ve forgotten something...”  \n\nNev",
    "chunk_order_index": 4,
    "full_doc_id": "doc-6408de1ccca0fa2fd39f62dfe301feff"
  },
  "chunk-ba2a5193ac2998bff39f8309bb5d539f": {
    "tokens": 1200,
    "content": "showed them a glass ball the size of a large marble, which seemed to be full of white smoke.  \n\n“It’s a Remembrall!” he explained. “Gran knows I forget things—this tells you if there’s something you’ve forgotten to do. Look, you hold it tight like this and if it turns red—oh...” His face  fell,  because  the  Remembrall  had  suddenly  glowed scarlet, “...you’ve forgotten something...”  \n\nNeville was trying to remember what he’d forgotten when Draco Malfoy, who was passing the GryŃndor table, snatched the Remembrall out of his hand.  \n\nHarry and Ron jumped to their feet. They were half hoping for a reason to Łght Malfoy, but Professor McGonagall, who could spot trouble quicker than any teacher in the school, was there in a łash.  \n\n“What’s going on?”  \n\n“Malfoy’s got my Remembrall, Professor.”  \n\nScowling, Malfoy quickly dropped the Remembrall back on the table.  \n\n“Just looking,” he said, and he sloped away with Crabbe and Goyle behind him.  \n\nAt three-thirty that afternoon, Harry, Ron, and the other GryŃndors hurried down the front steps onto the grounds for their Łrst łying lesson. It was a clear, breezy day, and the grass rippled under their feet as they marched down the sloping lawns toward a smooth, łat lawn on the opposite side of the grounds to the forbidden forest, whose trees were swaying darkly in the distance.  \n\nThe Slytherins were already there, and so were twenty broomsticks lying in neat lines on the ground. Harry had heard Fred and George Weasley complain about the school brooms, saying that some of them started to vibrate if you łew too high, or always łew slightly to the left.  \n\nTheir teacher, Madam Hooch, arrived. She had short, gray hair, and yellow eyes like a hawk.  \n\n“Well, what are you all waiting for?” she barked. “Everyone stand by a broomstick. Come on, hurry up.”  \n\nHarry glanced down at his broom. It was old and some of the twigs stuck out at odd angles.  \n\n“Stick out your right hand over your broom,” called Madam Hooch at the front, “and say ‘Up!’”  \n\n“UP!” everyone shouted.  \n\nHarry’s broom jumped into his hand at once, but it was one of the few that did. Hermione Granger’s had simply rolled over on the ground, and Neville’s hadn’t moved at all. Perhaps brooms, like horses, could tell when you were afraid, thought Harry; there was a quaver in Neville’s voice that said only too clearly that he wanted to keep his feet on the ground.  \n\nMadam Hooch then showed them how to mount their brooms without sliding oŀ the end, and walked up and down the rows correcting their grips. Harry and Ron were delighted when she told Malfoy he’d been doing it wrong for years.  \n\n“Now, when I blow my whistle, you kick oŀ from the ground, hard,” said Madam Hooch. “Keep your brooms steady, rise a few feet, and then come straight back down by leaning forward slightly. On my whistle—three—two—”  \n\nBut Neville, nervous and jumpy and frightened of being left on the ground, pushed oŀ hard before the whistle had touched Madam Hooch’s lips.  \n\n“Come back, boy!” she shouted, but Neville was rising straight up like a cork shot out of a bottle—twelve feet— twenty feet. Harry saw his scared white face look down at the ground falling away, saw him gasp, slip sideways oŀ the broom and—  \n\nWHAM—a thud and a nasty crack and Neville lay facedown on the grass in a heap. His broomstick was still rising higher and higher, and started to drift lazily toward the forbidden forest and out of sight.  \n\nMadam Hooch was bending over Neville, her face as white as his.  \n\n“Broken wrist,” Harry heard her mutter. “Come on, boy—it’s all right, up you get.”  \n\nShe turned to the rest of the class.  \n\n“None of you is to move while I take this boy to the hospital wing! You leave those brooms where they are or you’ll be out of Hogwarts before you can say ‘Quidditch.’ Come on, dear.”  \n\nNeville, his face tear-streaked, clutching his wrist, hobbled oŀ with Madam Hooch, who had her arm around him.  \n\nNo sooner were they out of earshot than Malfoy burst into laughter.  \n\n“Did you see his face, the great lump?”  \n\nThe other Slytherins joined in.  \n\n“Shut up, Malfoy,” snapped Parvati Patil.  \n\n“Ooh, sticking up for Longbottom?” said Pansy Parkinson, a hard-faced Slytherin girl. “Never thought you’d like fat little crybabies, Parvati.”  \n\n“Look!”  said  Malfoy,  darting  forward  and  snatching something  out  of  the  grass.  “It’s  that  stupid  thing Longbottom’s gran sent him.”  \n\nThe Remembrall glittered in the sun as he held it up.  \n\n“Give  that  here,  Malfoy,”  said  Harry  quietly.  Everyone stopped talking to watch.  \n\nMalfoy smiled nastily.  \n\n“I think I’ll leave it somewhere for Longbottom to Łnd— how about—up a tree?”",
    "chunk_order_index": 5,
    "full_doc_id": "doc-6408de1ccca0fa2fd39f62dfe301feff"
  },
  "chunk-310f083925d4bd57b82c2aa442b90336": {
    "tokens": 1200,
    "content": "out  of  the  grass.  “It’s  that  stupid  thing Longbottom’s gran sent him.”  \n\nThe Remembrall glittered in the sun as he held it up.  \n\n“Give  that  here,  Malfoy,”  said  Harry  quietly.  Everyone stopped talking to watch.  \n\nMalfoy smiled nastily.  \n\n“I think I’ll leave it somewhere for Longbottom to Łnd— how about—up a tree?”  \n\n“Give it here!” Harry yelled, but Malfoy had leapt onto his broomstick and taken oŀ. He hadn’t been lying, he could ły well. Hovering level with the topmost branches of an oak he called, “Come and get it, Potter!”  \n\nHarry grabbed his broom.  \n\n“No!” shouted Hermione Granger. “Madam Hooch told us not to move—you’ll get us all into trouble.”  \n\nHarry ignored her. Blood was pounding in his ears. He mounted the broom and kicked hard against the ground and up, up he soared; air rushed through his hair, and his robes whipped out behind him—and in a rush of Łerce joy he realized he’d found something he could do without being taught—this was easy, this was wonderful. He pulled his broomstick up a little to take it even higher, and heard screams and gasps of girls back on the ground and an admiring whoop from Ron.  \n\nHe turned his broomstick sharply to face Malfoy in midair. Malfoy looked stunned.  \n\n“Give it here,” Harry called, “or I’ll knock you oŀ that broom!”  \n\n“Oh,  yeah?”  said  Malfoy,  trying  to  sneer,  but  looking worried.  \n\nHarry knew, somehow, what to do. He leaned forward and grasped the broom tightly in both hands, and it shot toward Malfoy like a javelin. Malfoy only just got out of the way in time; Harry made a sharp about-face and held the broom steady. A few people below were clapping.  \n\n“No Crabbe and Goyle up here to save your neck, Malfoy,” Harry called.  \n\nThe same thought seemed to have struck Malfoy.  \n\n“Catch it if you can, then!” he shouted, and he threw the glass ball high into the air and streaked back toward the ground.  \n\nHarry saw, as though in slow motion, the ball rise up in the air and then start to fall. He leaned forward and pointed his broom handle down—next second he was gathering speed in a steep dive, racing the ball—wind whistled in his ears, mingled with the screams of people watching—he stretched out his hand—a foot from the ground he caught it, just in time to pull his broom straight, and he toppled gently onto the grass with the Remembrall clutched safely in his Łst.  \n\n“HARRY POTTER!”  \n\nHis  heart  sank  faster  than  he’d  just  dived.  Professor McGonagall was running toward them. He got to his feet, trembling.  \n\n“Never—in all my time at Hogwarts—”  \n\nProfessor McGonagall was almost speechless with shock, and her glasses łashed furiously, “—how dare you—might have broken your neck—”  \n\n“It wasn’t his fault, Professor—”  \n\n“Be quiet, Miss Patil—”  \n\n“But Malfoy—”  \n\n“That’s enough, Mr. Weasley. Potter, follow me, now.”  \n\nHarry  caught  sight  of  Malfoy,  Crabbe,  and  Goyle’s triumphant faces as he left, walking numbly in Professor McGonagall’s wake as she strode toward the castle. He was going to be expelled, he just knew it. He wanted to say something  to  defend  himself,  but  there  seemed  to  be something wrong with his voice. Professor McGonagall was sweeping along without even looking at him; he had to jog to keep up. Now he’d done it. He hadn’t even lasted two weeks. He’d be packing his bags in ten minutes. What would the Dursleys say when he turned up on the doorstep?  \n\nUp the front steps, up the marble staircase inside, and still Professor McGonagall didn’t say a word to him. She wrenched open doors and marched along corridors with Harry trotting miserably  behind  her.  Maybe  she  was  taking  him  to Dumbledore. He thought of Hagrid, expelled but allowed to stay on as gamekeeper. Perhaps he could be Hagrid’s assistant. His stomach twisted as he imagined it, watching Ron and the others becoming wizards while he stumped around the grounds carrying Hagrid’s bag.  \n\nProfessor McGonagall stopped outside a classroom. She opened the door and poked her head inside.  \n\n“Excuse me, Professor Flitwick, could I borrow Wood for a moment?”  \n\nWood? thought Harry, bewildered; was Wood a cane she was going to use on him?  \n\nBut Wood turned out to be a person, a burly Łfth-year boy who came out of Flitwick’s class looking confused.  \n\n“Follow me, you two,” said Professor McGonagall, and they marched on up the corridor, Wood looking curiously at Harry.  \n\n“In here.”  \n\nProfessor McGonagall pointed them into a classroom that was empty except for Peeves, who was busy writing rude words on the blackboard.  \n\n“Out, Peeves!” she barked. Peeves threw the chalk into a bin, which clanged loudly",
    "chunk_order_index": 6,
    "full_doc_id": "doc-6408de1ccca0fa2fd39f62dfe301feff"
  },
  "chunk-6c4884bd9e0acab8a6f09268e9289f7a": {
    "tokens": 1200,
    "content": "out of Flitwick’s class looking confused.  \n\n“Follow me, you two,” said Professor McGonagall, and they marched on up the corridor, Wood looking curiously at Harry.  \n\n“In here.”  \n\nProfessor McGonagall pointed them into a classroom that was empty except for Peeves, who was busy writing rude words on the blackboard.  \n\n“Out, Peeves!” she barked. Peeves threw the chalk into a bin, which clanged loudly, and he swooped out cursing. Professor McGonagall slammed the door behind him and turned to face the two boys.  \n\n“Potter, this is Oliver Wood. Wood—I’ve found you a Seeker.”  \n\nWood’s expression changed from puzzlement to delight.  \n\n“Are you serious, Professor?”  \n\n“Absolutely,” said Professor McGonagall crisply. “The boy’s a natural. I’ve never seen anything like it. Was that your Łrst time on a broomstick, Potter?”  \n\nHarry nodded silently. He didn’t have a clue what was going on, but he didn’t seem to be being expelled, and some of the feeling started coming back to his legs.  \n\n“He caught that thing in his hand after a Łfty-foot dive,” Professor  McGonagall  told  Wood.  “Didn’t  even  scratch himself. Charlie Weasley couldn’t have done it.”  \n\nWood was now looking as though all his dreams had come true at once.  \n\n“Ever seen a game of Quidditch, Potter?” he asked excitedly.  \n\n“Wood’s  captain  of  the  GryŃndor  team,”  Professor McGonagall explained.  \n\n“He’s just the build for a Seeker, too,” said Wood, now walking around Harry and staring at him. “Light—speedy— we’ll have to get him a decent broom, Professor—a Nimbus Two Thousand or a Cleansweep Seven, I’d say.”  \n\n“I shall speak to Professor Dumbledore and see if we can’t bend the Łrst-year rule. Heaven knows, we need a better team than last year. Flattened in that last match by Slytherin, I couldn’t look Severus Snape in the face for weeks....”  \n\nProfessor McGonagall peered sternly over her glasses at Harry.  \n\n“I want to hear you’re training hard, Potter, or I may change my mind about punishing you.”  \n\nThen she suddenly smiled.  \n\n“Your father would have been proud,” she said. “He was an excellent Quidditch player himself.”  \n\n“You’re joking.”  \n\nIt was dinnertime. Harry had just Łnished telling Ron what had happened when he’d left the grounds with Professor McGonagall. Ron had a piece of steak and kidney pie halfway to his mouth, but he’d forgotten all about it.  \n\n“Seeker?” he said. “But Łrst years never—you must be the youngest House player in about—”  \n\n“—a century,” said Harry, shoveling pie into his mouth. He felt particularly hungry after the excitement of the afternoon. “Wood told me.”  \n\nRon was so amazed, so impressed, he just sat and gaped at Harry.  \n\n“I start training next week,” said Harry. “Only don’t tell anyone, Wood wants to keep it a secret.”  \n\nFred and George Weasley now came into the hall, spotted Harry, and hurried over.  \n\n“Well done,” said George in a low voice. “Wood told us. We’re on the team too—Beaters.”  \n\n“I tell you, we’re going to win that Quidditch Cup for sure this year,” said Fred. “We haven’t won since Charlie left, but this year’s team is going to be brilliant. You must be good, Harry, Wood was almost skipping when he told us.”  \n\n“Anyway, we’ve got to go, Lee Jordan reckons he’s found a new secret passageway out of the school.”  \n\n“Bet it’s that one behind the statue of Gregory the Smarmy that we found in our Łrst week. See you.”  \n\nFred and George had hardly disappeared when someone far less welcome turned up: Malfoy, łanked by Crabbe and Goyle.  \n\n“Having a last meal, Potter? When are you getting the train back to the Muggles?”  \n\n“You’re a lot braver now that you’re back on the ground and you’ve got your little friends with you,” said Harry coolly. There was of course nothing at all little about Crabbe and Goyle, but as the High Table was full of teachers, neither of them could do more than crack their knuckles and scowl.  \n\n“I’d take you on anytime on my own,” said Malfoy. “Tonight, if you want. Wizard’s duel. Wands only—no contact. What’s the matter? Never heard of a wizard’s duel before, I suppose?”  \n\n“Of course he has,” said Ron, wheeling around. “I’m his second, who’s yours?”  \n\nMalfoy looked at Crabbe and Goyle, sizing them up.  \n\n“Crabbe,” he said. “Midnight all right? We’ll meet you in the trophy room; that’s always unlocked.”  \n\nWhen Malfoy had gone, Ron and Harry looked at each other.  \n\n“What is a wizard’s duel?” said Harry. “And what do you mean, you’re my second?”  \n\n“Well, a second’s there to take over if you die,” said Ron casually, getting started at last on his cold pie. Catching the look on Harry’s face, he added quickly, “But people only die in proper duels, you know, with real wizards. The most you and",
    "chunk_order_index": 7,
    "full_doc_id": "doc-6408de1ccca0fa2fd39f62dfe301feff"
  },
  "chunk-6e08cb67a0ad40da6db1b790590ec79c": {
    "tokens": 1200,
    "content": "When Malfoy had gone, Ron and Harry looked at each other.  \n\n“What is a wizard’s duel?” said Harry. “And what do you mean, you’re my second?”  \n\n“Well, a second’s there to take over if you die,” said Ron casually, getting started at last on his cold pie. Catching the look on Harry’s face, he added quickly, “But people only die in proper duels, you know, with real wizards. The most you and Malfoy’ll be able to do is send sparks at each other. Neither of you knows enough magic to do any real damage. I bet he expected you to refuse, anyway.”  \n\n“And what if I wave my wand and nothing happens?”  \n\n“Throw it away and punch him on the nose,” Ron suggested. “Excuse me.”  \n\nThey both looked up. It was Hermione Granger.  \n\n“Can’t a person eat in peace in this place?” said Ron.  \n\nHermione ignored him and spoke to Harry.  \n\n“I couldn’t help overhearing what you and Malfoy were saying—”  \n\n“Bet you could,” Ron muttered.  \n\n“—and you mustn’t go wandering around the school at night, think of the points you’ll lose GryŃndor if you’re caught, and you’re bound to be. It’s really very selŁsh of you.”  \n\n“And it’s really none of your business,” said Harry.  \n\n“Good-bye,” said Ron.  \n\nAll the same, it wasn’t what you’d call the perfect end to the day, Harry thought, as he lay awake much later listening to Dean and Seamus falling asleep (Neville wasn’t back from the hospital wing). Ron had spent all evening giving him advice such as “If he tries to curse you, you’d better dodge it, because I can’t remember how to block them.” There was a very good chance they were going to get caught by Filch or Mrs. Norris, and Harry felt he was pushing his luck, breaking another school rule today. On the other hand, Malfoy’s sneering face kept looming up out of the darkness—this was his big chance to beat Malfoy face-to-face. He couldn’t miss it.  \n\n“Half-past eleven,” Ron muttered at last, “we’d better go.”  \n\nThey pulled on their bathrobes, picked up their wands, and crept across the tower room, down the spiral staircase, and into the GryŃndor common room. A few embers were still glowing in the Łreplace, turning all the armchairs into hunched black shadows. They had almost reached the portrait hole when a voice spoke from the chair nearest them, “I can’t believe you’re going to do this, Harry.”  \n\nA lamp łickered on. It was Hermione Granger, wearing a pink bathrobe and a frown.  \n\n“You!” said Ron furiously. “Go back to bed!”  \n\n“I almost told your brother,” Hermione snapped, “Percy— he’s a prefect, he’d put a stop to this.”  \n\nHarry couldn’t believe anyone could be so interfering.  \n\n“Come on,” he said to Ron. He pushed open the portrait of the Fat Lady and climbed through the hole.  \n\nHermione wasn’t going to give up that easily. She followed Ron through the portrait hole, hissing at them like an angry goose.  \n\n“Don’t you care about GryŃndor, do you only care about yourselves, I don’t want Slytherin to win the House Cup, and you’ll lose all the points I got from Professor McGonagall for knowing about Switching Spells.”  \n\n“Go away.”  \n\n“All right, but I warned you, you just remember what I said when you’re on the train home tomorrow, you’re so—”  \n\nBut what they were, they didn’t Łnd out. Hermione had turned to the portrait of the Fat Lady to get back inside and found herself facing an empty painting. The Fat Lady had gone on  a  nighttime  visit  and  Hermione  was  locked  out  of GryŃndor Tower.  \n\n“Now what am I going to do?” she asked shrilly.  \n\n“That’s your problem,” said Ron. “We’ve got to go, we’re going to be late.”  \n\nThey hadn’t even reached the end of the corridor when Hermione caught up with them.  \n\n“I’m coming with you,” she said.  \n\n“You are not.”  \n\n“D’you think I’m going to stand out here and wait for Filch to catch me? If he Łnds all three of us I’ll tell him the truth, that I was trying to stop you, and you can back me up.”  \n\n“You’ve got some nerve—” said Ron loudly.  \n\n“Shut  up,  both  of  you!”  said  Harry  sharply.  “I  heard something.”  \n\nIt was a sort of snuńing.  \n\n“Mrs. Norris?” breathed Ron, squinting through the dark.  \n\nIt wasn’t Mrs. Norris. It was Neville. He was curled up on the łoor, fast asleep, but jerked suddenly awake as they crept nearer.  \n\n“Thank goodness you found me! I’ve been out here for hours, I couldn’t remember the new password to get in to bed.”  \n\n“Keep your voice down, Neville. The password’s ‘Pig snout’ but it won’t help you now, the Fat Lady’s gone oŀ somewhere.”  \n\n“How’s your arm?” said Harry.  \n\n“Fine,”  said  Neville,  showing  them.  “Madam  Pomfrey mended it in about a minute.”  \n\n“Good—well, look, Neville, we’ve got to be somewhere",
    "chunk_order_index": 8,
    "full_doc_id": "doc-6408de1ccca0fa2fd39f62dfe301feff"
  },
  "chunk-d865b847d29d2ff2e0e4cc58c036cc17": {
    "tokens": 1200,
    "content": "’t remember the new password to get in to bed.”  \n\n“Keep your voice down, Neville. The password’s ‘Pig snout’ but it won’t help you now, the Fat Lady’s gone oŀ somewhere.”  \n\n“How’s your arm?” said Harry.  \n\n“Fine,”  said  Neville,  showing  them.  “Madam  Pomfrey mended it in about a minute.”  \n\n“Good—well, look, Neville, we’ve got to be somewhere, we’ll see you later—”  \n\n“Don’t leave me!” said Neville, scrambling to his feet, “I don’t want to stay here alone, the Bloody Baron’s been past twice already.”  \n\nRon looked at his watch and then glared furiously at Hermione and Neville.  \n\n“If either of you get us caught, I’ll never rest until I’ve learned that Curse of the Bogies Quirrell told us about, and used it on you.”  \n\nHermione opened her mouth, perhaps to tell Ron exactly how to use the Curse of the Bogies, but Harry hissed at her to be quiet and beckoned them all forward.  \n\nThey łitted along corridors striped with bars of moonlight from the high windows. At every turn Harry expected to run into Filch or Mrs. Norris, but they were lucky. They sped up a staircase to the third łoor and tiptoed toward the trophy room.  \n\nMalfoy and Crabbe weren’t there yet. The crystal trophy cases glimmered where the moonlight caught them. Cups, shields, plates, and statues winked silver and gold in the darkness. They edged along the walls, keeping their eyes on the doors at either end of the room. Harry took out his wand in case Malfoy leapt in and started at once. The minutes crept by.  \n\n“He’s late, maybe he’s chickened out,” Ron whispered.  \n\nThen a noise in the next room made them jump. Harry had only just raised his wand when they heard someone speak— and it wasn’t Malfoy.  \n\n“Sniŀ around, my sweet, they might be lurking in a corner.”  \n\nIt was Filch speaking to Mrs. Norris. Horror-struck, Harry waved madly at the other three to follow him as quickly as possible; they scurried silently toward the door, away from Filch’s voice. Neville’s robes had barely whipped round the corner when they heard Filch enter the trophy room.  \n\n“They’re in here somewhere,” they heard him mutter, “probably hiding.”  \n\n“This way!” Harry mouthed to the others and, petriŁed, they began to creep down a long gallery full of suits of armor. They could hear Filch getting nearer. Neville suddenly let out a frightened squeak and broke into a run—he tripped, grabbed Ron around the waist, and the pair of them toppled right into a suit of armor.  \n\nThe clanging and crashing were enough to wake the whole castle.  \n\n“RUN!” Harry yelled, and the four of them sprinted down the gallery, not looking back to see whether Filch was following— they swung around the doorpost and galloped down one corridor then another, Harry in the lead, without any idea where they were or where they were going—they ripped through  a  tapestry  and  found  themselves  in  a  hidden passageway, hurtled along it and came out near their Charms classroom, which they knew was miles from the trophy room.  \n\n“I think we’ve lost him,” Harry panted, leaning against the cold wall and wiping his forehead. Neville was bent double, wheezing and spluttering.  \n\n“I—told—you,” Hermione gasped, clutching at the stitch in her chest, “I—told—you.”  \n\n“We’ve got to get back to GryŃndor Tower,” said Ron, “quickly as possible.”  \n\n“Malfoy tricked you,” Hermione said to Harry. “You realize that, don’t you? He was never going to meet you—Filch knew someone was going to be in the trophy room, Malfoy must have tipped him oŀ.”  \n\nHarry thought she was probably right, but he wasn’t going to tell her that.  \n\n“Let’s go.”  \n\nIt wasn’t going to be that simple. They hadn’t gone more than a dozen paces when a doorknob rattled and something came shooting out of a classroom in front of them.  \n\nIt was Peeves. He caught sight of them and gave a squeal of delight.  \n\n“Shut up, Peeves—please—you’ll get us thrown out.”  \n\nPeeves cackled.  \n\n“Wandering around at midnight, Ickle Firsties? Tut, tut, tut. Naughty, naughty, you’ll get caughty.”  \n\n“Not if you don’t give us away, Peeves, please.”  \n\n“Should tell Filch, I should,” said Peeves in a saintly voice, but his eyes glittered wickedly. “It’s for your own good, you know.”  \n\n“Get out of the way,” snapped Ron, taking a swipe at Peeves —this was a big mistake.  \n\n“STUDENTS OUT OF BED!” Peeves bellowed, “STUDENTS OUT OF BED DOWN THE CHARMS CORRIDOR!”  \n\nDucking under Peeves, they ran for their lives, right to the end of the corridor where they slammed into a door—and it was locked.  \n\n“This is it!” Ron moaned, as they pushed helplessly at the door, “We’re done for! This is the end!”  \n\nThey could hear footsteps, Filch running as fast as he could toward Peeves’s shouts.  \n\n“Oh, move over,” Hermione snarled. She grabbed Harry’s",
    "chunk_order_index": 9,
    "full_doc_id": "doc-6408de1ccca0fa2fd39f62dfe301feff"
  },
  "chunk-a1edc245201e7be1315ca83becb21d74": {
    "tokens": 1200,
    "content": "MS CORRIDOR!”  \n\nDucking under Peeves, they ran for their lives, right to the end of the corridor where they slammed into a door—and it was locked.  \n\n“This is it!” Ron moaned, as they pushed helplessly at the door, “We’re done for! This is the end!”  \n\nThey could hear footsteps, Filch running as fast as he could toward Peeves’s shouts.  \n\n“Oh, move over,” Hermione snarled. She grabbed Harry’s wand, tapped the lock, and whispered, “Alohomora!”  \n\nThe lock clicked and the door swung open—they piled through it, shut it quickly, and pressed their ears against it, listening.  \n\n“Which way did they go, Peeves?” Filch was saying. “Quick, tell me.”  \n\n“Say ‘please.’”  \n\n“Don’t mess with me, Peeves, now where did they go?”  \n\n“Shan’t say nothing if you don’t say please,” said Peeves in his annoying singsong voice.  \n\n“All right—please.”  \n\n“NOTHING! Ha haaa! Told you I wouldn’t say nothing if you didn’t say please! Ha ha! Haaaaaa!” And they heard the sound of Peeves whooshing away and Filch cursing in rage.  \n\n“He thinks this door is locked,” Harry whispered. “I think we’ll be okay—get oŀ, Neville!” For Neville had been tugging on the sleeve of Harry’s bathrobe for the last minute. “What?”  \n\nHarry turned around—and saw, quite clearly, what. For a moment, he was sure he’d walked into a nightmare—this was too much, on top of everything that had happened so far.  \n\nThey weren’t in a room, as he had supposed. They were in a corridor. The forbidden corridor on the third łoor. And now they knew why it was forbidden.  \n\nThey were looking straight into the eyes of a monstrous dog, a dog that Łlled the whole space between ceiling and łoor. It had three heads. Three pairs of rolling, mad eyes; three noses, twitching and quivering in their direction; three drooling mouths, saliva hanging in slippery ropes from yellowish fangs.  \n\nIt was standing quite still, all six eyes staring at them, and Harry knew that the only reason they weren’t already dead was that their sudden appearance had taken it by surprise, but it was quickly getting over that, there was no mistaking what those thunderous growls meant.  \n\nHarry groped for the doorknob—between Filch and death, he’d take Filch.  \n\nThey fell backward—Harry slammed the door shut, and they ran, they almost łew, back down the corridor. Filch must have hurried oŀ to look for them somewhere else, because they didn’t see him anywhere, but they hardly cared—all they wanted to do was put as much space as possible between them and that monster. They didn’t stop running until they reached the portrait of the Fat Lady on the seventh łoor.  \n\n“Where on earth have you all been?” she asked, looking at their bathrobes hanging oŀ their shoulders and their łushed, sweaty faces.  \n\n“Never mind that—pig snout, pig snout,” panted Harry, and the  portrait  swung  forward.  They  scrambled  into  the common room and collapsed, trembling, into armchairs.  \n\nIt was a while before any of them said anything. Neville, indeed, looked as if he’d never speak again.  \n\n“What do they think they’re doing, keeping a thing like that locked up in a school?” said Ron Łnally. “If any dog needs exercise, that one does.”  \n\nHermione had got both her breath and her bad temper back again.  \n\n“You don’t use your eyes, any of you, do you?” she snapped. “Didn’t you see what it was standing on?”  \n\n“The łoor?” Harry suggested. “I wasn’t looking at its feet, I was too busy with its heads.”  \n\n“No, not the łoor. It was standing on a trapdoor. It’s obviously guarding something.”  \n\nShe stood up, glaring at them.  \n\n“I hope you’re pleased with yourselves. We could all have been killed—or worse, expelled. Now, if you don’t mind, I’m going to bed.”  \n\nRon stared after her, his mouth open.  \n\n“No, we don’t mind,” he said. “You’d think we dragged her along, wouldn’t you?”  \n\nBut Hermione had given Harry something else to think about as he climbed back into bed. The dog was guarding something....What had Hagrid said? Gringotts was the safest place in the world for something you wanted to hide—except perhaps Hogwarts.  \n\nIt looked as though Harry had found out where the grubby little package from vault seven hundred and thirteen was.  \n\n![](images/image_3.jpg)  \n\nalfoy couldn’t believe his eyes when he saw that Harry and Ron were still at Hogwarts the next day, looking tired but perfectly cheerful. Indeed, by the next morning Harry and Ron thought that meeting the three-headed dog had been an excellent adventure, and they were quite keen to have another one. In the meantime, Harry Łlled Ron in about the package that seemed to have been moved from Gringotts to Hogwarts, and they spent a lot of time wondering what could possibly need such heavy protection.  \n\n“It’s either really valuable or really dangerous,” said Ron.   \n“Or both,” said Harry.  \n\nBut as all they knew for sure about the mysterious object was that it was about two inches long, they didn’t have much chance of guessing what it was without further clues.  \n\nNeither Neville nor Hermione showed the slightest interest in what lay",
    "chunk_order_index": 10,
    "full_doc_id": "doc-6408de1ccca0fa2fd39f62dfe301feff"
  },
  "chunk-9baf1b55d537350c5d3a289a34bcfd18": {
    "tokens": 1200,
    "content": "the package that seemed to have been moved from Gringotts to Hogwarts, and they spent a lot of time wondering what could possibly need such heavy protection.  \n\n“It’s either really valuable or really dangerous,” said Ron.   \n“Or both,” said Harry.  \n\nBut as all they knew for sure about the mysterious object was that it was about two inches long, they didn’t have much chance of guessing what it was without further clues.  \n\nNeither Neville nor Hermione showed the slightest interest in what lay underneath the dog and the trapdoor. All Neville cared about was never going near the dog again.  \n\nHermione was now refusing to speak to Harry and Ron, but she was such a bossy know-it-all that they saw this as an added bonus. All they really wanted now was a way of getting back at Malfoy, and to their great delight, just such a thing arrived in the mail about a week later.  \n\nAs the owls łooded into the Great Hall as usual, everyone’s attention was caught at once by a long, thin package carried by six large screech owls. Harry was just as interested as everyone else to see what was in this large parcel, and was amazed when the owls soared down and dropped it right in front of him, knocking his bacon to the łoor. They had hardly łuttered out of the way when another owl dropped a letter on top of the parcel.  \n\nHarry ripped open the letter Łrst, which was lucky, because it said:  \n\nDO NOT OPEN THE PARCEL AT THE TABLE.  \n\nIt contains your new Nimbus Two Thousand, but I don’t want everybody knowing you’ve got a broomstick or they’ll all want one.  \n\nOliver Wood will meet you tonight on the Quidditch field at seven o’clock for your first training session.  \n\nProfessor M. McGonagall  \n\nHarry had diŃculty hiding his glee as he handed the note to Ron to read.  \n\n“A Nimbus Two Thousand!” Ron moaned enviously. “I’ve never even touched one.”  \n\nThey  left  the  hall  quickly,  wanting  to  unwrap  the broomstick in private before their Łrst class, but halfway across the entrance hall they found the way upstairs barred by Crabbe and Goyle. Malfoy seized the package from Harry and felt it.  \n\n“That’s a broomstick,” he said, throwing it back to Harry with a mixture of jealousy and spite on his face. “You’ll be in for it this time, Potter, Łrst years aren’t allowed them.”  \n\nRon couldn’t resist it.  \n\n“It’s not any old broomstick,” he said, “it’s a Nimbus Two Thousand. What did you say you’ve got at home, Malfoy, a Comet Two Sixty?” Ron grinned at Harry. “Comets look łashy, but they’re not in the same league as the Nimbus.”  \n\n“What would you know about it, Weasley, you couldn’t aŀord half the handle,” Malfoy snapped back. “I suppose you and your brothers have to save up twig by twig.”  \n\nBefore Ron could answer, Professor Flitwick appeared at Malfoy’s elbow.  \n\n“Not arguing, I hope, boys?” he squeaked.  \n\n“Potter’s been sent a broomstick, Professor,” said Malfoy quickly.  \n\n“Yes, yes, that’s right,” said Professor Flitwick, beaming at Harry. “Professor McGonagall told me all about the special circumstances, Potter. And what model is it?”  \n\n“A Nimbus Two Thousand, sir,” said Harry, Łghting not to laugh at the look of horror on Malfoy’s face. “And it’s really thanks to Malfoy here that I’ve got it,” he added.  \n\nHarry and Ron headed upstairs, smothering their laughter at Malfoy’s obvious rage and confusion.  \n\n“Well, it’s true,” Harry chortled as they reached the top of the marble staircase, “If he hadn’t stolen Neville’s Remembrall I wouldn’t be on the team....”  \n\n“So I suppose you think that’s a reward for breaking rules?” came an angry voice from just behind them. Hermione was stomping up the stairs, looking disapprovingly at the package in Harry’s hand.  \n\n“I thought you weren’t speaking to us?” said Harry.  \n\n“Yes, don’t stop now,” said Ron, “it’s doing us so much good.” Hermione marched away with her nose in the air.  \n\nHarry had a lot of trouble keeping his mind on his lessons that day. It kept wandering up to the dormitory where his new broomstick was lying under his bed, or straying oŀ to the Quidditch Łeld where he’d be learning to play that night. He bolted his dinner that evening without noticing what he was eating, and then rushed upstairs with Ron to unwrap the Nimbus Two Thousand at last.  \n\n“Wow,” Ron sighed, as the broomstick rolled onto Harry’s bedspread.  \n\nEven Harry, who knew nothing about the diŀerent brooms, thought  it  looked  wonderful.  Sleek  and  shiny,  with  a mahogany handle, it had a long tail of neat, straight twigs and Nimbus Two Thousand written in gold near the top.  \n\nAs seven o’clock drew nearer, Harry left the castle and set oŀ in the dusk toward the Quidditch Łeld. He’d never been inside the stadium before. Hundreds of seats were raised in stands around the Łeld so that the spectators were high enough to see what was going on. At either end of the Łeld were  three  golden  poles  with  hoops  on  the  end.  They reminded Harry of the little plastic sticks Muggle",
    "chunk_order_index": 11,
    "full_doc_id": "doc-6408de1ccca0fa2fd39f62dfe301feff"
  },
  "chunk-180a5bee6f03c13ed88096b3e7eda2bd": {
    "tokens": 1200,
    "content": "top.  \n\nAs seven o’clock drew nearer, Harry left the castle and set oŀ in the dusk toward the Quidditch Łeld. He’d never been inside the stadium before. Hundreds of seats were raised in stands around the Łeld so that the spectators were high enough to see what was going on. At either end of the Łeld were  three  golden  poles  with  hoops  on  the  end.  They reminded Harry of the little plastic sticks Muggle children blew bubbles through, except that they were Łfty feet high.  \n\nToo eager to ły again to wait for Wood, Harry mounted his broomstick and kicked oŀ from the ground. What a feeling— he swooped in and out of the goalposts and then sped up and down the Łeld. The Nimbus Two Thousand turned wherever he wanted at his lightest touch.  \n\n“Hey, Potter, come down!”  \n\nOliver Wood had arrived. He was carrying a large wooden crate under his arm. Harry landed next to him.  \n\n“Very nice,” said Wood, his eyes glinting. “I see what McGonagall meant...you really are a natural. I’m just going to teach you the rules this evening, then you’ll be joining team practice three times a week.”  \n\nHe opened the crate. Inside were four diŀerent-sized balls.  \n\n“Right,” said Wood. “Now, Quidditch is easy enough to understand, even if it’s not too easy to play. There are seven players on each side. Three of them are called Chasers.”  \n\n“Three Chasers,” Harry repeated, as Wood took out a bright red ball about the size of a soccer ball.  \n\n“This ball’s called the Quańe,” said Wood. “The Chasers throw the Quańe to each other and try and get it through one of the hoops to score a goal. Ten points every time the Quańe goes through one of the hoops. Follow me?”  \n\n“The Chasers throw the Quańe and put it through the hoops to score,” Harry recited. “So—that’s sort of like basketball on broomsticks with six hoops, isn’t it?”  \n\n“What’s basketball?” said Wood curiously.  \n\n“Never mind,” said Harry quickly.  \n\n“Now, there’s another player on each side who’s called the Keeper—I’m Keeper for GryŃndor. I have to ły around our hoops and stop the other team from scoring.”  \n\n“Three  Chasers,  one  Keeper,”  said  Harry,  who  was determined to remember it all. “And they play with the Quańe. Okay, got that. So what are they for?” He pointed at the three balls left inside the box.  \n\n“I’ll show you now,” said Wood. “Take this.”  \n\nHe handed Harry a small club, a bit like a short baseball bat.  \n\n“I’m going to show you what the Bludgers do,” Wood said. “These two are the Bludgers.”  \n\nHe showed Harry two identical balls, jet black and slightly smaller than the red Quańe. Harry noticed that they seemed to be straining to escape the straps holding them inside the box.  \n\n“Stand back,” Wood warned Harry. He bent down and freed one of the Bludgers.  \n\nAt once, the black ball rose high in the air and then pelted straight at Harry’s face. Harry swung at it with the bat to stop it from breaking his nose, and sent it zigzagging away into the air—it zoomed around their heads and then shot at Wood, who dived on top of it and managed to pin it to the ground.  \n\n“See?” Wood panted, forcing the struggling Bludger back into the crate and strapping it down safely. “The Bludgers rocket around, trying to knock players oŀ their brooms. That’s why you have two Beaters on each team—the Weasley twins are ours—it’s their job to protect their side from the Bludgers and try and knock them toward the other team. So—think you’ve got all that?”  \n\n“Three Chasers try and score with the Quańe; the Keeper guards the goalposts; the Beaters keep the Bludgers away from their team,” Harry reeled oŀ.  \n\n“Very good,” said Wood.  \n\n“Er—have the Bludgers ever killed anyone?” Harry asked, hoping he sounded oŀhand.  \n\n“Never at Hogwarts. We’ve had a couple of broken jaws but nothing worse than that. Now, the last member of the team is the Seeker. That’s you. And you don’t have to worry about the Quańe or the Bludgers—”  \n\n“—unless they crack my head open.”  \n\n“Don’t worry, the Weasleys are more than a match for the Bludgers—I mean, they’re like a pair of human Bludgers themselves.”  \n\nWood reached into the crate and took out the fourth and last ball. Compared with the Quańe and the Bludgers, it was tiny, about the size of a large walnut. It was bright gold and had little łuttering silver wings.  \n\n“This,” said Wood, “is the Golden Snitch, and it’s the most important ball of the lot. It’s very hard to catch because it’s so fast and diŃcult to see. It’s the Seeker’s job to catch it. You’ve got to weave in and out of the Chasers, Beaters, Bludgers, and Quańe to get it before the other team’s Seeker, because whichever Seeker catches the Snitch wins his team an extra hundred and Łfty points, so they nearly always win. That’s why Seekers get fou",
    "chunk_order_index": 12,
    "full_doc_id": "doc-6408de1ccca0fa2fd39f62dfe301feff"
  },
  "chunk-5d277333c3336542d3d42cdf887692f3": {
    "tokens": 1200,
    "content": "of the lot. It’s very hard to catch because it’s so fast and diŃcult to see. It’s the Seeker’s job to catch it. You’ve got to weave in and out of the Chasers, Beaters, Bludgers, and Quańe to get it before the other team’s Seeker, because whichever Seeker catches the Snitch wins his team an extra hundred and Łfty points, so they nearly always win. That’s why Seekers get fouled so much. A game of Quidditch only ends when the Snitch is caught, so it can go on for ages—I think the record is three months, they had to keep bringing on substitutes so the players could get some sleep.  \n\n“Well, that’s it—any questions?”  \n\nHarry shook his head. He understood what he had to do all right, it was doing it that was going to be the problem.  \n\n“We  won’t  practice  with  the  Snitch  yet,”  said  Wood, carefully shutting it back inside the crate, “it’s too dark, we might lose it. Let’s try you out with a few of these.”  \n\nHe pulled a bag of ordinary golf balls out of his pocket and a few minutes later, he and Harry were up in the air, Wood throwing the golf balls as hard as he could in every direction for Harry to catch.  \n\nHarry didn’t miss a single one, and Wood was delighted. After half an hour, night had really fallen and they couldn’t carry on.  \n\n“That Quidditch Cup’ll have our name on it this year,” said Wood happily as they trudged back up to the castle. “I wouldn’t be surprised if you turn out better than Charlie Weasley, and he could have played for England if he hadn’t gone oŀ chasing dragons.”  \n\nPerhaps it was because he was now so busy, what with Quidditch practice three evenings a week on top of all his homework, but Harry could hardly believe it when he realized that he’d already been at Hogwarts two months. The castle felt more like home than Privet Drive ever had. His lessons, too, were becoming more and more interesting now that they had mastered the basics.  \n\nOn Halloween morning they woke to the delicious smell of baking pumpkin wafting through the corridors. Even better, Professor Flitwick announced in Charms that he thought they were ready to start making objects ły, something they had all been dying to try since they’d seen him make Neville’s toad zoom around the classroom. Professor Flitwick put the class into pairs to practice. Harry’s partner was Seamus Finnigan (which was a relief, because Neville had been trying to catch his eye). Ron, however, was to be working with Hermione Granger. It was hard to tell whether Ron or Hermione was angrier about this. She hadn’t spoken to either of them since the day Harry’s broomstick had arrived.  \n\n“Now, don’t forget that nice wrist movement we’ve been practicing!” squeaked Professor Flitwick, perched on top of his pile of books as usual. “Swish and łick, remember, swish and łick. And saying the magic words properly is very important, too—never forget Wizard BaruŃo, who said ‘s’ instead of ‘f’ and found himself on the łoor with a buŀalo on his chest.”  \n\nIt was very diŃcult. Harry and Seamus swished and łicked, but the feather they were supposed to be sending skyward just lay on the desktop. Seamus got so impatient that he prodded it with his wand and set Łre to it—Harry had to put it out with his hat.  \n\nRon, at the next table, wasn’t having much more luck.  \n\n“Wingardium Leviosa!” he shouted, waving his long arms like a windmill.  \n\n“You’re saying it wrong,” Harry heard Hermione snap. “It’s Wing-gar-dium Levi-o-sa, make the ‘gar’ nice and long.”  \n\n“You do it, then, if you’re so clever,” Ron snarled.  \n\nHermione rolled up the sleeves of her gown, łicked her wand, and said, “Wingardium Leviosa!”  \n\nTheir feather rose oŀ the desk and hovered about four feet above their heads.  \n\n“Oh,  well  done!”  cried  Professor  Flitwick,  clapping. “Everyone see here, Miss Granger’s done it!”  \n\nRon was in a very bad mood by the end of the class.  \n\n“It’s no wonder no one can stand her,” he said to Harry as they pushed their way into the crowded corridor, “she’s a nightmare, honestly.”  \n\nSomeone knocked into Harry as they hurried past him. It was Hermione. Harry caught a glimpse of her face—and was startled to see that she was in tears.  \n\n“I think she heard you.”  \n\n“So?” said Ron, but he looked a bit uncomfortable. “She must’ve noticed she’s got no friends.”  \n\nHermione didn’t turn up for the next class and wasn’t seen all afternoon. On their way down to the Great Hall for the Halloween feast, Harry and Ron overheard Parvati Patil telling her friend Lavender that Hermione was crying in the girls’ bathroom and wanted to be left alone. Ron looked still more awkward at this, but a moment later they had entered the  Great  Hall,  where  the  Halloween  decorations  put Hermione out of their minds.  \n\nA thousand live bats łuttered from the walls and ceiling while a thousand more swooped over the tables in low black clouds, making the candles in the pumpkins stutter. The feast appeared suddenly on the golden plates, as it had at the startof-term banquet.  \n\nHarry was just helping himself to a",
    "chunk_order_index": 13,
    "full_doc_id": "doc-6408de1ccca0fa2fd39f62dfe301feff"
  },
  "chunk-1ce001236dc0dba746f43886c9d33a16": {
    "tokens": 1200,
    "content": "Ron looked still more awkward at this, but a moment later they had entered the  Great  Hall,  where  the  Halloween  decorations  put Hermione out of their minds.  \n\nA thousand live bats łuttered from the walls and ceiling while a thousand more swooped over the tables in low black clouds, making the candles in the pumpkins stutter. The feast appeared suddenly on the golden plates, as it had at the startof-term banquet.  \n\nHarry was just helping himself to a baked potato when Professor Quirrell came sprinting into the hall, his turban askew and terror on his face. Everyone stared as he reached Professor Dumbledore’s chair, slumped against the table, and gasped,  “Troll—in  the  dungeons—thought  you  ought  to know.”  \n\nHe then sank to the łoor in a dead faint.  \n\nThere was an uproar. It took several purple Łrecrackers exploding from the end of Professor Dumbledore’s wand to bring silence.  \n\n“Prefects,” he rumbled, “lead your Houses back to the dormitories immediately!”  \n\nPercy was in his element.  \n\n“Follow me! Stick together, Łrst years! No need to fear the troll if you follow my orders! Stay close behind me, now. Make way, Łrst years coming through! Excuse me, I’m a prefect!”  \n\n“How could a troll get in?” Harry asked as they climbed the stairs.  \n\n“Don’t ask me, they’re supposed to be really stupid,” said Ron. “Maybe Peeves let it in for a Halloween joke.”  \n\nThey  passed  diŀerent  groups  of  people  hurrying  in diŀerent directions. As they jostled their way through a crowd of confused Huńepuŀs, Harry suddenly grabbed Ron’s arm.  \n\n“I’ve just thought—Hermione.”  \n\n“What about her?”  \n\n“She doesn’t know about the troll.”  \n\nRon bit his lip.  \n\n“Oh, all right,” he snapped. “But Percy’d better not see us.”  \n\nDucking down, they joined the Huńepuŀs going the other way, slipped down a deserted side corridor, and hurried oŀ toward the girls’ bathroom. They had just turned the corner when they heard quick footsteps behind them.  \n\n“Percy!” hissed Ron, pulling Harry behind a large stone griŃn.  \n\nPeering around it, however, they saw not Percy but Snape. He crossed the corridor and disappeared from view.  \n\n“What’s he doing?” Harry whispered. “Why isn’t he down in the dungeons with the rest of the teachers?”  \n\n“Search me.”  \n\nQuietly as possible, they crept along the next corridor after Snape’s fading footsteps.  \n\n“He’s heading for the third łoor,” Harry said, but Ron held up his hand.  \n\n“Can you smell something?”  \n\nHarry sniŀed and a foul stench reached his nostrils, a mixture of old socks and the kind of public toilet no one seems to clean.  \n\nAnd then they heard it—a low grunting, and the shuńing footfalls of gigantic feet. Ron pointed—at the end of a passage to the left, something huge was moving toward them. They shrank into the shadows and watched as it emerged into a patch of moonlight.  \n\nIt was a horrible sight. Twelve feet tall, its skin was a dull, granite gray, its great lumpy body like a boulder with its small bald head perched on top like a coconut. It had short legs thick as tree trunks with łat, horny feet. The smell coming from it was incredible. It was holding a huge wooden club, which dragged along the łoor because its arms were so long.  \n\nThe troll stopped next to a doorway and peered inside. It waggled its long ears, making up its tiny mind, then slouched slowly into the room.  \n\n“The key’s in the lock,” Harry muttered. “We could lock it in.”  \n\n“Good idea,” said Ron nervously.  \n\nThey edged toward the open door, mouths dry, praying the troll wasn’t about to come out of it. With one great leap, Harry managed to grab the key, slam the door, and lock it.  \n\n“Yes!”  \n\nFlushed with their victory, they started to run back up the passage, but as they reached the corner they heard something that made their hearts stop—a high, petriŁed scream—and it was coming from the chamber they’d just chained up.  \n\n“Oh, no,” said Ron, pale as the Bloody Baron.  \n\n“It’s the girls’ bathroom!” Harry gasped.  \n\n“Hermione!” they said together.  \n\nIt was the last thing they wanted to do, but what choice did they have? Wheeling around, they sprinted back to the door and turned the key, fumbling in their panic. Harry pulled the door open and they ran inside.  \n\nHermione Granger was shrinking against the wall opposite, looking as if she was about to faint. The troll was advancing on her, knocking the sinks oŀ the walls as it went.  \n\n“Confuse it!” Harry said desperately to Ron, and, seizing a tap, he threw it as hard as he could against the wall.  \n\nThe troll stopped a few feet from Hermione. It lumbered around, blinking stupidly, to see what had made the noise. Its mean little eyes saw Harry. It hesitated, then made for him instead, lifting its club as it went.  \n\n“Oy, pea-brain!” yelled Ron from the other side of the chamber, and he threw a metal pipe at it. The troll didn’t even seem to notice the pipe hitting its shoulder, but it",
    "chunk_order_index": 14,
    "full_doc_id": "doc-6408de1ccca0fa2fd39f62dfe301feff"
  },
  "chunk-296004c8ff947d3cb2bbab658424c672": {
    "tokens": 1200,
    "content": "he could against the wall.  \n\nThe troll stopped a few feet from Hermione. It lumbered around, blinking stupidly, to see what had made the noise. Its mean little eyes saw Harry. It hesitated, then made for him instead, lifting its club as it went.  \n\n“Oy, pea-brain!” yelled Ron from the other side of the chamber, and he threw a metal pipe at it. The troll didn’t even seem to notice the pipe hitting its shoulder, but it heard the yell and paused again, turning its ugly snout toward Ron instead, giving Harry time to run around it.  \n\n“Come on, run, run!” Harry yelled at Hermione, trying to pull her toward the door, but she couldn’t move, she was still łat against the wall, her mouth open with terror.  \n\nThe shouting and the echoes seemed to be driving the troll berserk. It roared again and started toward Ron, who was nearest and had no way to escape.  \n\nHarry then did something that was both very brave and very stupid: He took a great running jump and managed to fasten his arms around the troll’s neck from behind. The troll couldn’t feel Harry hanging there, but even a troll will notice if you stick a long bit of wood up its nose, and Harry’s wand had still been in his hand when he’d jumped—it had gone straight up one of the troll’s nostrils.  \n\nHowling with pain, the troll twisted and łailed its club, with Harry clinging on for dear life; any second, the troll was going to rip him oŀ or catch him a terrible blow with the club.  \n\nHermione had sunk to the łoor in fright; Ron pulled out his own wand—not knowing what he was going to do he heard himself  cry  the  Łrst  spell  that  came  into  his  head: “Wingardium Leviosa!”  \n\nThe club łew suddenly out of the troll’s hand, rose high, high up into the air, turned slowly over—and dropped, with a sickening crack, onto its owner’s head. The troll swayed on the spot and then fell łat on its face, with a thud that made the whole room tremble.  \n\nHarry got to his feet. He was shaking and out of breath. Ron was standing there with his wand still raised, staring at what he had done.  \n\nIt was Hermione who spoke Łrst.  \n\n“Is it—dead?”  \n\n“I don’t think so,” said Harry, “I think it’s just been knocked out.”  \n\nHe bent down and pulled his wand out of the troll’s nose. It was covered in what looked like lumpy gray glue.  \n\n“Urgh—troll boogers.”  \n\nHe wiped it on the troll’s trousers.  \n\nA sudden slamming and loud footsteps made the three of them look up. They hadn’t realized what a racket they had been making, but of course, someone downstairs must have heard the crashes and the troll’s roars. A moment later, Professor McGonagall had come bursting into the room, closely followed by Snape, with Quirrell bringing up the rear. Quirrell took one look at the troll, let out a faint whimper, and sat quickly down on a toilet, clutching his heart.  \n\nSnape bent over the troll. Professor McGonagall was looking at Ron and Harry. Harry had never seen her look so angry. Her lips were white. Hopes of winning Łfty points for GryŃndor faded quickly from Harry’s mind.  \n\n“What on earth were you thinking of?” said Professor McGonagall, with cold fury in her voice. Harry looked at Ron, who was still standing with his wand in the air. “You’re lucky you weren’t killed. Why aren’t you in your dormitory?”  \n\nSnape gave Harry a swift, piercing look. Harry looked at the łoor. He wished Ron would put his wand down.  \n\nThen a small voice came out of the shadows.  \n\n“Please, Professor McGonagall—they were looking for me.”  \n\n“Miss Granger!”  \n\nHermione had managed to get to her feet at last.  \n\n“I went looking for the troll because I—I thought I could deal with it on my own—you know, because I’ve read all about them.”  \n\nRon  dropped  his  wand.  Hermione  Granger,  telling  a downright lie to a teacher?  \n\n“If they hadn’t found me, I’d be dead now. Harry stuck his wand up its nose and Ron knocked it out with its own club. They didn’t have time to come and fetch anyone. It was about to Łnish me oŀ when they arrived.”  \n\nHarry and Ron tried to look as though this story wasn’t new to them.  \n\n“Well—in that case...” said Professor McGonagall, staring at the three of them, “Miss Granger, you foolish girl, how could you think of tackling a mountain troll on your own?”  \n\nHermione hung her head. Harry was speechless. Hermione was the last person to do anything against the rules, and here she was, pretending she had, to get them out of trouble. It was as if Snape had started handing out sweets.  \n\n“Miss Granger, Łve points will be taken from GryŃndor for this,” said Professor McGonagall. “I’m very disappointed in you. If you’re not hurt at all, you’d better get oŀ to GryŃndor Tower. Students are Łnishing the feast in their Houses.”  \n\nHermione left.  \n\nProfessor McGonagall turned to Harry and Ron.  \n\n“Well, I still say you were lucky, but not many Łrst years could have taken on",
    "chunk_order_index": 15,
    "full_doc_id": "doc-6408de1ccca0fa2fd39f62dfe301feff"
  },
  "chunk-878321cda172e837d623121153d946e9": {
    "tokens": 1200,
    "content": "ve points will be taken from GryŃndor for this,” said Professor McGonagall. “I’m very disappointed in you. If you’re not hurt at all, you’d better get oŀ to GryŃndor Tower. Students are Łnishing the feast in their Houses.”  \n\nHermione left.  \n\nProfessor McGonagall turned to Harry and Ron.  \n\n“Well, I still say you were lucky, but not many Łrst years could have taken on a full-grown mountain troll. You each win GryŃndor  Łve  points.  Professor  Dumbledore  will  be informed of this. You may go.”  \n\nThey hurried out of the chamber and didn’t speak at all until they had climbed two łoors up. It was a relief to be away from the smell of the troll, quite apart from anything else.  \n\n“We  should  have  gotten  more  than  ten  points,”  Ron grumbled.  \n\n“Five, you mean, once she’s taken oŀ Hermione’s.”  \n\n“Good of her to get us out of trouble like that,” Ron admitted. “Mind you, we did save her.”  \n\n“She might not have needed saving if we hadn’t locked the thing in with her,” Harry reminded him.  \n\nThey had reached the portrait of the Fat Lady.  \n\n“Pig snout,” they said and entered.  \n\nThe common room was packed and noisy. Everyone was eating the food that had been sent up. Hermione, however, stood alone by the door, waiting for them. There was a very embarrassed pause. Then, none of them looking at each other, they all said “Thanks,” and hurried oŀ to get plates.  \n\nBut from that moment on, Hermione Granger became their friend. There are some things you can’t share without ending up  liking  each  other,  and  knocking  out  a  twelve-foot mountain troll is one of them.  \n\n![](images/image_4.jpg)  \n\ns they entered November, the weather turned very cold. The mountains around the school became icy gray and the lake like chilled steel. Every morning the ground was covered in frost. Hagrid could be seen from the upstairs windows defrosting broomsticks on the Quidditch Łeld, bundled up in a long moleskin overcoat, rabbit fur gloves, and enormous beaverskin boots.  \n\nThe Quidditch season had begun. On Saturday, Harry would be  playing  in  his  Łrst  match  after  weeks  of  training: GryŃndor versus Slytherin. If GryŃndor won, they would move up into second place in the House Championship.  \n\nHardly anyone had seen Harry play because Wood had decided that, as their secret weapon, Harry should be kept, well, secret. But the news that he was playing Seeker had leaked out somehow, and Harry didn’t know which was worse —people telling him he’d be brilliant or people telling him they’d  be  running  around  underneath  him  holding  a mattress.  \n\nIt was really lucky that Harry now had Hermione as a friend. He didn’t know how he’d have gotten through all his homework  without  her,  what  with  all  the  last-minute Quidditch practice Wood was making them do. She had also lent him Quidditch Through the Ages, which turned out to be a very interesting read.  \n\nHarry learned that there were seven hundred ways of committing  a  Quidditch  foul  and  that  all  of  them  had happened during a World Cup match in 1473; that Seekers were usually the smallest and fastest players, and that most serious Quidditch accidents seemed to happen to them; that although people rarely died playing Quidditch, referees had been known to vanish and turn up months later in the Sahara Desert.  \n\nHermione had become a bit more relaxed about breaking rules since Harry and Ron had saved her from the mountain troll, and she was much nicer for it. The day before Harry’s Łrst Quidditch match the three of them were out in the freezing courtyard during break, and she had conjured them up a bright blue Łre that could be carried around in a jam jar. They were standing with their backs to it, getting warm, when Snape crossed the yard. Harry noticed at once that Snape was limping. Harry, Ron, and Hermione moved closer together to block the Łre from view; they were sure it wouldn’t be allowed. Unfortunately, something about their guilty faces caught Snape’s eye. He limped over. He hadn’t seen the Łre, but he seemed to be looking for a reason to tell them oŀ anyway.  \n\n“What’s that you’ve got there, Potter?”  \n\nIt was Quidditch Through the Ages. Harry showed him.  \n\n“Library books are not to be taken outside the school,” said Snape. “Give it to me. Five points from GryŃndor.”  \n\n“He’s just made that rule up,” Harry muttered angrily as Snape limped away. “Wonder what’s wrong with his leg?”  \n\n“Dunno, but I hope it’s really hurting him,” said Ron bitterly. The GryŃndor common room was very noisy that evening. Harry, Ron, and Hermione sat together next to a window. Hermione was checking Harry and Ron’s Charms homework for them. She would never let them copy (“How will you learn?”), but by asking her to read it through, they got the right answers anyway.  \n\nHarry felt restless. He wanted Quidditch Through the Ages back, to take his mind oŀ his nerves about tomorrow. Why should he be afraid of Snape? Getting up, he told Ron",
    "chunk_order_index": 16,
    "full_doc_id": "doc-6408de1ccca0fa2fd39f62dfe301feff"
  },
  "chunk-1d29c24e5ef09f0569f186622017f83b": {
    "tokens": 1200,
    "content": "that evening. Harry, Ron, and Hermione sat together next to a window. Hermione was checking Harry and Ron’s Charms homework for them. She would never let them copy (“How will you learn?”), but by asking her to read it through, they got the right answers anyway.  \n\nHarry felt restless. He wanted Quidditch Through the Ages back, to take his mind oŀ his nerves about tomorrow. Why should he be afraid of Snape? Getting up, he told Ron and Hermione he was going to ask Snape if he could have it.  \n\n“Better you than me,” they said together, but Harry had an idea that Snape wouldn’t refuse if there were other teachers listening.  \n\nHe made his way down to the staŀroom and knocked. There was no answer. He knocked again. Nothing.  \n\nPerhaps Snape had left the book in there? It was worth a try. He pushed the door ajar and peered inside—and a horrible scene met his eyes.  \n\nSnape and Filch were inside, alone. Snape was holding his robes above his knees. One of his legs was bloody and mangled. Filch was handing Snape bandages.  \n\n“Blasted thing,” Snape was saying. “How are you supposed to keep your eyes on all three heads at once?”  \n\nHarry tried to shut the door quietly, but—  \n\n“POTTER!”  \n\nSnape’s face was twisted with fury as he dropped his robes quickly to hide his leg. Harry gulped.  \n\n“I just wondered if I could have my book back.”  \n\n“GET OUT! OUT!”  \n\nHarry left, before Snape could take any more points from GryŃndor. He sprinted back upstairs.  \n\n“Did you get it?” Ron asked as Harry joined them. “What’s the matter?”  \n\nIn a low whisper, Harry told them what he’d seen.  \n\n“You know what this means?” he Łnished breathlessly. “He tried to get past that three-headed dog at Halloween! That’s where he was going when we saw him—he’s after whatever it’s guarding! And I’d bet my broomstick he let that troll in, to make a diversion!”  \n\nHermione’s eyes were wide.  \n\n“No—he wouldn’t,” she said. “I know he’s not very nice, but he wouldn’t try and steal something Dumbledore was keeping safe.”  \n\n“Honestly, Hermione, you think all teachers are saints or something,” snapped Ron. “I’m with Harry. I wouldn’t put anything past Snape. But what’s he after? What’s that dog guarding?”  \n\nHarry went to bed with his head buzzing with the same question. Neville was snoring loudly, but Harry couldn’t sleep. He tried to empty his mind—he needed to sleep, he had to, he had his Łrst Quidditch match in a few hours—but the expression on Snape’s face when Harry had seen his leg wasn’t easy to forget.  \n\nThe next morning dawned very bright and cold. The Great Hall was full of the delicious smell of fried sausages and the cheerful chatter of everyone looking forward to a good Quidditch match.  \n\n“You’ve got to eat some breakfast.”  \n\n“I don’t want anything.”  \n\n“Just a bit of toast,” wheedled Hermione.  \n\n“I’m not hungry.”  \n\nHarry felt terrible. In an hour’s time he’d be walking onto the Łeld.  \n\n“Harry, you need your strength,” said Seamus Finnigan. “Seekers are always the ones who get clobbered by the other team.”  \n\n“Thanks,  Seamus,”  said  Harry,  watching  Seamus  pile ketchup on his sausages.  \n\nBy eleven o’clock the whole school seemed to be out in the stands  around  the  Quidditch  pitch.  Many  students  had binoculars. The seats might be raised high in the air, but it was still diŃcult to see what was going on sometimes.  \n\nRon and Hermione joined Neville, Seamus, and Dean the West Ham fan up in the top row. As a surprise for Harry, they had painted a large banner on one of the sheets Scabbers had ruined. It said Potter for President, and Dean, who was good at drawing, had done a large GryŃndor lion underneath. Then Hermione had performed a tricky little charm so that the paint łashed diŀerent colors.  \n\nMeanwhile, in the locker room, Harry and the rest of the team  were  changing  into  their  scarlet  Quidditch  robes (Slytherin would be playing in green).  \n\nWood cleared his throat for silence.  \n\n“Okay, men,” he said.  \n\n“And women,” said Chaser Angelina Johnson.  \n\n“And women,” Wood agreed. “This is it.”  \n\n“The big one,” said Fred Weasley.  \n\n“The one we’ve all been waiting for,” said George.  \n\n“We know Oliver’s speech by heart,” Fred told Harry, “we were on the team last year.”  \n\n“Shut up, you two,” said Wood. “This is the best team GryŃndor’s had in years. We’re going to win. I know it.”  \n\nHe glared at them all as if to say, “Or else.”  \n\n“Right. It’s time. Good luck, all of you.”  \n\nHarry followed Fred and George out of the locker room and, hoping his knees weren’t going to give way, walked onto the Łeld to loud cheers.  \n\nMadam Hooch was refereeing. She stood in the middle of the Łeld waiting for the two teams, her broom in her hand.  \n\n“Now, I want a nice fair game, all of you,” she said, once they were all",
    "chunk_order_index": 17,
    "full_doc_id": "doc-6408de1ccca0fa2fd39f62dfe301feff"
  },
  "chunk-6a1e85d9c6036bf83acffc175074f1c1": {
    "tokens": 1200,
    "content": "“Right. It’s time. Good luck, all of you.”  \n\nHarry followed Fred and George out of the locker room and, hoping his knees weren’t going to give way, walked onto the Łeld to loud cheers.  \n\nMadam Hooch was refereeing. She stood in the middle of the Łeld waiting for the two teams, her broom in her hand.  \n\n“Now, I want a nice fair game, all of you,” she said, once they were all gathered around her. Harry noticed that she seemed to be speaking particularly to the Slytherin Captain, Marcus Flint, a Łfth year. Harry thought Flint looked as if he had some troll blood in him. Out of the corner of his eye he saw the łuttering banner high above, łashing Potter for President over the crowd. His heart skipped. He felt braver.  \n\n“Mount your brooms, please.”  \n\nHarry clambered onto his Nimbus Two Thousand.  \n\nMadam Hooch gave a loud blast on her silver whistle.  \n\nFifteen brooms rose up, high, high into the air. They were oŀ.  \n\n“And the Quańe is taken immediately by Angelina Johnson of GryŃndor—what an excellent Chaser that girl is, and  \n\nrather attractive, too—”  \n\n“JORDAN!”  \n\n“Sorry, Professor.”  \n\nThe Weasley twins’ friend, Lee Jordan, was doing the commentary for the match, closely watched by Professor McGonagall.  \n\n“And she’s really belting along up there, a neat pass to Alicia Spinnet, a good Łnd of Oliver Wood’s, last year only a reserve— back to Johnson and—no, the Slytherins have taken the Quańe, Slytherin Captain Marcus Flint gains the Quańe and oŀ he goes—Flint łying like an eagle up there—he’s going to sc– no, stopped by an excellent move by GryŃndor Keeper Wood and the GryŃndors take the Quańe—that’s Chaser Katie Bell of GryŃndor there, nice dive around Flint, oŀ up the Łeld and—OUCH—that must have hurt, hit in the back of the head by a Bludger—Quańe taken by the Slytherins—that’s Adrian Pucey speeding oŀ toward the goalposts, but he’s blocked by a second Bludger—sent his way by Fred or George Weasley, can’t tell which—nice play by the GryŃndor Beater, anyway, and Johnson back in possession of the Quańe, a clear Łeld ahead and oŀ she goes—she’s really łying—dodges a speeding Bludger—the goalposts are ahead—come on, now, Angelina—Keeper  Bletchley  dives—misses—GRYFFINDOR SCORE!”  \n\nGryŃndor cheers Łlled the cold air, with howls and moans from the Slytherins.  \n\n“Budge up there, move along.”  \n\n“Hagrid!”  \n\nRon and Hermione squeezed together to give Hagrid enough space to join them.  \n\n“Bin watchin’ from me hut,” said Hagrid, patting a large pair of binoculars around his neck, “But it isn’t the same as bein’ in the crowd. No sign of the Snitch yet, eh?”  \n\n“Nope,” said Ron. “Harry hasn’t had much to do yet.”  \n\n“Kept outta trouble, though, that’s somethin’,” said Hagrid, raising his binoculars and peering skyward at the speck that was Harry.  \n\nWay up above them, Harry was gliding over the game, squinting about for some sign of the Snitch. This was part of his and Wood’s game plan.  \n\n“Keep out of the way until you catch sight of the Snitch,” Wood had said. “We don’t want you attacked before you have to be.”  \n\nWhen Angelina had scored, Harry had done a couple of loop-the-loops to let out his feelings. Now he was back to staring around for the Snitch. Once he caught sight of a łash of gold, but it was just a rełection from one of the Weasleys’ wristwatches, and once a Bludger decided to come pelting his way, more like a cannonball than anything, but Harry dodged it and Fred Weasley came chasing after it.  \n\n“All right there, Harry?” he had time to yell, as he beat the Bludger furiously toward Marcus Flint.  \n\nSlytherin in possession,” Lee Jordan was saying, “Chaser Pucey ducks two Bludgers, two Weasleys, and Chaser Bell, and speeds toward the—wait a moment—was that the Snitch?”  \n\nA murmur ran through the crowd as Adrian Pucey dropped the Quańe, too busy looking over his shoulder at the łash of gold that had passed his left ear.  \n\nHarry saw it. In a great rush of excitement he dived downward after the streak of gold. Slytherin Seeker Terence Higgs had seen it, too. Neck and neck they hurtled toward the Snitch—all the Chasers seemed to have forgotten what they were supposed to be doing as they hung in midair to watch.  \n\nHarry was faster than Higgs—he could see the little round ball, wings łuttering, darting up ahead—he put on an extra spurt of speed—  \n\nWHAM! A roar of rage echoed from the GryŃndors below— Marcus Flint had blocked Harry on purpose, and Harry’s broom spun oŀ course, Harry holding on for dear life.  \n\n“",
    "chunk_order_index": 18,
    "full_doc_id": "doc-6408de1ccca0fa2fd39f62dfe301feff"
  },
  "chunk-4d869fecfe6ddc0d11e1f10aa5cfebf1": {
    "tokens": 1200,
    "content": "asers seemed to have forgotten what they were supposed to be doing as they hung in midair to watch.  \n\nHarry was faster than Higgs—he could see the little round ball, wings łuttering, darting up ahead—he put on an extra spurt of speed—  \n\nWHAM! A roar of rage echoed from the GryŃndors below— Marcus Flint had blocked Harry on purpose, and Harry’s broom spun oŀ course, Harry holding on for dear life.  \n\n“Foul!” screamed the GryŃndors.  \n\nMadam Hooch spoke angrily to Flint and then ordered a free shot at the goalposts for GryŃndor. But in all the confusion, of course, the Golden Snitch had disappeared from sight again.  \n\nDown in the stands, Dean Thomas was yelling, “Send him oŀ, ref! Red card!”  \n\n“What are you talking about, Dean?” said Ron.  \n\n“Red card!” said Dean furiously. “In soccer you get shown the red card and you’re out of the game!”  \n\n“But this isn’t soccer, Dean,” Ron reminded him.  \n\nHagrid, however, was on Dean’s side.  \n\n“They oughta change the rules. Flint coulda knocked Harry outta the air.”  \n\nLee Jordan was Łnding it diŃcult not to take sides.  \n\n“So—after that obvious and disgusting bit of cheating—”  \n\n“Jordan!” growled Professor McGonagall.  \n\n“I mean, after that open and revolting foul—”  \n\n“Jordan, I’m warning you—”  \n\n“All right, all right. Flint nearly kills the GryŃndor Seeker, which could happen to anyone, I’m sure, so a penalty to GryŃndor, taken by Spinnet, who puts it away, no trouble, and we continue play, GryŃndor still in possession.”  \n\nIt was as Harry dodged another Bludger, which went spinning dangerously past his head, that it happened. His broom gave a sudden, frightening lurch. For a split second, he thought he was going to fall. He gripped the broom tightly with both his hands and knees. He’d never felt anything like that.  \n\nIt happened again. It was as though the broom was trying to buck him oŀ. But Nimbus Two Thousands did not suddenly decide to buck their riders oŀ. Harry tried to turn back toward the GryŃndor goalposts—he had half a mind to ask Wood to call time-out—and then he realized that his broom was completely out of his control. He couldn’t turn it. He couldn’t direct it at all. It was zigzagging through the air, and every now and then making violent swishing movements that almost unseated him.  \n\nLee was still commentating.  \n\n“Slytherin in possession—Flint with the Quańe—passes Spinnet—passes Bell—hit hard in the face by a Bludger, hope it broke his nose—only joking, Professor—Slytherin score—oh no...”  \n\nThe Slytherins were cheering. No one seemed to have noticed that Harry’s broom was behaving strangely. It was carrying him slowly higher, away from the game, jerking and twitching as it went.  \n\n“Dunno what Harry thinks he’s doing,” Hagrid mumbled. He stared through his binoculars. “If I didn’ know better, I’d say he’d lost control of his broom...but he can’t have....”  \n\nSuddenly, people were pointing up at Harry all over the stands. His broom had started to roll over and over, with him only just managing to hold on. Then the whole crowd gasped. Harry’s broom had given a wild jerk and Harry swung oŀ it. He was now dangling from it, holding on with only one hand.  \n\n“Did something happen to it when Flint blocked him?” Seamus whispered.  \n\n“Can’t have,” Hagrid said, his voice shaking. “Can’t nothing interfere with a broomstick except powerful Dark Magic—no kid could do that to a Nimbus Two Thousand.”  \n\nAt these words, Hermione seized Hagrid’s binoculars, but instead of looking up at Harry, she started looking frantically at the crowd.  \n\n“What are you doing?” moaned Ron, gray-faced.  \n\n“I knew it,” Hermione gasped, “Snape—look.”  \n\nRon grabbed the binoculars. Snape was in the middle of the stands opposite them. He had his eyes Łxed on Harry and was muttering nonstop under his breath.  \n\n“He’s doing  something—jinxing  the  broom,” said Hermione.  \n\n“What should we do?”  \n\n“Leave it to me.”  \n\nBefore  Ron  could  say  another  word,  Hermione  had disappeared. Ron turned the binoculars back on Harry. His broom was vibrating so hard, it was almost impossible for him to hang on much longer. The whole crowd was on its feet, watching, terriŁed, as the Weasleys łew up to try and pull Harry safely onto one of their brooms, but it was no good— every time they got near him, the broom would jump higher still. They dropped lower and circled beneath him, obviously hoping to catch him if he fell. Marcus Flint seized the Quańe and scored Łve times without anyone noticing.  \n\n“Come on, Hermione,” Ron muttered desperately.  \n\nHermione had fought her way across to the stand where Snape stood, and was now racing along the row behind him; she didn’t even stop to say sorry as she knocked Professor Quirrell headŁrst into the row in front. Reaching Snape, she crouched down, pulled out her wand, and whispered a few, well",
    "chunk_order_index": 19,
    "full_doc_id": "doc-6408de1ccca0fa2fd39f62dfe301feff"
  },
  "chunk-97c5554d758d6bd130f3b2ae2923a9cd": {
    "tokens": 1062,
    "content": ". Marcus Flint seized the Quańe and scored Łve times without anyone noticing.  \n\n“Come on, Hermione,” Ron muttered desperately.  \n\nHermione had fought her way across to the stand where Snape stood, and was now racing along the row behind him; she didn’t even stop to say sorry as she knocked Professor Quirrell headŁrst into the row in front. Reaching Snape, she crouched down, pulled out her wand, and whispered a few, well-chosen words. Bright blue łames shot from her wand onto the hem of Snape’s robes.  \n\nIt took perhaps thirty seconds for Snape to realize that he was on Łre. A sudden yelp told her she had done her job. Scooping the Łre oŀ him into a little jar in her pocket, she scrambled back along the row—Snape would never know what had happened.  \n\nIt was enough. Up in the air, Harry was suddenly able to clamber back on to his broom.  \n\n“Neville, you can look!” Ron said. Neville had been sobbing into Hagrid’s jacket for the last Łve minutes.  \n\nHarry was speeding toward the ground when the crowd saw him clap his hand to his mouth as though he was about to be  sick—he  hit  the  Łeld  on  all  fours—coughed—and something gold fell into his hand.  \n\n“I’ve got the Snitch!” he shouted, waving it above his head, and the game ended in complete confusion.  \n\n“He didn’t catch it, he nearly swallowed it,” Flint was still howling twenty minutes later, but it made no diŀerence— Harry hadn’t broken any rules and Lee Jordan was still happily shouting the results—GryŃndor had won by one hundred and seventy points to sixty. Harry heard none of this, though. He was being made a cup of strong tea back in Hagrid’s hut, with Ron and Hermione.  \n\n“It was Snape,” Ron was explaining, “Hermione and I saw him. He was cursing your broomstick, muttering, he wouldn’t take his eyes oŀ you.”  \n\n“Rubbish,” said Hagrid, who hadn’t heard a word of what had gone on next to him in the stands. “Why would Snape do somethin’ like that?”  \n\nHarry,  Ron,  and  Hermione  looked  at  one  another, wondering what to tell him. Harry decided on the truth.  \n\n“I found out something about him,” he told Hagrid. “He tried to get past that three-headed dog on Halloween. It bit him. We think he was trying to steal whatever it’s guarding.”  \n\nHagrid dropped the teapot.  \n\n“How do you know about Fluŀy?” he said.  \n\n“Fluŀy?”  \n\n“Yeah—he’s mine—bought him oŀ a Greek chappie I met in the pub las’ year—I lent him to Dumbledore to guard the—”  \n\n“Yes?” said Harry eagerly.  \n\n“Now, don’t ask me anymore,” said Hagrid gruńy. “That’s top secret, that is.”  \n\n“But Snape’s trying to steal it.”  \n\n“Rubbish,” said Hagrid again. “Snape’s a Hogwarts teacher, he’d do nothin’ of the sort.”  \n\n“So why did he just try and kill Harry?” cried Hermione.  \n\nThe afternoon’s events certainly seemed to have changed her mind about Snape.  \n\n“I know a jinx when I see one, Hagrid, I’ve read all about them! You’ve got to keep eye contact, and Snape wasn’t blinking at all, I saw him!”  \n\n“I’m tellin’ yeh, yer wrong!” said Hagrid hotly. “I don’ know why Harry’s broom acted like that, but Snape wouldn’ try an’ kill a student! Now, listen to me, all three of yeh—yer meddlin’ in things that don’ concern yeh. It’s dangerous. You forget that dog, an’ you forget what it’s guardin’, that’s between Professor Dumbledore an’ Nicolas Flamel—”  \n\n“Aha!” said Harry, “so there’s someone called Nicolas Flamel involved, is there?”  \n\nHagrid looked furious with himself.  \n\n![](images/image_5.jpg)  \n\nhristmas  was  coming.  One  morning  in  mid-December, Hogwarts woke to Łnd itself covered in several feet of snow. The lake froze solid and the Weasley twins were punished for bewitching several snowballs so that they followed Quirrell around, bouncing oŀ the back of his turban. The few owls that managed to battle their way through the stormy sky to deliver mail had to be nursed back to health by Hagrid before they could ły oŀ again.  \n\nNo one could wait for the holidays to start. While the GryŃndor common room and the Great Hall had roaring Łres, the drafty corridors had become icy and a bitter wind",
    "chunk_order_index": 20,
    "full_doc_id": "doc-6408de1ccca0fa2fd39f62dfe301feff"
  }
}