{
  "chunk-6e5dcf67d57caf5a692847b726499ac0": {
    "tokens": 1200,
    "content": "# \"All the News Che New Hlork Cimes That's Fit to Print'  \n\nVOL. CLXXI . . . . No. 59,385 © 2022  The New York Times Company NEW YORK, WEDNESDAY, APRIL 6, 2022  \n\n# In Scathing Speech, Zelensky Chastises U.N. for Inaction  \n\n![](images/image_1.jpg)  \nBorodyanka, a Ukrainian commuter town near Kyiv, was among the first places to be hit by Russian airstrikes. The acting mayor estimated the dead at more than 200.  \n\n# Germany Strains to Wean Itself Off Gas Imports Subsidizing War  \n\n# By KATRIN BENNHOLD  \n\nLUBMIN, Germany — Past a nudist beach and a sleepy marina, a gigantic mesh of metallic pipes rises from the pine forest behind the tiny village of Lubmin on Germany’s Baltic coast.  \n\nIf few people have heard of Lubmin, from Berlin to Washington many seem to know the name of the two gas pipelines arriving here directly from Russia: Nord Stream 1, which carries almost 60 million cubic meters of natural gas per year to keep Europe’s biggest  economy  humming.  And Nord Stream 2, built to increase that flow but abruptly shuttered in the run-up to Russia’s attack on Ukraine.  \n\nThe pair of pipelines has become a twin symbol of Germany’s dangerous dependence on Russian gas — and the country’s belated and frenzied effort to wean itself off it — with calls growing for the European Union to hit Moscow with tougher sanctions as atrocities come to light in Ukraine. On Tuesday, the European Commission,  the  E.U.’s  executive branch,  proposed  banning  imports of Russian coal and soon, possibly, its oil. But Russian gas — far more critical to Germany and much of the rest of Europe — was off the table. At least for now. “We are dependent on them,”  \n\nharbor between the two pipelines one recent morning. “None of us imagined Russia ever going to war. Now Russia is one of our main suppliers of gas, and that’s not something we can change overnight.”  \n\nThat dependence on Russia — accounting for more than a quarter of Germany’s total energy use — has meant that Berlin has so far refused to cut off President Vladimir V. Putin, whose war it is effectively subsidizing to the tune of an Continued on Page A7  \n\n![](images/image_2.jpg)  \n\nwhich has a population of just 2,119, as he stood in the industrial Pipes at the Nord Stream 1 gas pipeline in Lubmin, Germany.  \n\n# Hundreds Missing, and Tons of Rubble to Clear  \n\n# By CARLOTTA GALL  \n\nBORODYANKA,  Ukraine —Andreiy Ziuzko stood near the flattened apartment complex in Borodyanka that was once his home, his belongings in plastic bags on the sidewalk beside a few blackened cooking pots on Tuesday.  \n\nThe building had lain in ruins for weeks, struck just after fighting had driven him and his family to flee. It was only after a while that he explained something even worse had happened. His mother lived a few doors down, and her apartment had also been bombed. “Mom’s home was hit on the same day,” Mr. Ziuzko said. “I  \n\n# A Kyiv Suburb Begins Its Grim Task Weeks After Airstrikes  \n\n# can’t find her.”  \n\nRussian troops recently withdrew  from  the  area  around Borodyanka, a Ukrainian commuter town near Kyiv, the capital, that was among the first places to be hit by Russian airstrikes. Now dozens of people who were sheltering  in  basements  or  apartments are missing and presumed dead under the rubble, the acting mayor said Tuesday.  \n\n“We  think  over  200  people died,” said Georgii Yerko, the acting mayor of Borodyanka. “But it is an assumption.” On Tuesday, New York Times journalists reached the town for the first time after Russian troops withdrew. The scars left behind were shocking, with great gashes sliced through multistory complexes along the main street. Four apartment  buildings  had  collapsed in the bombing, residents said, their floors crushed down to ground  level  like  concertinas. Heavy fighting left more destruction for two miles along the main street.  \n\nRussia’s  pullout  from  areas Continued on Page A6  \n\n# What Does Putin Actually Own? It’s Hard to Tell.  \n\n# By MIKE McINTIRE  \n\nBuried in a 421-page legal filing in an obscure court case is a single sentence, offered almost as an afterthought, about a meeting at a Geneva  restaurant  where  two businessmen  chatted  about  “a yacht which had been presented to Mr. Putin.”  \n\nThe passing reference, cited in a 2010 judge’s decision in London on a financial dispute involving a shipping company, is the rare bit of public evidence directly linking President Vladimir V. Putin of Russia to any of the luxury boats, planes or villas associated with  \n\n# Sanctions Muddled by Hidden Wealth  \n\nhim over the years. It has taken on new significance as U.S. and European authorities pursue the hidden wealth of Mr. Putin and people close to him in response to Russia’s invasion of Ukraine. But the British court document also holds a clue to why it has been so hard to clearly connect the Russian  president  to  his  rumored riches.  The  yacht,  called  the Olympia, was managed by a company in Cyprus, where corporation filings show that the true owner was not Mr. Putin — it was the Russian government.  \n\nIndeed, it is one of many extravagant assets long speculated to be Mr.  Putin’s  that  actually  are owned or controlled by the state, showing how much the",
    "chunk_order_index": 0,
    "full_doc_id": "doc-2891c1d9d2d9671561c8b3c61d33ecaf"
  },
  "chunk-18185e7a0fca43de6090394970ead3a7": {
    "tokens": 1200,
    "content": "a clue to why it has been so hard to clearly connect the Russian  president  to  his  rumored riches.  The  yacht,  called  the Olympia, was managed by a company in Cyprus, where corporation filings show that the true owner was not Mr. Putin — it was the Russian government.  \n\nIndeed, it is one of many extravagant assets long speculated to be Mr.  Putin’s  that  actually  are owned or controlled by the state, showing how much the private interests of the president and his inner circle have merged with those of the government he has dominated for two decades. Others include a sprawling resort, a fleet of expensive  automobiles,  fancy planes and still more yachts. The United States and its allies Continued on Page A9  \n\n# Video of Charred Bodies Silences Chamber  \n\n# By RICHARD PÉREZ-PEÑA  \n\nWith  evidence  mounting  of atrocities in the Kyiv suburbs, and Russian forces preparing for a new offensive farther east, President  Volodymyr  Zelensky  of Ukraine  delivered  a  scathing speech to the United Nations on Tuesday, accusing Russia of a litany of horrors and questioning whether a world body that takes no action to stop a war serves any purpose.  \n\nSpeaking via video link to the U.N. Security Council, he compared Russian forces to the Islamic State, called for a Nuremberg-like war crimes tribunal and vented  his  bitter  frustration, knowing that the council — where Russia is one of five permanent members  with  veto  power  — would do nothing but talk.  \n\n“Where is the security that the Security Council needs to guarantee?” Mr. Zelensky said, raising the question of whether Russia deserved to keep its seat on the council. “Are you ready to close the U.N.? Do you think that the time of international law is gone? If your answer is no, then you need to act immediately.”  \n\nThe chamber fell silent as a short video provided by Mr. Zelensky’s government played, showing  some  of  the  hundreds  of corpses found strewn around the city of Bucha, northwest of Kyiv, after Russian forces retreated last week — bloated, charred bodies of civilians, including children. Some victims, their hands bound, had been shot in the head.  \n\nMr. Zelensky said that in Bucha, “they killed entire families, adults and children, and they tried to burn the bodies.” Civilians “were crushed by tanks while sitting in their cars in the middle of the road,” he added, asserting that “women were raped and killed in front  of  their  children;  their tongues were pulled out.”  \n\nChina refrained from criticizing Russia in Tuesday’s session, saying  that  the  Security  Council should wait until investigations establish the facts in Ukraine. A rising global power, China has drawn closer to Russia in recent years, united by a shared antipathy to the United States. The divisions on the war appeared essentially unchanged since Feb. 26, when 11 of 15 Security Council members voted for a resolution condemning  Russia’s  invasion, Russia vetoed the measure, and three others abstained — China, India and the United Arab Emirates.  \n\nRussia’s  U.N.  ambassador, Vasily Nebenzya, reiterated his government’s claims — rebutted by ample evidence — that atrocities in Bucha had been faked, or had not occurred when Russians held the city. He made a number of other unsupported claims, including stating falsely that in Ukraine — where the freely elected president is a Jew who lost family members in the Holocaust — Nazis are “running the show.” After  President  Vladimir  V. Putin of Russia launched the war  \n\n# Pills Are New Target in 50-Year Abortion Battle  \n\n# Aiming to Change Twitter, Musk Joins Its Board  \n\n# By KATE ZERNIKE  \n\nLast year, after Texas passed its strict abortion ban, surgical abortions in the state dropped by half. Many  women  found  a  workaround: pills. The week the law took effect, requests for medication abortion shot up to 138 a day from 11 a day at just one service that delivers the pills by mail. Anti-abortion lawmakers in the state were already on it. That  \n\n# States Crack Down on a Post-Roe Option  \n\nsame week, they passed another law making it a felony to provide abortion pills through the mail and requiring doctors to comply with new testing and reporting procedures to prescribe them. Medication abortion is the new front in the nation’s five-decadelong fight, as both sides anticipate that by summer the Supreme Court could overturn or pare back the constitutional right to abortion established in Roe v. Wade. Supporters of abortion rights, Continued on Page A19  \n\nOKLAHOMA MEASURE Lawmakers in the state approved a neartotal ban on abortion. PAGE A19  \n\nThis article is by Kate Conger, Mike Isaac and Lauren Hirsch.  \n\nElon Musk, the world’s richest man,  reached  out  to  Parag Agrawal, Twitter’s chief executive, a few weeks ago with a friendly heads-up. He was buying shares of the social media company,  Mr.  Musk  confided,  and wanted to discuss how to make Twitter better. Mr. Musk had ideas for reshap  \n\n# Advocate of a Shift in Social Media’s Power  \n\ning social networks that dovetailed with those of Mr. Agrawal and Jack Dorsey, Twitter’s cofounder, according to their public exchanges. All three have floated the notion of radically shifting the power in social networking to users and away from behemoth companies, by using an approach to technology that would give people control over what they see in their social media feeds.  \n\nIn  the  ensuing  weeks,  Mr. Agrawal  discussed",
    "chunk_order_index": 1,
    "full_doc_id": "doc-2891c1d9d2d9671561c8b3c61d33ecaf"
  },
  "chunk-3ff48b0d07e10c60095607fbb455b44a": {
    "tokens": 576,
    "content": "in Social Media’s Power  \n\ning social networks that dovetailed with those of Mr. Agrawal and Jack Dorsey, Twitter’s cofounder, according to their public exchanges. All three have floated the notion of radically shifting the power in social networking to users and away from behemoth companies, by using an approach to technology that would give people control over what they see in their social media feeds.  \n\nIn  the  ensuing  weeks,  Mr. Agrawal  discussed  having  Mr. Musk become a more active participant in Twitter’s future, according to two people with knowledge of the conversations who were not authorized to speak pubContinued on Page A18  \n\n![](images/image_3.jpg)  \n\n# INTERNATIONAL A4-11  \n\nDarfur Trial at The Hague A man accused of leading the terrifying janjaweed militia faces 31 charges of war crimes committed in western Sudan. Over 200,000 people died. PAGE A11  \n\n![](images/image_4.jpg)  \n\n# ARTS C1-6  \n\n# A Lover’s Influence  \n\nA new exhibition explores the artist and author David Wojnarowicz’s first significant relationship, with Jean Pierre Delage, which liberated him emotionally and changed him artistically. PAGE C1  \n\n![](images/image_5.jpg)  \n\n# BUSINESS B1-6  \n\nBoom Time for Vertical Farms Growing crops indoors is expanding as demand grows for year-round produce, but challenges abound. PAGE B6 JetBlue Makes Offer on Spirit The company’s \\$3.6 billion bid has thrown a wrench in Frontier Airlines’ plan to merge with Spirit. PAGE B5 NATIONAL A12-19 Battling Medicare for a Drug The Alzheimer’s Association has pushed for access to Aduhelm, despite its risks and tenuous efficacy.  PAGE A17 A Sprawling Cast of Characters Among the challenges facing the grand jury in the Jan. 6 Capitol attack is the sheer number of witnesses.  PAGE A14  \n\n# SPORTS B7-12  \n\nWoods Plans to Play the Masters Tiger Woods, who sustained significant leg injuries in a car crash last year, will seek his 16th major title. PAGE B10 Kansas’ Winning Formula Remy Martin, a transfer, and David McCormack, a senior, played big roles in the Jayhawks’ comeback win. PAGE B11 L.G.B.T.Q. Love Stories Sales of queer romance novels have surged, with new titles coming from the biggest publishers and finding prominent space on the shelves of mainstream retailers. PAGE C1  \n\nOPINION A22-23  \n\n# Bret Stephens  \n\n# FOOD D1-8  \n\nTasty in TriBeCa The offerings at Victoria Blamey’s Mena don’t “look or taste like anything else in the city,” Pete Wells writes. Above, the Cape Cod surf clam. PAGE D1",
    "chunk_order_index": 2,
    "full_doc_id": "doc-2891c1d9d2d9671561c8b3c61d33ecaf"
  }
}