{
  "chunk-6e3ed52d0794158cc8269593837e9481": {
    "tokens": 1200,
    "content": "# Che New ork Cimes  \n\nVOL. CLXXII .... No. 59,562  \n\nkTimes Company NEW YORK,FRIDAY, SEPTEMBER 30,2022  \n\n# BRITAIN'S GAMBLE ON NEW TAX CUTS WORRIES EXPERTS  \n\n# New York City Tightens Entry To Top Schools  \n\nEYEING PAST MISTAKES  \n\nReviving Use of Grades After 2-Year Pause  \n\nMove Could Clash With Worldwide Efforts to Combat Inflation  \n\n# By JIM TANKERSLEY  \n\nA stunning rebuke from the International Monetary Fund this week underscored one of the biggest risks of the new British government's plan to slash taxes on high earners: It could exacerbate rapid inflation and destabilize markets at a precarious economic moment.  \n\nThe alarm from economists, central bankers, investors and top U.S.officialscentered onthelikelihood that the taxcuts could stoke consumer demand by giving people more money to spend, pushing crushingly high prices even higher. That would put the British government in direct conflict with aggressive efforts of the central banks around the globe — and in the United Kingdom — that are raising interest rates in a bid to bring inflation under control. Many economists say British officials are also ignoring the lessons of the most recent bout of tax cuts—those engineeredin the United Statesbyformer President Donald J. Trump. Empirical research on the early results of those cuts suggests that they mostly helped the economy by temporarily increasing consumer demand, an outcome that could prove particularly damaging in the  high-inflation  environment that Britain and much of the world  \n\nLiz Truss, Britain's new prime minister, has staked her fledgling government on an oversize, oncein-a-generation package of tax cuts and deregulation meant to energize the economy. It includes a cut in rates for the country's lowest income tax bracket — and, in what was a surprise move, a fivepercentage-point cut in the counContinuedonPageA6  \n\n# By TROY CLOSSON  \n\nNew York City's selective middle schools can once again use grades to choose which students to admit, the school chancellor, David C. Banks, announced on Thursday, rolling back a pandemic-era moratorium that had opened the doors of some of the city's most elite schools to more low-income students.  \n\nSelective high schools will also be able to prioritize top-performing students.  \n\nThe sweeping move will end the random lotteryfor middle schools, a major shift after the previous administration ended the use of grades and test scores two years ago. At the city's competitive high schools, where changes widened the pool of eligible applicants, priority for seats will be limited to top students whose grades are an A average.  \n\nThe question of whether to base admissions on student performance prompted intense debate this fall. Many Asian American families were particularly vocal in arguing that the lotteries excluded their children from opportunities they had worked hard for. But Black and Latino students are significantly underrepresented at selective schools, and some parents had hoped the previous admissions changes would become permanent to boost racial integration in a system that has been labeled one of the most segregated in the nation.  \n\n\"It's critically important that if you're working hard and making good grades, you should not be thrown into a lottery with just everybody” Mr. Banks said, noting that the changes were based on family feedback.  \n\nNew York City has used selective admissions for public schools more than any school district in the country. About a third of the city's 900 or so middle and high schools had some kind of admissions requirement before the pandemic disrupted many measures Continued onPageA24  \n\nALEKsANDR: We can't take Kyiv. . . We just take villages, and that's it.  \n\nwkira: There are corpses lying around.  \n\nsERGEY: We were given an order to kill everyone we see.  \n\n# Bitter Tales of Failure and Fear In Russian Troops' Calls Home  \n\nThis article is by Yousur Al-Hlou, MashaFroliakandEvanHill.  \n\nKYIV, Ukraine - The Ukrainian capital was supposed to fall in a matter of days.  \n\nBut plagued by tactical errors and fierce Ukrainian resistance, President Vladimir V. Putin's destructivead  \n\nVISUAL vance quickly INVESTIGATIONS stalled,  and his forces became bogged down for most of March on the city's outskirts. From trenches, dugouts and in occupied homes in the area around Bucha, a western suburb of Kyiv, Russian soldiers disobeyed orders by making unauthorized calls from their cellphones to their wives, girlfriends, friends and parents hundreds of miles from the front line. Someone else was listening in: the Ukrainian government.  \n\nThe New York Times has exclusively obtained  recordings of thousands of calls that were made throughout March and intercepted by Ukrainian law enforcement agencies from this pivotal location.  \n\nReporters verified the authenticity of these calls by cross-referencing the Russian phone numbers with messaging apps and social media profiles to identify soldiers and family members. Continuod nnDaooA8  \n\n# A Staggering Path of Ruin Across Florida  \n\n![](images/image_1.jpg)  \n\n![](images/image_2.jpg)  \n\nHurricane Ian's aftermath included flooding in Port Charlotte, Fla., top, and wreckage in Fort Myers Beach, above. Marvis Long, middle, said “everything floated\" in her North Fort Myers home.  \n\nDeath Toll From Hurricane lan May Jump  \n\nThis article is by Patricia Mazzei, Nicholas Bogel-Burroughs, Frances Robles and Jack Healy.  \n\nFORT MYERS, Fla.- The extent of Hurricane Ian's destruction became clearer on Thursday as people across southwestern Florida, left without electricity, drinking  water  or  inhabitabie homes, began to assess the damage and gird for what Gov. Ron DeSantis said would be a yearslong recovery.  \n\nThe scale of the wreckage was staggering, even to Florida residents who had survived and rebuilt after",
    "chunk_order_index": 0,
    "full_doc_id": "doc-2b0e008d88de42057f162223daaf1711"
  },
  "chunk-376375b370065f4814364a07d85bdfe7": {
    "tokens": 1024,
    "content": "zei, Nicholas Bogel-Burroughs, Frances Robles and Jack Healy.  \n\nFORT MYERS, Fla.- The extent of Hurricane Ian's destruction became clearer on Thursday as people across southwestern Florida, left without electricity, drinking  water  or  inhabitabie homes, began to assess the damage and gird for what Gov. Ron DeSantis said would be a yearslong recovery.  \n\nThe scale of the wreckage was staggering, even to Florida residents who had survived and rebuilt after other powerful hurricanes. The storm pulverized roads, toppled trees, gutted downtown storefronts and set cars afloat, leaving a soggy scar of ruined homes and businesses from the coastal cities of Naples and Fort Myers to inland communities around Orlando.  \n\nAlthough state officials had not released a death toll by late in the day, Mr. DeSantis said Thursday night that “we absolutely expect\" to learn of storm-related fatalities as rescuers work through a backlog of 91l calls and scour the most devastated neighborhoods. More than 500 people in Charlotte and Lee Counties, the hardest hit, had been rescued on Thursday, the Florida Division of Emergency Management said; the small town of Fort Myers Beach, on a barrier island just off the coast, appeared decimated.  \n\nWhile Ian left Florida on Thursday afternoon as a tropical storm, South Carolina residents were bracing for lashing winds and heavy rain as it quickly became a hurricane again at sea; forecasters said it could strengthen again before doubling back onto land there by Friday.  \n\nPhotostromseveralareasot thestateshowedhomescrunched together in a chaotic jumble, or smashed into what looked like toothpicks. Fishing boats and pleasure cruisers had been hurled onto the ground as if they were bathtub toys. The streets were a perilous obstacle course of toppled trees and downed wires. In North Fort Myers, where Marion Burkholder, 84, survived the storm by clambering into a dinghy  inside a neighbor's screened-in porch and floating up with the rising waters, Thursday brought dreaded news. Her carpets were sopping and her floors were covered with a dark brown liquid. Her fridge lay on its side. “Everything floated,” said Marvis Long, 96, who lives nearby. \"The water was coming in just like waves inhere.  \n\nMayors, sheriffs and other offiContinued on Page A18  \n\nCHANGED VIEW Gov. Ron DeSantis is seeking the kind of federal aid he once opposed. PAGE A20  \n\nSEVERE TOLL In hard-hit areas of Florida, just 18.5 percent of homes have flood insurance. PAGE A16  \n\n# At Flooded Nursing Home, a Rush to Save Those Too Frail to Walk  \n\nThis article is by Richard Fausset, Campbell Robertson and Shawn Hubler. ORLANDO, Fla. - The emergency call came from the nursing home shortly after 5 a.m.: Water was seeping into the low-slung, low-lying complex called Avante at Orlando and threatening its 106 residents, some too frail to walk.  \n\nBy daybreak, dozens of rescue workers had descended on Avante, which bills itself as a skilled nursing and rehabilitation center. The water in the building was about a foot deep, but it was perhaps as high as three feet in the parking lot outside. Many of the patients, in their 80s or 90s, were wheeled out on cots, their white sheets billowing in the  \n\n# Narrow Escapes Amid the Rising Waters  \n\nwhipping  winds trailing  Hurricane Ian, their faces filled with fear and confusion. Soon, however, they were safe — if shaken and wet — in vans and buses bound for shelters and hospitals.  \n\nAs epic rain and high wind pounded much of central Florida on Thursday, a picture emerged of what the storm had wrought, from wrenching catastrophe to mere gale-force inconvenience. The battered landscape ranged from utter devastation on the southContinued on Page A18  \n\nLast Days of a Toxic Town The town of Wittenoom in Australia was poisoned by asbestos mining. Decades later, its holdouts are being removed so that it can be razed. PAGEA4 NATI0NALA16-25 Judge Overrules Trump Arbiter Judge Aileen M. Cannon eased some demands by the special master she appointed toreview documents seized from the ex-president's home. PAGE A23 SPORTSB6-10 A Worthy Successor Roger Maris's family and teammates see parallels in Aaron Judge's home-run chase and think the former slugger would approve. On Baseball. PAGEB7 OBITUARIESB11-12 'Gangsta's Paradise' Rapper Coolio, whose gritty West Coast hip-hop made him a star in the 1990s, and whose hit song won a Grammy for best rap solo performance, was 59. PAGE B12  \n\nOPINION A26-27   \nDavid Brooks PAGE A27 D354613\" 9  \n\n# TIFFANY & CO.",
    "chunk_order_index": 1,
    "full_doc_id": "doc-2b0e008d88de42057f162223daaf1711"
  }
}