{
  "chunk-bd942966ceb6bc34e6f52613d1da64b1": {
    "tokens": 1200,
    "content": "VOL. CLXXIII . . . . No. 59,941 © 2023  The New York Times Company  \n\nSATURDAY, OCTOBER 14, 2023  \n\n![](images/image_1.jpg)  \nPalestinians who left the northern Gaza Strip made their way south on Friday near Khan Yunis as calls to evacuate persisted.  \n\n# Shaken and Grieving, Jewish New Yorkers Put Aside Differences  \n\n# By JOHN LELAND  \n\nNew York’s Jewish community is the largest outside of Israel, and it is often polarized, particularly regarding Israel and its treatment of Palestinians. Since the brutal terror attacks on Israelis last Saturday, many New York Jews said they have put aside those differences.  \n\nThis week, thousands of Jews from across the political and theological spectrum gathered outside the  United  Nations,  many wrapped in blue and white Israeli flags, coming together both to grieve and to condemn the assault.  \n\nIt was a show of unity that would have been hard to imagine previously, said Eric Goldstein, chief executive of UJA-Federation of New York. “To a large degree the Jewish community has come together in this moment.” New York City has long had uniquely close emotional bonds with Israel, which strengthen in times of crisis — a relationship forged through the atrocities in Europe that led to the country’s founding and created much of New York’s Jewish community. Jewish New Yorkers have looked at Israel as an emblem of home and survival in a hostile world. Tens of thousands of New Yorkers have relatives in Israel, Mr. Goldstein  said.  When  Israel comes under attack, Jewish New Yorkers — including those who might rarely think about Israel — feel the threat. One measure of this relationship: Gov. Kathy Hochul, Mayor Eric Adams and Attorney General Letitia James all addressed the crowd outside the United Nations, supporting both Israel and the city’s Jewish community. Yet that relationship has had its divisions, with many progressive congregations and secular Jews strongly  criticizing  Israel.  This polarization has increased since the rise of the far-right government of Prime Minister Benjamin Netanyahu and a judicial reform program aimed at weakening Israel’s court system.  \n\n![](images/image_2.jpg)  \nA demonstration outside the United Nations on Tuesday.  \n\nAmichai Lau-Lavie, an Israeliborn rabbi who has been vocal about both his criticisms and his love for Israel, said it was time to put aside divisions and focus on shared grief.  \n\n“Right now people are hurting, and we just want to hold each other’s hand and let the divisions be in the back,” he said. “Our political position now makes no difference. Left, right, pro-occupation, antioccupation, don’t know about it — we’re hurting and we’re shocked and we’re horrified and we want Israel to get through this.”  \n\nParticularly for liberal congregations, the attacks have prompted a reconsideration of the language they use in discussing Israel, said Rabbi David Ingber, who  leads  the  progressive Continued on Page A15  \n\n# ISRAEL IS PUSHING GAZA EVACUATION AS SOLDIERS MASS  \n\nBoth Sides Prepare for Ground Invasion Amid Criticism by Aid Groups  \n\nThis article is by Patrick Kingsley, Farnaz Fassihi, Edward Wong and Victoria Kim.  \n\nJERUSALEM — Israel called for the evacuation of more than a million citizens from the northern Gaza Strip and concentrated more armed forces around the enclave on Friday, signaling that it may be preparing to escalate the war with Hamas.  \n\nThe United Nations and international aid and rights groups called Israel’s directive unworkable or unlawful, and urged it to rescind the evacuation. A U.N. spokesman,  Stéphane  Dujarric, said in a statement that the evacuation  could  not  be  conducted “without devastating humanitarian  consequences,”  and  “could transform what is already a tragedy into a calamitous situation.” The Israeli military did not back away from the evacuation plan on Friday but softened its stance, suggesting there was no deadline, after initially saying that people should  leave  northern  Gaza within 24 hours. “We understand it will take time,” Rear Adm. Daniel  Hagari,  the  chief  military spokesman, told reporters.  \n\nIn Gaza, already cut off from vital  supplies,  many  people  fled with what they could carry, not knowing what conditions awaited them in the south or how long they would be gone. But many others remained, out of necessity, fear or defiance.  Hamas,  the  militant group that controls Gaza and conducted a deadly, large-scale incursion into Israel last weekend, has urged people to stay put, calling the Israeli directive “psychological warfare.”  \n\nOn both sides, there is wideContinued on Page A8  \n\n![](images/image_3.jpg)  \n\n# Gaza Residents Flee Amid Fears Of Never Being Able to Return  \n\n# By RAJA ABDULRAHIM  \n\nJERUSALEM — Panic and chaos gripped the northern Gaza Strip Friday as thousands of people fled south in vehicles piled high with blankets and mattresses along two main roads after the Israeli  military  ordered  a  mass evacuation of half of the besieged coastal strip.  \n\nBut rather than finding safety from a feared ground invasion, at least 70 people were killed along the way when Israeli airstrikes hit some  of  the  vehicles  fleeing south,the Gazan authorities said. Some Gaza residents said they feared this could be the start of another permanent mass displacement like the one in 1948, when more than 700,000 Palestinians were expelled or fled their homes in present-day Israel during the war surrounding the nation’s establishment. But it was too soon to tell.  \n\n“As I’m packing my things, I’m wondering: Is this really another nakba?” said Dr. Arwa el-Ray",
    "chunk_order_index": 0,
    "full_doc_id": "doc-73b65d960905de470a3845178d64dfe5"
  },
  "chunk-c3ebf834be10087a234edbccaf21615b": {
    "tokens": 1200,
    "content": "of  the  vehicles  fleeing south,the Gazan authorities said. Some Gaza residents said they feared this could be the start of another permanent mass displacement like the one in 1948, when more than 700,000 Palestinians were expelled or fled their homes in present-day Israel during the war surrounding the nation’s establishment. But it was too soon to tell.  \n\n“As I’m packing my things, I’m wondering: Is this really another nakba?” said Dr. Arwa el-Rayes, a 56-year-old doctor, speaking in the last moments before she left her childhood home in Gaza City in the north. The nakba, which means catastrophe, is how Palestinians refer to the 1948 displacement.  \n\n“I’m taking my house key and thinking, will I ever return to my Continued on Page A8  \n\n# LOUISE GLÜCK, 1943-2023  \n\n# Nobel Laureate Poet’s Prism Was Pain, Trauma and Loss  \n\n# By CLAY RISEN  \n\nLouise Glück, an American poet whose searing, deeply personal work,  often  filtered  through themes of classical mythology, religion and the natural world, won her practically every honor available, including the Pulitzer Prize, the National Book Award and, in 2020, the Nobel Prize for Literature, died on Friday at her home in Cambridge, Mass. She was 80.  \n\nHer death was confirmed by Jonathan Galassi, her editor at Farrar, Straus & Giroux, The Associated Press said. Richard Deming, a friend and former colleague of hers in the English department at Yale, said the cause was cancer. Ms. Glück (pronounced glick) was  widely  considered  to  be among the country’s greatest living poets, long before she won the Nobel. She began publishing in the 1960s and received some acclaim  in  the  ’70s,  but  she  cemented her reputation in the ’80s and early ’90s with a string of books, including “Triumph of Achilles” (1985), which won the National Book Critics Circle Award; “Ararat” (1990); and “The Wild Iris” (1992), which won the Pulitzer Prize.  \n\nHer work was both deeply personal — “Ararat,” for example, drew on the pain she experienced over the death of her father — and broadly accessible, both to critics, who praised her clarity and precise lyricism, and to the broader Continued on Page A24  \n\n![](images/image_4.jpg)  \nLouise Glück in late 2020.  \n\n# Microsoft Gets Merger at Last With Activision  \n\n# By KELLEN BROWNING and DAVID McCABE  \n\nSAN FRANCISCO — Microsoft said on Friday that it had closed its \\$69 billion purchase of the video game giant Activision Blizzard, overcoming  significant  regulatory hurdles in Britain and the United States and signaling that the tech industry’s giants are still free to use their cash hoards to get even bigger.  \n\nThe deal, the largest consumer tech acquisition since AOL bought Time Warner more than two decades  ago,  won  approval  from British regulators on Friday, the last remaining regulatory obstacle.  \n\nThe completion of Microsoft’s Activision acquisition is a clear signal that several years of governments around the world scrutinizing big tech companies have so far done little to curb their power, their growth or their ability to ink megadeals. And the deal could provide a blueprint for other big tech companies on how to sucContinued on Page A21  \n\n# Chinese Bitcoin Mines in U.S. Fuel Suspicions  \n\n# By GABRIEL J.X. DANCE and MICHAEL FORSYTHE  \n\n# Possible Security Risks  \n\nWhen a company with Chinese origins broke ground last year on a  crypto-mining  operation  in Cheyenne, Wyo., a team at Microsoft that assesses national security threats sounded the alarm. Not only was the site next door to a Microsoft data center that supported the Pentagon, it was about a mile away from an Air Force base that controlled nuclear-armed intercontinental ballis  \n\n# and Stress on Grid  \n\nThe location could allow the Chinese to “pursue full-spectrum intelligence  collection  operations,” the Microsoft team wrote in an August 2022 report to the Committee on Foreign Investment in the United States, a federal body that monitors threats posed by A Bit Origin Ltd. operation in Wyoming near an Air Force base.  \n\n![](images/image_5.jpg)  \n\nMicrosoft’s warning did not go unheeded. Speaking on the condition of anonymity, U.S. government officials told The New York Times last week that they had been tracking the Wyoming operation for months. One official said that measures had been taken to mitigate potential intelligence collection but declined to elaborate. In addition, the mining company said it responded to queries from the federal investment committee.  \n\nThe national security concerns about the Wyoming site, previously  unreported, reflect  a broader unease about a recent surge in Chinese Bitcoin mines across the country.  \n\nAside from intelligence-gathering worries, the mines, which are large warehouses or containers packed with specialized computers, put immense pressure on power grids. The computers typically run around the clock while “mining” for the digital coins, the most popular among the various cryptocurrencies.  \n\nBrian Harrell, a former assistant secretary for infrastructure protection at the Department of Homeland  Security  during  the Trump administration, said the Continued on Page A14  \n\n# INTERNATIONAL A4-12  \n\n# NATIONAL A13-21  \n\n# BUSINESS B1-6  \n\n# TRAVEL C7-9  \n\n# ARTS C1-6  \n\nRock Star Now ‘Sewage Czar’ Feargal Sharkey, lead singer of the Undertones, fights for clean water in Britain. The Saturday Profile.  PAGE A12 A Referendum on Ukraine Poland has been a staunch back",
    "chunk_order_index": 1,
    "full_doc_id": "doc-73b65d960905de470a3845178d64dfe5"
  },
  "chunk-b9de16aea70e74f11d0094eb1b0b254f": {
    "tokens": 464,
    "content": "during  the Trump administration, said the Continued on Page A14  \n\n# INTERNATIONAL A4-12  \n\n# NATIONAL A13-21  \n\n# BUSINESS B1-6  \n\n# TRAVEL C7-9  \n\n# ARTS C1-6  \n\nRock Star Now ‘Sewage Czar’ Feargal Sharkey, lead singer of the Undertones, fights for clean water in Britain. The Saturday Profile.  PAGE A12 A Referendum on Ukraine Poland has been a staunch backer. But entering Sunday’s election, the right is focusing on domestic issues.  PAGE A6 A Pitch to Native Americans Ruben Gallego, a Democrat seeking a Senate seat in Arizona, has vowed to call on all 22 of its federally recognized tribes. PAGE A13 ‘Ring of Fire’ for the Moon An annular solar eclipse, in which the moon doesn’t quite cover the sun, will swoop over the West. PAGE A20 SPORTS B7-10 18 and Navigating the N.H.L. Can a teen handle the rigors of the league and newfound stardom? Chicago’s Connor Bedard is about to find out. PAGE B7 A Cooling Labor Market? After scrambling to fill out work forces in recent years, many companies are reporting more modest goals for seasonal employment. PAGE B1 A ‘Shadow’ Lending Market Apollo used annuities to build a major financing business. Others followed, worrying regulators. PAGE B1 THIS WEEKEND Being 13 in America A special section providing an in-depth look at a year in the life of three girls from different parts of the country.  \n\n![](images/image_6.jpg)  \n\nCruising the Rhone in Style A reporter takes a luxury river cruise in France, wondering whether it was a wise thing to do. PAGE C7 Autumn Fun on Two Wheels There are few better ways to revel amid the leaves than by cycling down dirt or gravel roads and paths. PAGE C8 Touchdown at La Guardia A five-ton aerial sculpture created by Richard Lippold for Lincoln Center has been reinstalled at the airport.  PAGE C1 Scrolls That Survived Vesuvius Methods used to retrieve hidden text on delicate papyrus may help scholars locate lost ancient works. PAGE C1  \n\n![](images/image_7.jpg)",
    "chunk_order_index": 2,
    "full_doc_id": "doc-73b65d960905de470a3845178d64dfe5"
  }
}