{
    "image_1": [
        {
            "merged_entity_name": "ALICE",
            "entity_type": "PERSON",
            "description": "The main character in the story, a young girl with long hair, wearing a dress, and interacting with various creatures including a small rabbit. She navigates through a series of adventures, trying to reach the garden door with the golden key and experiences changes in size.",
            "source_image_entities": [
                "ALICE"
            ],
            "source_text_entities": [
                "\"ALICE\""
            ]
        },
        {
            "merged_entity_name": "WHITE RABBIT",
            "entity_type": "PERSON",
            "description": "A small rabbit standing on its hind legs, wearing a waistcoat and holding a watch, who is in a hurry and is associated with a pair of white kid-gloves and a fan. He is worried about keeping the Duchess waiting.",
            "source_image_entities": [
                "RABBIT"
            ],
            "source_text_entities": [
                "\"WHITE RABBIT\""
            ]
        }
    ],
    "image_2": [
        {
            "merged_entity_name": "ALICE",
            "entity_type": "PERSON",
            "description": "The main character in the story, interacting with various creatures and navigating through a series of adventures. She is a young girl with long hair, wearing a dress, swimming in water, and looking surprised. Alice is also referred to as 'MISS ALICE' in a hypothetical scenario.",
            "source_image_entities": [
                "ALICE"
            ],
            "source_text_entities": [
                "\"ALICE\"",
                "\"MOUSE\""
            ]
        },
        {
            "merged_entity_name": "WATER",
            "entity_type": "GEO",
            "description": "The medium in which Alice is swimming, depicted as waves around her. Initially, Alice thinks she has fallen into the sea, but later realizes it is the pool of tears which she had wept when she was nine feet high.",
            "source_image_entities": [
                "WATER"
            ],
            "source_text_entities": [
                "\"POOL OF TEARS\"",
                "\"SEA\""
            ]
        },
        {
            "merged_entity_name": "DRESS",
            "entity_type": "OBJECT",
            "description": "The clothing Alice is wearing while swimming, partially submerged in water.",
            "source_image_entities": [
                "DRESS"
            ],
            "source_text_entities": []
        }
    ],
    "image_3": [
        {
            "merged_entity_name": "ALICE",
            "entity_type": "PERSON",
            "description": "A young girl with long hair, swimming in a pool of tears, and interacting with various creatures while navigating through a series of adventures.",
            "source_image_entities": [
                "ALICE"
            ],
            "source_text_entities": [
                "\"ALICE\""
            ]
        },
        {
            "merged_entity_name": "MOUSE",
            "entity_type": "ANIMAL",
            "description": "A small mouse swimming alongside Alice in the pool of tears, with whom Alice has a conversation.",
            "source_image_entities": [
                "MOUSE"
            ],
            "source_text_entities": [
                "\"MOUSE\""
            ]
        }
    ],
    "image_4": [
        {
            "merged_entity_name": "ALICE",
            "entity_type": "PERSON",
            "description": "The main character in the story, interacting with various creatures and navigating through a series of adventures. She is a young girl with long hair, sitting on the ground, surrounded by various animals, and is also referred to as 'MISS ALICE' in a hypothetical scenario.",
            "source_image_entities": [
                "ALICE"
            ],
            "source_text_entities": [
                "\"ALICE\"",
                "\"ALICE\""
            ]
        },
        {
            "merged_entity_name": "MOUSE",
            "entity_type": "ANIMAL",
            "description": "A small rodent standing near Alice, looking up, and a character with authority among the animals, attempting to tell a story to make everyone dry and leading the Caucus-race.",
            "source_image_entities": [
                "MOUSE"
            ],
            "source_text_entities": [
                "\"MOUSE\"",
                "\"MOUSE\""
            ]
        },
        {
            "merged_entity_name": "CRAB",
            "entity_type": "ANIMAL",
            "description": "A large crab with its claws raised, situated in front of Alice, and an older character who imparts wisdom to her daughter and interacts with Alice; also referred to as 'CRAB' and 'YOUNG CRAB' for the mother and daughter respectively.",
            "source_image_entities": [
                "CRAB"
            ],
            "source_text_entities": [
                "\"CRAB\""
            ]
        },
        {
            "merged_entity_name": "BIRDS",
            "entity_type": "ANIMAL",
            "description": "Various birds, including owls and other types, gathered around Alice, and the pool was getting quite crowded with the birds and animals that had fallen into it: there was a Duck and a Dodo, a Lory and an Eaglet, and several other curious creatures.",
            "source_image_entities": [
                "BIRDS"
            ],
            "source_text_entities": [
                "\"DUCK\"",
                "\"DODO\"",
                "\"EAGLET\"",
                "\"LORY\""
            ]
        }
    ],
    "image_5": [
        {
            "merged_entity_name": "ALICE",
            "entity_type": "PERSON",
            "description": "The main character in the story, interacting with various creatures and navigating through a series of adventures, including the Caucus-race. She is also referred to as 'MISS ALICE' in a hypothetical scenario.",
            "source_image_entities": [
                "ALICE"
            ],
            "source_text_entities": [
                "\"ALICE\"",
                "\"ALICE\""
            ]
        },
        {
            "merged_entity_name": "DODO",
            "entity_type": "PERSON",
            "description": "A large, plump bird with a long beak, holding a cane and appearing to speak to Alice. The Dodo is a character that suggests a Caucus-race as a solution to dry everyone off and later decides that everyone wins, embodying a sense of fairness and whimsy.",
            "source_image_entities": [
                "DODO"
            ],
            "source_text_entities": [
                "\"DODO\"",
                "\"DODO\""
            ]
        },
        {
            "merged_entity_name": "CAUCUS-RACE",
            "entity_type": "EVENT",
            "description": "The Caucus-race is a made-up event suggested by the Dodo to help dry off the wet animals and birds. It is characterized by a lack of formal start and end, and eventually, everyone is declared a winner.",
            "source_image_entities": [
                "BIRDS"
            ],
            "source_text_entities": [
                "\"CAUCUS-RACE\"",
                "\"CAUCUS-RACE\""
            ]
        }
    ],
    "image_6": [
        {
            "merged_entity_name": "ALICE",
            "entity_type": "PERSON",
            "description": "A young girl with long hair, wearing a dress, sitting at a table, and interacting with various creatures while navigating through a series of adventures. She is also referred to as 'MISS ALICE' in a hypothetical scenario.",
            "source_image_entities": [
                "ALICE"
            ],
            "source_text_entities": [
                "\"ALICE\"",
                "\"MISS ALICE\""
            ]
        },
        {
            "merged_entity_name": "TABLE",
            "entity_type": "OBJECT",
            "description": "A wooden table with a cloth on it, where Alice is sitting.",
            "source_image_entities": [
                "TABLE"
            ],
            "source_text_entities": []
        },
        {
            "merged_entity_name": "ROOM",
            "entity_type": "GEO",
            "description": "An indoor setting with a window and a fireplace, where Alice finds herself growing larger and getting trapped.",
            "source_image_entities": [
                "ROOM"
            ],
            "source_text_entities": []
        },
        {
            "merged_entity_name": "WHITE RABBIT",
            "entity_type": "PERSON",
            "description": "The White Rabbit is a character who is anxious and appears to be in search of items, mistaking Alice for a housemaid named Mary Ann.",
            "source_image_entities": [],
            "source_text_entities": [
                "\"WHITE RABBIT\""
            ]
        },
        {
            "merged_entity_name": "MARY ANN",
            "entity_type": "PERSON",
            "description": "Mary Ann is the housemaid whom the White Rabbit mistakes Alice for, ordering her to fetch items.",
            "source_image_entities": [],
            "source_text_entities": [
                "\"MARY ANN\""
            ]
        },
        {
            "merged_entity_name": "RABBIT",
            "entity_type": "PERSON",
            "description": "The Rabbit is a character who is looking for Alice, tries to open the door, and communicates with Pat.",
            "source_image_entities": [],
            "source_text_entities": [
                "\"RABBIT\""
            ]
        },
        {
            "merged_entity_name": "PAT",
            "entity_type": "PERSON",
            "description": "Pat is a character who is addressed by the Rabbit and is involved in the conversation about Alice's arm.",
            "source_image_entities": [],
            "source_text_entities": [
                "\"PAT\""
            ]
        },
        {
            "merged_entity_name": "CUCUMBER-FRAME",
            "entity_type": "GEO",
            "description": "A structure where the Rabbit might have fallen, as inferred from the sound of broken glass and Alice's conclusion.",
            "source_image_entities": [],
            "source_text_entities": [
                "\"CUCUMBER-FRAME\""
            ]
        }
    ],
    "image_7": [
        {
            "merged_entity_name": "ALICE",
            "entity_type": "PERSON",
            "description": "The main character in the story, interacting with various creatures and navigating through a series of adventures. She is also referred to as 'MISS ALICE' in a hypothetical scenario. Alice is depicted as a large figure reaching out of the window and up the chimney due to her growth, and she is the one who grabs the rabbit.",
            "source_image_entities": [
                "HAND",
                "RABBIT"
            ],
            "source_text_entities": [
                "\"ALICE\"",
                "\"RABBIT\""
            ]
        },
        {
            "merged_entity_name": "WINDOW",
            "entity_type": "GEO",
            "description": "A small window with a flower pot on the sill, through which Alice tries to escape by putting her arm out. It is also the point of discussion between the Rabbit and Pat when they see Alice's arm.",
            "source_image_entities": [
                "WINDOW"
            ],
            "source_text_entities": [
                "\"WINDOW\"",
                "\"ARM\""
            ]
        }
    ],
    "image_8": [
        {
            "merged_entity_name": "LIZARD (BILL)",
            "entity_type": "ANIMAL",
            "description": "Bill, also known as the Lizard, is depicted in an upright position emerging from a chimney. He is a character who is often tasked with difficult jobs, ends up being kicked by Alice in the chimney, and is later helped by two guinea-pigs after his encounter with Alice.",
            "source_image_entities": [
                "LIZARD"
            ],
            "source_text_entities": [
                "BILL (THE LITTLE LIZARD)"
            ]
        },
        {
            "merged_entity_name": "CHIMNEY",
            "entity_type": "OBJECT",
            "description": "A stone chimney with a damaged top, emitting smoke. The chimney is a significant location in the text, where Alice kicks Bill and later uses to escape.",
            "source_image_entities": [
                "CHIMNEY"
            ],
            "source_text_entities": [
                "CHIMNEY"
            ]
        }
    ],
    "image_9": [
        {
            "merged_entity_name": "Alice",
            "entity_type": "PERSON",
            "description": "The main character in the story, interacting with various creatures including a GIRL and navigating through a series of adventures. She is also referred to as 'MISS ALICE' in a hypothetical scenario.",
            "source_image_entities": [
                "GIRL"
            ],
            "source_text_entities": [
                "\"ALICE\""
            ]
        },
        {
            "merged_entity_name": "Puppy",
            "entity_type": "ANIMAL",
            "description": "The Puppy is a large, playful creature that Alice encounters and interacts with in the wood, appearing surprised or excited.",
            "source_image_entities": [
                "DOG"
            ],
            "source_text_entities": [
                "\"PUPPY\""
            ]
        },
        {
            "merged_entity_name": "Thorny Plant",
            "entity_type": "OBJECT",
            "description": "A thorny plant that Alice encounters and the GIRL is touching, also known as a thistle in the story.",
            "source_image_entities": [
                "PLANT"
            ],
            "source_text_entities": [
                "\"MUSHROOM\""
            ]
        },
        {
            "merged_entity_name": "Caterpillar",
            "entity_type": "PERSON",
            "description": "The Caterpillar is a blue creature that Alice finds sitting on a mushroom, smoking a hookah, and engages in a conversation with her.",
            "source_image_entities": [],
            "source_text_entities": [
                "\"CATERPILLAR\""
            ]
        }
    ],
    "image_10": [
        {
            "merged_entity_name": "ALICE",
            "entity_type": "PERSON",
            "description": "A young girl with long hair, wearing a dress, standing and looking up at the caterpillar. The main character in the story, interacting with various creatures and navigating through a series of adventures. She is also referred to as 'MISS ALICE' in a hypothetical scenario.",
            "source_image_entities": [
                "ALICE"
            ],
            "source_text_entities": [
                "\"ALICE\"",
                "\"ALICE\""
            ]
        },
        {
            "merged_entity_name": "CATERPILLAR",
            "entity_type": "PERSON",
            "description": "A large caterpillar sitting on a mushroom, smoking a hookah and wearing a jacket. The Caterpillar is a blue creature that Alice finds sitting on a mushroom, smoking a hookah, and engages in a conversation with her. The Caterpillar is a character who interacts with Alice, asking her questions and providing her with information about her size and the mushroom.",
            "source_image_entities": [
                "CATERPILLAR"
            ],
            "source_text_entities": [
                "\"CATERPILLAR\"",
                "\"CATERPILLAR\""
            ]
        },
        {
            "merged_entity_name": "MUSHROOM",
            "entity_type": "GEO",
            "description": "A large mushroom on which the caterpillar is sitting. The Mushroom is a large fungi that Alice encounters, which is as tall as her and on top of which the Caterpillar is sitting. The Mushroom is an object in the story that has sides which can make one grow taller or shorter when eaten.",
            "source_image_entities": [
                "MUSHROOM"
            ],
            "source_text_entities": [
                "\"MUSHROOM\"",
                "\"MUSHROOM\""
            ]
        },
        {
            "merged_entity_name": "HOOKAH",
            "entity_type": "OBJECT",
            "description": "A hookah from which the caterpillar is smoking. The Hookah is a pipe used by the Caterpillar for smoking, which it takes out of its mouth to speak to Alice.",
            "source_image_entities": [
                "HOOKAH"
            ],
            "source_text_entities": [
                "\"HOOKAH\""
            ]
        }
    ],
    "image_11": [
        {
            "merged_entity_name": "Caterpillar",
            "entity_type": "PERSON",
            "description": "The Caterpillar is a blue creature that Alice finds sitting on a mushroom, smoking a hookah, and engages in a conversation with her. A man dressed in a hat and boots, holding a staff, standing next to a tied-up creature.",
            "source_image_entities": [
                "MAN WITH STAFF"
            ],
            "source_text_entities": [
                "CATERPILLAR"
            ]
        },
        {
            "merged_entity_name": "Tied-Up Creature",
            "entity_type": "PERSON",
            "description": "A creature with its legs up and body wrapped in cloth, standing on a rock. The Caterpillar is a character who interacts with Alice, asking her questions and providing her with information about her size and the mushroom.",
            "source_image_entities": [
                "TIED-UP CREATURE"
            ],
            "source_text_entities": [
                "CATERPILLAR"
            ]
        },
        {
            "merged_entity_name": "Mushroom",
            "entity_type": "GEO",
            "description": "The Mushroom is a large fungi that Alice encounters, which is as tall as her and on top of which the Caterpillar is sitting. A large rock on which the tied-up creature is standing.",
            "source_image_entities": [
                "ROCK"
            ],
            "source_text_entities": [
                "MUSHROOM"
            ]
        },
        {
            "merged_entity_name": "Landscape",
            "entity_type": "GEO",
            "description": "A landscape with trees and hills in the background. The Trees are mentioned as the green stuff Alice sees and later realizes they are the tops of the trees she had been wandering under.",
            "source_image_entities": [
                "LANDSCAPE"
            ],
            "source_text_entities": [
                "TREES"
            ]
        }
    ],
    "image_12": [
        {
            "merged_entity_name": "ALICE",
            "entity_type": "PERSON",
            "description": "The main character in the story, interacting with various creatures including the Caterpillar and navigating through a series of adventures. She is also referred to as 'MISS ALICE' in a hypothetical scenario. Alice is a young girl with a surprised expression, wearing a dress and apron, standing in a room.",
            "source_image_entities": [
                "ALICE"
            ],
            "source_text_entities": [
                "\"ALICE\"",
                "\"ALICE\"",
                "\"CATERPILLAR\"",
                "\"MUSHROOM\""
            ]
        },
        {
            "merged_entity_name": "CATERPILLAR",
            "entity_type": "PERSON",
            "description": "The Caterpillar is a blue creature that Alice finds sitting on a mushroom, smoking a hookah, and engages in a conversation with her. The Caterpillar is a character who provides Alice with information about her size and the mushroom, and is also a character that interacts with Alice, asking her questions.",
            "source_image_entities": [
                "FAT MAN"
            ],
            "source_text_entities": [
                "\"CATERPILLAR\"",
                "\"CATERPILLAR\"",
                "\"HOOKAH\""
            ]
        },
        {
            "merged_entity_name": "ROOM",
            "entity_type": "GEO",
            "description": "An indoor setting with wooden walls, a chair, and a table, which is the location of Alice's interactions with the Caterpillar.",
            "source_image_entities": [
                "ROOM"
            ],
            "source_text_entities": []
        },
        {
            "merged_entity_name": "DOOR",
            "entity_type": "OBJECT",
            "description": "A wooden door through which the Fat Man is falling, mentioned as the place where Father William performed a back-somersault, showcasing his agility.",
            "source_image_entities": [
                "DOOR"
            ],
            "source_text_entities": [
                "\"DOOR\""
            ]
        },
        {
            "merged_entity_name": "MUSHROOM",
            "entity_type": "GEO",
            "description": "The Mushroom is a large fungi that Alice encounters, which is as tall as her and on top of which the Caterpillar is sitting. It is also an object in the story that has sides which can make one grow taller or shorter when eaten, and is a central object in the story with two sides that cause Alice to grow taller or shorter.",
            "source_image_entities": [],
            "source_text_entities": [
                "\"MUSHROOM\"",
                "\"MUSHROOM\"",
                "\"MUSHROOM\""
            ]
        }
    ],
    "image_13": [
        {
            "merged_entity_name": "Caterpillar",
            "entity_type": "PERSON",
            "description": "The Caterpillar is a blue creature that Alice finds sitting on a mushroom, smoking a hookah, and engages in a conversation with her. An older man with a bald head, wearing a decorated jacket, sitting at the table.",
            "source_image_entities": [
                "MAN"
            ],
            "source_text_entities": [
                "CATERPILLAR"
            ]
        },
        {
            "merged_entity_name": "Mushroom",
            "entity_type": "GEO",
            "description": "The Mushroom is a large fungi that Alice encounters, which is as tall as her and on top of which the Caterpillar is sitting. A table covered with a cloth, holding various items including a pot, a pan, and a jug, with the Caterpillar sitting on top.",
            "source_image_entities": [
                "TABLE"
            ],
            "source_text_entities": [
                "MUSHROOM"
            ]
        },
        {
            "merged_entity_name": "Alice",
            "entity_type": "PERSON",
            "description": "The main character in the story, interacting with various creatures and navigating through a series of adventures. She is also referred to as 'MISS ALICE' in a hypothetical scenario. A woman in a dress and hat, pouring from a large pot into a pan on the table.",
            "source_image_entities": [
                "WOMAN"
            ],
            "source_text_entities": [
                "ALICE"
            ]
        },
        {
            "merged_entity_name": "Hookah",
            "entity_type": "OBJECT",
            "description": "The Hookah is a pipe used by the Caterpillar for smoking, which it takes out of its mouth to speak to Alice. A jug placed on the table near the man, which is the hookah used by the Caterpillar.",
            "source_image_entities": [
                "JUG"
            ],
            "source_text_entities": [
                "HOOKAH"
            ]
        }
    ],
    "image_14": [
        {
            "merged_entity_name": "Tweedledee and Tweedledum",
            "entity_type": "PERSON",
            "description": "Tweedledee and Tweedledum are characters with a similar appearance, often depicted as round-faced and wearing patterned clothing. They are known for their humorous interactions and are part of the fantasy world that Alice encounters in her adventures.",
            "source_image_entities": [
                "TWEEDLEDEE",
                "TWEEDLEDUM"
            ],
            "source_text_entities": []
        },
        {
            "merged_entity_name": "BELL",
            "entity_type": "OBJECT",
            "description": "The Bell is an object typically associated with Tweedledum, who is often depicted holding and ringing it. It is an element of the whimsical setting and interactions involving Tweedledee and Tweedledum.",
            "source_image_entities": [
                "BELL"
            ],
            "source_text_entities": []
        },
        {
            "merged_entity_name": "TREES",
            "entity_type": "GEO",
            "description": "The Trees are a natural part of the landscape in the story, providing a setting for various encounters and adventures. They are mentioned as the green stuff Alice sees and later realizes they are the tops of the trees she had been wandering under.",
            "source_image_entities": [
                "TREES"
            ],
            "source_text_entities": [
                "TREES"
            ]
        },
        {
            "merged_entity_name": "BRIDGE",
            "entity_type": "GEO",
            "description": "The Bridge is a structure in the background of the scene, adding to the landscape and contributing to the setting of the story.",
            "source_image_entities": [
                "BRIDGE"
            ],
            "source_text_entities": []
        },
        {
            "merged_entity_name": "CATERPILLAR",
            "entity_type": "PERSON",
            "description": "The Caterpillar is a blue creature that Alice finds sitting on a mushroom, smoking a hookah, and engages in a conversation with her. It provides Alice with information about the effects of the mushroom and is a central character in her journey.",
            "source_image_entities": [],
            "source_text_entities": [
                "CATERPILLAR",
                "CATERPILLAR",
                "CATERPILLAR"
            ]
        },
        {
            "merged_entity_name": "HOOKAH",
            "entity_type": "OBJECT",
            "description": "The Hookah is a pipe used by the Caterpillar for smoking, which it takes out of its mouth to speak to Alice. It is an object that indicates a change in the Caterpillar's actions and is part of the interaction between Alice and the Caterpillar.",
            "source_image_entities": [],
            "source_text_entities": [
                "HOOKAH",
                "HOOKAH"
            ]
        },
        {
            "merged_entity_name": "MUSHROOM",
            "entity_type": "GEO",
            "description": "The Mushroom is a large fungi that Alice encounters, which is as tall as her and on top of which the Caterpillar is sitting. It is also an object in the story that has sides which can make one grow taller or shorter when eaten, playing a central role in Alice's size-changing experiences.",
            "source_image_entities": [],
            "source_text_entities": [
                "MUSHROOM",
                "MUSHROOM",
                "MUSHROOM"
            ]
        }
    ],
    "image_15": [
        {
            "merged_entity_name": "Mushroom",
            "entity_type": "GEO",
            "description": "The Mushroom is an object in the story that has sides which can make one grow taller or shorter when eaten, and is used by Alice to change her size.",
            "source_image_entities": [
                "STAR PATTERN"
            ],
            "source_text_entities": [
                "MUSHROOM"
            ]
        }
    ],
    "image_16": [
        {
            "merged_entity_name": "SQUIRREL",
            "entity_type": "PERSON",
            "description": "A squirrel dressed in a military uniform, holding an envelope with a crown seal, which is involved in the Croquet Invitation Event.",
            "source_image_entities": [
                "SQUIRREL"
            ],
            "source_text_entities": [
                "CROQUET INVITATION EVENT"
            ]
        },
        {
            "merged_entity_name": "ENVELOPE",
            "entity_type": "OBJECT",
            "description": "An envelope with a crown seal, being handed from the squirrel to the toad, which is central to the Croquet Invitation Event.",
            "source_image_entities": [
                "ENVELOPE"
            ],
            "source_text_entities": [
                "CROQUET INVITATION EVENT"
            ]
        }
    ],
    "image_17": [
        {
            "merged_entity_name": "ALICE",
            "entity_type": "PERSON",
            "description": "The main character in the story, interacting with various creatures and navigating through a series of adventures. She is a young girl with long hair, wearing a dress, standing and observing the scene.",
            "source_image_entities": [
                "ALICE"
            ],
            "source_text_entities": [
                "\"ALICE\""
            ]
        },
        {
            "merged_entity_name": "QUEEN OF HEARTS",
            "entity_type": "PERSON",
            "description": "A large, crowned figure with an angry expression, sitting on a throne. She is a character who the Duchess is preparing to play croquet with.",
            "source_image_entities": [
                "QUEEN OF HEARTS"
            ],
            "source_text_entities": [
                "\"QUEEN\""
            ]
        },
        {
            "merged_entity_name": "BABY",
            "entity_type": "PERSON",
            "description": "A small, crying figure being held by the Queen of Hearts. It is also referred to as the 'Pig Baby' by the Cat and Alice, which turned into a pig.",
            "source_image_entities": [
                "BABY"
            ],
            "source_text_entities": [
                "\"PIG BABY\""
            ]
        },
        {
            "merged_entity_name": "COOK",
            "entity_type": "PERSON",
            "description": "A figure with a long nose and hat, holding a ladle and stirring a pot. The cook is a character in the kitchen who throws items at the Duchess and the baby.",
            "source_image_entities": [
                "COOK"
            ],
            "source_text_entities": [
                "\"COOK\""
            ]
        },
        {
            "merged_entity_name": "CHESHIRE CAT",
            "entity_type": "ANIMAL",
            "description": "A grinning cat with striped fur, sitting on the floor. It is known for its grinning, mentioned by the Duchess and lying on the hearth in the kitchen.",
            "source_image_entities": [
                "CHESHIRE CAT"
            ],
            "source_text_entities": [
                "\"CHESHIRE-CAT HEARTH\""
            ]
        },
        {
            "merged_entity_name": "THRONE",
            "entity_type": "OBJECT",
            "description": "An ornate chair with a crown on top, where the Queen of Hearts is seated.",
            "source_image_entities": [
                "THRONE"
            ],
            "source_text_entities": []
        },
        {
            "merged_entity_name": "POT",
            "entity_type": "OBJECT",
            "description": "The Cook is stirring a Pot with a ladle. The cauldron is a large pot over the fire, filled with soup that seems to have too much pepper.",
            "source_image_entities": [
                "POT"
            ],
            "source_text_entities": [
                "\"CAULDRON\""
            ]
        },
        {
            "merged_entity_name": "FLOOR",
            "entity_type": "UNKNOWN",
            "description": "The Cheshire Cat is sitting on the Floor, grinning.",
            "source_image_entities": [
                "FLOOR"
            ],
            "source_text_entities": []
        },
        {
            "merged_entity_name": "DUCHESS",
            "entity_type": "PERSON",
            "description": "The Duchess is a character who is nursing a baby and has a conversation with Alice about Cheshire-Cats. She is mentioned as the recipient of an invitation to play croquet, sent by the Queen.",
            "source_image_entities": [],
            "source_text_entities": [
                "\"DUCHESS\""
            ]
        }
    ],
    "image_18": [
        {
            "merged_entity_name": "ALICE",
            "entity_type": "PERSON",
            "description": "The main character in the story, interacting with various creatures and navigating through a series of adventures. She is a young girl with long hair, wearing a dress and shoes, and at one point holds a pig-like creature which turns into a pig.",
            "source_image_entities": [
                "ALICE"
            ],
            "source_text_entities": [
                "\"ALICE\""
            ]
        },
        {
            "merged_entity_name": "PIG BABY",
            "entity_type": "OBJECT",
            "description": "A character mentioned by the Cat and Alice, which turned into a pig. It was a queer-shaped little creature, initially being held by Alice and later set down in the wood.",
            "source_image_entities": [
                "PIG"
            ],
            "source_text_entities": [
                "\"PIG BABY\""
            ]
        },
        {
            "merged_entity_name": "FLOWERS",
            "entity_type": "GEO",
            "description": "Bouquet of flowers held by the pig-like creature, which later turned into a pig.",
            "source_image_entities": [
                "FLOWERS"
            ],
            "source_text_entities": []
        },
        {
            "merged_entity_name": "GRASS",
            "entity_type": "GEO",
            "description": "Tall grass surrounding Alice and the pig-like creature, which later turned into a pig.",
            "source_image_entities": [
                "GRASS"
            ],
            "source_text_entities": []
        },
        {
            "merged_entity_name": "CHESHIRE-CAT",
            "entity_type": "PERSON",
            "description": "A mysterious character known for its grinning, mentioned by the Duchess and lying on the hearth in the kitchen. It engages in conversation with Alice about the nature of madness and the inhabitants around them.",
            "source_image_entities": [],
            "source_text_entities": [
                "\"CHESHIRE-CAT HEARTH\""
            ]
        },
        {
            "merged_entity_name": "CROQUET WITH THE QUEEN",
            "entity_type": "EVENT",
            "description": "An event that the Duchess is preparing for and Alice expresses interest in attending, involving a game of croquet with the Queen.",
            "source_image_entities": [],
            "source_text_entities": [
                "\"CROQUET WITH THE QUEEN\"",
                "\"CROQUET GAME WITH THE QUEEN\""
            ]
        }
    ],
    "image_19": [
        {
            "merged_entity_name": "ALICE",
            "entity_type": "PERSON",
            "description": "The main character in the story, interacting with various creatures and navigating through a series of adventures. She is a young girl with long hair, wearing a dress, standing and looking up.",
            "source_image_entities": [
                "ALICE"
            ],
            "source_text_entities": [
                "\"ALICE\"",
                "\"ALICE\""
            ]
        },
        {
            "merged_entity_name": "CHESHIRE CAT",
            "entity_type": "PERSON",
            "description": "A cat with a wide grin, sitting on a tree branch, known for its grinning, mentioned by the Duchess and lying on the hearth in the kitchen. It is a mysterious character who appears and vanishes, engaging in conversation with Alice.",
            "source_image_entities": [
                "CHESHIRE CAT"
            ],
            "source_text_entities": [
                "\"CHESHIRE-CAT HEARTH\"",
                "\"THE CAT\""
            ]
        },
        {
            "merged_entity_name": "TREE",
            "entity_type": "GEO",
            "description": "A tall tree with branches where the Cheshire Cat is sitting.",
            "source_image_entities": [
                "TREE"
            ],
            "source_text_entities": []
        },
        {
            "merged_entity_name": "FOREST",
            "entity_type": "GEO",
            "description": "A dense forest surrounding Alice and the tree, also known as the wood where Alice sets the pig down and watches it trot away.",
            "source_image_entities": [
                "FOREST"
            ],
            "source_text_entities": [
                "\"WOOD\""
            ]
        }
    ],
    "image_20": [
        {
            "merged_entity_name": "CHESHIRE CAT",
            "entity_type": "PERSON",
            "description": "The Cheshire Cat is a grinning cat with a wide smile, known for its mysterious appearances and disappearances, partially hidden in the branches of a tree, and engages in conversation with Alice.",
            "source_image_entities": [
                "CHESHIRE CAT"
            ],
            "source_text_entities": [
                "THE CAT"
            ]
        },
        {
            "merged_entity_name": "TREE",
            "entity_type": "GEO",
            "description": "A detailed, leafy tree with many branches, some of which are occupied by the Cheshire Cat, and is also the location for a table set out under it where the March Hare and the Hatter are having tea.",
            "source_image_entities": [
                "TREE"
            ],
            "source_text_entities": [
                "HOUSE OF THE MARCH HARE"
            ]
        }
    ],
    "image_21": [
        {
            "merged_entity_name": "ALICE",
            "entity_type": "PERSON",
            "description": "The main character in the story, interacting with various creatures and navigating through a series of adventures. She is a young girl with long hair, sitting at a table, and is also referred to as 'MISS ALICE' in a hypothetical scenario.",
            "source_image_entities": [
                "ALICE"
            ],
            "source_text_entities": [
                "ALICE"
            ]
        },
        {
            "merged_entity_name": "MARCH HARE",
            "entity_type": "PERSON",
            "description": "An anthropomorphic hare wearing a suit and hat, sitting at the table, and is having tea with the Hatter, using the Dormouse as a cushion. He is known for his remarks and involvement in the tea party with the Hatter and Alice.",
            "source_image_entities": [
                "MARCH HARE"
            ],
            "source_text_entities": [
                "MARCH HARE"
            ]
        },
        {
            "merged_entity_name": "MAD HATTER",
            "entity_type": "PERSON",
            "description": "An eccentric man wearing a large top hat labeled '10/6', sitting at the table, and is having tea with the March Hare. He makes personal remarks to Alice and is known for his peculiar statements and behavior.",
            "source_image_entities": [
                "MAD HATTER"
            ],
            "source_text_entities": [
                "HATTER"
            ]
        },
        {
            "merged_entity_name": "DORMOUSE",
            "entity_type": "PERSON",
            "description": "A small mouse sleeping on the March Hare's shoulder, and is being used as a cushion by the March Hare and the Hatter during their conversation.",
            "source_image_entities": [
                "DORMOUSE"
            ],
            "source_text_entities": [
                "DORMOUSE"
            ]
        },
        {
            "merged_entity_name": "TABLE",
            "entity_type": "OBJECT",
            "description": "A table set for tea with cups, saucers, and a teapot, where the March Hare, the Hatter, and the Dormouse are having tea, and Alice sits down to join them.",
            "source_image_entities": [
                "TABLE"
            ],
            "source_text_entities": [
                "TABLE"
            ]
        }
    ],
    "image_22": [
        {
            "merged_entity_name": "MAD HATTER",
            "entity_type": "PERSON",
            "description": "A character from Alice in Wonderland, depicted with wild hair, a large hat with a card reading '10/6', and a surprised or shocked expression. The Hatter is a character who engages in a conversation with Alice and the March Hare, known for his peculiar statements and behavior. He is also known for his watch that tells the day of the month but not the time and his interaction with Time.",
            "source_image_entities": [
                "MAD HATTER"
            ],
            "source_text_entities": [
                "HATTER",
                "HATTER",
                "HATTER"
            ]
        },
        {
            "merged_entity_name": "DORMOUSE",
            "entity_type": "PERSON",
            "description": "A small creature, likely a dormouse, sitting next to the Mad Hatter with a sleepy or dazed expression. The Dormouse is a character who often falls asleep during conversations and makes remarks without fully waking up, and is used as a cushion by the March Hare and the Hatter during the tea party.",
            "source_image_entities": [
                "DORMOUSE"
            ],
            "source_text_entities": [
                "DORMOUSE",
                "DORMOUSE",
                "DORMOUSE"
            ]
        },
        {
            "merged_entity_name": "MARCH HARE",
            "entity_type": "PERSON",
            "description": "The March Hare is a character who is having tea with the Hatter and using the Dormouse as a cushion. He is known for his remarks and involvement in the tea party with the Hatter and Alice, and for his distinctive house with chimneys shaped like ears.",
            "source_image_entities": [],
            "source_text_entities": [
                "MARCH HARE",
                "MARCH HARE",
                "MARCH HARE"
            ]
        },
        {
            "merged_entity_name": "TEA PARTY",
            "entity_type": "EVENT",
            "description": "The tea party is the event where the Hatter, March Hare, and Dormouse engage in their nonsensical conversation with Alice. It involves two tea cups on saucers placed on a table in front of the Mad Hatter and the Dormouse, and is set with two cups and a plate for tea.",
            "source_image_entities": [
                "TEA CUPS",
                "TABLE"
            ],
            "source_text_entities": [
                "TEA PARTY",
                "MAD TEA-PARTY"
            ]
        }
    ],
    "image_23": [
        {
            "merged_entity_name": "MAD HATTER",
            "entity_type": "PERSON",
            "description": "A human-like character wearing a large top hat and a suit, standing next to the March Hare, known for his rudeness towards Alice and part of the nonsensical conversation during the tea party.",
            "source_image_entities": [
                "MAD HATTER"
            ],
            "source_text_entities": [
                "MAD HATTER",
                "HATTER"
            ]
        },
        {
            "merged_entity_name": "MARCH HARE",
            "entity_type": "PERSON",
            "description": "A rabbit-like character wearing a top hat and a suit, sitting at a table with a teapot, suggesting changing the subject and engaging in absurd dialogue with Alice and the Dormouse during the tea party.",
            "source_image_entities": [
                "MARCH HARE"
            ],
            "source_text_entities": [
                "MARCH HARE"
            ]
        },
        {
            "merged_entity_name": "TEAPOT",
            "entity_type": "OBJECT",
            "description": "An ornate teapot on the table in front of the March Hare, into which the Dormouse is almost put by the Mad Hatter and the March Hare.",
            "source_image_entities": [
                "TEAPOT"
            ],
            "source_text_entities": [
                "TEAPOT"
            ]
        },
        {
            "merged_entity_name": "CUPS AND SAUCERS",
            "entity_type": "OBJECT",
            "description": "Several cups and saucers placed on the table around the teapot, part of the setting for the tea party where Alice engages in conversation with the Mad Hatter, the March Hare, and the Dormouse.",
            "source_image_entities": [
                "CUPS AND SAUCERS"
            ],
            "source_text_entities": []
        },
        {
            "merged_entity_name": "TABLE",
            "entity_type": "GEO",
            "description": "A table where the March Hare is seated and the Mad Hatter is standing, the central location for the tea party in Wonderland.",
            "source_image_entities": [
                "TABLE"
            ],
            "source_text_entities": []
        }
    ],
    "image_24": [
        {
            "merged_entity_name": "CARD SOLDIER 1",
            "entity_type": "PERSON",
            "description": "A character dressed as a playing card with spades on it, holding a paintbrush and standing next to a rose bush, similar to the gardeners painting the roses in Wonderland.",
            "source_image_entities": [
                "CARD SOLDIER 1"
            ],
            "source_text_entities": [
                "GARDENERS"
            ]
        },
        {
            "merged_entity_name": "CARD SOLDIER 2",
            "entity_type": "PERSON",
            "description": "Another character dressed as a playing card with spades on it, holding a bucket and also standing next to the rose bush, similar to the gardeners painting the roses in Wonderland.",
            "source_image_entities": [
                "CARD SOLDIER 2"
            ],
            "source_text_entities": [
                "GARDENERS"
            ]
        },
        {
            "merged_entity_name": "ROSE BUSH",
            "entity_type": "GEO",
            "description": "A bush with roses that the card soldiers are painting, similar to the rose-tree in the Queen's garden where the gardeners are painting the roses red in Wonderland.",
            "source_image_entities": [
                "ROSE BUSH"
            ],
            "source_text_entities": [
                "ROSE-TREE"
            ]
        }
    ],
    "image_25": [
        {
            "merged_entity_name": "ALICE",
            "entity_type": "PERSON",
            "description": "The main character in the story, interacting with various creatures and navigating through a series of adventures, including standing in front of the Queen and other characters, and being recognized by the White Rabbit during the grand procession.",
            "source_image_entities": [
                "ALICE"
            ],
            "source_text_entities": [
                "\"ALICE\""
            ]
        },
        {
            "merged_entity_name": "QUEEN OF HEARTS",
            "entity_type": "PERSON",
            "description": "A character from Alice's Adventures in Wonderland, depicted as a queen holding a scepter, pointing at Alice, overseeing the croquet game, and known for her temper and the scene where she issues orders to behead people.",
            "source_image_entities": [
                "QUEEN OF HEARTS"
            ],
            "source_text_entities": [
                "\"QUEEN OF HEARTS\""
            ]
        },
        {
            "merged_entity_name": "KING OF HEARTS",
            "entity_type": "PERSON",
            "description": "A character from Alice's Adventures in Wonderland, depicted as a king standing next to the Queen of Hearts, and part of the grand procession where he tries to calm the Queen down during her outbursts.",
            "source_image_entities": [
                "KING OF HEARTS"
            ],
            "source_text_entities": [
                "\"KING OF HEARTS\""
            ]
        },
        {
            "merged_entity_name": "CARD GUARDS",
            "entity_type": "ORGANIZATION",
            "description": "Several guards dressed as playing cards, standing behind the King and Queen of Hearts, and contributing to the unusual nature of the events in Wonderland.",
            "source_image_entities": [
                "CARD GUARDS"
            ],
            "source_text_entities": [
                "\"SOLDIERS\""
            ]
        },
        {
            "merged_entity_name": "GARDEN",
            "entity_type": "GEO",
            "description": "A garden setting with trees, flowers, and a fountain in the background, which is also the location of the croquet game and various events involving the Queen and other characters.",
            "source_image_entities": [
                "GARDEN"
            ],
            "source_text_entities": [
                "\"CROQUET-GROUND\"",
                "\"BEAUTIFUL GARDEN\""
            ]
        }
    ],
    "image_26": [
        {
            "merged_entity_name": "ALICE",
            "entity_type": "PERSON",
            "description": "A young girl with long hair, wearing a dress, holding a flamingo, and interacting with various creatures and navigating through a series of adventures in the Kingdom of Hearts.",
            "source_image_entities": [
                "ALICE"
            ],
            "source_text_entities": [
                "\"ALICE\""
            ]
        },
        {
            "merged_entity_name": "FLAMINGO",
            "entity_type": "OBJECT",
            "description": "A large bird with a long neck and legs, being held by Alice, and used as a mallet in the croquet game, often twisting and turning, making it challenging for players like Alice to manage.",
            "source_image_entities": [
                "FLAMINGO"
            ],
            "source_text_entities": [
                "\"FLAMINGO\""
            ]
        },
        {
            "merged_entity_name": "HEDGEHOG",
            "entity_type": "OBJECT",
            "description": "A small animal with spines, lying on the ground near Alice's feet, and used as a ball in the croquet game, often unrolling and crawling away, causing difficulty for the players.",
            "source_image_entities": [
                "HEDGEHOG"
            ],
            "source_text_entities": [
                "\"HEDGEHOG\""
            ]
        }
    ],
    "image_27": [
        {
            "merged_entity_name": "CHESHIRE CAT",
            "entity_type": "PERSON",
            "description": "The Cheshire Cat is a mysterious character that appears in the story, providing company and conversation for Alice. It is known for its grinning and has the ability to fade away, leaving only its smile behind. It is also mentioned by the Duchess and lies on the hearth in the kitchen.",
            "source_image_entities": [
                "CHESHIRE CAT"
            ],
            "source_text_entities": [
                "CHESHIRE CAT",
                "CHESHIRE-CAT HEARTH"
            ]
        },
        {
            "merged_entity_name": "KING OF HEARTS",
            "entity_type": "PERSON",
            "description": "The King is the spouse of the Queen of Hearts, who also shows interest in the Cheshire Cat and orders its removal. He is involved in a dispute with the Queen and the executioner regarding the beheading of the Cheshire Cat.",
            "source_image_entities": [
                "KING OF HEARTS"
            ],
            "source_text_entities": [
                "KING"
            ]
        },
        {
            "merged_entity_name": "QUEEN OF HEARTS",
            "entity_type": "PERSON",
            "description": "The Queen of Hearts is a character known for her quick temper and tendency to order executions, playing a central role in the croquet game. She is involved in a dispute with the King and the executioner over the removal of the Cheshire Cat and is quick to anger, but also shows a moment of mercy by pardoning the guests.",
            "source_image_entities": [
                "QUEEN OF HEARTS"
            ],
            "source_text_entities": [
                "QUEEN",
                "QUEEN"
            ]
        },
        {
            "merged_entity_name": "CARD GUARDS",
            "entity_type": "ORGANIZATION",
            "description": "The Card Guards are several guards dressed as playing cards with clubs symbols, standing in a line. They are used to form the arches in the croquet game, doubling up and standing on their hands and feet, contributing to the game's complexity.",
            "source_image_entities": [
                "CARD GUARDS"
            ],
            "source_text_entities": [
                "SOLDIERS"
            ]
        },
        {
            "merged_entity_name": "WHITE RABBIT",
            "entity_type": "PERSON",
            "description": "The White Rabbit is a rabbit dressed in formal clothing, standing next to the Queen of Hearts. It is one of the characters that Alice interacts with during her adventures.",
            "source_image_entities": [
                "WHITE RABBIT"
            ],
            "source_text_entities": []
        },
        {
            "merged_entity_name": "DUCHESS",
            "entity_type": "PERSON",
            "description": "The Duchess is a character who is in prison and has a conversation with Alice about the moral of things. She is also mentioned as a character who frequently speaks in morals and has a conversation with Alice about various topics.",
            "source_image_entities": [],
            "source_text_entities": [
                "DUCHESS",
                "DUCHESS"
            ]
        },
        {
            "merged_entity_name": "EXECUTIONER",
            "entity_type": "PERSON",
            "description": "The Executioner is the one who would carry out the Queen's orders to remove the Cheshire Cat by 'off with his head'. He is involved in a dispute with the King and the Queen over the process of beheading and is sent to fetch the Duchess.",
            "source_image_entities": [],
            "source_text_entities": [
                "EXECUTIONER",
                "EXECUTIONER"
            ]
        }
    ],
    "image_28": [
        {
            "merged_entity_name": "ALICE",
            "entity_type": "PERSON",
            "description": "The main character in the story, interacting with various creatures and navigating through a series of adventures. She is a young girl with long hair, wearing a dress, and holding a flamingo.",
            "source_image_entities": [
                "ALICE"
            ],
            "source_text_entities": [
                "ALICE"
            ]
        },
        {
            "merged_entity_name": "QUEEN OF HEARTS",
            "entity_type": "PERSON",
            "description": "A queen character with a large head and a crown, dressed in royal attire, known for her quick temper and tendency to order executions, playing a central role in the croquet game.",
            "source_image_entities": [
                "QUEEN OF HEARTS"
            ],
            "source_text_entities": [
                "QUEEN"
            ]
        },
        {
            "merged_entity_name": "FLAMINGO",
            "entity_type": "OBJECT",
            "description": "A pink bird used as a mallet in the croquet game, often twisting and turning, making it challenging for players like Alice to manage. It is also held by Alice and seen trying in a helpless sort of way to fly up into a tree.",
            "source_image_entities": [
                "FLAMINGO"
            ],
            "source_text_entities": [
                "FLAMINGO"
            ]
        }
    ],
    "image_29": [
        {
            "merged_entity_name": "GRIFFIN",
            "entity_type": "ORGANIZATION",
            "description": "A mythical creature with the body of a lion and the head and wings of an eagle, depicted in a resting position, also known as Gryphon in the narrative.",
            "source_image_entities": [
                "GRIFFIN"
            ],
            "source_text_entities": [
                "GRYPHON"
            ]
        },
        {
            "merged_entity_name": "LANDSCAPE",
            "entity_type": "GEO",
            "description": "A rocky terrain with sparse vegetation, serving as the background for the Griffin, and also the setting for various interactions and events in the story.",
            "source_image_entities": [
                "LANDSCAPE"
            ],
            "source_text_entities": [
                "CROQUET-GROUND",
                "PRISON",
                "KITCHEN"
            ]
        }
    ],
    "image_30": [
        {
            "merged_entity_name": "ALICE",
            "entity_type": "PERSON",
            "description": "A young girl with long hair, sitting on the ground, looking up at a Gryphon and a Mock Turtle. She is the main character in the story, interacting with various creatures and navigating through a series of adventures.",
            "source_image_entities": [
                "ALICE"
            ],
            "source_text_entities": [
                "ALICE",
                "ALICE",
                "ALICE"
            ]
        },
        {
            "merged_entity_name": "GRYPHON",
            "entity_type": "OBJECT",
            "description": "A mythical creature with the body of a lion and the head and wings of an eagle, standing to the left of Alice. The Gryphon is a character awakened by the Queen to take Alice to see the Mock Turtle and is involved in the story's events.",
            "source_image_entities": [
                "GRYPHON"
            ],
            "source_text_entities": [
                "GRYPHON",
                "GRYPHON",
                "THE GRYPHON"
            ]
        },
        {
            "merged_entity_name": "MOCK TURTLE",
            "entity_type": "OBJECT",
            "description": "A creature resembling a hybrid between a turtle and a calf, standing to the right of Alice. The Mock Turtle is a character mentioned by the Queen, who is said to tell his history to Alice and shares his history with Alice and the Gryphon, expressing sorrow.",
            "source_image_entities": [
                "MOCK TURTLE"
            ],
            "source_text_entities": [
                "MOCK TURTLE",
                "MOCK TURTLE",
                "THE MOCK TURTLE"
            ]
        },
        {
            "merged_entity_name": "ROCKY LANDSCAPE",
            "entity_type": "GEO",
            "description": "A rocky terrain with a large rock formation behind Alice, Gryphon, and Mock Turtle. This setting is part of the coastal environment where the narrative takes place.",
            "source_image_entities": [
                "ROCKY LANDSCAPE"
            ],
            "source_text_entities": []
        },
        {
            "merged_entity_name": "OCEAN",
            "entity_type": "GEO",
            "description": "The ocean is visible in the background, suggesting a coastal setting. This detail provides context to the location of the story.",
            "source_image_entities": [
                "OCEAN"
            ],
            "source_text_entities": []
        }
    ]
}