{
    "image_1": {
        "image_id": 1,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (2)/images/image_1.jpg",
        "caption": [],
        "footnote": [],
        "context": "‘I’m sure I’m not Ada,’ she said, ‘for her hair goes in such long ringlets, and mine doesn’t go in ringlets at all; and I’m sure I ca’n’t be Mabel,\\* for I know all sorts of things, and she, oh, she knows such a very little! Besides, she’s she, and I’m I, and––oh dear, how puzzling it all is! I’ll try if I know all the things I used to know. Let me see: four times five is twelve, and four times six is thirteen, and four times seven is––oh dear! I shall never get to twenty at that rate!\\*  on talking. ‘Dear, dear! How queer everything is to-day! And yesterday things went on just as usual. I wonder if I’ve been changed in the night? Let me think: was I the same when I got up this morning? I almost think I can remember feeling a little different. But if I’m not the same, the next question is “Who in the world am I?” Ah, that’s the great puzzle!’ And she began thinking over all the children she knew that were of the same age as herself, to see if she could have been changed for any of them. ",
        "chunk_order_index": 0,
        "chunk_id": "chunk-0f5946bcf5f7b8d1179d7ac6b0f37be9",
        "description": "The image is a black-and-white illustration depicting a scene from the classic story 'Alice in Wonderland.' The main character, Alice, is shown kneeling on the ground with her hand resting on her chin, deep in thought. She has long, flowing hair and is dressed in a dress with puffed sleeves and a full skirt. Her posture and expression convey a sense of curiosity and contemplation. To her left, there is a small rabbit standing upright, facing away from Alice. The rabbit appears to be wearing a waistcoat and holding a watch, which are characteristic features of the White Rabbit from the story. The background is a simple, darkened area that contrasts with the lighter figure of Alice, emphasizing her as the focal point of the image. The overall atmosphere is one of wonder and confusion, reflecting Alice's state of mind as she tries to make sense of her strange surroundings.",
        "segmentation": true
    },
    "image_2": {
        "image_id": 2,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (2)/images/image_2.jpg",
        "caption": [],
        "footnote": [],
        "context": "Just then she heard something splashing about in the pool a little way off, and she swam nearer to make out what it was: at first she thought it must be a walrus or hippopotamus, but then she remembered how small she was now, and she soon made out that it ‘I wish I hadn’t cried so much!’ said Alice, as she swam about, trying to find her way out. ‘I shall be punished for it now, I suppose, by being drowned in my own tears! That will be a queer thing, to be sure! However, everything is queer to-day.’   was that she had somehow fallen into the sea, ‘and in that case\\* I can go back by railway,’ she said to herself. (Alice had been to the seaside once in her life,\\* and had come to the general conclusion that, wherever you go to on the English coast, you find a number of bathing-machines\\* in the sea, some children digging in the sand with wooden spades, then a row of lodging-houses, and behind them a railway-station.) However, she soon made out that she was in the pool of tears which she had wept when she was nine feet high. ",
        "chunk_order_index": 1,
        "chunk_id": "chunk-d5a9734368b802b2038dcc1be22c57ad",
        "description": "The image is a black-and-white illustration depicting a young girl swimming in a pool of tears. The girl has long, flowing hair that floats around her head, and she appears to be wearing a dress. Her expression is one of surprise or concern, with wide eyes and an open mouth. She is reaching out with one arm, as if trying to find her way or touch something. The water around her is depicted with wavy lines, indicating movement and depth. The background is minimalistic, with a few curved lines suggesting the edge of the pool or a wall. The overall atmosphere conveyed by the image is one of confusion and bewilderment, fitting the context of Alice's adventures in Wonderland.",
        "segmentation": true
    },
    "image_3": {
        "image_id": 3,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (2)/images/image_3.jpg",
        "caption": [],
        "footnote": [],
        "context": "‘I wo’n’t indeed!’ said Alice, in a great hurry to change the subject of conversation. ‘Are you––are you fond––of––of dogs?’ The Mouse did not answer, so Alice went on eagerly: ‘There is such a nice little dog, near our house, I should like to show you! A little bright-eyed terrier, you know, with oh, such long curly brown hair! And ‘We, indeed!’ cried the Mouse, who was trembling down to the end of its tail. ‘As if $I$ would talk on such a subject! Our family always hated cats: nasty, low, vulgar things! Don’t let me hear the name again!’  a fancy to cats, if you could only see her. She is such a dear quiet thing,’ Alice went on, half to herself, as she swam lazily about in the pool, ‘and she sits purring so nicely by the fire, licking her paws and washing her face––and she is such a nice soft thing to nurse––and she’s such a capital one for catching mice——oh, I beg your pardon!’ cried Alice again, for this time the Mouse was bristling all over, and she felt certain it must be really offended. ‘We wo’n’t talk about her any more, if you’d rather not.’ ",
        "chunk_order_index": 1,
        "chunk_id": "chunk-d5a9734368b802b2038dcc1be22c57ad",
        "description": "The image is a black-and-white illustration depicting a scene from the story of Alice in Wonderland. It shows Alice, a young girl with long hair, swimming in a pool of tears. She is looking at a mouse that is also swimming in the pool. The mouse appears to be bristling and has a displeased expression on its face. The background is minimalistic, with horizontal lines suggesting the surface of the water and vertical lines indicating the walls of the pool. The overall atmosphere is one of tension and discomfort, as Alice tries to make conversation with the mouse, which clearly does not appreciate the topic of cats.",
        "segmentation": true
    },
    "image_4": {
        "image_id": 4,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (2)/images/image_4.jpg",
        "caption": [
            "a caucus-race and a long tale "
        ],
        "footnote": [],
        "context": "The first question of course was, how to get dry again: they had a consultation about this, and after a few minutes it seemed quite natural to Alice to find herself talking familiarly with them, as if she had known them all her life. Indeed, she had quite a long argument with the Lory, who at last turned sulky, and would only say ‘I’m older than you, They were indeed a queer-looking party that assembled on the bank––the birds with draggled feathers, the animals with their fur clinging close to them, and all dripping wet, cross, and uncomfortable. CHAPTER III round and swam slowly back to her: its face was quite pale (with passion, Alice thought), and it said, in a low trembling voice, ‘Let us get to the shore, and then I’ll tell you my history, and you’ll understand why it is I hate cats and dogs.’ It was high time to go, for the pool was getting quite crowded with the birds and animals that had fallen into it: there was a Duck and a Dodo, a Lory and an Eaglet, and several other curious creatures.\\* Alice led the way, and the whole party swam to the shore. ",
        "chunk_order_index": 2,
        "chunk_id": "chunk-ed1066ad27ba4ac36efe3d3029cbbcbb",
        "description": "The image is a black-and-white illustration depicting a whimsical scene from 'Alice's Adventures in Wonderland.' The central figure is Alice, who is sitting on the ground with her back to the viewer. She is surrounded by a variety of animals and birds, all appearing wet and disheveled, suggesting they have just emerged from a pool of water. To the left of Alice, there is a large bird with long feathers, possibly an eagle or a vulture, standing upright. Next to it is a smaller bird with a round body and a short beak, which could be a duck. In front of Alice, there is a mouse standing on its hind legs, looking up at her. To the right of the mouse, there is a crab with its claws raised. Behind the crab, there are two more birds, one with a long neck and another with a rounded body. Further back, there is a large owl with its wings slightly spread. The background is filled with other birds and animals, all appearing damp and somewhat distressed. The overall atmosphere of the image conveys a sense of confusion and discomfort, as if the characters are trying to make sense of their current situation.",
        "segmentation": true
    },
    "image_5": {
        "image_id": 5,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (2)/images/image_5.jpg",
        "caption": [],
        "footnote": [],
        "context": "The next thing was to eat the comfits: this caused some noise and confusion, as Alice thought the whole thing very absurd, but they all looked so grave that she did not dare to laugh; and, as she could not think of anything to say, she simply bowed, and took the thimble, looking as solemn as she could. Then they all crowded round her once more, while the Dodo solemnly presented the thimble, saying ‘We beg your acceptance of this elegant thimble’; and, when it had finished this short speech, they all cheered. ‘Hand it over here,’ said the Dodo. whole party at once crowded round her, calling out, in a confused way, ‘Prizes! Prizes!’ Alice had no idea what to do, and in despair she put her hand in her pocket, and pulled out a box of comfits\\* (luckily the salt water had not got into it), and handed them round as prizes. There was exactly one a-piece, all round. ‘But she must have a prize herself, you know,’ said the Mouse. ‘Of course,’ the Dodo replied very gravely. ‘What else have you got in your pocket?’ it went on, turning to Alice. ‘Only a thimble,’ said Alice sadly. ",
        "chunk_order_index": 3,
        "chunk_id": "chunk-68e4aee8a8d679a8a24b667a81afb38f",
        "description": "The image is a black-and-white illustration from the classic story 'Alice's Adventures in Wonderland.' It depicts a scene where Alice, a young girl with long hair, is interacting with a group of anthropomorphic birds. Alice is dressed in a traditional dress and is handing over a box of comfits to a large bird-like creature, which appears to be a dodo. The dodo is standing upright on its hind legs, holding a cane, and has a solemn expression. Surrounding the dodo are other bird-like creatures, including eagles and owls, all of which are looking at Alice with serious expressions. The background is minimalistic, focusing the viewer's attention on the interaction between Alice and the birds. The overall atmosphere is one of absurdity and whimsy, as Alice interacts with these fantastical creatures in a formal and somewhat surreal manner.",
        "segmentation": true
    },
    "image_6": {
        "image_id": 6,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (2)/images/image_6.jpg",
        "caption": [
            "fortable, and, as there seemed to be no sort of chance of her ever getting out of the room again, no wonder she felt unhappy. "
        ],
        "footnote": [],
        "context": "‘It was much pleasanter at home,’ thought poor Alice, ‘when one wasn’t always growing larger and smaller, and being ordered about by mice and rabbits. I almost wish I hadn’t gone down that rabbit-hole––and yet––and yet––it’s rather curious, you know, this sort of life! I do wonder what can have happened to me! When I used to read fairy tales, I fancied that kind of thing never happened, and now here I am in the middle of one! There ought to be a book written about me, that there ought! And when I grow up, I’ll write one––but I’m grown down on the floor: in another minute there was not even room for this, and she tried the effect of lying down with one elbow against the door, and the other arm curled round her head. Still she went on growing, and, as a last resource, she put one arm out of the window, and one foot up the chimney, and said to herself ‘Now I can do no more, whatever happens. What will become of me?’ Luckily for Alice, the little magic bottle had now had its full effect, and she grew no larger: still it was very uncom ",
        "chunk_order_index": 5,
        "chunk_id": "chunk-c7e95a5cb388aa0cf74d824d1db9174f",
        "description": "The image is a black-and-white illustration depicting a young girl with long, flowing hair, dressed in a light-colored dress. She appears to be lying down on the floor with one arm resting on her head and the other arm stretched out. Her expression conveys a sense of curiosity and contemplation. The background shows a room with a window that has diamond-shaped panes, suggesting an indoor setting. The overall atmosphere of the image is one of wonder and introspection, fitting the context of Alice's adventures in Wonderland. The illustration captures the moment where Alice reflects on her unusual experiences and contemplates her current predicament.",
        "segmentation": true
    },
    "image_7": {
        "image_id": 7,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (2)/images/image_7.jpg",
        "caption": [],
        "footnote": [],
        "context": "Next came an angry voice––the Rabbit’s––‘Pat! Pat! Where are you?’ And ‘That you wo’n’t!’ thought Alice, and, after waiting till she fancied she heard the Rabbit just under the window, she suddenly spread out her hand, and made a snatch in the air. She did not get hold of anything, but she heard a little shriek and a fall, and a crash of broken glass, from which she concluded that it was just possible it had fallen into a cucumber-frame, or something of the sort. heard it say to itself ‘Then I’ll go round and get in at the window.’ listen. ‘Mary Ann! Mary Ann!’ said the voice. ‘Fetch me my gloves this moment!’ Then came a little pattering of feet on the stairs. Alice knew it was the Rabbit coming to look for her, and she trembled till she shook the house, quite forgetting that she was now about a thousand times as large as the Rabbit, and had no reason to be afraid of it. Presently the Rabbit came up to the door, and tried to open it; but, as the door opened inwards, and Alice’s elbow was pressed hard against it, that attempt proved a failure. Alice ",
        "chunk_order_index": 5,
        "chunk_id": "chunk-c7e95a5cb388aa0cf74d824d1db9174f",
        "description": "The image is a black-and-white illustration depicting a scene from the story of Alice in Wonderland. It shows a large hand reaching down towards a small rabbit that appears to be falling or being pushed out of a window. The rabbit is dressed in a vest and bow tie, giving it a somewhat human-like appearance. The background includes a window with broken glass, suggesting that the rabbit has fallen through it. There is also a flower pot on a windowsill, adding to the indoor setting. The overall atmosphere conveys a sense of urgency and surprise, as the rabbit looks startled and the hand looms ominously above it. The illustration style is detailed and expressive, capturing the whimsical and fantastical elements of the story.",
        "segmentation": true
    },
    "image_8": {
        "image_id": 8,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (2)/images/image_8.jpg",
        "caption": [],
        "footnote": [],
        "context": "There was a dead silence instantly, and Alice thought to herself ‘I wonder what they will do next! ‘We must burn the house down!’ said the Rabbit’s voice. And Alice called out, as loud as she could, ‘If you do, I’ll set Dinah at you!’ ‘So you did, old fellow!’ said the others. Last came a little feeble, squeaking voice (‘That’s Bill, thought Alice), ‘Well, I hardly know––No more, thank ye; I’m better now––but I’m a deal too flustered to tell you–– all I know is, something comes at me like a Jack-in-the-box, and up I goes like a skyrocket!’  as she could, and waited till she heard a little animal (she couldn’t guess of what sort it was) scratching and scrambling about in the chimney close above her: then, saying to herself ‘This is Bill’, she gave one sharp kick, and waited to see what would happen next. The first thing she heard was a general chorus of ‘There goes Bill!’ then the Rabbit’s voice alone––‘Catch him, you by the hedge!’ then silence, and then another confusion of voices–– ‘Hold up his head––Brandy now––Don’t choke him––How was it, old fellow? What happened to you? Tell us all about it!’ ",
        "chunk_order_index": 6,
        "chunk_id": "chunk-5a9c6ef8168e1d0b2390a95946fae8a0",
        "description": "The image is a black and white illustration depicting a lizard-like creature emerging from a chimney. The creature appears to be in a state of distress or surprise, with its body partially out of the chimney and its tail still inside. The creature's limbs are spread out, and it has a long, slender body with a pointed tail. The chimney itself is depicted with a sense of motion, as if the creature is being expelled forcefully. There are wavy lines around the creature, suggesting smoke or steam emanating from the chimney. The overall atmosphere of the image conveys a sense of urgency and chaos, as if the creature has been unexpectedly ejected from the chimney.",
        "segmentation": true
    },
    "image_9": {
        "image_id": 9,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (2)/images/image_9.jpg",
        "caption": [
            "all the time at the thought that it might be hungry, in which case it would be very likely to eat her up in spite of all her coaxing. "
        ],
        "footnote": [],
        "context": "Hardly knowing what she did, she picked up a little bit of stick, and held it out to the puppy: whereupon the puppy jumped into the air off all its feet at once, with a yelp of delight, and rushed at the stick, and made believe to worry it: then Alice dodged behind a great thistle, to keep herself from being run over; and, the moment she appeared on the other side, the puppy made another rush at the stick, and tumbled head over heels in its hurry to get hold of it: then Alice, thinking it was very like plan.’ It sounded an excellent plan, no doubt, and very neatly and simply arranged: the only difficulty was, that she had not the smallest idea how to set about it; and, while she was peering about anxiously among the trees, a little sharp bark just over her head made her look up in a great hurry. An enormous puppy was looking down at her with large round eyes, and feebly stretching out one paw, trying to touch her. ‘Poor little thing!’ said Alice, in a coaxing tone, and she tried hard to whistle to it; but she was terribly frightened ",
        "chunk_order_index": 7,
        "chunk_id": "chunk-b4688d5965ebbcc44dd57ef2d06d5fa7",
        "description": "The image is a black-and-white illustration depicting a scene from a story. It shows a large, shaggy puppy with wide eyes and an open mouth, appearing surprised or startled. The puppy is positioned in the foreground, taking up most of the frame. Its fur is detailed with fine lines, giving it a textured appearance. The puppy's posture suggests movement, as if it has just jumped or is about to pounce. To the right of the puppy, there is a small figure of a girl, who appears to be Alice from 'Alice in Wonderland.' She is reaching out towards the puppy, holding a stick in her hand. The girl is drawn with less detail compared to the puppy, but her dress and hair are visible. The background consists of tall thistles and other plants, adding to the outdoor setting. The overall atmosphere of the image conveys a sense of surprise and interaction between the girl and the puppy.",
        "segmentation": true
    },
    "image_10": {
        "image_id": 10,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (2)/images/image_10.jpg",
        "caption": [],
        "footnote": [],
        "context": "‘What do you mean by that?’ said the Caterpillar, sternly. ‘Explain yourself!’  This was not an encouraging opening for a conversation. Alice replied, rather shyly, ‘I––I hardly know, Sir, just at present––at least I know who I was when I got up this morning, but I think I must have been changed several times since then.’ ‘Who are you?’ said the Caterpillar. The Caterpillar and Alice looked at each other for some time in silence: at last the Caterpillar took the hookah out of its mouth, and addressed her in a languid, sleepy voice. advice from a caterpillar CHAPTER V was a large mushroom growing near her, about the same height as herself; and, when she had looked under it, and on both sides of it, and behind it, it occurred to her that she might as well look and see what was on the top of it. She stretched herself up on tiptoe, and peeped over the edge of the mushroom, and her eyes immediately met those of a large blue caterpillar, that was sitting on the top, with its arms folded, quietly smoking a long hookah, and taking not the smallest notice of her or of anything else. ",
        "chunk_order_index": 7,
        "chunk_id": "chunk-b4688d5965ebbcc44dd57ef2d06d5fa7",
        "description": "The image is a black-and-white illustration from the classic story 'Alice's Adventures in Wonderland.' It depicts a scene where Alice, a young girl with long hair tied back, stands on the right side of the image. She is wearing a dress and appears to be looking up at a large caterpillar that is sitting atop a mushroom. The caterpillar is anthropomorphized, wearing a jacket and smoking a hookah, which it holds with one hand while resting its other arm on the mushroom. The caterpillar is encircled by a large ring of smoke from the hookah. The background is filled with tall grass and leaves, adding to the whimsical and fantastical atmosphere of the scene. The overall mood conveyed is one of curiosity and surrealism, as Alice encounters this unusual creature in a dreamlike world.",
        "segmentation": true
    },
    "image_11": {
        "image_id": 11,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (2)/images/image_11.jpg",
        "caption": [],
        "footnote": [],
        "context": "‘In my youth,’ said the sage, as he shook his grey locks, ‘I kept all my limbs very supple By the use of this ointment––one shilling the box––\\* Allow me to sell you a couple?’ ‘You ‘You are old,’ said the youth, ‘as I mentioned before, And have grown most uncommonly fat; Yet you turned a back-somersault in at the door–– Pray, what is the reason of that?’ ‘In my youth,’ Father William replied to his son, ‘I feared it might injure the brain; But, now that I’m perfectly sure I have none, Why, I do it again and again.’  I am, Sir,’ said Alice. ‘I ca’n’t remember things as I used––and I don’t keep the same size for ten minutes together!’ ‘Ca’n’t remember what things?’ said the Caterpillar. ‘Well, I’ve tried to say “How doth the little busy bee,” but it all came different!’ Alice replied in a very melancholy voice. ‘Repeat “You are old, Father William,”’\\* said the Caterpillar. Alice folded her hands, and began:–– ‘You are old, Father William,’ the young man said, ‘And your hair has become very white; And yet you incessantly stand on your head–– Do you think, at your age, it is right?’ ",
        "chunk_order_index": 8,
        "chunk_id": "chunk-307991c2248b4bc7a7af25d9d8c2e44f",
        "description": "The image is a black and white illustration depicting a whimsical scene. On the left side, there is a young man dressed in a suit with a hat, holding a long stick or cane in his right hand. He appears to be speaking or gesturing towards another character on the right. The character on the right is an older man, depicted in a humorous and exaggerated manner. He is standing on his head with his legs in the air, wearing a large, puffy shirt and pants that are tied around his waist. His feet are crossed and he has a surprised or confused expression on his face. The background shows a rural landscape with rocks, grass, and trees, suggesting an outdoor setting. The overall atmosphere of the image is playful and surreal, capturing a moment of absurdity and humor.",
        "segmentation": true
    },
    "image_12": {
        "image_id": 12,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (2)/images/image_12.jpg",
        "caption": [],
        "footnote": [],
        "context": "Do you think I can listen all day to such stuff? Be off, or ‘I have answered three questions, and that is enough,’ Said his father. ‘Don’t give yourself airs! ‘You are old,’ said the youth, ‘one would hardly suppose That your eye was as steady as ever; Yet you balanced an eel on the end of your nose–– What made you so awfully clever?’ ‘In my youth,’ said his father, ‘I took to the law, And argued each case with my wife; And the muscular strength, which it gave to my jaw Has lasted the rest of my life.’   said the youth, ‘as I mentioned before, And have grown most uncommonly fat; Yet you turned a back-somersault in at the door–– Pray, what is the reason of that?’ ‘In my youth,’ said the sage, as he shook his grey locks, ‘I kept all my limbs very supple By the use of this ointment––one shilling the box––\\* Allow me to sell you a couple?’ ‘You are old,’ said the youth, ‘and your jaws are too weak For anything tougher than suet; Yet you finished the goose, with the bones and the beak–– Pray, how did you manage to do it?’ ",
        "chunk_order_index": 8,
        "chunk_id": "chunk-307991c2248b4bc7a7af25d9d8c2e44f",
        "description": "The image is a black and white illustration depicting a chaotic scene inside what appears to be a rustic, wooden room. On the left side of the image, there is a figure with long hair, wearing a hat and a dress, standing with one arm raised and the other hand on their chest, as if in shock or surprise. This figure has a surprised expression, with wide eyes and an open mouth. To the right, another figure is depicted in mid-air, seemingly having been kicked out of the room. This figure is dressed in a patterned garment and boots, with a large belly and a bald head. The figure's legs are spread apart, and they appear to be falling backward through the doorway, which is open. The door is swinging outward, and a hat is flying off the figure's head. The background shows wooden walls and a window with curtains, adding to the rustic atmosphere. The overall mood of the image conveys a sense of sudden action and surprise.",
        "segmentation": true
    },
    "image_13": {
        "image_id": 13,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (2)/images/image_13.jpg",
        "caption": [],
        "footnote": [],
        "context": "Do you think I can listen all day to such stuff? Be off, or ‘I have answered three questions, and that is enough,’ Said his father. ‘Don’t give yourself airs! ‘You are old,’ said the youth, ‘one would hardly suppose That your eye was as steady as ever; Yet you balanced an eel on the end of your nose–– What made you so awfully clever?’ ‘In my youth,’ said his father, ‘I took to the law, And argued each case with my wife; And the muscular strength, which it gave to my jaw Has lasted the rest of my life.’  said the youth, ‘as I mentioned before, And have grown most uncommonly fat; Yet you turned a back-somersault in at the door–– Pray, what is the reason of that?’ ‘In my youth,’ said the sage, as he shook his grey locks, ‘I kept all my limbs very supple By the use of this ointment––one shilling the box––\\* Allow me to sell you a couple?’ ‘You are old,’ said the youth, ‘and your jaws are too weak For anything tougher than suet; Yet you finished the goose, with the bones and the beak–– Pray, how did you manage to do it?’  ",
        "chunk_order_index": 8,
        "chunk_id": "chunk-307991c2248b4bc7a7af25d9d8c2e44f",
        "description": "The image is a black and white illustration depicting a scene with two characters in a rustic kitchen setting. On the left, a young boy with short hair and wearing a hat is pouring liquid from a large pot into a bowl on a table. He is dressed in a simple outfit with long pants and shoes. On the right, an older man with a bald head and a prominent nose is sitting at the table, laughing heartily. The man is wearing a patterned shirt with buttons and a vest. The table is covered with a tablecloth and has various items on it, including a jug, a plate with food, and a bowl. The background shows a wooden cabinet with a shelf above it, holding a few items such as a hat and a pitcher. The overall atmosphere of the image conveys a sense of humor and whimsy, with the older man's exaggerated expression of laughter and the boy's focused action of pouring the liquid.",
        "segmentation": true
    },
    "image_14": {
        "image_id": 14,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (2)/images/image_14.jpg",
        "caption": [],
        "footnote": [],
        "context": "Alice said nothing: she had never been so much contradicted in all her life before, and she felt ‘I don’t know,’ said the Caterpillar. ‘Oh, I’m not particular as to size,’ Alice hastily replied; ‘only one doesn’t like changing so often, you know.’ ‘What size do you want to be?’ it asked. The Caterpillar was the first to speak. ‘It is wrong from beginning to end,’ said the Caterpillar, decidedly; and there was silence for some minutes. ‘Not quite right, I’m afraid,’ said Alice, timidly: ‘some of the words have got altered.’ ‘That is not said right,’ said the Caterpillar. his father, ‘I took to the law, And argued each case with my wife; And the muscular strength, which it gave to my jaw Has lasted the rest of my life.’ ‘You are old,’ said the youth, ‘one would hardly suppose That your eye was as steady as ever; Yet you balanced an eel on the end of your nose–– What made you so awfully clever?’ ‘I have answered three questions, and that is enough,’ Said his father. ‘Don’t give yourself airs! Do you think I can listen all day to such stuff? Be off, or I’ll kick you down-stairs!’ ",
        "chunk_order_index": 8,
        "chunk_id": "chunk-307991c2248b4bc7a7af25d9d8c2e44f",
        "description": "The image is a black-and-white illustration depicting two characters in a whimsical outdoor setting. On the left, there is a tall, thin figure with long hair and a hat, dressed in a short tunic and boots. This character appears to be speaking or shouting, with one arm extended forward and the other bent at the elbow. The expression on the face suggests surprise or alarm. To the right, there is a shorter, rounder figure with a surprised or shocked expression, wearing a patterned jacket and pants, and a hat that has fallen off. This character is bending slightly forward with arms outstretched, as if reacting to something unexpected. In the background, there are trees and bushes, and a bridge with arches can be seen in the distance. The overall atmosphere of the image conveys a sense of surprise and confusion, as if the characters are engaged in an unexpected encounter.",
        "segmentation": true
    },
    "image_15": {
        "image_id": 15,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (2)/images/image_15.jpg",
        "caption": [],
        "footnote": [],
        "context": "‘What can all that green stuff be?’ said Alice. ‘And where have my shoulders got to? And oh, my poor hands, how is it I ca’n’t see you?’ She was moving them about, as she spoke,  ‘Come, my head’s free at last!’ said Alice in a tone of delight, which changed into alarm in another moment, when she found that her shoulders were nowhere to be found: all she could see, when she looked down, was an immense length of neck, which seemed to rise like a stalk out of a sea of green leaves that lay far below her. little of the right-hand bit to try the effect. The next moment she felt a violent blow underneath her chin: it had struck her foot! She was a good deal frightened by this very sudden change, but she felt that there was no time to be lost, as she was shrinking rapidly: so she set to work at once to eat some of the other bit. Her chin was pressed so closely against her foot, that there was hardly room to open her mouth; but she did it at last, and managed to swallow a morsel of the left-hand bit. ",
        "chunk_order_index": 9,
        "chunk_id": "chunk-31f4ee8fbd3f25d5600ad5a3fbe38f72",
        "description": "The image consists of a series of asterisks arranged in a pattern. There are three rows of asterisks, with each row containing seven asterisks. The asterisks are evenly spaced and aligned horizontally. The overall appearance is simple and repetitive, with no additional elements or variations in the pattern.",
        "segmentation": false
    },
    "image_16": {
        "image_id": 16,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (2)/images/image_16.jpg",
        "caption": [],
        "footnote": [],
        "context": "For a minute or two she stood looking at the house, and wondering what to do next, when suddenly a footman in livery came running out of the wood––(she considered him to be a footman because he was in livery: otherwise, judging by his face only, she would have called him a fish)––and rapped loudly at the door with his knuckles. It was opened by another footman in livery, with a round face, and large eyes like a frog; and both footmen, Alice noticed, had powdered hair that curled all over their heads. She felt pig and pepper CHAPTER VI minute to another! However, I’ve got back to my right size: the next thing is, to get into that beautiful garden––how is that to be done, I wonder?’ As she said this,\\* she came suddenly upon an open place, with a little house in it about four feet high. ‘Whoever lives there,’ thought Alice, ‘it’ll never do to come upon them this size: why, I should frighten them out of their wits!’ So she began nibbling at the right-hand bit again, and did not venture to go near the house till she had brought herself down to nine inches high. ",
        "chunk_order_index": 10,
        "chunk_id": "chunk-07e81a0f1a595fc9a500cbca3e7871f8",
        "description": "The image is a black-and-white illustration depicting two anthropomorphic characters in a whimsical scene. On the left, there is a character resembling a frog, dressed in a formal outfit with a high collar and a coat that has buttons. This character has a round face, large eyes, and powdered hair that curls all over its head. It stands on a step, holding a large envelope with a crown seal, suggesting it is an official document or letter. On the right, there is another character resembling a fish, also dressed in a formal outfit with a high collar and a coat. This character has a long, thin body and a tail, and it appears to be handing over the envelope to the frog-like character. The background shows a tree and part of a building, indicating that the scene takes place outdoors near a house. The overall atmosphere is surreal and fantastical, with the characters' exaggerated features and the unusual interaction adding to the whimsical tone.",
        "segmentation": true
    },
    "image_17": {
        "image_id": 17,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (2)/images/image_17.jpg",
        "caption": [],
        "footnote": [],
        "context": "‘Please would you tell me,’ said Alice, a little timidly, for she was not quite sure whether it was good manners There was certainly too much of it in the air. Even the Duchess sneezed occasionally; and as for the baby, it was sneezing and howling alternately without a moment’s pause. The only two creatures in the kitchen, that did not sneeze, were the cook, and a large cat, which was lying on the hearth and grinning from ear to ear. ‘There’s certainly too much pepper\\* in that soup!’ Alice said to herself, as well as she could for sneezing.  here,’ he said, ‘on and off, for days and days.’ ‘But what am $I$ to do?’ said Alice. ‘Anything you like,’ said the Footman, and began whistling. ‘Oh, there’s no use in talking to him,’ said Alice desperately: ‘he’s perfectly idiotic!’ And she opened the door and went in. The door led right into a large kitchen,\\* which was full of smoke from one end to the other: the Duchess\\* was sitting on a three-legged stool in the middle, nursing a baby: the cook was leaning over the fire, stirring a large cauldron which seemed to be full of soup. ",
        "chunk_order_index": 11,
        "chunk_id": "chunk-38bcd459414bbfcbf7797eb4a86b4cbf",
        "description": "The image is a black and white illustration depicting a chaotic scene in a kitchen from the story of Alice in Wonderland. The main characters include Alice, who stands on the right side of the image, dressed in a dress with puffed sleeves and a full skirt, her posture indicating curiosity and concern. To her left, there is a large cat lying on the floor near the hearth, grinning widely from ear to ear. Above the cat, a cook is leaning over a fire, stirring a large cauldron filled with soup, her face partially obscured by the smoke that fills the room. The Duchess is seated on a three-legged stool in the center, nursing a baby who is crying and sneezing alternately. The Duchess herself appears distressed, with a frown on her face and her hair disheveled. A footman stands behind the Duchess, holding a stick and appearing to be whistling or speaking. The overall atmosphere is one of disorder and confusion, with the smoke from the fire adding to the sense of chaos. The detailed expressions and postures of the characters convey a mix of emotions, including frustration, distress, and curiosity.",
        "segmentation": true
    },
    "image_18": {
        "image_id": 18,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (2)/images/image_18.jpg",
        "caption": [],
        "footnote": [],
        "context": "she began thinking over other children So she set the little creature down, and felt quite relieved to see it trot away quietly into the wood. ‘If it had grown up,’ she said to herself, ‘it would have made a dreadfully ugly child: but it makes rather a handsome pig, I think.’ And again, so violently, that she looked down into its face in some alarm. This time there could be no mistake about it: it was neither more nor less than a pig,\\* and she felt that it would be quite absurd for her to carry it any further. thing at all. ‘But perhaps it was only sobbing,’ she thought, and looked into its eyes again, to see if there were any tears. No, there were no tears. ‘If you’re going to turn into a pig, my dear,’ said Alice, seriously, ‘I’ll have nothing more to do with you. Mind now!’ The poor little thing sobbed again (or grunted, it was impossible to say which), and they went on for some while in silence. Alice was just beginning to think to herself, ‘Now, what am I to do with this creature, when I get it home?’ when it grunted ",
        "chunk_order_index": 12,
        "chunk_id": "chunk-4e7ce795eed753909f57ff8d2827aca6",
        "description": "The image is a black-and-white illustration depicting a young girl holding a piglet. The girl has long, wavy hair and is dressed in a dress with a high collar and puffed sleeves, typical of Victorian fashion. She is standing in a grassy area with tall grasses and plants around her. The piglet appears to be small and is being held by the girl with both hands. The girl's expression seems to be one of curiosity or concern. The background includes some tall plants and grasses, adding to the outdoor setting. The overall atmosphere of the image conveys a sense of wonder and curiosity, as if the girl is encountering something unexpected.",
        "segmentation": true
    },
    "image_19": {
        "image_id": 19,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (2)/images/image_19.jpg",
        "caption": [],
        "footnote": [],
        "context": "‘You must be,’ said the Cat, ‘or you wouldn’t have come here.’ ‘How do you know I’m mad?’ said Alice. ‘Oh, you ca’n’t help that,’ said the Cat: ‘we’re all mad here. I’m mad. You’re mad.’ ‘But I don’t want to go among mad people,’ Alice remarked. ‘In that direction,’ the Cat said, waving its right paw round, ‘lives a Hatter: and in that direction,’ waving the other paw, ‘lives a March Hare. Visit either you like: they’re both mad.’\\* Alice felt that this could not be denied, so she tried another question. ‘What sort of people live about here?’   who might do very well as pigs, and was just saying to herself ‘if one only knew the right way to change them——’ when she was a little startled by seeing the Cheshire-Cat sitting on a bough of a tree a few yards off. The Cat only grinned when it saw Alice. It looked goodnatured, she thought: still it had very long claws and a great many teeth, so she felt that it ought to be treated with respect. ‘Cheshire-Puss,’ she began, rather timidly, as she did not at all know whether it would like the name: however, it only ",
        "chunk_order_index": 12,
        "chunk_id": "chunk-4e7ce795eed753909f57ff8d2827aca6",
        "description": "The image is an illustration from the classic children's book 'Alice in Wonderland.' It depicts a scene where Alice, a young girl with long hair tied back, is standing under a tree. She is dressed in a white blouse and a dark skirt. To her right, there is a Cheshire Cat sitting on a bough of the tree. The cat has a wide grin and its body is mostly hidden by the branches, leaving only its head visible. The background is a dense forest with tall trees and thick foliage. The text accompanying the illustration is a dialogue between Alice and the Cheshire Cat, discussing the madness of the inhabitants of Wonderland. The atmosphere conveyed is one of curiosity and slight bewilderment, as Alice navigates through this surreal and whimsical world.",
        "segmentation": true
    },
    "image_20": {
        "image_id": 20,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (2)/images/image_20.jpg",
        "caption": [],
        "footnote": [],
        "context": "She had not gone much farther ‘Well! I’ve often seen a cat without a grin,’ thought Alice; ‘but a grin without a cat! It’s the most curious thing I ever saw in all my life!’ ‘All right,’ said the Cat; and this time it vanished quite slowly, beginning with the end of the tail, and ending with the grin, which remained some time after the rest of it had gone. ‘I said “pig”,’ replied Alice; ‘and I wish you wouldn’t keep appearing and vanishing so suddenly: you make one quite giddy!’ ‘Did you say “pig”, or “fig”?’ said the Cat.  would,’ said the Cat, and vanished again. Alice waited a little, half expecting to see it again, but it did not appear, and after a minute or two she walked on in the direction in which the March Hare was said to live. ‘I’ve seen hatters before,’ she said to herself: ‘the March Hare will be much the most interesting, and perhaps, as this is May,\\* it wo’n’t be raving mad––at least not so mad as it was in March.’ As she said this, she looked up, and there was the Cat again, sitting on a branch of a tree. ",
        "chunk_order_index": 13,
        "chunk_id": "chunk-d4888e6f087010517594f99ab030381f",
        "description": "The image is a black-and-white illustration depicting a whimsical scene from the story of Alice in Wonderland. The central figure is the Cheshire Cat, which is depicted as a disembodied grin floating among tree branches. The cat's face is characterized by its wide, toothy smile and half-closed eyes, giving it a mischievous and enigmatic expression. The surrounding environment is dense with foliage, creating a forest-like atmosphere. The branches and leaves are intricately drawn, adding to the fantastical and dreamlike quality of the scene. The overall mood conveyed is one of surrealism and mystery, fitting the narrative context where the Cheshire Cat appears and disappears unexpectedly, leaving only its grin behind.",
        "segmentation": true
    },
    "image_21": {
        "image_id": 21,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (2)/images/image_21.jpg",
        "caption": [],
        "footnote": [],
        "context": "‘Not the same thing a bit!’ said the Hatter. ‘Why, you might just as well say that “I see what I eat” is the same ‘I do,’ Alice hastily replied; ‘at least––at least I mean what I say––that’s the same thing, you know.’ ‘Then you should say what you mean,’ the March Hare went on. ‘Exactly so,’ said Alice. ‘Do you mean that you think you can find out the answer to it?’ said the March Hare. ‘Come, we shall have some fun now!’ thought Alice. ‘I’m glad they’ve begun asking riddles––I believe I can guess that,’ she added aloud. said Alice angrily. ‘It wasn’t very civil of you to sit down without being invited,’ said the March Hare. ‘I didn’t know it was your table,’ said Alice: ‘it’s laid for a great many more than three.’ ‘Your hair wants cutting,’ said the Hatter. He had been looking at Alice for some time with great curiosity, and this was his first speech. ‘You should learn not to make personal remarks,’ Alice said with some severity: ‘it’s very rude.’ The Hatter opened his eyes very wide on hearing this; but all he said was ‘Why is a raven like a writing-desk?’\\* ",
        "chunk_order_index": 13,
        "chunk_id": "chunk-d4888e6f087010517594f99ab030381f",
        "description": "The image is a black-and-white illustration depicting a whimsical tea party scene from the classic story 'Alice in Wonderland.' The main characters include Alice, the Mad Hatter, and the March Hare. Alice is seated at a table, appearing to be engaged in conversation with the other characters. The Mad Hatter, wearing a large top hat labeled '10/6,' is depicted with an exaggerated expression of surprise or confusion. The March Hare, dressed in a suit and bow tie, is also seated at the table, seemingly in mid-conversation. A Dormouse is present as well, sitting between the Mad Hatter and the March Hare, though it appears to be asleep or unresponsive. The table is set with various tea items, including cups, saucers, and a teapot. The background includes a window and some foliage, adding to the surreal and fantastical atmosphere of the scene. The overall mood conveyed is one of absurdity and nonsensical dialogue, characteristic of the story's whimsical nature.",
        "segmentation": true
    },
    "image_22": {
        "image_id": 22,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (2)/images/image_22.jpg",
        "caption": [],
        "footnote": [],
        "context": "A bright idea came into Alice’s ‘And ever since that,’ the Hatter went on in a mournful tone, ‘he wo’n’t do a thing I ask! It’s always six o’clock now.’ ‘How dreadfully savage!’ exclaimed Alice. ‘Well, I’d hardly finished the first verse,’ said the Hatter, ‘when the Queen bawled out “He’s murdering the time! Off with his head!”’ Here the Dormouse shook itself, and began singing in its sleep ‘Twinkle, twinkle, twinkle, twinkle— —’ and went on so long that they had to pinch it to make it stop. ‘It goes on, you know,’ the Hatter continued, ‘in this way:–– grand, certainly,’ said Alice thoughtfully; ‘but then––I shouldn’t be hungry for it, you know.’ ‘Not at first, perhaps,’ said the Hatter: ‘but you could keep it to half-past one as long as you liked.’ ‘Is that the way you manage?’ Alice asked. The Hatter shook his head mournfully. ‘Not I!’ he replied. ‘We quarreled last March——just before he went mad, you know— ’ (pointing with his teaspoon at the March Hare,) it was at the great concert given by the Queen of Hearts, and I had to sing You know the song, perhaps?’ ‘I’ve heard something like it,’ said Alice.  ",
        "chunk_order_index": 14,
        "chunk_id": "chunk-b79ea16380063eb49fda81b6a6d74a3d",
        "description": "The image is a black-and-white illustration depicting the Mad Hatter from Lewis Carroll's 'Alice in Wonderland.' The Hatter is shown with wild, disheveled hair and a wide, exaggerated mouth open as if he is shouting or singing. He wears a large, oversized top hat labeled '10/6' and a polka-dotted bow tie. His eyes are closed, and his posture is animated, with one hand raised and the other resting on a table. On the table, there are two teacups and saucers, suggesting a tea party setting. To the left of the Hatter, there is a dormouse, which appears to be sleeping or resting its head on the table. The background is minimalistic, with simple lines indicating a wall and possibly a window. The overall atmosphere conveyed by the image is one of whimsy and absurdity, characteristic of the Mad Hatter's character.",
        "segmentation": true
    },
    "image_23": {
        "image_id": 23,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (2)/images/image_23.jpg",
        "caption": [],
        "footnote": [],
        "context": "Once more she found herself in the long hall, and close to the little glass table. ‘Now, I’ll manage better this time,’ she said to herself, and began Just as she said this, she noticed that one of the trees had a door leading right into it. ‘That’s very curious!’ she thought. ‘But everything’s curious to-day. I think I may as well go in at once.’ And in she went. ‘At any rate I’ll never go there again!’ said Alice, as she picked her way through the wood. ‘It’s the stupidest teaparty I ever was at in all my life!’ muchness”––did you ever see such a thing as a drawing of a muchness!’ ‘Really, now you ask me,’ said Alice, very much confused, ‘I don’t think— ‘Then you shouldn’t talk,’ said the Hatter. This piece of rudeness was more than Alice could bear: she got up in great disgust, and walked off: the Dormouse fell asleep instantly, and neither of the others took the least notice of her going, though she looked back once or twice, half hoping that they would call after her: the last time she saw them, they were trying to put the Dormouse into the teapot.\\* ",
        "chunk_order_index": 16,
        "chunk_id": "chunk-f832632e23b5b9867ca9c288fba5b2df",
        "description": "The image is a black and white illustration depicting a whimsical tea party scene from the story of Alice in Wonderland. The main characters are the March Hare and the Mad Hatter, both anthropomorphic animals dressed in human clothing. The March Hare, on the left, is depicted with long ears and a somewhat surprised or startled expression, wearing a suit and holding a teapot. The Mad Hatter, on the right, is shown with a large top hat and a mischievous or confused expression, also dressed in a suit. They are seated at a table set for tea, with cups, saucers, and a teapot visible. The background is minimalistic, focusing attention on the characters and their interaction. The overall atmosphere is one of absurdity and nonsensical humor, characteristic of the Alice in Wonderland narrative.",
        "segmentation": true
    },
    "image_24": {
        "image_id": 24,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (2)/images/image_24.jpg",
        "caption": [],
        "footnote": [],
        "context": "Five and Seven said nothing, but looked at Two. Two began, in a low voice, ‘Why, the fact is, you ‘Would you tell me, please,’ said Alice, a little timidly, ‘why you are painting those roses?’  Seven flung down his brush, and had just begun ‘Well, of all the unjust things––’ when his eye chanced to fall upon Alice, as she stood watching them, and he checked himself suddenly: the others looked round also, and all of them bowed low. ‘Yes, it is his business!’ said Five. ‘And I’ll tell him––it was for bringing the cook tulip-roots instead of onions.’ curious thing, and she went nearer to watch them, and, just as she came up to them, she heard one of them say ‘Look out now, Five! Don’t go splashing paint over me like that!’  ‘I couldn’t help it,’ said Five, in a sulky tone. ‘Seven jogged my elbow.’ On which Seven looked up and said ‘That’s right, Five! Always lay the blame on others!’ ‘You’d better not talk!’ said Five. ‘I heard the Queen say only yesterday you deserved to be beheaded.’ ‘What for?’ said the one who had spoken first. ‘That’s none of your business, Two!’ said Seven. ",
        "chunk_order_index": 16,
        "chunk_id": "chunk-f832632e23b5b9867ca9c288fba5b2df",
        "description": "The image is a black-and-white illustration depicting three card guards from the story of Alice in Wonderland. The guards are dressed as playing cards, specifically spades, with their bodies resembling the shape of a card and their faces drawn on the top part. They are engaged in an activity involving a rose bush. Two of the guards are painting the roses, while the third one is holding a bucket of paint. The guard in the middle appears to be speaking or shouting, possibly in frustration or anger, as indicated by his open mouth and raised hand. The other two guards are looking at him, one with a surprised expression and the other with a more neutral demeanor. The background shows a garden setting with a fence and some foliage. The overall atmosphere conveys a sense of tension and absurdity typical of the whimsical world of Alice in Wonderland.",
        "segmentation": true
    },
    "image_25": {
        "image_id": 25,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (2)/images/image_25.jpg",
        "caption": [],
        "footnote": [],
        "context": "‘And who are these?’ said the Queen, pointing to the three gardeners  ‘My name is Alice, so please your Majesty,’ said Alice very politely; but she added, to herself, ‘Why, they’re only a pack of cards,\\* after all. I needn’t be afraid of them!’ ‘Idiot!’ said the Queen, tossing her head impatiently; and, turning to Alice, she went on: ‘What’s your name, child?’ When the procession came opposite to Alice, they all stopped and looked at her, and the Queen said, severely, ‘Who is this?’ She said it to the Knave of Hearts,\\* who only bowed and smiled in reply.  noticing her. Then followed the Knave of Hearts, carrying the King’s crown on a crimson velvet cushion; and, last of all this grand procession, came THE KING AND THE QUEEN OF HEARTS. Alice was rather doubtful\\* whether she ought not to lie down on her face like the three gardeners, but she could not remember ever having heard of such a rule at processions; ‘and besides, what would be the use of a procession,’ thought she, ‘if people had all to lie down on their faces, so that they couldn’t see it?’ So she stood where she was, and waited. ",
        "chunk_order_index": 17,
        "chunk_id": "chunk-f199f526d405f1e74ed283278f1027cd",
        "description": "The image is a black-and-white illustration depicting a scene from the story of Alice in Wonderland. In the foreground, there is a young girl with long hair, dressed in a simple dress, standing and facing a group of characters. The girl appears to be Alice, as indicated by the context provided. To her left, there are three card guards, each holding a large playing card (a heart, a spade, and a diamond) that covers their faces. These guards are dressed in ornate uniforms with intricate patterns and crowns on their heads. Behind them stands the Knave of Hearts, who is also dressed in an elaborate uniform and is carrying a crimson velvet cushion with a crown on it. To the right of Alice, there is a larger figure, presumably the Queen of Hearts, who is pointing at Alice and speaking to her. The Queen is depicted with a stern expression and is wearing a crown and a dress with a heart pattern. Behind the Queen, there is another figure, likely the King of Hearts, who is also dressed in an ornate uniform and is looking at Alice. The background shows a garden with trees, a waterfall, and a stone wall with arches. The overall atmosphere of the image conveys a sense of tension and authority, as Alice is being questioned by the Queen of Hearts.",
        "segmentation": true
    },
    "image_26": {
        "image_id": 26,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (2)/images/image_26.jpg",
        "caption": [],
        "footnote": [],
        "context": "with its head, it would twist itself round and look up in her face, with such a puzzled expression that she could not help bursting out laughing; and, when she had got its head down, and was going to begin again, it was very provoking to find that the hedgehog had unrolled itself, and was in the act of crawling away: besides all this, there was generally a ridge or a furrow in the way wherever she wanted to send the hedgehog to, and, as the doubled-up soldiers were always getting up and walking off to other parts of the Alice thought she had never seen such a curious croquetground in her life: it was all ridges and furrows: the croquet balls were live hedgehogs, and the mallets live flamingoes,\\* and the soldiers had to double themselves up and stand on their hands and feet, to make the arches. The chief difficulty Alice found at first was in managing her flamingo: she succeeded in getting its body tucked away, comfortably enough, under her arm, with its legs hanging down, but generally, just as she had got its neck nicely straightened out, and was going to give the hedgehog a blow ",
        "chunk_order_index": 18,
        "chunk_id": "chunk-3c18eb100a5e6722c3bd6e9d6f829c44",
        "description": "The image is a black-and-white illustration depicting a scene from the story of Alice in Wonderland. It shows Alice, a young girl with long hair, holding a flamingo under her arm as if it were a croquet mallet. The flamingo's neck is extended, and its head is turned towards Alice, who appears to be blowing on it or speaking to it. Alice is dressed in a dress with puffed sleeves and a full skirt, typical of the Victorian era. At her feet, there is a hedgehog, which is depicted as a live croquet ball. The background suggests an outdoor setting with a grassy ground that has ridges and furrows, contributing to the whimsical and surreal atmosphere of the scene. The overall mood conveyed by the image is one of curiosity and wonder, as Alice interacts with these fantastical creatures in a playful yet peculiar manner.",
        "segmentation": true
    },
    "image_27": {
        "image_id": 27,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (2)/images/image_27.jpg",
        "caption": [],
        "footnote": [],
        "context": "‘You ca’n’t think the mock turtle’s story CHAPTER IX The Cat’s head began fading away the moment he was gone, and, by the time he had come back with the Duchess, it had entirely disappeared: so the King and the executioner ran wildly up and down, looking for it, while the rest of the party went back to the game. ‘She’s in prison,’ the Queen said to the executioner: ‘fetch her here.’ And the executioner went off like an arrow. Alice could think of nothing else to say but ‘It belongs to the Duchess: you’d better ask her about it.’ executioner’s argument was, that you couldn’t cut off a head unless there was a body to cut it off from: that he had never had to do such a thing before, and he wasn’t going to begin at his time of life. The King’s argument was that anything that had a head could be beheaded, and that you weren’t to talk nonsense. The Queen’s argument was that, if something wasn’t done about it in less than no time, she’d have everybody executed, all round. (It was this last remark that had made the whole party look so grave and anxious.) ",
        "chunk_order_index": 19,
        "chunk_id": "chunk-fd8ae5e5b4e443b917523b1253e7c093",
        "description": "The image is a black-and-white illustration from the classic story 'Alice in Wonderland.' It depicts a surreal and whimsical scene featuring several characters. In the foreground, there are two kings dressed in elaborate, card-inspired costumes. The King on the left appears to be shouting or speaking emphatically, while the King on the right is holding a large key and pointing towards something off-frame. Behind them, there are several other card guards standing in a line, each with a different expression and posture. To the right of the scene, there is a rabbit, possibly the White Rabbit, looking up at the kings. Above all these characters, dominating the background, is the head of the Cheshire Cat, which is floating in the air with a mischievous grin. The cat's head is detailed with fur texture and large, expressive eyes. The overall atmosphere of the image is one of absurdity and fantasy, capturing the chaotic and nonsensical nature of the story.",
        "segmentation": true
    },
    "image_28": {
        "image_id": 28,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (2)/images/image_28.jpg",
        "caption": [],
        "footnote": [],
        "context": "‘How fond she is of finding morals she added ‘and the moral of that is––“Take care of the sense, and the sounds will take care of themselves.”’\\* ‘Ah, well! It means much the same thing, said the Duchess, digging her sharp little chin into Alice’s shoulder as ‘Somebody said,’ Alice whispered, ‘that it’s done by everybody minding their own business!’ ‘ ’Tis so,’ said the Duchess: ‘and the moral of that is––“Oh, ’tis love, ’tis love, that makes the world go round!”’\\* ‘The game’s going on rather better now,’ she said, by way of keeping up the conversation a little. remember it in a bit.’ ‘Perhaps it hasn’t one,’ Alice ventured to remark. ‘Tut, tut, child!’ said the Duchess. ‘Every thing’s got a moral, if only you can find it.’\\* And she squeezed herself up closer to Alice’s side as she spoke. Alice did not much like her keeping so close to her: first, because the Duchess was very ugly; and secondly, because she was exactly the right height to rest her chin on Alice’s shoulder, and it was an uncomfortably sharp chin. However, she did not like to be rude: so she bore it as well as she could.  ",
        "chunk_order_index": 19,
        "chunk_id": "chunk-fd8ae5e5b4e443b917523b1253e7c093",
        "description": "The image is a black-and-white illustration depicting a scene from the classic story 'Alice in Wonderland.' On the left side of the image, there is a young girl with long hair, dressed in a dress and apron, holding a flamingo. The flamingo has a long neck and appears to be part of a game or activity. To the right, there is a character resembling the Duchess, wearing a large, ornate hat and a dress with a floral pattern. The Duchess has a sharp chin and a somewhat exaggerated facial expression, which gives her a comical and slightly intimidating appearance. The background shows a grassy area with some trees, suggesting an outdoor setting. The overall atmosphere of the image is whimsical and fantastical, capturing the surreal and imaginative world of Alice in Wonderland.",
        "segmentation": true
    },
    "image_29": {
        "image_id": 29,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (2)/images/image_29.jpg",
        "caption": [],
        "footnote": [],
        "context": "They very soon came upon a Gryphon,\\* lying fast asleep in the sun. (If you don’t know what a Gryphon is, look at the picture.) ‘Up, lazy thing!’ said the Queen, ‘and take this young lady to see the Mock Turtle, and to hear his history. I must go back and see after some executions I have ordered;’ and she walked off, leaving Alice alone with the Gryphon. Alice did not quite like the look of the creature, but on the whole she thought it would be quite as safe to stay with it as to go after that savage ‘Have you seen the Mock Turtle yet?’ ‘No,’ said Alice. ‘I don’t even know what a Mock Turtle is.’ ‘It’s the thing Mock Turtle Soup\\* is made from,’ said the Queen. ‘I never saw one, or heard of one,’ said Alice. ‘Come on, then,’ said the Queen, ‘and he shall tell you his history.’ As they walked off together, Alice heard the King say in a low voice, to the company generally, ‘You are all pardoned.’ ‘Come, that’s a good thing!’ she said to herself, for she had felt quite unhappy at the number of executions the Queen had ordered. ",
        "chunk_order_index": 20,
        "chunk_id": "chunk-853766c91b1d9659f1bb09e3fbb7c59f",
        "description": "The image is a black and white illustration of a Gryphon, a mythical creature with the body of a lion and the head and wings of an eagle. The Gryphon is depicted lying on the ground, fast asleep in the sun. Its posture is relaxed, with its head resting on its front paws and its wings partially spread out. The background shows a simple landscape with a few rocks and grass, suggesting an outdoor setting. The illustration style is detailed and intricate, capturing the texture of the Gryphon's scales and feathers. The overall atmosphere conveyed by the image is one of tranquility and calm, as the Gryphon appears to be in a peaceful state of rest.",
        "segmentation": true
    },
    "image_30": {
        "image_id": 30,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (2)/images/image_30.jpg",
        "caption": [],
        "footnote": [],
        "context": "‘Ah! Then yours wasn’t a really good school,’ said the Mock Turtle in a ‘Certainly not!’ said Alice indignantly. ‘You did,’ said the Mock Turtle. ‘Hold your tongue!’ added the Gryphon, before Alice could speak again. The Mock Turtle went on. ‘We had the best of educations––in fact, we went to school every day ‘I’ve been to a day-school, too,’ said Alice. ‘You needn’t be so proud as all that.’ ‘With extras?’ asked the Mock Turtle, a little anxiously. ‘Yes,’ said Alice: ‘we learned French and music.’ ‘And washing?’ said the Mock Turtle. ‘I never said I didn’t!’ interrupted Alice. him Tortoise, if he wasn’t one?’ Alice asked. ‘We called him Tortoise because he taught us,’ said the Mock Turtle angrily. ‘Really you are very dull!’ ‘You ought to be ashamed of yourself for asking such a simple question,’ added the Gryphon; and then they both sat silent and looked at poor Alice, who felt ready to sink into the earth. At last the Gryphon said to the Mock Turtle ‘Drive on, old fellow! Don’t be all day about it!’, and he went on in these words:–– ‘Yes, we went to school in the sea,\\* though you mayn’t believe it— ",
        "chunk_order_index": 21,
        "chunk_id": "chunk-b21cf0c7f8de7b74dd3864359ab88652",
        "description": "The image is a black-and-white illustration depicting a scene from 'Alice's Adventures in Wonderland.' It features three main characters: Alice, the Gryphon, and the Mock Turtle. Alice is seated on the ground, looking up at the two creatures with a curious and slightly bewildered expression. The Gryphon, a mythical creature with the head of an eagle and the body of a lion, is on the left side of the image. It has its wings spread out and appears to be speaking or gesturing towards Alice. The Mock Turtle, a turtle-like creature with a sad and somewhat resigned expression, is on the right side of the image. It stands upright on its hind legs and seems to be engaged in conversation with Alice. The background shows a rocky landscape with a large rock formation behind Alice and a distant sea visible in the background. The overall atmosphere is one of whimsy and surrealism, characteristic of the story. The illustration captures the interaction between the characters, conveying a sense of dialogue and storytelling.",
        "segmentation": true
    }
}