{
  "chunk-0ff1311559b245c00201952cf8ff419b": {
    "tokens": 1200,
    "content": "VOL. CLXXII . . . No. 59,905 © 2023  The New York Times Company NEW YORK, FRIDAY, SEPTEMBER 8, 2023  \n\n![](images/image_1.jpg)  \nNyamut Gai, 28, lost two children to disease and hunger as she made the weekslong trip from Sudan back home to South Sudan.  \n\n# War Drives South Sudanese Back to an Ill-Prepared Homeland  \n\n# By ABDI LATIF DAHIR  \n\nJODA, South Sudan — Nyamut Gai lost everything four years ago when  armed  militias  stormed through her village in South Sudan, a landlocked African country tormented by civil war, famine and flooding.  \n\nDesperate, she and her family fled almost 600 miles north across the border to Sudan, where she worked as a cleaner in the capital, Khartoum, and began to settle in. But then, a fierce war broke out in Sudan in mid-April between rival factions of the military, sending her packing yet again. As she and her family made the weekslong journey by foot and bus from Khartoum, her 1-monthold son began coughing and withering away from hunger, and soon died. When she finally crossed the border  into  South  Sudan,  any sense of relief she felt was shattered when her 3-year-old son succumbed to measles.  \n\n“We are not safe anywhere,” Ms. Gai, 28, said on a recent morning at a muddy and congested aid center in Renk, a town in South Sudan.  \n\n“People fled war here. There’s a  \n\n# ‘They Are Coming to Start From Zero,’ an Official Says  \n\nwar in Sudan now. There’s war everywhere,” she said. “It never ends.”  \n\nThe war in Sudan has set off a mass exodus of people who years ago fled a bloody civil war in South Sudan to seek safety in Sudan. But they are returning home to a country still in the grip of political instability, economic stagnation and a massive humanitarian crisis — many  of  them  without  actual homes to return to.  \n\nSudan descended into chaos almost five months ago, when a long-simmering rivalry between the leader of the army, Gen. Abdel Fattah al-Burhan, and the commander of the paramilitary Rapid Support  Forces,  Lt.  Gen.  Mohamed Hamdan, burst into open warfare across the northeast African nation.  \n\nIn recent weeks, the conflict has intensified in Khartoum and adContinued on Page A8  \n\n# Bid to Redraw Council’s Map Got Ugly Fast  \n\nTriumph by Progressive Marred in L.A. Feud F. Kovaleski and Leanne Abraham. LOS ANGELES — Nithya Raman turned into a political celebrity almost overnight when she emerged as the face of a rising progressive  vanguard  to  campaign for the Los Angeles City Council in 2020.  \n\nWith a master’s degree in urban planning from the Massachusetts Institute of Technology and experience  working  with  slum dwellers in India, Ms. Raman zeroed in on the city’s soaring housing prices and promised to give renters and homeless people a seat at the political table — her seat.  \n\nMs. Raman, 42, wound up receiving more votes than any council member in the city’s history and began to draw comparisons to the progressive New York congresswoman, Alexandria OcasioCortez — “LAOC,” one local critic derisively called her.  \n\nBarely a year later, though, Ms. Raman ran into an adversary her grass-roots army was powerless to confront: the bruising power politics involved in running a city of 3.8 million people. The City Council had embarked on its oncea-decade  redistricting  process, and Ms. Raman, who had few allies among the city’s old-guard politicians, was threatened at one point with losing virtually all of the constituents who had elected her.  \n\n“I’ve  been  in  politics  for  50 years and I’ve never seen anything like this before in my entire life,” said Jackie Goldberg, Ms. Raman’s representative on the redistricting commission. “I’ve never seen a group of people come together and try to disband the City Council district of a woman who got more votes than any of them ever did.”  \n\nThe redistricting battle in Los  \n\n# UKRAINE INSISTS CLUSTER ARSENAL KEEPS IT IN FIGHT  \n\nBUT CIVILIANS AT RISK  \n\nU.S. Arms Help to Offset Shortages, but Aren’t ‘Magic Wand’  \n\n# By LARA JAKES and ERIC SCHMITT  \n\nROME — The images of Russian troops retreating from a village in Ukraine under fire leave little doubt of the impact of cluster munitions. Soldiers running from a constellation of at least a dozen explosions around them. An armored vehicle speeding down a road before being hit in a cascade of simultaneous eruptions salting the surrounding ground.  \n\nRussian  withdrawal  from  the southeastern village of Urozhaine, verified by The New York Times, highlights the power of the weapons. But their use also points to a grim trade-off in the 18- month  conflict.  By  embracing cluster  munitions  to  keep  this summer’s counteroffensive moving  forward,  Ukraine  and  the United States have opened themselves to human rights concerns about their long-term threat to ci  \n\n![](images/image_2.jpg)  \nFINBARR O'REILLY FOR THE NEW YORK TIME Russian bomblets in Ukraine. Both sides use such arms.  \n\n# A Parched City Grips a Lifeline But Can’t Use It  \n\n# By DAVID GELLES  \n\nTHORNTON,  Colo.  —",
    "chunk_order_index": 0,
    "full_doc_id": "doc-fd609bc339a9542eb907d9551f2538c4"
  },
  "chunk-4c974663e2021d76dd1b48bba969af48": {
    "tokens": 1200,
    "content": "’s counteroffensive moving  forward,  Ukraine  and  the United States have opened themselves to human rights concerns about their long-term threat to ci  \n\n![](images/image_2.jpg)  \nFINBARR O'REILLY FOR THE NEW YORK TIME Russian bomblets in Ukraine. Both sides use such arms.  \n\n# A Parched City Grips a Lifeline But Can’t Use It  \n\n# By DAVID GELLES  \n\nTHORNTON,  Colo.  —  Jack Ethredge could see the future. It was 1985, and Mr. Ethredge, then the city manager of Thornton, understood that sooner or later, the Denver suburb would need more water.  \n\nUNCHARTED WATERS A Clash in Colorado  \n\nThe population was booming, businesses were flocking to the Mountain West, and Thornton had no major lakes or rivers of its own, nor any meaningful amount of groundwater to draw upon, a fluke of geology and geography. The city had drilled a dozen or so wells over the years, but the groundwater’s limited supply and high mineral content meant it wasn’t fit for drinking.  \n\nSo at Mr. Ethredge’s behest, Thornton went shopping. The City Council bought about 17,000 acres of farmland 60 miles to the north, near Fort Collins, along with the associated water rights. When the time was right, Thornton would divert the water from the Cache la Poudre River that irrigated that farmland, put it in a pipeline and send it downstate.  \n\n“In the water business you have to be years and years ahead of the game,” Mr. Ethredge, now retired, said in an interview.  \n\nIn  theory,  Thornton’s  water woes were solved. In practice, the problems were just beginning. ToContinued on Page A18  \n\n![](images/image_3.jpg)  \nEcuavoley has Andean roots dating to the 19th century. “It is in my blood,” one Queens resident said.  \n\n# Near the U.S. Open, a Parallel Sporting Universe  \n\n# By DAVID WALDSTEIN  \n\nEach summer, Flushing Meadows Corona Park in Queens hosts one of the most distinct, continually functioning sporting events in New York City. It features hundreds of players hitting balls, delicious food on offer and spectators sipping drinks while soaking in the entertainment. And on the other side of a fence, there is also a tennis tournament.  \n\nFor virtually as long as the U.S. Open has been held at its current site, families, mostly immigrants from Ecuador, have made the surrounding parkland and parking lots home to their own kind of championships. Their game is known to many as  \n\n# A Game From Ecuador Captures the Heart of a Community  \n\necuavoley, a brand of three-a-side volleyball believed to have originated in Ecuador, where many consider it a national sport alongside soccer. It is also one of the primary activities in this corner of New York.  \n\n“This  is  my  game,”  Miguel Tenecela, 41, an electrician from Corona,  Queens,  said  between games. “It is in my blood.” Because of its diversity, Queens borough, but some areas enjoy a pronounced  Ecuadorean  flavor. Some estimate the number of people in Queens originally from the Andean  country  at  well  over 100,000, with many concentrated in Corona, the neighborhood just west of the Billie Jean King National Tennis Center. As it is with the U.S. Open, the park is where they  showcase  their  favored sport.  \n\nLast weekend, Tenecela and many of his friends and family members gathered, as they often do, for hours of ecuavoley, also called voley or boley, a game with Andean roots dating to the 19th century. On Friday, Yarina’s “Rosalia-Ecuador”  pumped  from  a Continued on Page A17  \n\nAngeles underscores how some big city leaders — often Democrats — have used gerrymandering for their political advantage, much the way Republican lawmakers have redrawn legislative lines to secure or expand their control over some statehouses. Similar fights have been waged in Boston, Miami and Chicago. The conflict in Los Angeles became a national controversy last fall after audio was leaked that revealed the shockingly frank, racist language that politicians used behind closed doors to discuss where to draw district boundaries. Nury Martinez, the former council president, used slurs to describe the young, Black child of a white colleague, as well as Indigenous immigrants from Oaxaca, and was forced to resign.  \n\nBut the uproar over the recordings obscured the more fundamental impact of Los Angeles’s 2021 redistricting process: the degree to which political interfervilians who inadvertently trigger unexploded bombs.  \n\nNow,  two  months  after  the United States shipped an initial tranche  of  the  munitions  to Ukraine to ensure its troops did not run out of ammunition, three American officials said the Biden administration is planning to send more, and soon.  \n\nOne official said the weapons were  key  to  helping  Ukraine maintain  the  momentum  its troops just recently gained on the southern front against Russian forces. All three of the officials spoke on the condition of anonymity to describe internal discussions.  \n\nPresident Biden’s decision this summer to send the munitions to Ukraine, after pleas by President Volodymyr Zelensky, drew widespread condemnation, and even some close American allies were critical.  \n\nContinued on Page A6  \n\n# For Mattel, Success of ‘Barbie’ Goes Far Beyond the Big Screen  \n\n# By JAMES B. STEWART  \n\nWhen Ynon Kreiz arrived at Mattel in April 2018, the newly installed chief executive had one mantra when it came to a feature film starring Barbie, a project he",
    "chunk_order_index": 1,
    "full_doc_id": "doc-fd609bc339a9542eb907d9551f2538c4"
  },
  "chunk-7fb9e14e719e3da6c39e0e08993a7fdf": {
    "tokens": 771,
    "content": "ions to Ukraine, after pleas by President Volodymyr Zelensky, drew widespread condemnation, and even some close American allies were critical.  \n\nContinued on Page A6  \n\n# For Mattel, Success of ‘Barbie’ Goes Far Beyond the Big Screen  \n\n# By JAMES B. STEWART  \n\nWhen Ynon Kreiz arrived at Mattel in April 2018, the newly installed chief executive had one mantra when it came to a feature film starring Barbie, a project he really  wanted  to  get  off  the ground: He didn’t care if the movie sold a single additional doll. But “Barbie” the film had to be good and a cultural event. It had to be different. It had to break molds. And if that meant turning the chief executive of Mattel — i.e., himself — into the object of comic ridicule in the portrayal of the chief executive character in the film (“vain and foolish to the nth degree,” as The Guardian put it), then so be it.  \n\nThat approach has paid off to a degree that even Mr. Kreiz could hardly  have  believed  possible. “Barbie” is close to grossing \\$1.4 billion  and  passed  one  of  the “Harry Potter” movies as the topgrossing Warner Bros. film of all time. It could end up near the \\$2 billion mark. (The record-holder is 2009’s “Avatar,” at \\$2.9 billion.) How Mattel pulled off a feat that had eluded the company for years Continued on Page A20  \n\n![](images/image_4.jpg)  \n\nBUSINESS B1-5 China Floods World With Cars Even as China’s other exports falter, its carmakers are seeing considerable increases in overseas sales. PAGE B1 $\\mathbb{s}500$ Million to Aid Local News Philanthropies focus attention on newsrooms as concern grows over the closure of smaller outlets. PAGE B1  \n\n# NATIONAL A11-21  \n\nFlorida Law Hinders Cleanup Migrants who once flocked to the state after hurricanes to help rebuild said they would stay away this year because of its new immigration law.  PAGE A11  \n\n# A Medicare Mystery  \n\nInstead of growing, as this giant federal program always has, spending per beneficiary has nearly leveled over a decade. No one knows why. PAGE A14 Guilty of Ignoring Subpoena The verdict makes Peter Navarro the second adviser to President Donald J. Trump to be convicted for defying the Jan. 6 panel’s summons. PAGE A21 WEEKEND ARTS C1-12 Messages Are His Medium A new exhibition looks at Ed Ruscha’s use of language and images. Above,“The Back of Hollywood” from 1977.  PAGE C1 Confessions of a Drag Legend The memoir by Charles Busch explores the ascent of a man who is exceptionally good at playing women.  PAGE C1  \n\n![](images/image_5.jpg)  \n\n# INTERNATIONAL A4-10  \n\nIndia’s Global Ambitions The country’s hosting of the G20 summit this weekend will put its growing power on display. But Prime Minister Narendra Modi’s divisive religious politics threaten its rise. PAGE A4 Villages in Greece Submerged Military forces were called in to rescue residents after heavy rains overnight added to major flooding in central Greece. The number of weather-related deaths is likely to rise. PAGE A9  \n\nOPINION A22-23 Pamela Paul  \n\n![](images/image_6.jpg)  \n\n# SPORTS B6-7, 9  \n\nGauff Reaches U.S. Open Final Coco Gauff, 19, became the youngest American in the Open final since Serena Williams in 2001, sealing a win after a delay caused by a protest. PAGE B9",
    "chunk_order_index": 2,
    "full_doc_id": "doc-fd609bc339a9542eb907d9551f2538c4"
  }
}