{
    "chunk-0f5946bcf5f7b8d1179d7ac6b0f37be9": [
        {
            "entity_name": "Alice",
            "entity_type": "PERSON",
            "description": "The main character in the story, experiencing unusual adventures and changes in size. She is also compared to other children like Ada and Mabel, and goes through a series of events involving objects such as the White Rabbit's fan and white kid-gloves, and the little golden key to the garden door.",
            "source_entities": [
                "\"ALICE\"",
                "\"ADA\"",
                "\"MABEL\""
            ]
        },
        {
            "entity_name": "White Rabbit (WHITE RABBIT)",
            "entity_type": "PERSON",
            "description": "A character who is in a hurry and is associated with a pair of white kid-gloves and a fan, which he drops and Alice picks up.",
            "source_entities": [
                "\"WHITE RABBIT\"",
                "\"WHITE KID-GLOVES\"",
                "\"FAN\""
            ]
        },
        {
            "entity_name": "Geographical Misconceptions (LONDON, PARIS, ROME)",
            "entity_type": "CONCEPT",
            "description": "Alice's incorrect associations of capital cities, where she confuses London with Paris and Paris with Rome.",
            "source_entities": [
                "\"LONDON\"",
                "\"PARIS\"",
                "\"ROME\""
            ]
        },
        {
            "entity_name": "Nile (NILE)",
            "entity_type": "GEO",
            "description": "The Nile is mentioned in a poem recited by Alice, associated with a crocodile.",
            "source_entities": [
                "\"NILE\"",
                "\"LITTLE CROCODILE\""
            ]
        },
        {
            "entity_name": "Garden Access (GOLDEN KEY, GARDEN DOOR)",
            "entity_type": "OBJECT",
            "description": "The little golden key is used by Alice to access the garden door, which is her destination.",
            "source_entities": [
                "\"GOLDEN KEY\"",
                "\"GARDEN DOOR\""
            ]
        },
        {
            "entity_name": "Shrinking Cause (FAN)",
            "entity_type": "OBJECT",
            "description": "The fan is an object dropped by the White Rabbit, which Alice uses and causes her to shrink.",
            "source_entities": [
                "\"FAN\""
            ]
        },
        {
            "entity_name": "Identity Confusion (MULTIPLICATION-TABLE, GEOGRAPHY)",
            "entity_type": "CONCEPT",
            "description": "Alice tries to recall the multiplication-table and geography to determine if she has changed, but gets confused.",
            "source_entities": [
                "\"MULTIPLICATION-TABLE\"",
                "\"GEOGRAPHY\""
            ]
        },
        {
            "entity_name": "Measurement Object (TABLE)",
            "entity_type": "OBJECT",
            "description": "The table is used by Alice to measure her height as she shrinks.",
            "source_entities": [
                "\"TABLE\""
            ]
        }
    ],
    "chunk-d5a9734368b802b2038dcc1be22c57ad": [
        {
            "entity_name": "Alice",
            "entity_type": "PERSON",
            "description": "The main character in the story, who experiences shrinking, swimming in a pool of tears, and conversing with a mouse. She is also the one who recalls her seaside visit and the features of the English coast, and mentions her cat Dinah and her brother's Latin Grammar book.",
            "source_entities": [
                "\"ALICE\""
            ]
        },
        {
            "entity_name": "Pool of Tears",
            "entity_type": "GEO",
            "description": "The body of salt-water where Alice finds herself swimming, which she created by crying when she was nine feet high. Initially mistaken by Alice for the sea, it is later recognized as the pool of her own tears.",
            "source_entities": [
                "\"POOL OF TEARS\"",
                "\"SEA\""
            ]
        },
        {
            "entity_name": "Mouse",
            "entity_type": "PERSON",
            "description": "A character that Alice encounters in the pool of tears, with whom she has a conversation. The Mouse is inquisitive, seems to wink, and later shows a strong aversion to cats, reflecting the family's hatred towards them.",
            "source_entities": [
                "\"MOUSE\""
            ]
        },
        {
            "entity_name": "English Coast",
            "entity_type": "GEO",
            "description": "A place where Alice has been to the seaside, characterized by bathing-machines, children digging in the sand with wooden spades, a row of lodging-houses, and a railway-station behind them. It is part of Alice's recollection and generalization of the coastal scenery.",
            "source_entities": [
                "\"ENGLISH COAST\"",
                "\"BATHING-MACHINES\"",
                "\"CHILDREN\"",
                "\"LODGING-HOUSES\"",
                "\"RAILWAY-STATION\""
            ]
        },
        {
            "entity_name": "Dinah",
            "entity_type": "PERSON",
            "description": "Alice's cat, described as a dear, quiet thing with a nice soft nature, known for purring by the fire, licking her paws, washing her face, and being good at catching mice. Alice believes the Mouse might like Dinah if it could see her.",
            "source_entities": [
                "\"DINAH\""
            ]
        },
        {
            "entity_name": "William the Conqueror",
            "entity_type": "PERSON",
            "description": "Historically referenced by Alice as possibly bringing a French mouse to England, indicating a connection to the Mouse's potential origin.",
            "source_entities": [
                "\"WILLIAM THE CONQUEROR\""
            ]
        },
        {
            "entity_name": "Brother",
            "entity_type": "PERSON",
            "description": "Alice's brother is mentioned as the owner of a Latin Grammar book that Alice recalls for addressing the Mouse, indicating her brother's influence on her language skills.",
            "source_entities": [
                "\"BROTHER\""
            ]
        },
        {
            "entity_name": "Little Dog",
            "entity_type": "PERSON",
            "description": "A terrier described by Alice to the Mouse, with long curly brown hair and various tricks it can perform, such as fetching things and sitting up to beg for its dinner. The dog belongs to a farmer near Alice's house.",
            "source_entities": [
                "\"LITTLE DOG\"",
                "\"FARMER\""
            ]
        }
    ],
    "chunk-ed1066ad27ba4ac36efe3d3029cbbcbb": [
        {
            "entity_name": "Caucus-race",
            "entity_type": "Event",
            "description": "The Caucus-race is a made-up event suggested by the Dodo to help dry off the wet animals and birds, in which they all participate.",
            "source_entities": [
                "CAUCUS-RACE"
            ]
        }
    ],
    "chunk-68e4aee8a8d679a8a24b667a81afb38f": [
        {
            "entity_name": "Caucus-race",
            "entity_type": "EVENT",
            "description": "The Caucus-race is an event organized by the Dodo in Wonderland, where participants run in a circle and everyone wins, serving to dry the participants. It is characterized by its lack of traditional race structure and the distribution of prizes by Alice.",
            "source_entities": [
                "CAUCUS-RACE",
                "COMFITS",
                "THIMBLE PRESENTATION"
            ]
        }
    ],
    "chunk-7a8a89108fc5552caf8299afa1656350": [
        {
            "entity_name": "Alice",
            "entity_type": "PERSON",
            "description": "The main character in the story, interacting with various creatures and navigating through a series of adventures. She is also referred to as 'MISS ALICE' in a hypothetical scenario.",
            "source_entities": [
                "\"ALICE\"",
                "\"MISS ALICE\""
            ]
        },
        {
            "entity_name": "The Mouse",
            "entity_type": "PERSON",
            "description": "A character in the story who tells a story and later becomes offended, leaving Alice's company.",
            "source_entities": [
                "\"THE MOUSE\""
            ]
        },
        {
            "entity_name": "Lory",
            "entity_type": "PERSON",
            "description": "A character who expresses pity when the Mouse leaves and engages in conversation with Alice.",
            "source_entities": [
                "\"LORY\""
            ]
        },
        {
            "entity_name": "Crab",
            "entity_type": "PERSON",
            "description": "An older character who imparts wisdom to her daughter and interacts with Alice; also referred to as 'CRAB' and 'YOUNG CRAB' for the mother and daughter respectively.",
            "source_entities": [
                "\"CRAB\"",
                "\"YOUNG CRAB\""
            ]
        },
        {
            "entity_name": "Dinah",
            "entity_type": "PERSON",
            "description": "Alice's pet cat, mentioned as being adept at catching mice and birds, causing a stir among the other characters.",
            "source_entities": [
                "\"DINAH\""
            ]
        },
        {
            "entity_name": "White Rabbit (W. RABBIT)",
            "entity_type": "PERSON",
            "description": "A character who is anxious and appears to be in search of items, mistaking Alice for a housemaid named Mary Ann. He is also referred to as 'W. RABBIT', the owner of the house where Alice searches for a fan and gloves.",
            "source_entities": [
                "\"WHITE RABBIT\"",
                "\"W. RABBIT\""
            ]
        },
        {
            "entity_name": "Duchess",
            "entity_type": "PERSON",
            "description": "A character mentioned in the context of causing the White Rabbit anxiety, as he fears her reaction to his lost items.",
            "source_entities": [
                "\"DUCHESS\""
            ]
        },
        {
            "entity_name": "Mary Ann",
            "entity_type": "PERSON",
            "description": "The housemaid whom the White Rabbit mistakes Alice for, ordering her to fetch items.",
            "source_entities": [
                "\"MARY ANN\""
            ]
        },
        {
            "entity_name": "Magpie",
            "entity_type": "PERSON",
            "description": "An old Magpie who decides to leave the gathering after hearing about Dinah's bird-catching abilities.",
            "source_entities": [
                "\"MAGPIE\""
            ]
        },
        {
            "entity_name": "Canary",
            "entity_type": "PERSON",
            "description": "A Canary who, in a trembling voice, calls for her children to leave after Alice mentions Dinah's bird-catching prowess.",
            "source_entities": [
                "\"CANARY\""
            ]
        },
        {
            "entity_name": "Mouse-Hole",
            "entity_type": "GEO",
            "description": "The location Alice imagines watching, waiting for Dinah to return and prevent the mouse from escaping.",
            "source_entities": [
                "\"MOUSE-HOLE\""
            ]
        },
        {
            "entity_name": "Nurse",
            "entity_type": "PERSON",
            "description": "A hypothetical character who would call for Alice in the scenario she imagines.",
            "source_entities": [
                "\"NURSE\""
            ]
        }
    ],
    "chunk-c7e95a5cb388aa0cf74d824d1db9174f": null,
    "chunk-5a9c6ef8168e1d0b2390a95946fae8a0": [
        {
            "entity_name": "Bill (THE LITTLE LIZARD)",
            "entity_type": "PERSON",
            "description": "Bill is a character who is often tasked with difficult jobs, ends up being kicked by Alice in the chimney, and is later helped by two guinea-pigs after his encounter with Alice.",
            "source_entities": [
                "BILL",
                "LIZARD",
                "GUINEA-PIGS"
            ]
        },
        {
            "entity_name": "Alice's Adventures",
            "entity_type": "EVENT",
            "description": "Alice's Adventures include her experiences in the house, her escape through the chimney, her shrinking after eating cakes, and her plans to grow to her right size and find her way into the lovely garden.",
            "source_entities": [
                "ALICE",
                "THE HOUSE",
                "CHIMNEY",
                "PEBBLES",
                "CAKES",
                "FIRST PLAN",
                "SECOND PLAN"
            ]
        },
        {
            "entity_name": "The Rabbit's Orders",
            "entity_type": "EVENT",
            "description": "The Rabbit's Orders involve coordinating the efforts to deal with Alice, including burning the house down and instructing characters to catch Bill by the hedge.",
            "source_entities": [
                "RABBIT",
                "HEDGE"
            ]
        },
        {
            "entity_name": "Alice's Escape and Transformation",
            "entity_type": "EVENT",
            "description": "Alice's Escape and Transformation involve her shrinking in size after eating cakes that turned from pebbles, escaping the house, and her encounter with a crowd of little animals and birds outside.",
            "source_entities": [
                "PEBBLES",
                "CAKES",
                "LITTLE ANIMALS AND BIRDS"
            ]
        },
        {
            "entity_name": "The Setting",
            "entity_type": "GEO",
            "description": "The Setting includes various locations such as the house, the window, the chimney, the roof, and the hedge, which are significant in the events of the story.",
            "source_entities": [
                "THE HOUSE",
                "WINDOW",
                "CHIMNEY",
                "ROOF",
                "HEDGE"
            ]
        },
        {
            "entity_name": "Alice's Plans",
            "entity_type": "EVENT",
            "description": "Alice's Plans include growing to her right size again and finding her way into the lovely garden, which are her main objectives after escaping the house.",
            "source_entities": [
                "FIRST PLAN",
                "SECOND PLAN",
                "THE LOVELY GARDEN"
            ]
        }
    ],
    "chunk-b4688d5965ebbcc44dd57ef2d06d5fa7": [
        {
            "entity_name": "Alice",
            "entity_type": "PERSON",
            "description": "The main character in the story, who finds herself in a strange wood and encounters various creatures and challenges, including a large puppy and a blue caterpillar.",
            "source_entities": [
                "\"ALICE\""
            ]
        },
        {
            "entity_name": "The Wood",
            "entity_type": "GEO",
            "description": "The initial setting where Alice wanders, trying to find her way to a garden, and where she encounters the puppy and the caterpillar.",
            "source_entities": [
                "\"WOOD\""
            ]
        },
        {
            "entity_name": "The Garden",
            "entity_type": "GEO",
            "description": "A destination Alice wishes to reach, which she considers part of her plan while wandering in the wood.",
            "source_entities": [
                "\"GARDEN\""
            ]
        },
        {
            "entity_name": "The Caterpillar",
            "entity_type": "PERSON",
            "description": "A large blue creature that Alice finds sitting on a mushroom, smoking a hookah, and engages in a conversation with her about identity and transformation.",
            "source_entities": [
                "\"CATERPILLAR\""
            ]
        },
        {
            "entity_name": "The Mushroom",
            "entity_type": "GEO",
            "description": "A large fungi that Alice encounters, which is as tall as her and on top of which the Caterpillar is sitting and smoking a hookah.",
            "source_entities": [
                "\"MUSHROOM\""
            ]
        },
        {
            "entity_name": "The Buttercup",
            "entity_type": "GEO",
            "description": "A plant against which Alice leans to rest herself after escaping from the Puppy.",
            "source_entities": [
                "\"BUTTERCUP\""
            ]
        },
        {
            "entity_name": "The Hookah",
            "entity_type": "OBJECT",
            "description": "A pipe used by the Caterpillar for smoking, which it takes out of its mouth to speak to Alice.",
            "source_entities": [
                "\"HOOKAH\""
            ]
        },
        {
            "entity_name": "Metamorphosis",
            "entity_type": "CONCEPT",
            "description": "The process of transformation from a caterpillar to a butterfly, mentioned by Alice in her conversation with the Caterpillar, including the stage of a chrysalis.",
            "source_entities": [
                "\"CHRYSALIS\"",
                "\"BUTTERFLY\""
            ]
        }
    ],
    "chunk-307991c2248b4bc7a7af25d9d8c2e44f": [
        {
            "entity_name": "Father William (Sage)",
            "entity_type": "PERSON",
            "description": "Father William, also known as the Sage, is an old character mentioned in a poem recited by Alice, who engages in peculiar activities and provides explanations for his actions.",
            "source_entities": [
                "FATHER WILLIAM",
                "SAGE"
            ]
        },
        {
            "entity_name": "Youth (Young Man)",
            "entity_type": "PERSON",
            "description": "The Youth, also known as the Young Man, is the son of Father William who questions his father's abilities and actions in the poem.",
            "source_entities": [
                "YOUTH",
                "YOUNG MAN"
            ]
        }
    ],
    "chunk-31f4ee8fbd3f25d5600ad5a3fbe38f72": [
        {
            "entity_name": "Alice",
            "entity_type": "PERSON",
            "description": "The main character in the story, who interacts with various entities, experiences changes in size, and is mistaken for a serpent by the Pigeon.",
            "source_entities": [
                "\"ALICE\""
            ]
        },
        {
            "entity_name": "Mushroom",
            "entity_type": "GEO",
            "description": "A central object in the story with two sides that cause Alice to grow taller or shorter, and is the source of the Caterpillar's information.",
            "source_entities": [
                "\"MUSHROOM\"",
                "\"HOOKAH\""
            ]
        },
        {
            "entity_name": "Caterpillar",
            "entity_type": "PERSON",
            "description": "A character that provides Alice with information about the effects of the Mushroom and uses the Hookah.",
            "source_entities": [
                "\"CATERPILLAR\""
            ]
        },
        {
            "entity_name": "Pigeon",
            "entity_type": "PERSON",
            "description": "A character that mistakes Alice for a serpent and discusses its troubles with eggs and serpents, highlighting the Pigeon's efforts to protect its eggs.",
            "source_entities": [
                "\"PIGEON\"",
                "\"EGGS\"",
                "\"SERPENT\""
            ]
        },
        {
            "entity_name": "Grass",
            "entity_type": "GEO",
            "description": "The location where the Caterpillar crawls away into after speaking with Alice.",
            "source_entities": [
                "\"GRASS\""
            ]
        },
        {
            "entity_name": "Trees",
            "entity_type": "GEO",
            "description": "Mentioned as the green stuff Alice sees and later realizes they are the tops of the trees she had been wandering under.",
            "source_entities": [
                "\"TREES\""
            ]
        }
    ],
    "chunk-07e81a0f1a595fc9a500cbca3e7871f8": [
        {
            "entity_name": "Croquet Invitation Event",
            "entity_type": "EVENT",
            "description": "The Croquet Invitation Event is the delivery of an invitation for the Duchess to play croquet, sent by the Queen, involving the Fish-Footman and Frog-Footman as messengers.",
            "source_entities": [
                "CROQUET INVITATION EVENT",
                "CROQUET GAME"
            ]
        },
        {
            "entity_name": "Footman",
            "entity_type": "PERSON",
            "description": "The Footman is a character who interacts with Alice, providing information about the noise inside the house and the possibility of her entering, and is also referred to as Fish-Footman and Frog-Footman.",
            "source_entities": [
                "FISH-FOOTMAN",
                "FROG-FOOTMAN",
                "FOOTMAN"
            ]
        },
        {
            "entity_name": "Garden",
            "entity_type": "GEO",
            "description": "The Garden is a beautiful location that Alice wishes to enter, also referred to as the Open Place where she encounters the Little House and the footmen.",
            "source_entities": [
                "GARDEN",
                "OPEN PLACE"
            ]
        },
        {
            "entity_name": "Little House",
            "entity_type": "GEO",
            "description": "The Little House is a small dwelling, about four feet high, that Alice encounters in the Open Place, also part of the Garden.",
            "source_entities": [
                "LITTLE HOUSE"
            ]
        },
        {
            "entity_name": "Mushroom",
            "entity_type": "GEO",
            "description": "The Mushroom is an object that Alice uses to change her size, allowing her to adjust her height.",
            "source_entities": [
                "MUSHROOM"
            ]
        },
        {
            "entity_name": "Wood",
            "entity_type": "GEO",
            "description": "The Wood is a location where Alice hides and observes the Fish-Footman and Frog-Footman, also part of the Garden.",
            "source_entities": [
                "WOOD"
            ]
        }
    ],
    "chunk-38bcd459414bbfcbf7797eb4a86b4cbf": [
        {
            "entity_name": "Cheshire-Cat",
            "entity_type": "PERSON",
            "description": "A character known for its grinning, mentioned by the Duchess and lying on the hearth in the kitchen.",
            "source_entities": [
                "CHESHIRE-CAT",
                "HEARTH"
            ]
        }
    ],
    "chunk-4e7ce795eed753909f57ff8d2827aca6": [
        {
            "entity_name": "Croquet with the Queen",
            "entity_type": "EVENT",
            "description": "An event that the Duchess is preparing for and Alice expresses interest in attending, involving a game of croquet.",
            "source_entities": [
                "CROQUET WITH THE QUEEN",
                "CROQUET"
            ]
        },
        {
            "entity_name": "The Baby (Pig)",
            "entity_type": "PERSON",
            "description": "A character in the story that Alice is tasked with nursing, which eventually turns into a pig.",
            "source_entities": [
                "BABY",
                "PIG"
            ]
        }
    ],
    "chunk-d4888e6f087010517594f99ab030381f": [
        {
            "entity_name": "The Cat",
            "entity_type": "PERSON",
            "description": "A mysterious character who appears and vanishes, engaging in conversation with Alice. Also known as 'Cheshire Cat' due to its ability to disappear and leave only its grin.",
            "source_entities": [
                "THE CAT"
            ]
        },
        {
            "entity_name": "March Hare",
            "entity_type": "PERSON",
            "description": "A character who is having tea with the Hatter and using the Dormouse as a cushion. Known for being raving mad, especially in March.",
            "source_entities": [
                "MARCH HARE"
            ]
        },
        {
            "entity_name": "Hatter",
            "entity_type": "PERSON",
            "description": "A character who is having tea with the March Hare, makes personal remarks to Alice, and is known for his curiosity and riddles.",
            "source_entities": [
                "HATTER"
            ]
        },
        {
            "entity_name": "Dormouse",
            "entity_type": "PERSON",
            "description": "A character who is asleep and being used as a cushion by the March Hare and the Hatter, occasionally making remarks in its sleep.",
            "source_entities": [
                "DORMOUSE"
            ]
        },
        {
            "entity_name": "House of the March Hare",
            "entity_type": "GEO",
            "description": "A distinctive location with chimneys shaped like ears and a roof thatched with fur, where the March Hare, Hatter, and Dormouse are having tea.",
            "source_entities": [
                "HOUSE OF THE MARCH HARE"
            ]
        },
        {
            "entity_name": "Baby (Pig)",
            "entity_type": "PERSON",
            "description": "A character mentioned by the Cat and Alice, which turned into a pig.",
            "source_entities": [
                "BABY",
                "PIG"
            ]
        },
        {
            "entity_name": "Croquet Game with the Queen",
            "entity_type": "EVENT",
            "description": "An event Alice expresses a desire to participate in, involving the Queen.",
            "source_entities": [
                "CROQUET GAME WITH THE QUEEN"
            ]
        },
        {
            "entity_name": "Mad Tea-Party",
            "entity_type": "EVENT",
            "description": "The event where Alice encounters the March Hare, the Hatter, and the Dormouse, characterized by its madness and unconventional tea-time.",
            "source_entities": [
                "MAD TEA-PARTY"
            ]
        }
    ],
    "chunk-b79ea16380063eb49fda81b6a6d74a3d": [
        {
            "entity_name": "Hatter",
            "entity_type": "PERSON",
            "description": "The Hatter is a character who engages in a conversation with Alice and the March Hare, known for his peculiar statements and behavior. He is also known for his watch that tells the day of the month but not the time, and his belief that he can influence Time.",
            "source_entities": [
                "HATTER",
                "WATCH"
            ]
        },
        {
            "entity_name": "March Hare",
            "entity_type": "PERSON",
            "description": "The March Hare is a character in the conversation, known for his remarks and involvement in the tea party with the Hatter and Alice. He is also involved in the discussion about the malfunctioning watch due to the use of butter.",
            "source_entities": [
                "MARCH HARE",
                "BUTTER",
                "BREADKNIFE"
            ]
        },
        {
            "entity_name": "Dormouse",
            "entity_type": "PERSON",
            "description": "The Dormouse is a character that often falls asleep during conversations and makes remarks without fully waking up. He is known for singing 'Twinkle, twinkle, twinkle, twinkle' in his sleep during the tea party.",
            "source_entities": [
                "DORMOUSE",
                "TWINKLE, TWINKLE, TWINKLE, TWINKLE"
            ]
        },
        {
            "entity_name": "Alice",
            "entity_type": "PERSON",
            "description": "Alice is the main character who interacts with the Hatter, the March Hare, and the Dormouse, trying to understand their nonsensical world. She is involved in discussions about riddles, time, and the peculiar behavior of the characters.",
            "source_entities": [
                "ALICE",
                "RIDDLE",
                "MUSIC"
            ]
        },
        {
            "entity_name": "Queen of Hearts",
            "entity_type": "PERSON",
            "description": "The Queen of Hearts is mentioned as a character who hosts a concert where the Hatter had to sing, and is known for her harsh punishment. She is also associated with the great concert and the song.",
            "source_entities": [
                "QUEEN OF HEARTS",
                "GREAT CONCERT",
                "SONG"
            ]
        },
        {
            "entity_name": "Ravens and Writing-desks",
            "entity_type": "CONCEPT",
            "description": "Ravens and writing-desks are mentioned as topics that Alice thinks over, though she doesn't remember much about them. Ravens are also mentioned as one of the animals Alice thought about.",
            "source_entities": [
                "RAVENS AND WRITING-DESKS",
                "RAVENS",
                "WRITING-DESKS"
            ]
        },
        {
            "entity_name": "Tea Party",
            "entity_type": "EVENT",
            "description": "The tea party is the event where the Hatter, March Hare, and Dormouse engage in their nonsensical conversation with Alice. It is also the setting for the discussion about Time and the peculiar behavior of the characters.",
            "source_entities": [
                "TEA PARTY",
                "TIME",
                "CLOCK",
                "LESSONS",
                "DINNER"
            ]
        }
    ],
    "chunk-be2d334dbc441fa27d966aa2bb26f3b5": [
        {
            "entity_name": "Elsie, Lacie, and Tillie",
            "entity_type": "PERSON",
            "description": "Three little sisters in the Dormouse's story who live at the bottom of a well and are learning to draw. Also referred to as the Three Little Sisters.",
            "source_entities": [
                "ELSIE, LACIE, AND TILLIE",
                "THREE LITTLE SISTERS"
            ]
        },
        {
            "entity_name": "Treacle-Well",
            "entity_type": "GEO",
            "description": "The location mentioned in the Dormouse's story where Elsie, Lacie, and Tillie live and draw treacle from, also known as the Well.",
            "source_entities": [
                "TREACLE-WELL",
                "WELL"
            ]
        }
    ],
    "chunk-f832632e23b5b9867ca9c288fba5b2df": [
        {
            "entity_name": "Gardeners (Five, Seven, Two)",
            "entity_type": "PERSON",
            "description": "The gardeners are characters in Wonderland who are painting white roses red to avoid the Queen's punishment, consisting of Five, Seven, and Two.",
            "source_entities": [
                "GARDENERS",
                "FIVE",
                "SEVEN",
                "TWO"
            ]
        },
        {
            "entity_name": "Croquet-Ground",
            "entity_type": "GEO",
            "description": "The location in Wonderland where Alice finds the Queen's rose garden and witnesses the croquet game, involving live hedgehogs and flamingos.",
            "source_entities": [
                "CROQUET-GROUND",
                "CROQUET GAME"
            ]
        },
        {
            "entity_name": "Painting the Roses",
            "entity_type": "EVENT",
            "description": "An event in Wonderland where the gardeners are attempting to paint white roses red to avoid punishment from the Queen.",
            "source_entities": [
                "PAINTING THE ROSES"
            ]
        },
        {
            "entity_name": "Alice's Adventures in the Garden",
            "entity_type": "GEO",
            "description": "The series of locations and events Alice experiences after finding the door in the tree, including the long hall, the little glass table, the golden key, the mushroom, the little passage, and the beautiful garden.",
            "source_entities": [
                "MUSHROOM",
                "LITTLE GLASS TABLE",
                "GOLDEN KEY",
                "BEAUTIFUL GARDEN",
                "LONG HALL",
                "LITTLE PASSAGE",
                "DOOR IN THE TREE"
            ]
        },
        {
            "entity_name": "Tea Party",
            "entity_type": "EVENT",
            "description": "An event in Wonderland where Alice engages in conversation with the Mad Hatter, the March Hare, and the Dormouse, leading to Alice's disgust and departure.",
            "source_entities": [
                "TEA PARTY",
                "ALICE'S DISGUST"
            ]
        }
    ],
    "chunk-f199f526d405f1e74ed283278f1027cd": [
        {
            "entity_name": "King and Queen of Hearts",
            "entity_type": "PERSON",
            "description": "The King and Queen of Hearts are central figures in the story, appearing in the grand procession and interacting with Alice. The Queen is known for her quick temper and issuing orders to behead people, while the King tries to calm her down during her outbursts.",
            "source_entities": [
                "KING OF HEARTS",
                "QUEEN OF HEARTS"
            ]
        },
        {
            "entity_name": "Grand Procession",
            "entity_type": "EVENT",
            "description": "The grand procession is a significant event in the story where various characters, including the King and Queen of Hearts, make an appearance. It is a parade-like event that Alice witnesses and participates in.",
            "source_entities": [
                "GRAND PROCESSION",
                "ROYAL CHILDREN"
            ]
        },
        {
            "entity_name": "Croquet Game",
            "entity_type": "EVENT",
            "description": "The croquet game is an event where Alice participates, using live hedgehogs as balls and flamingoes as mallets in a bizarre version of the sport. It takes place on the croquet ground and involves various characters from the story.",
            "source_entities": [
                "CROQUET GAME",
                "CROQUET GROUND",
                "LIVE HEDGEHOGS",
                "LIVE FLAMINGOES"
            ]
        },
        {
            "entity_name": "Three Gardeners",
            "entity_type": "PERSON",
            "description": "The three gardeners are workers who find themselves in trouble with the Queen and are eventually protected by Alice. They are involved in the events surrounding the rose-tree and the Queen's order for their execution.",
            "source_entities": [
                "THREE GARDENERS",
                "THREE SOLDIERS"
            ]
        },
        {
            "entity_name": "Rose-Tree",
            "entity_type": "GEO",
            "description": "The rose-tree is the location where the gardeners are working and where the Queen questions their activities, leading to her order for their execution. It is a significant setting in the story.",
            "source_entities": [
                "ROSE-TREE"
            ]
        },
        {
            "entity_name": "Execution",
            "entity_type": "EVENT",
            "description": "Execution is the event of beheading the gardeners as ordered by the Queen, which is prevented by Alice's intervention. It is a central event in the story that highlights the Queen's temperament and Alice's role in the unfolding drama.",
            "source_entities": [
                "EXECUTION"
            ]
        }
    ],
    "chunk-3c18eb100a5e6722c3bd6e9d6f829c44": [
        {
            "entity_name": "Croquet Game",
            "entity_type": "EVENT",
            "description": "The central event in the text where Alice participates, involving live hedgehogs as balls and flamingoes as mallets, played on a croquet ground characterized by ridges and furrows.",
            "source_entities": [
                "CROQUET GROUND",
                "CROQUET GAME"
            ]
        },
        {
            "entity_name": "Hedgehog",
            "entity_type": "GEO",
            "description": "Used as a croquet ball in the peculiar game, often unrolling and crawling away, causing difficulty for the players, and contributing to the game's complexity and challenge.",
            "source_entities": [
                "HEDGEHOG"
            ]
        },
        {
            "entity_name": "Flamingo",
            "entity_type": "GEO",
            "description": "Serves as a mallet in the croquet game, often twisting and turning, making it challenging for players like Alice to manage, and contributing to the game's complexity and challenge.",
            "source_entities": [
                "FLAMINGO"
            ]
        },
        {
            "entity_name": "Soldiers",
            "entity_type": "ORGANIZATION",
            "description": "Used to form the arches in the croquet game, doubling up and standing on their hands and feet, contributing to the game's complexity and challenge.",
            "source_entities": [
                "SOLDIERS"
            ]
        },
        {
            "entity_name": "Arch",
            "entity_type": "GEO",
            "description": "A part of the croquet game that players must navigate through, adding to the game's complexity and challenge.",
            "source_entities": [
                "ARCH"
            ]
        }
    ],
    "chunk-fd8ae5e5b4e443b917523b1253e7c093": [
        {
            "entity_name": "Alice",
            "entity_type": "PERSON",
            "description": "The main character who interacts with various entities, including the Queen, the King, the Cheshire-Cat, and the Duchess. She is involved in the game's confusion and is sought to settle disputes.",
            "source_entities": [
                "ALICE"
            ]
        },
        {
            "entity_name": "The Queen",
            "entity_type": "PERSON",
            "description": "A character who sentences players to execution and is involved in a dispute with the King and the executioner over the process of beheading. She also orders the executioner to fetch the Duchess from prison.",
            "source_entities": [
                "QUEEN"
            ]
        },
        {
            "entity_name": "The King",
            "entity_type": "PERSON",
            "description": "A character who is involved in a dispute with the Queen and the executioner, arguing that anything with a head can be beheaded.",
            "source_entities": [
                "KING"
            ]
        },
        {
            "entity_name": "The Executioner",
            "entity_type": "PERSON",
            "description": "A character who argues about the process of beheading, stating that a body is required to cut off a head. He is sent by the Queen to fetch the Duchess from prison.",
            "source_entities": [
                "EXECUTIONER"
            ]
        },
        {
            "entity_name": "The Cheshire-Cat",
            "entity_type": "PERSON",
            "description": "A character surrounded by a crowd and involved in a dispute with the King and the Queen. The Cheshire-Cat's head begins to fade away, leading to confusion among the King and the executioner.",
            "source_entities": [
                "CHESHIRE-CAT"
            ]
        },
        {
            "entity_name": "The Duchess",
            "entity_type": "PERSON",
            "description": "A character who is in prison and has a conversation with Alice about the moral of things. She is fetched by the executioner at the Queen's command and walks off with Alice.",
            "source_entities": [
                "DUCHESS"
            ]
        },
        {
            "entity_name": "The Game",
            "entity_type": "EVENT",
            "description": "An event causing confusion, leading to the Queen's sentences of execution. Alice tries to determine her turn amidst the chaos.",
            "source_entities": [
                "GAME"
            ]
        },
        {
            "entity_name": "The Hedgehog",
            "entity_type": "GEO",
            "description": "An animal that Alice sees fighting with another hedgehog, providing an opportunity for croqueting. However, by the time Alice returns with her flamingo, both hedgehogs are out of sight.",
            "source_entities": [
                "HEDGEHOG"
            ]
        },
        {
            "entity_name": "The Flamingo",
            "entity_type": "GEO",
            "description": "An animal that Alice uses for croqueting and chases across the garden. She eventually catches the flamingo and brings it back to prevent it from escaping again.",
            "source_entities": [
                "FLAMINGO"
            ]
        },
        {
            "entity_name": "The Mock Turtle",
            "entity_type": "PERSON",
            "description": "A character who tells a story to Alice in Chapter IX.",
            "source_entities": [
                "MOCK TURTLE"
            ]
        }
    ],
    "chunk-853766c91b1d9659f1bb09e3fbb7c59f": [
        {
            "entity_name": "Alice",
            "entity_type": "PERSON",
            "description": "The main character in the text, interacting with various other characters and experiencing the events described.",
            "source_entities": [
                "ALICE"
            ]
        },
        {
            "entity_name": "Duchess",
            "entity_type": "PERSON",
            "description": "A character who frequently speaks in morals and has a conversation with Alice about various topics.",
            "source_entities": [
                "DUCHESS"
            ]
        },
        {
            "entity_name": "Queen",
            "entity_type": "PERSON",
            "description": "A character who is quick to anger and orders executions, but also shows a moment of mercy by pardoning the guests.",
            "source_entities": [
                "QUEEN"
            ]
        },
        {
            "entity_name": "King",
            "entity_type": "PERSON",
            "description": "A character who pardons the guests at the end of the event, showing leniency.",
            "source_entities": [
                "KING"
            ]
        },
        {
            "entity_name": "Mock Turtle",
            "entity_type": "PERSON",
            "description": "A character mentioned by the Queen, who is said to tell his history to Alice.",
            "source_entities": [
                "MOCK TURTLE"
            ]
        },
        {
            "entity_name": "Gryphon",
            "entity_type": "PERSON",
            "description": "A character who is awakened by the Queen to take Alice to see the Mock Turtle.",
            "source_entities": [
                "GRYPHON"
            ]
        },
        {
            "entity_name": "Flamingo (Mustard)",
            "entity_type": "GEO",
            "description": "Mentioned as a potential source of danger, with a comparison to mustard. Both are used to convey morals in the text.",
            "source_entities": [
                "FLAMINGO",
                "MUSTARD"
            ]
        },
        {
            "entity_name": "Mustard Mine",
            "entity_type": "GEO",
            "description": "A place mentioned by the Duchess, used to explain a moral about possession.",
            "source_entities": [
                "MUSTARDMINE"
            ]
        },
        {
            "entity_name": "Croquet-Ground",
            "entity_type": "GEO",
            "description": "The location where the Queen and Alice return to continue the game.",
            "source_entities": [
                "CROQUET-GROUND"
            ]
        },
        {
            "entity_name": "Executions (Arches)",
            "entity_type": "EVENT",
            "description": "Sentences given by the Queen to the players who delay in the game, leading to the dismantling of the arches as soldiers take on the role of custody.",
            "source_entities": [
                "EXECUTIONS",
                "ARCHES"
            ]
        },
        {
            "entity_name": "Pardons",
            "entity_type": "EVENT",
            "description": "Acts of mercy by the King at the end of the event, forgiving all the guests.",
            "source_entities": [
                "PARDONS"
            ]
        }
    ],
    "chunk-b21cf0c7f8de7b74dd3864359ab88652": [
        {
            "entity_name": "EXECUTIONS",
            "entity_type": "EVENT",
            "description": "The Queen orders executions, which is a significant event in the narrative and influences Alice's perception of the Queen.",
            "source_entities": [
                "EXECUTIONS"
            ]
        },
        {
            "entity_name": "SCHOOL IN THE SEA",
            "entity_type": "ORGANIZATION",
            "description": "The School in the Sea is where the Mock Turtle and others received their education, as described in the Mock Turtle's history, and is part of the curriculum discussion including French, Music, Washing, Reeling and Writhing, Arithmetic, Ambition, Distraction, Uglification, and Derision.",
            "source_entities": [
                "SCHOOL IN THE SEA",
                "FRENCH",
                "MUSIC",
                "WASHING",
                "REELING AND WRITHING",
                "ARITHMETIC",
                "AMBITION",
                "DISTRACTION",
                "UGLIFICATION",
                "DERISION"
            ]
        },
        {
            "entity_name": "TORTOISE",
            "entity_type": "PERSON",
            "description": "Tortoise is the name used by the Mock Turtle and others to refer to their teacher at the School in the Sea, indicating a significant figure in their education.",
            "source_entities": [
                "TORTOISE"
            ]
        }
    ],
    "chunk-cacd2a2b46770ac96130010ea30c542c": [
        {
            "entity_name": "Arithmetic (Ambition, Distraction, Uglification, Derision)",
            "entity_type": "Concept",
            "description": "Arithmetic is a concept in the text that encompasses various branches including Ambition, Distraction, Uglification, and Derision.",
            "source_entities": [
                "ARITHMETIC",
                "AMBITION",
                "DISTRATION",
                "UGLIFICATION",
                "DERISION"
            ]
        },
        {
            "entity_name": "Drawlingmaster",
            "entity_type": "Person",
            "description": "The Drawlingmaster is an old conger-eel who taught Drawling, Stretching, and Fainting in Coils to the Mock Turtle.",
            "source_entities": [
                "DRAWLINGMASTER",
                "DRAWLING",
                "STRETCHING",
                "FAINTING IN COILS"
            ]
        },
        {
            "entity_name": "Classical Master",
            "entity_type": "Person",
            "description": "The Classical Master is an old crab who taught Laughing and Grief.",
            "source_entities": [
                "CLASSICAL MASTER",
                "LAUGHING",
                "GRIEF"
            ]
        },
        {
            "entity_name": "Lessons",
            "entity_type": "Event",
            "description": "Lessons are the educational activities described in the text, which lessen from day to day, culminating in a holiday on the eleventh day.",
            "source_entities": [
                "LESSONS",
                "ELEVENTH DAY"
            ]
        },
        {
            "entity_name": "Twelfth Day",
            "entity_type": "Event",
            "description": "Twelfth Day is mentioned as the day following the holiday after the eleventh day of lessons.",
            "source_entities": [
                "TWELFTH DAY"
            ]
        }
    ]
}