{
    "image_1": {
        "image_id": 1,
        "image_path": "./fusion_research/fusion_dataset/novel/Charlottes Web (E. B. White) (3)/images/image_1.jpg",
        "caption": [],
        "footnote": [],
        "context": "Mr. Zuckerman and Mr. Arable and Lurvy grabbed the pig and pushed him headfirst toward the crate. Wil­ bur began to struggle. The harder the men pushed, the harder he held back. Avery jumped down and joined the men. Wilbur kicked and thrashed and grunted. \"Nothing wrong with this \"I' m h ungry, \" Sa'i d A very. \"I want a can d1' e d app 1 e. \" \"Wilbur's all right now,\" said Fern. \"We can start. I want to take a ride in the Ferris wheel.\" \"He's up!\" said Mr. Arable. \"I guess there's nothing wrong with him.\" into the pen and knelt by Wilbur's side. \"It's sunstroke,\" said Zuckerman. \"The heat is too much for him.\" \"Maybe he's dead,\" said Avery. \"Come out of that pigpen immediately!\" cried Mrs. Arable. Avery obeyed his mother and climbed into the back of the truck so he could see better. Lurvy returned with cold water and dashed it on Wilbur. \"Throw some on me!\" cried Avery. \"I'm hot, too.\" \"Oh, keep quiet!\" hollered Fern. \"Keep qui-ut! \" Her eyes were brimming with tears. Wilbur, feeling the cold water, came to. He rose slowly to his feet, while the geese cheered. ",
        "chunk_order_index": 1,
        "chunk_id": "chunk-9f963812757e4e9006fc123e1a244864",
        "description": "The image is a black-and-white illustration depicting a scene of urgency and care. A man, dressed in overalls and a short-sleeved shirt, is kneeling on one knee while pouring water from a bucket onto a pig lying on the ground. The pig appears to be in distress, with its body stretched out and its mouth open as if grunting or gasping for air. The man's posture suggests he is focused and determined, leaning forward with his right arm extended to pour the water and his left hand supporting the bucket. His facial expression conveys concern and attentiveness. The background is minimalistic, with no additional details, emphasizing the interaction between the man and the pig. The overall atmosphere conveyed by the image is one of immediate action and care, possibly indicating a situation where the pig is overheated or in need of cooling down.",
        "segmentation": true
    },
    "image_2": {
        "image_id": 2,
        "image_path": "./fusion_research/fusion_dataset/novel/Charlottes Web (E. B. White) (3)/images/image_2.jpg",
        "caption": [],
        "footnote": [],
        "context": "\"Can I have some money?\" asked Fern. \"Can I, too?\" asked Avery. \"I'm going to win a  EN they pulled into the Fair Grounds, they could hear music and see the Ferris wheel turning in the sky. They could smell the dust of the race track where the sprinkling cart had moistened it; and they could smell hamburgers frying and see bal­ loons aloft. They could hear sheep blatting in their pens. An enormous voice over the loudspeaker said: \"Attention, please! Will the owner of a Pontiac car, license number H-2439, please move your car away from the fireworks shed!\" back out. Then, using all their strength, the men picked up the crate and heaved it aboard the truck. They did not know that under the straw was a rat, and inside a knothole was a big grey spider. They saw only a pig.  \"Everybody in! \" called Mr. Arable. He started the motor. The ladies climbed in beside him. Mr. Zucker­ man and Lurvyand Fern and Avery rode in back, hang­ ing onto the sideboards. The truck began to move ahead. The geese cheered. The children answered thei cheer, and away went everybody to the Fair. Chapter XVII Uncle ",
        "chunk_order_index": 1,
        "chunk_id": "chunk-9f963812757e4e9006fc123e1a244864",
        "description": "The image is a single large, bold letter 'W' in black color. The letter is displayed against a white background. The font style appears to be serif, characterized by small lines or strokes regularly attached to the end of a larger stroke in a letter or symbol within the alphabet. The letter 'W' is centrally positioned and fills most of the frame, with no other objects, scenes, or background elements present.",
        "segmentation": false
    },
    "image_3": {
        "image_id": 3,
        "image_path": "./fusion_research/fusion_dataset/novel/Charlottes Web (E. B. White) (3)/images/image_3.jpg",
        "caption": [],
        "footnote": [],
        "context": "Charlotte, watching her chance, scrambled out of the crate While Wilbur was being unloaded and taken out of his crate and into his new pigpen, crowds gathered to watch. They stared at the sign ZUCKERMAN'S FA­ MOUS PIG. Wilbur stared back and tried to look extra good. He was pleased with his new home. The pen was grassy, and it was shaded from the sun by a shed roof. \"Well, they've got to grow up some time,\" said Mr. Arable. \"And a fair is a good place to start, I guess.\" \"Do you really think it's all right?\" she asked.  their mother. .. Watch out for pickpockets!\" cautioned their fa­ ther. \"And don't cross the race track when the horses are coming!\" cried Mrs. Zuckerman. The children grabbed each other by the hand and danced off in the direction of the merry-go-round, toward the wonderful music and the wonderful adven­ ture and the wonderful excitement, into the wonderful midway where there would be no parents to guard them and guide them, and where they could be happy and free and do as they pleased. Mrs. Arable stood quietly and watched them go. Then she sighed. Then she blew her nose. ",
        "chunk_order_index": 2,
        "chunk_id": "chunk-f120fec315b3df9a3b00040815316218",
        "description": "The image is a black-and-white illustration depicting a lively scene at a fair. In the foreground, two children are holding hands and walking towards the center of the fair. The boy is wearing a short-sleeved shirt and pants, while the girl is dressed in a dress with puffed sleeves. They appear to be enjoying themselves, possibly excited about the attractions ahead. To their right, there is a small figure of a clown holding balloons, adding to the festive atmosphere. In the background, there is a large Ferris wheel dominating the scene, with several gondolas visible. To the left of the Ferris wheel, there is a swing ride with people seated and enjoying the ride. There are also various stalls and booths, including one labeled 'BLANKETS' and another with a sign that reads 'LUCKY DUCK.' A flagpole with an American flag is seen near the top right corner of the image. Balloons are scattered throughout the scene, and there are other people in the background, some standing and others walking, all contributing to the bustling and joyful atmosphere of the fair.",
        "segmentation": true
    },
    "image_4": {
        "image_id": 4,
        "image_path": "./fusion_research/fusion_dataset/novel/Charlottes Web (E. B. White) (3)/images/image_4.jpg",
        "caption": [],
        "footnote": [],
        "context": "\"Perhaps,\" she said, wearily. \"But I feel like the end of a long day.\" Clinging upside down to \"I'm awfully sorry to hear that you're feeling poorly, Charlotte,\" he said. \"Perhaps if you spin a web and catch a couple of flies you'll feel better.\" Wilbur looked at his friend. She looked rather swol­ len and she seemed listless.  \"When are you going to spin a web?\" asked Wilbur. \"This afternoon, late, if I'm not too tired,\" said Charlotte. \"The least thing tires me these days. I don't seem to have the energy I once had. My age, I guess.\"  you, and now I must be gomg. She ascended slowly and returned to Wilbur's pen. \"He claims he's a spring pig,\" reported Charlotte, \"and perhaps he is. One thing is certain, he has a most unattractive personality. He is too familiar, too noisy, and he cracks weak jokes. Also, he's not anywhere near as clean as you are, nor as pleasant. I took quite a dis­ like to him in our brief interview. He's going to be a hard pig to beat, though, Wilbur, on account of his size and weight. But with me helping you, it can be done.\" ",
        "chunk_order_index": 2,
        "chunk_id": "chunk-f120fec315b3df9a3b00040815316218",
        "description": "The image is a black and white illustration featuring a pig with a somewhat grumpy or tired expression. The pig has a large, round body covered in coarse fur, and its posture suggests it is lying down or resting. Its eyes are half-closed, and its mouth is slightly open, giving it a listless appearance. To the left of the pig, there is a spider hanging upside down from a thread. The spider appears to be small and delicate, contrasting with the larger, more robust pig. The background is minimal, with only a few lines suggesting grass or ground beneath the pig. The overall atmosphere conveyed by the image is one of weariness and perhaps a touch of melancholy, fitting the context of the story where Charlotte the spider is feeling unwell.",
        "segmentation": true
    },
    "image_5": {
        "image_id": 5,
        "image_path": "./fusion_research/fusion_dataset/novel/Charlottes Web (E. B. White) (3)/images/image_5.jpg",
        "caption": [],
        "footnote": [],
        "context": "Charlotte had her web almost finished when Temple­ ton returned, carrying the newspaper clipping. She had left a space in the middle of the web. At this hour, no Templeton kept out of sight. In the tall grass behind the cattle barn he found a folded newspaper. Inside it were leftovers from somebody's lunch: a deviled ham sandwich, a piece of Swiss cheese, part of a hard-boiled egg, and the core of a wormy apple. The rat crawled in and ate everything. Then he tore a word out of the paper, rolled it up, and started back to Wilbur's pen. the merry-go-round and the voice of the man in the beano booth calling numbers. The children felt refreshed after their nap. Fern met her friend Henry Fussy, and he invited her to ride with him in the Ferris wheel. He even bought a ticket for her, so it didn't cost her anything. When Mrs. Arable happened to look up into the starry sky and saw her little daughter sitting with Henry Fussy and going higher and higher into the air, and saw how happy Fern looked, she just shook her head. \".My, my!\" she said. \"Henry Fussy. Think of that!\"  ",
        "chunk_order_index": 3,
        "chunk_id": "chunk-f9b8acadcaeb8bbc04a9e91e2f931713",
        "description": "The image is a black-and-white illustration of a newspaper clipping lying on the ground, partially covered by tall grass. The newspaper appears crumpled and dirty, with visible text that reads 'HUMBLE' prominently in the center. The surrounding grass is drawn with fine lines, giving it a detailed and textured appearance. The overall scene suggests a discarded or forgotten item in an outdoor setting, possibly near a barn or farm, given the context provided in the caption and footnote.",
        "segmentation": false
    },
    "image_6": {
        "image_id": 6,
        "image_path": "./fusion_research/fusion_dataset/novel/Charlottes Web (E. B. White) (3)/images/image_6.jpg",
        "caption": [],
        "footnote": [],
        "context": "The grownups climbed slowly into the truck and Wilbur heard the engine start and then heard the truck moving away in low speed. He would have felt lonely and homesick, had Charlotte not been with him. He never felt lonely when she was near. In the distance he could still hear the music of the merry-go-round. Fern and A very climbed into the truck and lay down. They pulled the Indian blanket over them. Lurvy gave Wilbur a forkful of fresh straw. Mr. Arable patted him. \"Time for us to go home,\" he said to the pig. \"See you tomorrow.\" every­ where good hiding and good hunting. Bye, bye, my humble Wilbur! Fare thee well, Charlotte, you old schemer! This will be a night to remember in a rat's life.\" He vanished into the shadows. Charlotte went back to her work. It was quite dark now. In the distance, fireworks began going off-rock­ ets, scattering fiery balls in the sky. By the time the Arables and the Zuckennans and Lurvy returned from the grandstand, Charlotte had finished her web. The word HUMBLE was woven neatly in the center. No­ body noticed it in the darkness. Everyone was tired and happy.  ",
        "chunk_order_index": 4,
        "chunk_id": "chunk-e279af1f25428445768a7a93045285ed",
        "description": "The image is a black and white illustration of a small, furry animal that appears to be a hedgehog. The hedgehog is depicted with its head raised and eyes closed, as if it is enjoying the sensation of something above it. Its fur is detailed with numerous lines and strokes, giving it a textured appearance. The hedgehog's ears are pointed and its nose is prominent. It seems to be standing on a surface that is shaded to indicate a three-dimensional form, possibly a piece of wood or a ledge. The overall atmosphere conveyed by the image is one of contentment and sensory pleasure, as the hedgehog appears to be basking in a moment of bliss.",
        "segmentation": true
    },
    "image_7": {
        "image_id": 7,
        "image_path": "./fusion_research/fusion_dataset/novel/Charlottes Web (E. B. White) (3)/images/image_7.jpg",
        "caption": [],
        "footnote": [],
        "context": "morning when the first light came into the sky and the sparrows stirred in the trees, when the cows rattled their chains and the rooster crowed and the early auto­ mobiles went whispering along the road, Wilbur awoke and looked for Charlotte. He saw her up overhead in a comer near the back of his pen. She was very quiet. Her eight legs were spread wide. She seemed to have shrunk during the night. Next to her, attached to the ceiling, Wilbur saw a curious object. It was a sort of sac, or cocoon. It was peach-colored and looked as he was sleeping peacefully, deep in the straw. Miles away, at the Arables' house, the men sat around the kitchen table eating a dish of canned peaches and talking over the events of the day. Upstairs, Avery was already in bed and asleep. Mrs. Arable was tucking F em into bed. \"Did you have a good time at the Fair?\" she asked as she kissed her daughter. Fern nodded. \"I had the best time I have ever had anywhere or any time in all of my whole life.\" \"Well!\" said Mrs. Arable. \"Isn't that nice!\" Chapter XIX 'fhe Egg Sac ",
        "chunk_order_index": 4,
        "chunk_id": "chunk-e279af1f25428445768a7a93045285ed",
        "description": "The image is a simple, black silhouette of the capital letter 'N'. The letter is depicted in a serif font, characterized by small lines or strokes regularly attached to the end of a larger stroke. The background is plain white, and there are no other objects, scenes, or activities depicted in the image. The letter 'N' is centrally positioned and fills a significant portion of the frame.",
        "segmentation": false
    },
    "image_8": {
        "image_id": 8,
        "image_path": "./fusion_research/fusion_dataset/novel/Charlottes Web (E. B. White) (3)/images/image_8.jpg",
        "caption": [],
        "footnote": [],
        "context": "\"If nothing \"Charlotte,\" said Wilbur dreamily, \"are you really going to have five hundred and founeen children?'·' \"Yes, it is pretty,\" replied Charlotte, patting the sac with her two front legs. \"Anyway, I can guarantee that it is strong. It's made out of the toughest material I have. It is also waterproof. The eggs are inside and will be warm and dry.\" \"It's a perfectly beautiful egg sac,\" said Wilbur, feeling as happy as though he had constructed it him­ self. \"No, I'm not. I counted them. I got started counting, so I kept on-just to keep my mind occupied.\" \"Are you awake, Charlotte?\" he said softly. \"Yes,\" came the answer. \"What is that nifty little thing? Did you make it?\" \"I did indeed,\" replied Charlotte in a weak voice. \"Is it a plaything?\" \"Plaything? I should say not. It is my egg sac, my may;num opus. \"I don't know what a magnum opus is,\" said Wilbur. \"That's Latin,\" explained Charlotte. \"It means 'great work.' This egg sac is my great work-the finest thing I have ever made.\" \"What's inside it?\" asked Wilbur. \"Eggs?\" \"Five hundred and fourteen of them,\" she replied. \"Five hundred and fourteen?\" said Wilbur. \"You're kidding.\" ",
        "chunk_order_index": 5,
        "chunk_id": "chunk-b2e4d78b2ca09956b51bd47ad8e07f07",
        "description": "The image is a black-and-white sketch depicting a spider perched on top of an egg sac. The spider is positioned at the upper right corner of the egg sac, with its body oriented towards the viewer. The spider's legs are spread out, and it appears to be patting or touching the surface of the egg sac with its two front legs. The egg sac itself is round and textured, resembling a ball of tightly woven threads or fibers. The background consists of diagonal lines that give the impression of a web or a network of threads extending from the egg sac. The overall style of the drawing is rough and sketchy, with heavy use of cross-hatching to create texture and depth.",
        "segmentation": false
    },
    "image_9": {
        "image_id": 9,
        "image_path": "./fusion_research/fusion_dataset/novel/Charlottes Web (E. B. White) (3)/images/image_9.jpg",
        "caption": [],
        "footnote": [],
        "context": "\"Don't worry about my stomach,\" snarled Temple­ ton. \"It can handle anything. And by the way, I've got some bad news. As \"You ought to be ashamed of yourself,\" said Char­ lotte in disgust. \"It would serve you right if you had an acute attack of indigestion.\" \"What a night!\" he repeated, hoarsely. \"What feast­ ing and carousing! A real gorge! I must have eaten the remains of thirty lunches. Never have I seen such leav­ ings, and everything well-ripened and seasoned with the passage of time and the heat of the day. Oh, it was rich, my friends, rich!\" all plain and clear. It was a perfect piece of designing and building. In another hour or two, a steady stream of people would pass by, admiring it, and reading it, and looking at Wilbur, and marvel­ ing at the miracle. As Wilbur was studying the web, a pair of whiskers and a sharp face appeared. Slowly Templeton dragged himself across the pen and threw himself down in a corner. \"I'm back,\" he said in a husky voice. \"What a night!\" The rat was swollen to twice his normal size. His stomach was as big around as a jelly jar. ",
        "chunk_order_index": 5,
        "chunk_id": "chunk-b2e4d78b2ca09956b51bd47ad8e07f07",
        "description": "The image is a black and white illustration of a rat lying on its side. The rat appears to be in a state of discomfort or exhaustion, with its eyes closed and mouth slightly open. Its body is swollen, particularly around the stomach area, which is depicted as being as big around as a jelly jar. The rat's fur is detailed with individual strands visible, giving it a textured appearance. The tail is long and thin, curving upwards. The background consists of wooden planks, suggesting a barn or similar rustic setting. The overall atmosphere conveyed by the image is one of fatigue and possibly pain, aligning with the context provided about the rat's overindulgence.",
        "segmentation": true
    },
    "image_10": {
        "image_id": 10,
        "image_path": "./fusion_research/fusion_dataset/novel/Charlottes Web (E. B. White) (3)/images/image_10.jpg",
        "caption": [],
        "footnote": [],
        "context": "\"You're all right, Edith,\" said \"You didn't even look at my hair!\" said Mrs. Zuck­ erman. \"Looks fine,\" snapped Mr. Zuckerman, as he and Lurvy set the crate down in front of Wilbur. \"Does my hair look all right?\" asked Mrs. Zucker­ man. \"Put that empty buttermilk jar into the truck!\" com­ manded Mr. Arable. A very grabbed the jar and rushed to the truck. \"You wait!\" said Mrs. Arable. \"Can't you see every­ body is busy?\" \"Can I have some money?\" asked Fern. \"We have no time to lose!\" shouted Mr. Zucker­ man. \"Lurvy, help with the crate! \"  in the air and gave a loud yell. The straw fluttered down like confetti into Fern's hair. Mr. Zuckerman hugged Mrs. Zuckerman. Mr. Arable kissed Mrs. Ara­ ble. Avery kissed Wilbur. Lurvy shook hands with everybody. Fern hugged her mother. Avery hugged Fern. Mrs. Arable hugged Mrs. Zuckerman. Up overhead, in the shadows of the ceiling, Charlotte crouched unseen, her front legs encircling her egg sac. Her heart was not beating as strongly as usual and she felt weary and old, but she was sure at last that she had saved Wilbur's life, and she felt peaceful and con­ tented. ",
        "chunk_order_index": 6,
        "chunk_id": "chunk-b054668dbec45ac6c411e5cdade7daec",
        "description": "The image is a black-and-white illustration depicting a joyful and celebratory scene. In the foreground, a boy is performing a handstand on the grass, his legs raised high in the air and his body inverted. Behind him, two adults are embracing each other warmly, their faces expressing happiness and relief. To the right of the embracing couple, a girl is hugging another adult, who appears to be a woman, while another child stands nearby, observing the scene with a smile. The background features a crowd of people, some of whom are clapping and cheering, adding to the festive atmosphere. There is a loudspeaker mounted on a pole, suggesting that this might be a public event or gathering. The overall mood of the image conveys warmth, happiness, and a sense of community celebration.",
        "segmentation": true
    },
    "image_11": {
        "image_id": 11,
        "image_path": "./fusion_research/fusion_dataset/novel/Charlottes Web (E. B. White) (3)/images/image_11.jpg",
        "caption": [],
        "footnote": [],
        "context": "Wilbur trembled when he heard this speech. He felt happy but dizzy. The truck crept along slowly irt low speed. Crowds of people surrounded it, and Mr. Arable had to drive very Homer L. Zuckerman and his famous pig. The truck bearing this extraordinary animal is now ap­ proaching the infield. Kindly stand back and give the truck room to proceed! In a few moments the pig will be unloaded in the special judging ring in front of the grandstand, where a special award will be made. Will the crowd please make way and let the truck pass. Thank you.\" and Mr. Arable and Lurvy and Avery grabbed the crate and boosted it over the side of the pen and up into the truck. Fern jumped aboard and sat on top of the crate. She still had straw in her hair and looked very pretty and excited. Mr. Arable started the motor. Everyone climbed in, and off they drove to the judge's booth in front of the grandstand. As they passed the Ferris wheel, Fern gazed up at it and wished she were in the topmost car with Henry Fussy at her side. Chapter XX 'The Hour of 'f riumph ",
        "chunk_order_index": 7,
        "chunk_id": "chunk-9304f370ce63444623c505eb4d1c4046",
        "description": "The image is a close-up of the capital letter 'S' in a serif font. The letter is black and set against a white background. The 'S' is stylized with smooth curves and sharp serifs at the top and bottom, typical of serif typefaces. There are no other objects, people, or scenes present in the image. The focus is solely on the letter, which occupies most of the frame.",
        "segmentation": false
    },
    "image_12": {
        "image_id": 12,
        "image_path": "./fusion_research/fusion_dataset/novel/Charlottes Web (E. B. White) (3)/images/image_12.jpg",
        "caption": [],
        "footnote": [],
        "context": "A great feeling of happiness swept over the Zucker­ mans and the Arables. This was the greatest moment in Mr. Zuckerman's life. It is deeply satisfying to win a prize in front of a lot And now one of the judges climbed into the ring with the prizes. He handed Mr. Zuckerman two ten dollar bills and a five dollar bill. Then he tied the medal around Wilbur's neck. Then he shook hands with Mr. Zuckerman while Wilbur blushed. Avery put out his hand and the judge shook hands with him, too. The crowd cheered. A photographer took Wilbur's picture.  Templeton poked his head from the straw. He noticed that the end of Wilbur's tail was within reach. Templeton grinned. \"I'll tend to this,\" he chuckled. He took Wilbur's tail in his mouth and bit it, just as hard as he could bite. The pain revived Wilbur. In a flash he was back on his feet. \"Ouch!\" he screamed. \"Hoorray!\" yelled the crowd. \"He's up! The pig's up! Good work, Zuckerman! That's some pig!\" Everyone was delighted. Mr. Zuckerman was the most pleased of all. He sighed with relief. Nobody had seen Templeton. The rat had done his work well. ",
        "chunk_order_index": 8,
        "chunk_id": "chunk-91bf631ebfbbe809e5abac021fc92c14",
        "description": "The image is a black-and-white illustration depicting a scene with a boy and a pig. The boy, who appears to be young and has tousled hair, is leaning over a large pig that is lying on the ground. The boy's expression is one of concern or curiosity as he looks down at the pig. The pig is depicted with a round body and a long snout, and it seems to be in a state of distress or exhaustion. To the right of the pig, there is a wooden crate, which adds to the rural or farm setting of the scene. The overall atmosphere conveyed by the image is one of care and attention, as the boy seems to be tending to the pig. The illustration style is detailed and expressive, capturing the emotions and actions of the characters vividly.",
        "segmentation": true
    },
    "image_13": {
        "image_id": 13,
        "image_path": "./fusion_research/fusion_dataset/novel/Charlottes Web (E. B. White) (3)/images/image_13.jpg",
        "caption": [],
        "footnote": [],
        "context": "\"I didn't ask for a shower bath,\" said Mr. Zucker­ man. The crowd \"You asked for water,\" said Lurvy meekly. \"For goodness' sake!\" bellowed .Mr. Zuckerman, who was really drenched. \"What ails you, Lurvy? Can't you see the pig is all right?\" As Wilbur was being shoved back into the crate, Lurvy came charging through the crowd carrying a pail of water. His eyes had a wild look. Without hesi­ tating a second, he dashed the water at Wilbur. In his excitement he missed his aim, and the water splashed all over Mr. Zuckerman and Avery. They got soaking wet. one of the judges climbed into the ring with the prizes. He handed Mr. Zuckerman two ten dollar bills and a five dollar bill. Then he tied the medal around Wilbur's neck. Then he shook hands with Mr. Zuckerman while Wilbur blushed. Avery put out his hand and the judge shook hands with him, too. The crowd cheered. A photographer took Wilbur's picture. A great feeling of happiness swept over the Zucker­ mans and the Arables. This was the greatest moment in Mr. Zuckerman's life. It is deeply satisfying to win a prize in front of a lot of people. ",
        "chunk_order_index": 8,
        "chunk_id": "chunk-91bf631ebfbbe809e5abac021fc92c14",
        "description": "The image is a black-and-white illustration depicting a lively scene at what appears to be a fair or competition. In the foreground, a pig stands prominently on the left side of the image, with a medal hanging around its neck, suggesting it has won a prize. To the right of the pig, a man in a suit and hat is kneeling, holding a camera and taking a picture of the pig. Behind the pig, another man in a suit is shaking hands with a third man who is standing next to a young boy. The man shaking hands is receiving money from the other man, indicating a prize award ceremony. The background shows a crowd of people watching the event, some of whom are clapping and cheering. The overall atmosphere is one of celebration and happiness, as indicated by the expressions and actions of the people in the image.",
        "segmentation": true
    },
    "image_14": {
        "image_id": 14,
        "image_path": "./fusion_research/fusion_dataset/novel/Charlottes Web (E. B. White) (3)/images/image_14.jpg",
        "caption": [],
        "footnote": [],
        "context": "little tired, perhaps. But I feel peaceful. Your success in the ring this morning was, to a small \"Yes, but you seem specially so today. Do you feel all right?\" \"I like to sit still,\" she said. \"I've always been rather quiet.\" \"Charlotte,\" said Wilbur after a while, \"why are you so quiet?\" excitement and strain of the ceremony. His medal still hung from his neck; by looking out of the corner of his eye he could see it. and Wilbur were alone. The families had gone to look for Fern. Temple­ ton was asleep. Wilbur lay resting after the When he dis­ covered there was still a little water left in the bottom of the pail, he raised the pail high in the air and dumped the water on himself and made faces. The children in the grandstand screamed with appreciation. At last things calmed down. Wilbur was loaded into the truck. Avery was led from the ring by his mother and placed on the seat of the truck to dry off. The truck, driven by Mr. Arable, crawled slowly back to the pigpen. Avery's wet trousers made a big wet spot on the seat. Chapter XXI Last Day ",
        "chunk_order_index": 9,
        "chunk_id": "chunk-f6a341547e19189c5ca48f1b8e38bc76",
        "description": "The image is a close-up of the uppercase letter 'C'. The letter is rendered in a bold, serif font. The color of the letter is black, and it appears to be set against a white background. The letter 'C' is well-defined with smooth curves and sharp edges, typical of a serif typeface.",
        "segmentation": false
    },
    "image_15": {
        "image_id": 15,
        "image_path": "./fusion_research/fusion_dataset/novel/Charlottes Web (E. B. White) (3)/images/image_15.jpg",
        "caption": [],
        "footnote": [],
        "context": "\"Neither will I,\" said the rat, picking his teeth. \"I feel as though I'd eaten a spool of thread. Well, \"Thank you, T<:mpleton,\" he said. \"I will never forget this as long as I live.\" But Templeton worked away at the job, and man­ aged to cut the sac adrift and carry it to the ground, where he dropped it in front of Wilbur. Wilbur heaved a great sigh of relief. \"Thith thruff thticks in my mouth,\" complained the rat. \"lt'th worth than caramel candy.\" \"Use extreme care!\" he said. \"I don't want a single one of those eggs harmed.\"  rat sat up. \"You mean that?\" he said. \"I promise. I cross my heart.\" \"All right, it's a deal,\" said the rat. He walked to the wall and started to climb. His stomach was still swollen from last night's gorge. Groaning and cornplaining, he pulled himself slowly to the ceiling. He crept along till he reached the egg sac. Charlotte moved aside for him. She was dying, but she still had strength enough to move a little. Then Templeton bared his long ugly teeth and began snipping the threads that fastened the sac to the ceiling. \\Vilbur watched from below. ",
        "chunk_order_index": 10,
        "chunk_id": "chunk-13dfd378a9b23f98f46d5fa0c2cae7f7",
        "description": "The image is a black and white illustration of a rat. The rat is depicted in a dynamic pose, with its front paws raised as if it is climbing or reaching for something. Its eyes are wide open, and its mouth is slightly agape, giving it an expression of determination or effort. The rat's fur is detailed with numerous lines to show texture and volume. Its tail is long and segmented, extending outwards from the bottom of the image. The background consists of horizontal lines, suggesting a surface or wall that the rat is interacting with. There is a small object near the rat's nose, which appears to be a piece of thread or string. The overall atmosphere conveyed by the image is one of action and focus, as the rat seems to be engaged in a task that requires concentration and effort.",
        "segmentation": true
    },
    "image_16": {
        "image_id": 16,
        "image_path": "./fusion_research/fusion_dataset/novel/Charlottes Web (E. B. White) (3)/images/image_16.jpg",
        "caption": [],
        "footnote": [],
        "context": "In J\\1r. Zuckerman took the medal from Wilbur's neck and hung it on a nail over the pigpen, where visitors could examine it. \\Vilbur himself could look at it whenever he wanted to. \"Congratu-congratu-congratulations!\" they cried. \"Nice work.\" The geese gave him a noisy welcome. wore a medal of honor; in his mouth he held a sac of spider's eggs. There is no place like home, Wilbur thought, as he placed Charlotte's five hundred and founeen unborn children carefully in a safe corner. The barn smelled good. His friends the sheep and the geese were glad to see him back. him. She never moved again. Next day, as the Ferris wheel was being taken apart and the race horses were being loaded into vans and the entertainers were pack­ ing up their belongings and driving away in their trailers, Charlotte died. The Fair Grounds were soon deserted. The sheds and buildings were empty and forlorn. The infield was littered with bottles and trash. Nobody, of the hundreds of people that had visited the Fair, knew that a grey spider had played the most important part of all. No one was with her when she died. Chapter XX/l A War1n Wind ",
        "chunk_order_index": 11,
        "chunk_id": "chunk-853bbdb1918877bb9383f2d1c6d22b4c",
        "description": "The image is a close-up of the letter 'A' in a serif font. The letter is bold and black, set against a white background. The top part of the letter extends beyond the baseline, creating a traditional serif style. The letter 'A' is partially cropped at the top, showing only the upper half of the letter. Above the letter, there are two characters that appear to be part of a larger word or phrase, but they are not fully visible. The visible characters are 'ND', suggesting that the full word might be 'AND'.",
        "segmentation": false
    },
    "image_17": {
        "image_id": 17,
        "image_path": "./fusion_research/fusion_dataset/novel/Charlottes Web (E. B. White) (3)/images/image_17.jpg",
        "caption": [],
        "footnote": [],
        "context": "All winter Wilbur watched over Charlotte's egg sac as though he were guarding his own children. He had scooped out a special place in the manure for the sac, next to the board fence. On very cold nights he lay so that his breath would warm it. For Wilbur, nothing in life was so imponant as this small round object-noth­ ing \"Who wants to live forever?\" sneered the rat. \"I am naturally a heavy eater and I get untold satisfaction from the pleasures of the feast.\" He patted his stomach, grinned at the sheep, and crept upstairs to lie down. found a trinket or a keepsake he carried it home and stored it there. He continued to visit Wilbur three times a day, exactly at mealtime, and Wilbur kept the promise he had made. Wilbur let the rat eat first. Then, when Templeton couldn't hold another mouthful, Wilbur would eat. As a result of overeating, Templeton grew bigger and fatter than any rat you ever saw. He was gigantic. He was as big as a young woodchuck.  The old sheep spoke to him about his size one day. \"You would live longer,\" said the old sheep, \"if you ate less.\" ",
        "chunk_order_index": 12,
        "chunk_id": "chunk-82e936cf2fd34b2e4ed3bdb7f4054d07",
        "description": "The image is a black-and-white illustration depicting a scene with two animals. In the foreground, there is a rat sitting on a wooden box. The rat has a long tail and appears to be in a relaxed posture, facing towards the right side of the image. Behind the rat, there is a sheep peeking over a wooden fence. The sheep has a fluffy coat and is looking down at the rat with an expression that could be interpreted as curiosity or concern. The background includes some grass and a piece of wood, suggesting an outdoor setting, possibly a farm or barnyard. The overall atmosphere of the image conveys a sense of interaction between the two animals, with the sheep observing the rat from behind the fence.",
        "segmentation": true
    },
    "image_18": {
        "image_id": 18,
        "image_path": "./fusion_research/fusion_dataset/novel/Charlottes Web (E. B. White) (3)/images/image_18.jpg",
        "caption": [],
        "footnote": [],
        "context": "\"Are all of you going?\" asked Wilbur. \"You can't all go. I would be \"Wherever the wind takes us. High, low. Near, far. East, west. North, south. We take to the breeze, we go as we please.\" \"But where?\" asked Wilbur.  \"We're leaving here on the warm updraft. This is our moment for setting forth. We are aeronauts and we are going out into the world to make webs for our­ selves.\" \"Good-bye!\" they called. \"Good-bye, good-bye!\" At last one little spider took time enough to stop and talk to Wilbur before making its balloon. \"Come back, children!\" he cried. The silk formed a balloon. As Wilbur watched, the spider let go of the fence and rose into the air. \"Good-bye!\" it said, as it sailed through the door­ way. \"Wait a minute!\" screamed Wilbur. \"Where do you think you're going?\" But the spider was already out of sight. Then another baby spider crawled to the top of the fence, stood on its head, made a balloon, and sailed away. Then another spider. Then another. The air was soon filled with tiny balloons, each balloon carrying a spider.  Wilbur was frantic. Charlotte's babies were disap­ pearing at a great rate. ",
        "chunk_order_index": 13,
        "chunk_id": "chunk-5cf6efc77f0ce109563176fc97f22ebe",
        "description": "The image is a black-and-white illustration depicting a scene involving a pig and several spiders. The pig, which appears to be Wilbur from the context provided, is leaning over a wooden fence with a curious and somewhat concerned expression. His eyes are wide open, and his mouth is slightly agape, suggesting he is speaking or calling out. The texture of the pig's fur is detailed, with individual bristles visible. The fence is drawn with rough, hatched lines, giving it a rustic appearance. Above the fence, there are multiple small spiders, each attached to a thin thread that extends upwards. These threads have wavy lines emanating from them, indicating movement or the presence of wind. The spiders appear to be floating away, as if carried by the breeze. The overall atmosphere conveyed by the image is one of urgency and farewell, as Wilbur watches the spiders depart.",
        "segmentation": true
    },
    "image_19": {
        "image_id": 19,
        "image_path": "./fusion_research/fusion_dataset/novel/Charlottes Web (E. B. White) (3)/images/image_19.jpg",
        "caption": [],
        "footnote": [],
        "context": "\"How \"Then my name is Aranea,\" said the spider. \"A,\" said Wilbur. \"What was my mother's middle initial?\" asked the second spider. \"I'm trembling with joy,\" said Wilbur. \"Then my name is Joy,\" said the first spider. \"I'll tell you my name,\" replied the first little spider, \"if you'll tell me why you are trembling.\" \"What are your names, please?\" asked Wilbur, trembling with joy. \"You can indeed,\" said the spiders. \"Can I take this to mean,\" asked Wilbur, \"that you have definitely decided to live here in the barn cellar, and that I am going to have three friends?\" the egg sac. It was empty. He looked into the air. The balloonists were gone. Then he walked drearily to the doorway, where Charlotte's web used to be. He was standing there, thinking of her, when he heard a small VOICe. \"Salutations!\" it said. \"I'm up here.\" \"So am I,\" said another tiny voice. \"So am I,\" said a third voice. \"Three of us are stay­ ing. We like this place, and we like you. Wilbur looked up. At the top of the doorway three small webs were being constructed. On each web, working busily was one of Charlotte's daughters. ",
        "chunk_order_index": 13,
        "chunk_id": "chunk-5cf6efc77f0ce109563176fc97f22ebe",
        "description": "The image is a black-and-white illustration depicting a pastoral farm scene. In the foreground, there is a pig standing near a wooden fence. The pig appears to be looking up at a spider web that spans across the top of the doorway. The web has three spiders on it, each positioned at different points along the web. The spiders are small and detailed, with visible legs and bodies. The background features a barn on the right side, with its roof sloping downward. There are trees in the distance, their branches bare, suggesting a late autumn or early winter setting. The sky is clear, and the overall atmosphere is serene and calm, evoking a sense of quiet reflection and companionship between the pig and the spiders.",
        "segmentation": true
    },
    "image_20": {
        "image_id": 20,
        "image_path": "./fusion_research/fusion_dataset/novel/Charlottes Web (E. B. White) (3)/images/image_20.jpg",
        "caption": [],
        "footnote": [],
        "context": "had grown up to be quite a pig. E. B. White was born in Mount Vernon, New York, and was graduated from Cornell University. His writings have appeared for many years in The New Yorker magazine. He was awarded the 1970 Laura Ingalls Wilder Medal for his children's books STUART LITTLE and CHARLOTTE'S WEB, and his third book for children, THE TRUMPET OF THE SWAN, has also won several awards. The author of seventeen books of prose and poetry, Mr. White has received many distinguished literary honors. In 1973 he was elected to the American Academy of Arts and Letters. ",
        "chunk_order_index": 14,
        "chunk_id": "chunk-bbd8b21537b411d0f31462dad600b699",
        "description": "The image is a black and white barcode with the numbers '50250' on the right side and '9780064400558' below it. The barcode consists of a series of vertical lines of varying widths, which represent the encoded data. The numbers are clearly printed in a standard font, with '50250' being larger and positioned to the right of the barcode, while '9780064400558' is smaller and located directly below the barcode. There are no other objects, scenes, or background elements in the image. The barcode appears to be a standard product code used for inventory and sales purposes.",
        "segmentation": false
    }
}