{
    "image_1": {
        "image_id": 1,
        "image_path": "./fusion_research/fusion_dataset/novel/Charlottes Web (E. B. White) (2)/images/image_1.jpg",
        "caption": [],
        "footnote": [],
        "context": "\"You needn't feel too badly, Wilbur,\" she said. \"Not many creatures can spin webs. Even men aren't as good at it as spiders, although they think they're pretty good, and they'll try anything. Did Templeton untied his string and took it back to his home. Charlotte returned to her weaving. Wilbur sighed. \"You're ever so much cleverer and brighter than I am, Charlotte. I guess I was just trying to show off. Serves me right.\" how. But cheer up, you don't need a web. Zuckerman supplies you with three big meals a day. Why should you worry about trapping food?\" ",
        "chunk_order_index": 0,
        "chunk_id": "chunk-417215f91ee0a37cc2f6daa4d63375cc",
        "description": "The image is a black-and-white illustration featuring a spider web in the upper left corner, with a spider positioned at the center of the web. Below the web, there is a pig and a rat. The pig appears to be jumping or leaping forward with its eyes closed and mouth open, as if it is excited or surprised. The rat is standing on its hind legs, facing the pig, with its front paws raised slightly, possibly in a gesture of communication or surprise. The background consists of horizontal lines that resemble wooden planks or a fence, adding to the rustic setting. The overall atmosphere of the image conveys a sense of interaction and movement between the characters.",
        "segmentation": true
    },
    "image_2": {
        "image_id": 2,
        "image_path": "./fusion_research/fusion_dataset/novel/Charlottes Web (E. B. White) (2)/images/image_2.jpg",
        "caption": [],
        "footnote": [],
        "context": "\"That's a mercy,\" replied Wilbur, and he \"What does 'gullible' mean?\" \"Easy to fool,\" said Charlotte. \"I was just thinking,\" said the spider, \"that people are very gullible.\" Wilbur walked into his yard just at that moment. \"What are you thinking about, Charlotte?\" he asked. Finally, one morning toward the middle of July, the idea came. \"Why, how perfectly simple! \" she said to herself. \"The way to save Wilbur's life is to play a trick on Zuckerman. If I can fool a bug,\" thought Char­ lotte, \"I can surely fool a man. People are not as smart as bugs.\"  Wilbur!\" There was a pause. \"Good night, Charlotte! \" \"Good night, Wilbur!\" \"Good night!\" \"Good night!\" Chapter X An Explosion AFTER day the spider waited, head­ down, for an idea to come to her. Hour by hour she sat motionless, deep in thought. Having promised Wilbur that she would save his life, she was determined to keep her promise. Charlotte was naturally patient. She knew from experience that if she waited long enough, a fly would come to her web; and she felt sure that if she thought long enough about Wilbur's problem, an idea would come to her mind.  ",
        "chunk_order_index": 1,
        "chunk_id": "chunk-e3b9278be90606f3d30147cbe7130ac3",
        "description": "The image is a black and white line drawing of a spider in the center of its web. The spider is depicted with detailed features, including eight legs and a segmented body. The web is drawn with intersecting lines forming a geometric pattern, radiating outward from the spider's position at the hub. The spider appears to be hanging upside down, with its legs spread out, giving it a poised and ready stance. The web is shown with a vertical line extending upwards, suggesting that the spider has spun this line to anchor the web. The overall atmosphere of the image is one of stillness and precision, capturing the intricate details of the spider's anatomy and the web's structure.",
        "segmentation": true
    },
    "image_3": {
        "image_id": 3,
        "image_path": "./fusion_research/fusion_dataset/novel/Charlottes Web (E. B. White) (2)/images/image_3.jpg",
        "caption": [],
        "footnote": [],
        "context": "Wilbur's heart \"That's a fine spider and I'm going to capture it,\" said Avery. He took the cover off the candy box. Then he picked up a stick. \"I'm going to knock that ol' spider into this box,\" he said. \"Leave it alone!\" commanded Fern. \"You've got a frog-isn't that enough?\" \"Hey, look at that big spider!\" he said. \"It's tre­ menjus.\" Avery noticed the spider web, and, coming closer, he saw Charlotte. They climbed the fence into the lane and walked lazily toward the pigpen. Wilbur heard them coming and got up. \"I'm going to visit Wilbur,\" Fern announced. children grew tired of swinging, they went down toward the pasture and picked wild rasp­ berries and ate them. Their tongues turned from purple to red. Fern bit into a raspberry that had a bad-tasting bug inside it, and got discouraged. Avery found an empty candy box and put his frog in it. The frog seemed tired after his morning in the swing. The chil­ dren walked slowly up toward the barn. They, too, were tired and hardly had energy enough to walk. \"Let's build a tree house,\" suggested Avery. \"I want to live in a tree, with my frog.\" ",
        "chunk_order_index": 2,
        "chunk_id": "chunk-e39885fdee9f8b4971f0d379dbf3376c",
        "description": "The image is a black-and-white illustration depicting a rustic farm scene. In the foreground, there is a wooden structure with a large beam supporting a rope swing. A boy is sitting on the swing, which is attached to the beam by a rope. He appears to be in motion, swinging back and forth. Another boy is standing on a ladder leaning against the wooden structure, reaching up towards the beam. The background shows a rural landscape with a barn, trees, and a fence. The ground is depicted with wavy lines, suggesting grass or a dirt path. The overall atmosphere of the image conveys a sense of childhood play and adventure in a countryside setting.",
        "segmentation": true
    },
    "image_4": {
        "image_id": 4,
        "image_path": "./fusion_research/fusion_dataset/novel/Charlottes Web (E. B. White) (2)/images/image_4.jpg",
        "caption": [],
        "footnote": [],
        "context": "\"Well,\" said one of the lambs, \"this whole business is all well and good for Charlotte, but what about the rest of us? The smell is unbearable. Who wants to live in a barn that Templeton, of course, was miserable over the loss of his beloved egg. But he couldn't resist boasting. \"It pays to save things,\" he said in his surly voice. \"A rat never knows when something is going to come in handy. I never throw anything away.\" \"I'm delighted that the egg never hatched,\" she gab­ bled. The goose was proud of her share in the adventure.  the house. Avery ran after her, holding his nose. Charlotte felt greatly relieved to see him go. It had been a narrow escape. Later on that morning, the animals came up from the pasture-the sheep, the lambs, the gander, the goose, and the seven goslings. There were many complaints about the awful smell, and vVilbur had to tell the story over and over again, of how the Arable boy had tried to capture Charlotte, and how the smell of the broken egg drove him away just in time. \"It was that rotten goose egg that saved Charlotte's life,\" said Wilbur. ",
        "chunk_order_index": 3,
        "chunk_id": "chunk-25b382c4a6005e001365fd3060174b9a",
        "description": "The image is a black and white illustration depicting a young boy who has fallen on his back after tripping over a tree stump. The boy is wearing a short-sleeved shirt, shorts, and shoes with socks. His legs are raised in the air, and he appears to be in a state of surprise or distress. The tree stump is broken, with splintered wood visible, indicating that it was the cause of his fall. The background shows a grassy area with some trees and bushes, suggesting an outdoor setting. The overall atmosphere conveyed by the image is one of unexpected mishap and minor injury, capturing a moment of childhood accident and reaction.",
        "segmentation": true
    },
    "image_5": {
        "image_id": 5,
        "image_path": "./fusion_research/fusion_dataset/novel/Charlottes Web (E. B. White) (2)/images/image_5.jpg",
        "caption": [],
        "footnote": [],
        "context": "Zuckerman stared at the writing on the web. Then he munnured the words \"Some The two men walked silently down to Wilbur's yard. Lurvy pointed to the spider's web. \"Do you see what I see?\" he asked. \"N-not exactly,\" said Lurvy. \"Come and see for yourself.\" \"\\Vhat's the trouble?\" asked Mr. Zuckerman. \"Any­ thing wrong with the pig?\" \"I think you'd better come down to the pigpen,\" he said. \"I'm seeing things,\" he whispered. He dropped to his knees and uttered a short prayer. Then, forgetting all about \\Vilbur's breakfast, he walked back to the house and called Mr. Zuckerman. and made a pattern of love­ liness and mystery, like a delicate veil. Even Lurvy, who wasn't panicularly interested in beauty, noticed the web when he came with the pig's breakfast. He noted how clearly it showed up and he noted how big and carefully built it was. And then he took another look and he saw something that made him set his pail down. There, in the center of the web, neatly woven in block letters, was a message. It said: SOME PIG! Lurvy felt weak. He brushed his hand across his eyes and stared harder at Charlotte's web. ",
        "chunk_order_index": 4,
        "chunk_id": "chunk-b69896b8e49f84b8a8220596093a66df",
        "description": "The image is a black and white illustration of a spider web. The web is depicted in a detailed, intricate manner with multiple concentric circles radiating from the center. The web is set against a dark background, which enhances the contrast and makes the web stand out prominently. The web appears to be well-constructed, with evenly spaced radial lines and concentric circles. There are no people, objects, or additional scenes depicted in the image. The overall atmosphere conveyed by the image is one of stillness and precision, highlighting the delicate and complex structure of the spider web.",
        "segmentation": false
    },
    "image_6": {
        "image_id": 6,
        "image_path": "./fusion_research/fusion_dataset/novel/Charlottes Web (E. B. White) (2)/images/image_6.jpg",
        "caption": [],
        "footnote": [],
        "context": "Mr. Zuckerman In the days that followed, Mr. Zuckerman was so busy entertaining visitors that he neglected his farm work. He wore his good clothes all the time now-got right into them when he got up in the morning. Mrs. Zuckerman prepared special meals for Wilbur. Lurvy shaved and got a haircut; and his principal farm duty was to feed the pig while people looked on. When Fern told her mother that A very had tried to hit the Zuckermans' spider with a stick, Mrs. Arable was so shocked that she sent Avery to bed without any supper, as punishment.   at Wilbur and to read the words on Charlotte's web. The Zuckermans' driveway was full of cars and trucks from morning till night-Fords and Chevvies and Buick roadmasters and GMC pickups and Plymouths and Studebakers and Packards and De Sotos with gyromatic transmissions and Oldsmobiles with rocket engines and Jeep station wagons and Pontiacs. The news of the wonderful pig spread clear up into the hills, and farmers came rattling down in buggies and buckboards, to stand hour after hour at Wilb''s pen admiring the miraculous animal. All said they had never seen such a pig before in their lives. ",
        "chunk_order_index": 5,
        "chunk_id": "chunk-e599d86e8b65bf951fe236e711378110",
        "description": "The image is a black-and-white illustration depicting a bustling scene at a farm. The focal point is a large wooden barn with a gabled roof and wide doors. In front of the barn, there is a group of people gathered, some standing and others sitting on the ground. The people are dressed in various outfits, suggesting a mix of casual and formal attire. To the right of the barn, there is a dirt road leading away from the scene, with numerous cars and trucks parked along it. The vehicles include a variety of models, such as Fords, Chevvies, Buick roadmasters, GMC pickups, Plymouths, Studebakers, Packards, De Sotos, Oldsmobiles, Jeep station wagons, and Pontiacs. The background features rolling hills and a few scattered trees, adding to the rural atmosphere. The overall scene conveys a sense of excitement and curiosity, as if the people have come to see something extraordinary.",
        "segmentation": true
    },
    "image_7": {
        "image_id": 7,
        "image_path": "./fusion_research/fusion_dataset/novel/Charlottes Web (E. B. White) (2)/images/image_7.jpg",
        "caption": [],
        "footnote": [],
        "context": "\"Bee-bee-bee!\" \"Bee-bee-bee!\" \"Bee-bee-bee!\" \"Bee-bee-bee!\" \"Bee-bee-bee!\" \"Bee-bee-bee!\" \"Bee­ bee-bee!\" said the goslings. \"Goslings, one through seven?\" \"Here, here, here!\" said the goose. Charlotte glared at her. \"It's my idio-idio-idiosyncrasy,\" replied the gander. \"Goose?\" said Charlotte. \"You sound like three ganders,\" muttered Char­ lotte. \"Why can't you just say 'here'? Why do you have to repeat everything?\" \"Here, here, here!\" said the gander. \"I shall begin by calling the roll. Wilbur?\" \"Here!\" said the pig. \"Gander?\" EVENING, a few days after the writ­ ing had appeared in Charlotte's web, the spider called a meeting of all the animals in the bam cellar. to hoe it. On Sunday the church was full. The minister explained the miracle. He said that the words on the spider's web proved that human beings must always be on the watch for the corning of wonders.  All in all, the Zuckennans' pigpen was the center of attraction. Fern was happy, for she felt that Char­ lotte's trick was working and that Wilbur's life would be saved. But she found that the bam was not nearly as pleasant-too many people. She liked it better when she could be all alone with her friends the animals. Chapter XII A Meeting ",
        "chunk_order_index": 5,
        "chunk_id": "chunk-e599d86e8b65bf951fe236e711378110",
        "description": "The image displays a large, bold black letter 'O' on a white background. The letter 'O' is perfectly circular with uniform thickness in its stroke. There are no other objects, scenes, or background elements present in the image. The simplicity of the image focuses entirely on the letter 'O', which stands out prominently against the stark white backdrop.",
        "segmentation": false
    },
    "image_8": {
        "image_id": 8,
        "image_path": "./fusion_research/fusion_dataset/novel/Charlottes Web (E. B. White) (2)/images/image_8.jpg",
        "caption": [],
        "footnote": [],
        "context": "\"I think,\" said the gander, \"it's tee double ee double rr double rr double eye double ff double eye double see see see see see.\" \"That doesn't make a particle of difference,\" replied Charlotte. \"Not a particle. People believe almost any­ thing they see in print. Does anybody here know how to spell 'terrific'?\" \"But Charlotte,\" said Wilbur, \"I'm not terrific.\"  \"Cut that down to one 'terrific' and it will do ver nicely,\" said Charlotte. \"I think 'terrific' might impress Zuckerman.\" \"How about 'Terrific, terrific, terrific'?\" asked the goose. \"No good,\" said Charlotte. \"It sounds like a rich des­ sert.\" thinks Wilbur is an unusual pig, and therefore he won't want to kill him and eat him. I dare say my trick will work and Wilbur's life can be saved. \"Hurray!\" cried everybody. \"Thank you very much,\" said Charlotte. \"Now I called this meeting in order to get suggestions. I need new ideas for the web. People are already getting sick of reading the words 'Some Pig!' If anybody can think of another message, or remark, I'll be glad to weave it into the web. Any suggestions for a new slogan?\" \"How about 'Pig Supreme'?\" asked one of the lambs. ",
        "chunk_order_index": 6,
        "chunk_id": "chunk-aacf791abd702456b6896d9c0fb0ba77",
        "description": "The image is a black-and-white illustration depicting a farm scene with various animals and a girl. In the foreground, a pig stands on its hind legs, reaching up towards a web that spans across the top left corner of the image. The web appears to be intricately woven, suggesting it might be the work of a spider. To the right of the pig, a group of geese are gathered around a fence, looking in the direction of the pig and the web. Among the geese, one goose stands out as it seems to be speaking or reacting to something. Behind the geese, there is a girl leaning over the fence, observing the scene with interest. She has her hands resting on the fence, and her posture suggests she is engaged in what is happening. The background shows a pastoral landscape with trees and hills, adding to the rural setting. The overall atmosphere of the image conveys a sense of curiosity and interaction among the animals and the girl.",
        "segmentation": true
    },
    "image_9": {
        "image_id": 9,
        "image_path": "./fusion_research/fusion_dataset/novel/Charlottes Web (E. B. White) (2)/images/image_9.jpg",
        "caption": [],
        "footnote": [],
        "context": "Charlotte climbed to a point at the top of the left hand side of the web. Swinging her spinnerets into posi­ tion, she \"Now let's see, the first letter is T.\" \"If I write the word 'Terrific' with sticky thread,\" she thought, \"every bug that comes along will get stuck in it and spoil the effect.\" A spider can produce several kinds of thread. She uses a dry, tough thread for foundation lines, and she uses a sticky thread for snare lines-the ones that catch and hold insects. Charlotte decided to use her dry thread for writing the new message. \"But I'm not terrific, Charlotte. I'm just about average for a pig.\" \"You're terrific as far as I'm concerned,\" replied Charlotte, sweetly, \"and that's what counts. You're my best friend, and I think you're sensational. Now stop arguing and go get some sleep!\" Chapter XIII Good Progress ter. She left the radial lines alone, as they were needed for support. As she worked, her eight legs were a great help to her. So were her teeth. She loved to weave and she was an expert at it. When she was finished ripping things out, her web looked something like this: ",
        "chunk_order_index": 7,
        "chunk_id": "chunk-2a5bb81c871a434bad8471ea8a9ef202",
        "description": "The image is a black and white line drawing of a spider on its web. The spider is positioned on the left side of the web, near the top. It appears to be in the process of weaving or writing on the web. The web itself is depicted with radial lines extending from a central point to the outer edges, forming a circular pattern. The spider's posture suggests it is actively engaged in its task, with its legs spread out and its body oriented towards the web. The overall scene conveys a sense of precision and skill in the spider's activity.",
        "segmentation": false
    },
    "image_10": {
        "image_id": 10,
        "image_path": "./fusion_research/fusion_dataset/novel/Charlottes Web (E. B. White) (2)/images/image_10.jpg",
        "caption": [],
        "footnote": [],
        "context": "The news spread. People who had journeyed to see Wilbur when \"Terrific!\" breathed Zuckerman, in joyful admira­ tion. \"Edith, you better phone the reponer on the Weekly Chronicle and tell him what has happened. He will want to know about this. He may want to bring a photographer. There isn't a pig in the whole state that is as terrific as our pig.\" Everybody stood at the pigpen and stared at the web and read the word, over and over, while Wilbur, who really felt terrific, stood quietly swelling out his chest and swinging his snout from side to side. She ate a small bug that she had been saving. Then she slept. Next morning, Wilbur arose and stood beneath the web. He breathed the morning air into his lungs. Drops of dew, catching the sun, made the web stand out clearly. When Lurvy arrived with breakfast, there was the handsome pig, and over him, woven neatly in block letters, was the word TERRIFIC. Another miracle. Lurvy rushed and called Mr. Zuckerman. Mr. Zuck­ erman rushed and called Mrs. Zuckerman. Mrs. Zuck­ erman ran to the phone and called the Arables. The Arables climbed into their truck and hurried over. ",
        "chunk_order_index": 7,
        "chunk_id": "chunk-2a5bb81c871a434bad8471ea8a9ef202",
        "description": "The image is a black-and-white illustration featuring a pig standing in front of a wooden fence. The pig appears content and slightly smiling, with its eyes closed and snout pointing upwards. Above the pig, there is a large spider web woven between two vertical wooden posts. The web contains the word 'TERRIFIC' spelled out in block letters. The spider can be seen near the top left corner of the web. The background includes some grass at the bottom and a few small plants growing around the base of the fence. The overall atmosphere of the image conveys a sense of wonder and admiration, as if the pig has been recognized for being extraordinary.",
        "segmentation": true
    },
    "image_11": {
        "image_id": 11,
        "image_path": "./fusion_research/fusion_dataset/novel/Charlottes Web (E. B. White) (2)/images/image_11.jpg",
        "caption": [],
        "footnote": [],
        "context": "\"What do you think I am, a messenger boy?\" grumbled the rat. \"I'm not going to spend all my time chasing down to the \"I'm sorry, Templeton,\" she said, \"but 'Pre-shrunk' is out of the question. We want Zuckerman to think Wilbur is nicely filled out, not all shrunk up. I'll have to ask you to try again.\" Charlotte examined the label. It said PRE­ SHRUNK. The rat looked disgusted. But he sneaked away to the dump and was back in a while with a strip of cotton cloth. \"How's this?\" he asked. \"It's a label off an old shirt.\"  there now, rummaging around. When he returned to the bam, he carried in his mouth an advertisement he had tom from a crum­ pled magazine. \"How's this?\" he asked, showing the ad to Charlotte. \"It says 'Crunchy.' 'Crunchy' would be a good word to write in your web.\" \"Just the wrong idea,\" replied Charlotte. \"Couldn't be worse. We don't want Zuckerman to think Wilbur is crunchy. He might start thinking about crisp, crunchy bacon and tasty ham. That would put ideas into his head. We must advertise Wilbur's noble qual­ ities, not his tastiness. Go get another word, please, Templeton!\" ",
        "chunk_order_index": 8,
        "chunk_id": "chunk-c376858a7f20ef13f1444e16e78edb12",
        "description": "The image is a black and white illustration featuring a rat standing amidst various objects. The rat appears to be in a forest setting, surrounded by mushrooms, leaves, and other natural elements. The rat holds a piece of paper in its mouth that reads 'Crunchy.' There are also other pieces of paper scattered around, one of which has the word 'WONDERFUL' written on it. The rat's posture suggests it is presenting these papers as potential options. The overall atmosphere of the image conveys a sense of whimsy and narrative, fitting the context of a story involving characters and their interactions.",
        "segmentation": true
    },
    "image_12": {
        "image_id": 12,
        "image_path": "./fusion_research/fusion_dataset/novel/Charlottes Web (E. B. White) (2)/images/image_12.jpg",
        "caption": [],
        "footnote": [],
        "context": "Tired from his romp, Wilbur lay \"Do you?\" said Charlotte, looking at him with affection. \"Well, you're a good little pig, and radiant you shall be. I'm in this thing pretty deep now-I might as well go the limit.\" \"Actually,\" said Wilbur, \"I feel radiant.\" \"O.K., Wilbur,\" said Charlotte. \"You can go back to sleep. O.K., Templeton, the soap ad will do, I guess. I'm not sure Wilbur's action is exactly radiant, but it's interesting.\" Wilbur went over backwards, writhing and twisting as he went. \"Do a back flip with a half twist in it!\" cried Char­ lotte. Wilbur obeyed. T ogerher they studied the soap ad. \" 'With new radiant action,' \" repeated Charlotte, slowly. \"Wilbur!\" she called. Wilbur, who v:as asleep in the straw, jumped up. \"Run around!\" commanded Charlotte. \"I want to see you in action, to see if you are radiant.\" Wilbur raced to the end of his yard. \"Now back again, faster!\" said Charlotte. Wilbur galloped back. His skin shone. His tail had a fine, tight curl in it. \"Jump into the air!\" cried Charlotte. Wilbur jumped as high as he could. \"Keep your knees straight and touch the ground with your ears!\" called Charlotte. ",
        "chunk_order_index": 8,
        "chunk_id": "chunk-c376858a7f20ef13f1444e16e78edb12",
        "description": "The image is a black and white illustration of a pig in mid-air, seemingly performing an acrobatic maneuver. The pig is depicted with its body stretched out horizontally, legs spread wide, and tail curled up. The pig's expression appears focused and determined. The background shows a simple ground with some grass tufts, suggesting an outdoor setting. The overall atmosphere conveyed by the image is one of playful energy and agility, as the pig seems to be enjoying a dynamic activity.",
        "segmentation": true
    },
    "image_13": {
        "image_id": 13,
        "image_path": "./fusion_research/fusion_dataset/novel/Charlottes Web (E. B. White) (2)/images/image_13.jpg",
        "caption": [],
        "footnote": [],
        "context": "\"I don't know,\" said Charlotte. \"There was my cousin, slipping in, dodging out, beaten mercilessly over the head by the wildly thrashing fish, dancing in, dancing out, throwing her threads and fighting hard. First she threw a left around the tail. The fish lashed back. Then a \"How much did the fish weigh?\" asked Wilbur eagerly.  \"It was a never-to-be-forgotten battle,\" said Char­ lotte. \"There was the fish, caught only by one fin, and its tail wildly thrashing and shining in the sun. There was the web, sagging dangerously under the weight of the fish.\" \"Did she succeed?\" asked Wilbur.  he lay waiting for sleep to come. \"Tell me a story!\" So Charlotte, although she, too, was tired, did what Wilbur wanted. \"Once upon a time,\" she began, \"I had a beautiful cousin who managed to build her web across a small stream. One day a tiny fish leaped into the air and got tangled in the web. My cousin was very much sur­ prised, of course. The fish was thrashing wildly. My cousin hardly dared tackle it. But she did. She swooped down and threw great masses of wrapping material around the fish and fought bravely to capture it.\" ",
        "chunk_order_index": 9,
        "chunk_id": "chunk-f4bddce6de487359621fa3a88599dcc6",
        "description": "The image is a black and white illustration depicting a dramatic scene involving a spider and a fish. The spider, positioned on the right side of the image, is shown in the act of capturing a fish that has become entangled in its web. The web is stretched across the water, with several strands clearly visible, creating a sense of tension and struggle. The fish, located towards the center-left of the image, is depicted with its body partially submerged in the water, causing ripples to spread outwards. The spider's posture is dynamic, with its legs extended as it works to secure the fish. Surrounding the scene are tall grasses or reeds, adding to the natural setting. The overall atmosphere conveyed by the image is one of intense action and survival, highlighting the spider's determination and the fish's plight.",
        "segmentation": true
    },
    "image_14": {
        "image_id": 14,
        "image_path": "./fusion_research/fusion_dataset/novel/Charlottes Web (E. B. White) (2)/images/image_14.jpg",
        "caption": [],
        "footnote": [],
        "context": "\"What's miraculous about a spider's web?\" said But for that matter I don't understand how a spider learned to spin a web in the first place. When the words appeared, everyone said they were a miracle. But no­ body pointed out that the web itself is a miracle.\" \"Oh, no,\" said Dr. Dorian. \"I don't understand it. \"Do you understand how there could be any writing in a spider's web?\" \"Well, do you' understand it?\" asked Mrs. Arable. \"Understand what?\" \"Yes,\" replied the doctor. \"Have you heard about the words that appeared in the spider's web?\" asked Mrs. Arable nervously. watches animals, hour after hour. She just sits and listens.\" Dr. Dorian leaned back and closed his eyes. \"How enchanting!\" he said. \"It must be real nice and quiet down there. Homer has some sheep, hasn't he?\" \"Yes,\" said Mrs. Arable. \"But it all started with that pig we let Fern raise on a bottle. She calls him Wilbur. Homer bought the pig, and ever since it left our place Fern has been going to her uncle's to be near it.\"  \"I've been hearing things about that pig,\" said Dr. Dorian, opening his eyes. \"They say he's quite a pig.\" ",
        "chunk_order_index": 10,
        "chunk_id": "chunk-4fc4d4f193065cd59d45ad3f038fc420",
        "description": "The image is a black-and-white illustration of a young girl sitting in an armchair. She has her hair styled in a bun and is wearing a necklace. The girl appears to be engaged in an activity, possibly sewing or knitting, as she is holding a piece of fabric with both hands. Her posture is relaxed, and she seems focused on her task. The armchair has a textured pattern, and the girl's clothing includes a collared shirt and a dress. The overall atmosphere of the image conveys a sense of calm and concentration.",
        "segmentation": true
    },
    "image_15": {
        "image_id": 15,
        "image_path": "./fusion_research/fusion_dataset/novel/Charlottes Web (E. B. White) (2)/images/image_15.jpg",
        "caption": [],
        "footnote": [],
        "context": "\"I suppose so,\" said Mrs. Arable. \"I never looked at it that way \"Well, who taught a spider? A young spider knows how to spin a web without any instructions from any­ body. Don't you regard that as a miracle?\" \"My mother taught me.\" \"Sure,\" said the doctor. \"But somebody taught you, didn't they?\" Mrs. Arable shifted uneasily in her chair. \"No,\" she replied. \"But I can crochet a doily and I can knit a sock.\" \"Ever try to spin one?\" asked Dr. Dorian. Arable. \"I don't see why you say a web is a miracle­ it's just a web.\" you heard about the words that appeared in the spider's web?\" asked Mrs. Arable nervously. \"Yes,\" replied the doctor. \"Well, do you' understand it?\" asked Mrs. Arable. \"Understand what?\" \"Do you understand how there could be any writing in a spider's web?\" \"Oh, no,\" said Dr. Dorian. \"I don't understand it. But for that matter I don't understand how a spider learned to spin a web in the first place. When the words appeared, everyone said they were a miracle. But no­ body pointed out that the web itself is a miracle.\" \"What's miraculous about a spider's web?\" said Mrs. ",
        "chunk_order_index": 10,
        "chunk_id": "chunk-4fc4d4f193065cd59d45ad3f038fc420",
        "description": "The image is a black-and-white cartoon illustration of an older man with a full beard and glasses, reclining in a chair with his legs stretched out on a desk. He appears to be asleep or deeply relaxed, with his eyes closed and his head tilted back. The man is wearing a suit jacket and pants, and he has a pipe in his mouth. His posture suggests a sense of ease and perhaps a bit of laziness. On the wall behind him, there is a framed certificate or diploma, indicating that he might be a professional or someone with formal qualifications. The overall atmosphere of the image conveys a sense of relaxation and perhaps a touch of humor, as the man seems to be taking a break from work.",
        "segmentation": true
    },
    "image_16": {
        "image_id": 16,
        "image_path": "./fusion_research/fusion_dataset/novel/Charlottes Web (E. B. White) (2)/images/image_16.jpg",
        "caption": [],
        "footnote": [],
        "context": "When morning came, everybody got up at daylight. The day was hot. Up the road at the Arables' house, Fern lugged a pail of hot water to her room and took a sponge bath. Then she put on her prettiest dress be­ cause she knew she would see boys at the Fair. Mrs. Arable scrubbed the back of Avery's neck, and wet his hair, and Down in the barn cellar, the animals, too, went to sleep early, all except Charlotte. Tomorrow would be Fair Day. Every creature planned to get up early to see Wilbur off on his great adventure.  in the swings.  Lurvy was in bed by eight-thirty. He lay dreaming that he was throwing baseballs at a cloth cat and winning a genuine Navajo blanket. Mr. and Mrs. Zuckerman were in bed by nine. Mrs. Zuckerman lay dreaming about a deep freeze unit. Mr. Zuckerman lay dreaming about Wilbur. He dreamt that Wilbur had grown until he was one hundred and sixteen feet long and ninety-two feet high and that he had won all the prizes at the Fair and was covered with blue ribbons and even had a blue ribbon tied to the end of his tail. ",
        "chunk_order_index": 12,
        "chunk_id": "chunk-e49223905f9e7bb8908e24abc7825c81",
        "description": "The image is a black-and-white illustration featuring an oversized pig standing on a platform. The pig has a large, round body with a small tail that curls at the end. On its side, there is a banner that reads 'FIRST PRIZE.' The pig's skin is depicted with cross-hatching to show texture and shading. Below the pig, there are several people gathered around the platform, appearing as small figures in comparison to the enormous pig. The people seem to be observing or admiring the pig. In the background, there are tents and a tree, suggesting that this scene takes place at a fair or exhibition. The overall atmosphere conveyed by the image is one of excitement and celebration, as the pig has won a prize and is being showcased.",
        "segmentation": true
    },
    "image_17": {
        "image_id": 17,
        "image_path": "./fusion_research/fusion_dataset/novel/Charlottes Web (E. B. White) (2)/images/image_17.jpg",
        "caption": [],
        "footnote": [],
        "context": "\"Children!\" snapped the goose. \"We're staying quietly-ietly-ietly at home. Only Wilbur-ilbur-ilbur \"Please, please, please, please, please, please . . . They made quite a racket. \"Please, please, please take us to the Fair!\" begged a gosling. Then all 6even began teasing to go. The seven goslings paraded round and round their mother. The Zuckermans went up to change into their best clothes. Lurvy went to shave and put on his plaid shirt and his purple necktie. The animals were left to them­ selves in the bam. He was pure white, pink around the ears and snout, and smooth as silk.  rubbed him al over. The geese gathered around to see the fun, and so did the sheep and lambs. Even Templeton poked his head out cautiously, to watch Wilbur get a buttermilk bath. Charlotte got so interested, she lowered herself on a dragline so she could see better. Wilbur stood still and closed his eyes. He could feel the buttennilk trick­ ling down his sides. He opened his mouth and some buttennilk ran in. It was delicious. He felt radiant and happy. When Mrs. Zuckennan got through and rubbed him dry, he was the deanest, prettiest pig you ever saw.  ",
        "chunk_order_index": 13,
        "chunk_id": "chunk-e6d5713ca7b6dd74608a2636e04ae13a",
        "description": "The image is a black-and-white illustration depicting a farm scene. On the left side, there is a man standing behind a wooden fence. He is wearing overalls and a cap, with his hands on his hips, appearing to be observing the scene. To the right, a woman is bending down, petting a pig. She is dressed in a long dress and apron, and her posture suggests she is gently handling the pig. The pig is standing in front of her, looking content and well-groomed. There is a bucket on the ground next to the pig, possibly containing food or water. The background includes a barn door and some grass, indicating an outdoor farm setting. The overall atmosphere is calm and pastoral, with a sense of routine farm life.",
        "segmentation": true
    }
}