{
    "image_1": {
        "entity_name": "Alice",
        "entity_type": "PERSON",
        "description": "Alice is the protagonist who interacts with the Queens, showing obedience and later confusion and impatience.",
        "reason": "The image depicts Alice standing between two large, round-headed figures resembling queens, which aligns with the text where Alice is interacting with the Red Queen and the White Queen. The image captures a moment of confusion and absurdity as Alice finds herself in an unexpected situation, which is consistent with the narrative in the text.",
        "matched_chunk_entity_name": "Alice"
    },
    "image_2": {
        "entity_name": "QUEEN ALICE",
        "entity_type": "GEO",
        "description": "QUEEN ALICE is an arched doorway that Alice encounters, symbolizing a transition or a new role for her.",
        "reason": "The image depicts Alice standing in front of a door with the inscription 'Queen Alice,' which aligns with the text describing the same scene. The door represents a significant geographical entity in the story, marking a transition for Alice.",
        "matched_chunk_entity_name": "QUEEN ALICE"
    },
    "image_3": {
        "entity_name": "Leg of Mutton",
        "entity_type": "OBJECT",
        "description": "The Leg of Mutton is introduced to Alice by the Red Queen and behaves in a manner akin to a person, bowing and speaking.",
        "reason": "The image depicts an anthropomorphized leg of mutton standing on a plate, which aligns with the description of the Leg of Mutton in the text. The whimsical and surreal nature of the illustration matches the context of the story where food items come to life and interact with human characters.",
        "matched_chunk_entity_name": "Leg of Mutton"
    },
    "image_4": {
        "entity_name": "DINNER WITH QUEENS",
        "entity_type": "EVENT",
        "description": "Dinner with Queens is the event where Alice is invited to dine with the Red Queen and the White Queen, featuring unusual occurrences.",
        "reason": "The image depicts a chaotic scene involving a young girl (Alice) in a fantastical setting, surrounded by various objects and creatures. This aligns with the description of the event 'DINNER WITH QUEENS,' which involves Alice dining with the Red and White Queens in a surreal and whimsical environment.",
        "matched_chunk_entity_name": "DINNER WITH QUEENS"
    },
    "image_5": {
        "entity_name": "Red Queen",
        "entity_type": "PERSON",
        "description": "The Red Queen is a character who interacts with Alice, pushing her and causing mischief, eventually turning into a kitten.",
        "reason": "The image depicts a queen-like character in a dynamic pose, which aligns with the description of the Red Queen in the text. The Red Queen is described as being involved in chaotic and surreal events with Alice, which matches the chaotic atmosphere suggested by the image.",
        "matched_chunk_entity_name": "Red Queen"
    },
    "image_6": {
        "entity_name": "KITTEN",
        "entity_type": "PERSON",
        "description": "The Kitten is a character in the story, which Alice believes was transformed from the Red Queen in her dream.",
        "reason": "The image depicts a kitten being held upside down by a human hand, which aligns with the text where Alice shakes the Red Queen and turns her into a kitten. The distressed state of the kitten in the image matches the description of the kitten in the text.",
        "matched_chunk_entity_name": "KITTEN"
    },
    "image_7": {
        "entity_name": "Alice",
        "entity_type": "PERSON",
        "description": "Alice is the main character in the story, interacting with various elements of her dream world.",
        "reason": "The image clearly depicts Alice, a young girl with long hair, kneeling on the ground and holding a cat. This aligns with the description of Alice in the text as the central character experiencing surreal events.",
        "matched_chunk_entity_name": "ALICE"
    }
}