{
    "image_1": [
        {
            "merged_entity_name": "ALICE",
            "entity_type": "PERSON",
            "description": "A young girl dressed in a dress, wearing a crown and holding a scepter, who is the protagonist interacting with the Queens and navigating the challenges in the Looking-Glass world.",
            "source_image_entities": [
                "ALICE"
            ],
            "source_text_entities": [
                "ALICE"
            ]
        },
        {
            "merged_entity_name": "KING",
            "entity_type": "PERSON",
            "description": "An older man with a large nose, wearing a crown and a robe, sitting on the ground, who is not explicitly mentioned in the text but can be inferred as part of the royal setting.",
            "source_image_entities": [
                "KING"
            ],
            "source_text_entities": []
        },
        {
            "merged_entity_name": "QUEEN",
            "entity_type": "PERSON",
            "description": "A woman with a large nose, wearing a crown and a robe, sitting on the ground, representing the White Queen and the Red Queen who are central to the narrative in the Looking-Glass world.",
            "source_image_entities": [
                "QUEEN"
            ],
            "source_text_entities": [
                "RED QUEEN",
                "WHITE QUEEN"
            ]
        },
        {
            "merged_entity_name": "SCEPTER",
            "entity_type": "OBJECT",
            "description": "A staff held by Alice, symbolizing authority or power, which is also referenced in the text as part of Alice's royal attire.",
            "source_image_entities": [
                "SCEPTER"
            ],
            "source_text_entities": []
        },
        {
            "merged_entity_name": "CROWN",
            "entity_type": "OBJECT",
            "description": "A royal headpiece worn by Alice, King, and Queen, symbolizing royalty, which is also mentioned in the text as part of the attire of the characters.",
            "source_image_entities": [
                "CROWN"
            ],
            "source_text_entities": []
        },
        {
            "merged_entity_name": "CLOCK",
            "entity_type": "OBJECT",
            "description": "The image feature block image_1_clock-2.jpg is a picture of a clock, which is not explicitly mentioned in the text but could be related to the time-based events in the story.",
            "source_image_entities": [
                "CLOCK"
            ],
            "source_text_entities": []
        },
        {
            "merged_entity_name": "QUEEN ALICE",
            "entity_type": "GEO",
            "description": "An arched doorway that Alice encounters, symbolizing a transition or a new role for her, which is also mentioned in the text with the words 'QUEEN ALICE' in large letters.",
            "source_image_entities": [],
            "source_text_entities": [
                "QUEEN ALICE"
            ]
        },
        {
            "merged_entity_name": "VISITORS' BELL",
            "entity_type": "GEO",
            "description": "One of the bell-handles at the doorway, indicating a choice for Alice regarding her status, which is also mentioned in the text as 'Visitors' Bell'.",
            "source_image_entities": [],
            "source_text_entities": [
                "VISITORS' BELL"
            ]
        },
        {
            "merged_entity_name": "SERVANTS' BELL",
            "entity_type": "GEO",
            "description": "The other bell-handle at the doorway, further complicating Alice's decision on her status, which is also mentioned in the text as 'Servants' Bell'.",
            "source_image_entities": [],
            "source_text_entities": [
                "SERVANTS' BELL"
            ]
        },
        {
            "merged_entity_name": "FROG",
            "entity_type": "PERSON",
            "description": "A character Alice encounters who is dressed in yellow and has a conversation with her about the door, which is also mentioned in the text as a creature with a long beak.",
            "source_image_entities": [],
            "source_text_entities": [
                "FROG",
                "CREATURE WITH A LONG BEAK"
            ]
        }
    ],
    "image_2": [
        {
            "merged_entity_name": "ALICE",
            "entity_type": "PERSON",
            "description": "A young girl dressed in a dress with a crown on her head, holding a scepter and standing in front of a door. Alice is the protagonist who interacts with the Queens, showing obedience and later confusion and impatience.",
            "source_image_entities": [
                "ALICE"
            ],
            "source_text_entities": [
                "ALICE",
                "ALICE"
            ]
        },
        {
            "merged_entity_name": "DOOR",
            "entity_type": "OBJECT",
            "description": "An ornate wooden door with the inscription 'Queen Alice' above it. The Door is a significant geographical entity in the text, representing a barrier and a point of interaction for Alice.",
            "source_image_entities": [
                "DOOR"
            ],
            "source_text_entities": [
                "DOOR"
            ]
        },
        {
            "merged_entity_name": "DODO",
            "entity_type": "PERSON",
            "description": "A creature resembling a bird with human-like features, wearing a coat and hat, holding a stick and bowing to Alice. This character is not mentioned in the text, so it remains as described in the image entity.",
            "source_image_entities": [
                "DODO"
            ],
            "source_text_entities": []
        },
        {
            "merged_entity_name": "RED QUEEN",
            "entity_type": "PERSON",
            "description": "The Red Queen is a character who suggests soothing actions for the White Queen and later joins her in sleep, indicating a caring side. She is also one of the queens at the head of the table, giving orders and interacting with Alice.",
            "source_image_entities": [],
            "source_text_entities": [
                "RED QUEEN",
                "RED QUEEN"
            ]
        },
        {
            "merged_entity_name": "WHITE QUEEN",
            "entity_type": "PERSON",
            "description": "The White Queen is a character who is tired and sleeps on Alice's shoulder, showing a sense of vulnerability. She is also the other queen at the head of the table, offering to repeat a riddle about fishes to Alice.",
            "source_image_entities": [],
            "source_text_entities": [
                "WHITE QUEEN",
                "WHITE QUEEN"
            ]
        }
    ],
    "image_3": [
        {
            "merged_entity_name": "HUMPTY DUMPTY",
            "entity_type": "PERSON",
            "description": "A large, egg-shaped character with a human face and limbs, wearing a long coat and standing on a wall, as depicted in the Looking-Glass World.",
            "source_image_entities": [
                "HUMPTY DUMPTY"
            ],
            "source_text_entities": [
                "HUMPTY DUMPTY"
            ]
        },
        {
            "merged_entity_name": "WALL",
            "entity_type": "GEO",
            "description": "A curved surface in the Looking-Glass World on which Humpty Dumpty is standing, serving as a significant geographical entity in the narrative.",
            "source_image_entities": [
                "WALL"
            ],
            "source_text_entities": [
                "WALL"
            ]
        },
        {
            "merged_entity_name": "RED QUEEN",
            "entity_type": "PERSON",
            "description": "The Red Queen is a character who suggests soothing actions for the White Queen, later joins her in sleep, indicating a caring side, and is one of the queens at the head of the table, giving orders and interacting with Alice.",
            "source_image_entities": [
                "RED QUEEN"
            ],
            "source_text_entities": [
                "RED QUEEN",
                "RED QUEEN"
            ]
        },
        {
            "merged_entity_name": "WHITE QUEEN",
            "entity_type": "PERSON",
            "description": "The White Queen is a character who is tired and sleeps on Alice's shoulder, showing a sense of vulnerability, and is the other queen at the head of the table, offering to repeat a riddle about fishes to Alice.",
            "source_image_entities": [
                "WHITE QUEEN"
            ],
            "source_text_entities": [
                "WHITE QUEEN",
                "WHITE QUEEN"
            ]
        },
        {
            "merged_entity_name": "ALICE",
            "entity_type": "PERSON",
            "description": "Alice is the protagonist who interacts with the Queens, showing obedience and later confusion and impatience, and is the main character in the story, experiencing a surreal and chaotic event involving the Red and White Queens.",
            "source_image_entities": [
                "ALICE"
            ],
            "source_text_entities": [
                "ALICE",
                "ALICE",
                "ALICE"
            ]
        },
        {
            "merged_entity_name": "QUEEN ALICE",
            "entity_type": "GEO",
            "description": "QUEEN ALICE is an arched doorway that Alice encounters in the Looking-Glass World, symbolizing a transition or a new role for her, and is also a title used by the Red Queen when toasting to Alice's health, indicating a possible confusion or play on words with Alice's name.",
            "source_image_entities": [
                "QUEEN ALICE"
            ],
            "source_text_entities": [
                "QUEEN ALICE",
                "QUEEN ALICE"
            ]
        }
    ],
    "image_4": [
        {
            "merged_entity_name": "ALICE",
            "entity_type": "PERSON",
            "description": "Alice is the main character in the story, interacting with various creatures and queens in a fantastical setting, including the Red Queen and the White Queen, and experiencing surreal events such as a dinner party where objects come to life.",
            "source_image_entities": [
                "ALICE"
            ],
            "source_text_entities": [
                "\"ALICE\"",
                "\"ALICE\"",
                "\"ALICE\""
            ]
        },
        {
            "merged_entity_name": "KING",
            "entity_type": "PERSON",
            "description": "The King is a character in the fantastical setting of the Looking-Glass World, wearing a crown and a robe, and is associated with the Queen, possibly the Red King or a similar authority figure.",
            "source_image_entities": [
                "KING"
            ],
            "source_text_entities": []
        },
        {
            "merged_entity_name": "QUEEN",
            "entity_type": "PERSON",
            "description": "The Queen is a character in the fantastical setting of the Looking-Glass World, wearing a crown and a robe, and is associated with the King. She could be the Red Queen or the White Queen, both of whom interact with Alice during the dinner event.",
            "source_image_entities": [
                "QUEEN"
            ],
            "source_text_entities": [
                "\"RED QUEEN\"",
                "\"WHITE QUEEN\""
            ]
        },
        {
            "merged_entity_name": "FLAMINGO",
            "entity_type": "OBJECT",
            "description": "The Flamingo is an object used as a croquet mallet in a surreal game within the fantastical setting of the Looking-Glass World, as part of the croquet set that includes hoops and mallets.",
            "source_image_entities": [
                "FLAMINGO"
            ],
            "source_text_entities": [
                "\"CROQUET SET\""
            ]
        },
        {
            "merged_entity_name": "HEDGEHOG",
            "entity_type": "OBJECT",
            "description": "The Hedgehog is an object used as a ball in a surreal game within the fantastical setting of the Looking-Glass World, as part of the croquet set that includes hoops and mallets.",
            "source_image_entities": [
                "HEDGEHOG"
            ],
            "source_text_entities": [
                "\"CROQUET SET\""
            ]
        },
        {
            "merged_entity_name": "CROQUET SET",
            "entity_type": "OBJECT",
            "description": "The Croquet Set is a set of equipment used in a surreal game within the Looking-Glass World, including a flamingo as a mallet and a hedgehog as a ball, as described in the text and image entities.",
            "source_image_entities": [
                "CROQUET SET"
            ],
            "source_text_entities": [
                "\"FLAMINGO\"",
                "\"HEDGEHOG\""
            ]
        },
        {
            "merged_entity_name": "TABLE SETTING",
            "entity_type": "OBJECT",
            "description": "The Table Setting is an object mentioned in the image entities, which could be related to the central table where the feast takes place in the Looking-Glass World, as described in the text entities.",
            "source_image_entities": [
                "TABLE SETTING"
            ],
            "source_text_entities": [
                "\"TABLE\""
            ]
        },
        {
            "merged_entity_name": "RED QUEEN",
            "entity_type": "PERSON",
            "description": "The Red Queen is one of the queens at the head of the table in the fantastical setting of the Looking-Glass World, giving orders, interacting with Alice, and eventually turning into a kitten. She is a central figure in the dinner event and Alice's dream.",
            "source_image_entities": [],
            "source_text_entities": [
                "\"RED QUEEN\"",
                "\"RED QUEEN\"",
                "\"RED QUEEN\""
            ]
        },
        {
            "merged_entity_name": "WHITE QUEEN",
            "entity_type": "PERSON",
            "description": "The White Queen is the other queen at the head of the table in the fantastical setting of the Looking-Glass World, offering to repeat a riddle about fishes to Alice and eventually disappearing into a soup tureen. She is a central figure in the dinner event and Alice's dream.",
            "source_image_entities": [],
            "source_text_entities": [
                "\"WHITE QUEEN\"",
                "\"WHITE QUEEN\""
            ]
        }
    ],
    "image_5": [
        {
            "merged_entity_name": "KING",
            "entity_type": "PERSON",
            "description": "A cartoon character identified as the 'Red Queen' in the text, wearing a crown and a robe, appearing to be in motion with one arm extended forward and the other bent at the elbow.",
            "source_image_entities": [
                "KING",
                "CROWN",
                "ROBE",
                "ARM MOTION"
            ],
            "source_text_entities": [
                "RED QUEEN"
            ]
        }
    ],
    "image_6": [
        {
            "merged_entity_name": "ALICE",
            "entity_type": "PERSON",
            "description": "Alice is the main character in the story, interacting with various creatures and queens in a fantastical setting, and experiencing a surreal and chaotic event involving the Red and White Queens.",
            "source_image_entities": [
                "CAT"
            ],
            "source_text_entities": [
                "ALICE"
            ]
        },
        {
            "merged_entity_name": "RED QUEEN",
            "entity_type": "PERSON",
            "description": "The Red Queen is one of the queens at the head of the table, giving orders and interacting with Alice, and is also a character in Alice's dream, whom Alice suspects the kitten turned into.",
            "source_image_entities": [
                "HAND"
            ],
            "source_text_entities": [
                "RED QUEEN"
            ]
        }
    ],
    "image_7": [
        {
            "merged_entity_name": "ALICE",
            "entity_type": "PERSON",
            "description": "Alice is the main character in the story, experiencing a surreal and chaotic event involving the Red and White Queens, and is also depicted as a young girl with long hair, dressed in a dress, holding a flamingo and a hedgehog.",
            "source_image_entities": [
                "ALICE"
            ],
            "source_text_entities": [
                "\"ALICE\"",
                "\"ALICE\""
            ]
        },
        {
            "merged_entity_name": "RED QUEEN",
            "entity_type": "PERSON",
            "description": "The Red Queen is a character who interacts with Alice, pushing her and causing mischief, eventually turning into a kitten, and is also mentioned as a character in Alice's dream whom Alice suspects the kitten turned into.",
            "source_image_entities": [
                "FLAMINGO"
            ],
            "source_text_entities": [
                "\"RED QUEEN\"",
                "\"RED QUEEN\"",
                "\"RED QUEEN\""
            ]
        },
        {
            "merged_entity_name": "WHITE KITTEN",
            "entity_type": "PERSON",
            "description": "The White Kitten is another character in the story, whom Alice refers to as the 'White Queen' in her dream, and is also mentioned as a character Alice interacts with, warning her about something happening and eventually disappearing into a soup tureen.",
            "source_image_entities": [
                "HEDGEHOG"
            ],
            "source_text_entities": [
                "\"WHITE KITTEN\"",
                "\"WHITE QUEEN\""
            ]
        },
        {
            "merged_entity_name": "CAT",
            "entity_type": "ANIMAL",
            "description": "The Cat is a character in the story, sitting on the ground and observing Alice, and is also mentioned as a character Alice wonders if Dinah turned into during her dream.",
            "source_image_entities": [
                "CAT"
            ],
            "source_text_entities": [
                "\"DINAH\"",
                "\"HUMPTY DUMPTY\""
            ]
        }
    ]
}