{
  "chunk-141e1502f1a0eb87e138ec3808a98076": {
    "tokens": 1200,
    "content": "VOL. CLXXII . . . . No. 59,593 © 2022  The New York Times Company NEW YORK, MONDAY, OCTOBER 31, 2022  \n\n![](images/image_1.jpg)  \nClockwise from top: a memorial on Sunday for the victims of the crowd surge in the Itaewon district of Seoul; relatives of missing people weeping at a community center; the 11-foot-wide alleyway where most of the deaths occurred. Over 150 people suffocated.  \n\n# Deadly Crush Leaves Seoul In Mourning  \n\nThis article is by Choe Sang-Hun, John Yoon, Paul Mozur, Victoria Kim,  Lee  Su-Hyun and  Jin  Yu Young.  \n\nSEOUL — It was supposed to be a festive evening, throngs of raucous youngsters dressed as zombies, princesses and superheroes converging on one of Seoul’s most popular nightlife districts for their first  restriction-free  Halloween celebration since the pandemic began.  \n\nLate Saturday evening, they crowded into bars and nightclubs pumping out the latest K-pop hits and spilled into the tight alleys that wind through the city’s Itaewon neighborhood. They snacked on the Greek, Turkish, Italian and other  international  foods  for which  the  diverse  district  is known.  \n\nAs the night grew more frenetic and the mass of revelers swelled, many of them crammed into an alleyway barely 11 feet wide, in a bottleneck of human traffic that made it difficult to breathe and move. There were few police officers around, and from within the crowd came calls to “push, push” and a big shove, according to witnesses. Then, they began to fall, a tangle of too many bodies, compressed into too small of a space. Zen Ogren, 32, found herself stuck in a packed and sweltering club alongside the narrow alleyway, a thoroughfare connecting a strip of bars to a busy subway station and a popular spot for taking photographs. Outside the club’s door, people were yelling, “Please don’t come out, people are dying,” she said. Security guards urged ContinuedonPageA6  \n\n# Brazil Rejects Bolsonaro and Brings Back ‘Lula’  \n\n# By JACK NICAS  \n\nBRASÍLIA — Voters in Brazil on Sunday ousted President Jair Bolsonaro after just one term and elected the leftist former President Luiz Inácio Lula da Silva to replace him, election officials said, a rebuke to Mr. Bolsonaro’s farright movement and his divisive four years in office.  \n\nThe victory completes a stunning political revival for Mr. da Silva — from the presidency to prison and back — that had once seemed unthinkable.  \n\nIt also ends Mr. Bolsonaro’s turbulent time as the region’s most powerful leader. For years, he attracted global attention for policies that accelerated the destruction of the Amazon rainforest and exacerbated the pandemic, which left nearly 700,000 dead in Brazil, while also becoming a major international figure of the far right for his brash attacks on the left, the media and Brazil’s democratic institutions.  \n\nMore recently, his efforts to undermine Brazil’s election system drew particular concern at home and abroad, as well as worldwide attention to Sunday’s vote as an  \n\n# After Prison, a Stunning Revival for the Leftist  \n\nformer President  Donald JTrump.  \n\nMany of his supporters vowed to take to the streets at his command.  \n\nimportant  test  for  one  of  the world’s largest democracies. Without  evidence,  Mr.  Bolsonaro criticized the nation’s electronic voting machines as rife with  fraud  and  suggested  he might not accept a loss, much like  \n\nYet in the hours after the race was called, far-right lawmakers, conservative pundits and many of Mr. Bolsonaro’s supporters had recognized Mr. da Silva’s victory. It was the first time an incumbent president failed to win reContinued on Page A7  \n\n![](images/image_2.jpg)  \n\nLuiz Inácio Lula da Silva in São Bernardo do Campo, Brazil, on Sunday. Known simply as Lula, he faces a sputtering economy.  \n\n# Researchers Defend Meat, With Industry’s Help  \n\n# By HIROKO TABUCHI  \n\nIn 2019, three dozen leading researchers sounded a stark warning in a prominent scientific journal: To fight climate change and improve human health, the world needed to dramatically cut back on eating red meat.  \n\nThe findings were quickly attacked by Frank Mitloehner, the head of an agricultural research center at the University of California, Davis, and a prominent critic of the journal’s research. The  report’s  authors  were spreading  a  “radical  anti-meat agenda,” Dr. Mitloehner wrote on Twitter, where he led a backlash under the hashtag, #yes2meat. “Their so-called planetary diet is a quasi-vegan diet,” he said, calling the findings “anti-livestock.” According to internal University of California documents reviewed by The New York Times, Dr. Mitloehner’s academic group, the Clear Center at UC Davis, receives almost all its funding from industry donations and coordinates with a major livestock lobby group on messaging campaigns. The documents show that the center, which has become a leading institution in the field of agriculture and climate, was set up in 2019 with a \\$2.9 million gift to be Continued on Page A14  \n\n# Senate Contests Are Tight In 4 Key States, Polls Find  \n\n# Working Class in Pennsylvania  \n\nDemocrats Lead in Arizona as Other Races Teeter  \n\n# By SHANE GOLDMACHER  \n\nSCRANTON, Pa. — The fate of the Democratic Party in northeastern Pennsylvania lies in the hands of people like Steve Papp. A 30-year veteran carpenter, he describes his job",
    "chunk_order_index": 0,
    "full_doc_id": "doc-aed47ee86f4709d5b32c49b4c6adabf5"
  },
  "chunk-5c54e8a770a4e9d75dc6b5cb10c17e54": {
    "tokens": 1200,
    "content": "2019 with a \\$2.9 million gift to be Continued on Page A14  \n\n# Senate Contests Are Tight In 4 Key States, Polls Find  \n\n# Working Class in Pennsylvania  \n\nDemocrats Lead in Arizona as Other Races Teeter  \n\n# By SHANE GOLDMACHER  \n\nSCRANTON, Pa. — The fate of the Democratic Party in northeastern Pennsylvania lies in the hands of people like Steve Papp. A 30-year veteran carpenter, he describes his job almost poetically as “hanging out with your brothers, building America.” But there has been a harder labor in his life of  late:  selling  his  fellow  carpenters, iron workers and masons on a Democratic Party that he sees as the protector of a “union way of life” but that they see as being increasingly out of step with their cultural values.  \n\n“The guys aren’t hearing the message,” Mr. Papp said.  \n\nPerhaps no place in the nation offers a more symbolic and consequential test of whether Democrats can win back some of the white  working-class  vote  than Pennsylvania — and particularly the state’s northeastern corner, the birthplace of President Biden, where years of economic decline have scarred the coal-rich landscape. This region is where a pivotal Senate race could be decided, where two seats in the House of Representatives are up for grabs and where a crucial governorship hangs in the balance.  \n\nNo  single  constituency,  of course, will determine the outcome of these races in a state as big as Pennsylvania, let alone the 2022 midterms. Turning out Black voters in cities is critical for Democrats.  Gaining  ground  in  the swingy suburbs is a must for Republicans. But it is among white working-class voters in rural areas and smaller towns — places like Sugarloaf Township, where Mr. Papp lives — where the Democratic Party has, in some ways, both the furthest to fall and the most to gain.  \n\nSitting  in  the  Scranton  carpenters’ union hall, where Democratic  lawn  signs  leaned  up against the walls, Mr. Papp said that he often brought stickers to the job site for those he converted, but that he had recently been giving away fewer than he would like. He ticked through what he feels he has been up against. Talk radio. Social  media.  The  Fox  News megaphone. “Misinformation and lies,” as he put it, about the Black Lives Matter movement and the L.G.B.T.Q. community. Continued on Page A11  \n\n# By LISA LERER and RUTH IGIELNIK  \n\nControl of the Senate rests on a knife’s edge, according to new polls by The New York Times and Siena College, with Republican challengers in Nevada and Georgia neck-and-neck with Democratic incumbents, and the Democratic candidate in Pennsylvania clinging to what appears to be a tenuous advantage.  \n\nThe bright spot for Democrats in the four key states polled was in Arizona,  where  Senator  Mark Kelly is holding a small but steady lead over his Republican challenger, Blake Masters.  \n\nThe results indicate a deeply volatile and unpredictable Senate contest: More people across three of the states surveyed said they wanted Republicans to gain control of the Senate, but they preferred the individual Democratic candidates in their states — a sign that Republicans may be hampered by the shortcomings of their nominees.  \n\nMidterm elections are typically referendums  on  the  party  in power, and Democrats must defy decades of that political history to win control of the Senate, an outcome  that  has  not  completely slipped out of the party’s grasp according  to  the  findings  of  the Times/Siena surveys. Democrats control the 50-50 Senate with Vice President Kamala Harris as the tiebreaking vote. To gain the majority, Republicans need to gain just one seat.  \n\nThe polls surveyed likely voters across four key Senate races: Arizona, Georgia, Nevada and Pennsylvania. Mr. Kelly, the Democratic incumbent in Arizona, holds the biggest lead, ahead of Mr. Masters by a 51 percent to 45 percent margin. Nevada is the tightest of the races, with the Democratic incumbent, Senator Catherine Cortez Masto, and her Republican challenger, Adam Laxalt, locked in a dead-heat at 47 percent. In Georgia, Senator Raphael Warnock leads narrowly in a tight race over his  Republican  opponent,  Herschel Walker, at 49 to 46 percent. In Pennsylvania, voters were about evenly divided on which party they wanted to control the Senate. But Lt. Gov. John Fetterman, a Democrat, is up slightly against Mehmet Oz, the former Continued on Page A10  \n\nSTAR POWER A high-profile display of Republican and Democratic efforts in New York illustrates how many races are close. PAGE A10 GOING MODERATE Some Republicans are making headway by distancing themselves from the right wing of their party. PAGE A9  \n\n# Years of Efforts to Vilify Pelosi Preceded Brutal Attack in Home  \n\nThis article is by Annie Karni, Catie Edmondson and Carl Hulse.  \n\nWASHINGTON — In 2006, as Nancy Pelosi was poised to become the first female speaker of the House, Republicans made a film spoof that portrayed an evil Democratic empire led by “Darth Nancy.”  \n\nIn 2009, the Republican National Committee ran an advertisement featuring Ms. Pelosi’s face framed by the barrel of a gun — complete with the sound of a bullet firing as red bled down the screen — a takeoff on the James Bond film “Goldfinger” in which the woman second in line to the presidency was cast as Pussy Galore.  \n\nThis year, a Republican running in the primary for Senate in Arizona aired an ad showing him in a spaghetti western-style duel",
    "chunk_order_index": 1,
    "full_doc_id": "doc-aed47ee86f4709d5b32c49b4c6adabf5"
  },
  "chunk-181c92649b15f6a9f7e25a875f7daed3": {
    "tokens": 718,
    "content": "arth Nancy.”  \n\nIn 2009, the Republican National Committee ran an advertisement featuring Ms. Pelosi’s face framed by the barrel of a gun — complete with the sound of a bullet firing as red bled down the screen — a takeoff on the James Bond film “Goldfinger” in which the woman second in line to the presidency was cast as Pussy Galore.  \n\nThis year, a Republican running in the primary for Senate in Arizona aired an ad showing him in a spaghetti western-style duel with Democrats, in which he shoots at a knife-wielding, mask-wearing, bug-eyed woman labeled “Crazyface Pelosi.”  \n\nThe name echoed former President Donald J. Trump’s many derisive monikers for Ms. Pelosi, including “Crazy Nancy.”  \n\nThe attack on Ms. Pelosi’s husband,  Paul  Pelosi,  on  Friday, which left him with a fractured skull and appeared to be part of a planned attack on the speaker herself, came after a yearslong campaign by Republicans to demonize  and  dehumanize  Ms. Pelosi in increasingly ugly ways. For the better part of two decades, Republicans have targeted Ms.  Pelosi,  the  most  powerful woman in American politics, as the most sinister Democratic vilContinued on Page A12  \n\n![](images/image_3.jpg)  \n\n# INTERNATIONAL A4-8  \n\nCatching Waves in Britain On the North Devon coast, the surfing scene can hold its own among the best in Europe. PAGE A4 Grain Blockade in Black Sea Moscow dismissed accusations that it was using food as a weapon after suspending a grain shipment deal. PAGE A8  \n\n# NATIONAL A9-16  \n\nAbortions Fall $\\mathfrak{6\\%}$ in 2 Months The rise of abortions in some states where it remains legal did not make up for the decline in states that banned or restricted it, new data shows.  PAGE A13 Task of Picking a Trump Jury Lawyers for both sides were challenged by having to find people without disqualifying opinions to serve.  PAGE A15 OBITUARIES A17, B8 A Persuasive Politician Roz Wyman convinced the owner of the Dodgers to move the team to Los Angeles from Brooklyn. She was 92. PAGE B8  \n\n![](images/image_4.jpg)  \n\n# ARTS C1-6  \n\n# Arias of the Mind  \n\nA new production fuses elements of opera, artificial intelligence and neuroscience. Above, Shanta Thake.  PAGE C5 Dancing on a New Knee James Whiteside, who ruptured a tendon in December, has recently made his return to the ballet stage. PAGE C1  \n\n# BUSINESS B1-7  \n\n# Salaries Are Less Secret  \n\nLaws in New York City and a handful of states are forcing companies to disclose pay ranges in their job postings. Proponents hope to narrow disparities for women and workers of color.  PAGE B1  \n\n# The Math at Twitter  \n\nTwitter has not turned a profit for eight of the past 10 years. Can the new owner Elon Musk make the numbers work in ways that they haven’t before? And what if he can’t? PAGE B1  \n\n# OPINION A18-19  \n\n# Charles M. Blow  \n\n![](images/image_5.jpg)  \n\n# SPORTS D1-9  \n\nA Star’s Special Spectators It took years for Yordan Alvarez’s parents to reach the U.S. from Cuba to see him play for the Astros. They are soaking in every second. PAGE D1",
    "chunk_order_index": 2,
    "full_doc_id": "doc-aed47ee86f4709d5b32c49b4c6adabf5"
  }
}