{
    "image_1": {
        "entity_name": "TABLE 1",
        "entity_type": "GEO",
        "description": "Table 1 provides the timeline for the Aggression Identification Shared Task at TRAC.",
        "reason": "The image clearly shows a table labeled 'Table 1: Timeline of the Aggression Identification Shared Task at TRAC - 1', which matches the description provided in the text. The table outlines key dates and events related to the shared task, aligning with the content of the text.",
        "matched_chunk_entity_name": "TABLE 1"
    },
    "image_2": {
        "entity_name": "Table 2: The teams that participated in the Aggression Identification Shared Task at TRAC - 1",
        "entity_type": "TABLE",
        "description": "A table listing the participating teams and the languages they took part in for the Aggression Identification Shared Task at TRAC - 1.",
        "reason": "The image clearly shows a table labeled 'Table 2' which provides information about the participating teams and the languages they took part in. This matches with the description provided in the text.",
        "matched_chunk_entity_name": "no match"
    },
    "image_3": {
        "entity_name": "Performance of top 15 teams on English Dataset",
        "entity_type": "EVENT",
        "description": "The bar chart titled 'English Performance' compares the performance of top 15 teams on two different social media platforms: Twitter and Facebook. The x-axis lists the names of the teams, while the y-axis represents the performance score ranging from 0 to 0.8.",
        "reason": "The image is a bar chart that shows the performance of top 15 teams on English dataset for two social media platforms, which directly aligns with the description provided in the text.",
        "matched_chunk_entity_name": "Performance of top 15 teams on English Dataset"
    },
    "image_4": {
        "entity_name": "Hindi Performance",
        "entity_type": "GRAPH",
        "description": "A bar chart comparing the performance of various teams on Hindi datasets from Twitter and Facebook.",
        "reason": "The image is a bar chart titled 'Hindi Performance' that aligns with the description provided in the text information. It compares the performance of different teams on Hindi datasets from Twitter and Facebook, which is consistent with the content of the image.",
        "matched_chunk_entity_name": "no match"
    }
}