{
    "chunk-9cae7fc39ca0853b5e8f4c07f9d977c9": [
        {
            "entity_name": "First Workshop on Trolling, Aggression and Cyberbullying (TRAC - 1)",
            "entity_type": "Event",
            "description": "The First Workshop on Trolling, Aggression and Cyberbullying (TRAC - 1) is an event where the Shared Task on Aggression Identification was organized at COLING 2018. It includes the TRAC workshop proceedings which feature system description papers submitted by the teams for the Shared Task on Aggression Identification.",
            "source_entities": [
                "FIRST WORKSHOP ON TROLLING, AGGRESSION AND CYBERBULLYING (TRAC - 1)",
                "COLING 2018",
                "TRAC WORKSHOP PROCEEDINGS"
            ]
        },
        {
            "entity_name": "Shared Task on Aggression Identification",
            "entity_type": "Event",
            "description": "The Shared Task on Aggression Identification is an event organized as part of TRAC - 1 at COLING 2018, aimed at developing a classifier for aggression in texts. It involved training and validation with a dataset of 15,000 aggression-annotated Facebook Posts and Comments in Hindi (Roman and Devanagari script) and English, and testing on sets from Facebook and another social media platform.",
            "source_entities": [
                "SHARED TASK ON AGGRESSION IDENTIFICATION",
                "FACEBOOK"
            ]
        },
        {
            "entity_name": "Internet",
            "entity_type": "Geo",
            "description": "The Internet is mentioned as a medium that has given harmful incidents, such as bullying or hate speech, unprecedented power and influence to affect the lives of billions of people. It is also the platform where user-generated content, including aggressive behavior, is widely disseminated.",
            "source_entities": [
                "INTERNET"
            ]
        }
    ],
    "chunk-c98797b4d5898b68808aad4eb43794e0": [
        {
            "entity_name": "Aggression Identification Shared Task",
            "entity_type": "EVENT",
            "description": "The Aggression Identification Shared Task is an event where participants classify texts into categories of aggression for social media, taking place at TRAC and involving participants from various organizations. It includes a classification of texts into overt aggression, covert aggression, and nonaggression categories.",
            "source_entities": [
                "AGGRESSION IDENTIFICATION SHARED TASK",
                "TRAC"
            ]
        },
        {
            "entity_name": "Dataset",
            "entity_type": "CONCEPT",
            "description": "The dataset provided to participants for the Aggression Identification Shared Task consists of 12,000 randomly sampled Facebook comments for training and 3,000 comments for development, annotated with levels of aggression in English and Hindi. It serves as the basis for classifying texts into overt aggression, covert aggression, and nonaggression categories.",
            "source_entities": [
                "DATASET",
                "ENGLISH",
                "HINDI",
                "OVERTLY AGGRESSIVE (OAG)",
                "NONAGGRESSION",
                "COVERT AGGRESSION",
                "OVERT AGGRESSION"
            ]
        },
        {
            "entity_name": "CodaLab",
            "entity_type": "ORGANIZATION",
            "description": "CodaLab is the platform used for the evaluation of systems submitted by participants in the shared task, including the Aggression Identification Shared Task.",
            "source_entities": [
                "CODALAB",
                "AGGRESSION IDENTIFICATION SHARED TASK"
            ]
        },
        {
            "entity_name": "Google Form",
            "entity_type": "ORGANIZATION",
            "description": "Google Form is the platform used for registration of participants interested in competing in the shared task, including the Aggression Identification Shared Task.",
            "source_entities": [
                "GOOGLE FORM",
                "AGGRESSION IDENTIFICATION SHARED TASK"
            ]
        },
        {
            "entity_name": "Facebook",
            "entity_type": "ORGANIZATION",
            "description": "Facebook is the source of the dataset provided to participants for the Aggression Identification Shared Task, consisting of comments annotated with levels of aggression.",
            "source_entities": [
                "FACEBOOK",
                "DATASET",
                "AGGRESSION IDENTIFICATION SHARED TASK"
            ]
        }
    ],
    "chunk-545990bda67013ebcc871877a4d5a1b1": [
        {
            "entity_name": "TRAC - 1",
            "entity_type": "EVENT",
            "description": "TRAC - 1 is an event where the Aggression Identification Shared Task took place, involving the evaluation of systems and addressing issues like the Annotation Issue and Language Issue.",
            "source_entities": [
                "TRAC - 1"
            ]
        },
        {
            "entity_name": "Kumar et al. (2018b)",
            "entity_type": "RESEARCH_PAPER",
            "description": "Kumar et al. (2018b) is a research paper that discussed a larger dataset, a subset of which was used in the shared task for training, development, and testing.",
            "source_entities": [
                "KUMAR ET AL. (2018B)"
            ]
        },
        {
            "entity_name": "Facebook",
            "entity_type": "ORGANIZATION",
            "description": "Facebook is the organization from which a dataset of comments was sampled for training and development in the shared task, and it is also the source of the surprise Twitter test set.",
            "source_entities": [
                "FACEBOOK",
                "TWITTER"
            ]
        },
        {
            "entity_name": "Hindi",
            "entity_type": "LANGUAGE",
            "description": "Hindi is a language for which a dataset was provided for the shared task, indicating its geographical relevance, and some comments in the English dataset contained code-mixed Hindi-English data.",
            "source_entities": [
                "HINDI",
                "GERMAN"
            ]
        },
        {
            "entity_name": "English",
            "entity_type": "LANGUAGE",
            "description": "English is a language for which a dataset was provided for the shared task, indicating its geographical relevance, and some comments in the dataset contained code-mixed Hindi-English data and data from other languages like German.",
            "source_entities": [
                "ENGLISH",
                "GERMAN"
            ]
        },
        {
            "entity_name": "Dataset",
            "entity_type": "CONCEPT",
            "description": "The Dataset refers to the collection of Facebook comments and Twitter tweets used for training, development, and testing in the shared task, which includes issues like the Annotation Issue and Language Issue.",
            "source_entities": [
                "DATASET",
                "ANNOTATION ISSUE",
                "LANGUAGE ISSUE"
            ]
        },
        {
            "entity_name": "Neural Networks",
            "entity_type": "CONCEPT",
            "description": "Neural Networks include Recurrent Neural Networks (RNN) and Convolutional Neural Networks (CNN), which were used by some teams for building their systems in the shared task.",
            "source_entities": [
                "RNN",
                "CNN"
            ]
        },
        {
            "entity_name": "Support Vector Machines",
            "entity_type": "CONCEPT",
            "description": "Support Vector Machines (SVM) is a machine learning model used by some teams for building their systems in the shared task.",
            "source_entities": [
                "SVM"
            ]
        },
        {
            "entity_name": "Vector Representation Models",
            "entity_type": "CONCEPT",
            "description": "Vector Representation Models include Fasttext and Glove, which are used for generating vector representations and were utilized by some teams in the shared task.",
            "source_entities": [
                "FASTTEXT",
                "GLOVE"
            ]
        },
        {
            "entity_name": "Multi-task Learning (MTL)",
            "entity_type": "CONCEPT",
            "description": "Multi-task learning (MTL) is a deep-learning architecture used by the uOttawa system for text classification, which involves multiple convolution structures with a trainable embedding layer, known as MultiCNN.",
            "source_entities": [
                "MULTI-TASK LEARNING (MTL)",
                "MULTICNN"
            ]
        }
    ],
    "chunk-23822abaedfa36f38129b9c4a2c5df6d": null,
    "chunk-d548ab53599fd4d48cda4a33bb77ead9": [
        {
            "entity_name": "COLING 2018 (TRAC Workshop)",
            "entity_type": "EVENT",
            "description": "COLING 2018 is the event where the TRAC workshop took place and the First Shared task on Aggression Identification was organized.",
            "source_entities": [
                "COLING 2018",
                "TRAC WORKSHOP"
            ]
        },
        {
            "entity_name": "UAEMEX-UAPT-TAC2 SYSTEM",
            "entity_type": "ORGANIZATION",
            "description": "A system generated by a combination of twelve distance measures through a K Nearest Neighbors classification algorithm and a canonical genetic algorithm.",
            "source_entities": [
                "UAEMEX-UAPT-TAC2 SYSTEM"
            ]
        },
        {
            "entity_name": "UNITO",
            "entity_type": "ORGANIZATION",
            "description": "The only unsupervised system submitted in the task, based on a multilingual lexicon of aggressive words, obtained by automatic translation from an Italian lexicon of offensive words with minimal human supervision.",
            "source_entities": [
                "UNITO"
            ]
        },
        {
            "entity_name": "BHANODAIG SYSTEM",
            "entity_type": "ORGANIZATION",
            "description": "A system that uses a bidirectional LSTM for its operations.",
            "source_entities": [
                "BHANODAIG SYSTEM"
            ]
        },
        {
            "entity_name": "GROUTAR",
            "entity_type": "ORGANIZATION",
            "description": "A team that used both the dataset provided for the task and other datasets.",
            "source_entities": [
                "GROUTAR"
            ]
        },
        {
            "entity_name": "SAROYEHUN",
            "entity_type": "ORGANIZATION",
            "description": "A team that used both the dataset provided for the task and other datasets.",
            "source_entities": [
                "SAROYEHUN"
            ]
        },
        {
            "entity_name": "MICROSOFT RESEARCH INDIA",
            "entity_type": "ORGANIZATION",
            "description": "Microsoft Research India provided grants for preparing the dataset and to the annotators for their work on the annotations.",
            "source_entities": [
                "MICROSOFT RESEARCH INDIA"
            ]
        },
        {
            "entity_name": "FACEBOOK",
            "entity_type": "ORGANIZATION",
            "description": "Facebook provided one of the test sets for the final testing of the systems.",
            "source_entities": [
                "FACEBOOK"
            ]
        },
        {
            "entity_name": "TWITTER",
            "entity_type": "ORGANIZATION",
            "description": "Twitter provided a surprise test set for the final testing of the systems.",
            "source_entities": [
                "TWITTER"
            ]
        },
        {
            "entity_name": "FIRST SHARED TASK ON AGGRESSION IDENTIFICATION",
            "entity_type": "EVENT",
            "description": "The event where more than 100 teams registered and 30 teams submitted their systems for aggression identification.",
            "source_entities": [
                "FIRST SHARED TASK ON AGGRESSION IDENTIFICATION"
            ]
        },
        {
            "entity_name": "SVM",
            "entity_type": "ORGANIZATION",
            "description": "SVM refers to Support Vector Machine, a classifier that performed well if features were carefully selected.",
            "source_entities": [
                "SVM"
            ]
        },
        {
            "entity_name": "RANDOM FOREST",
            "entity_type": "ORGANIZATION",
            "description": "Random forest is a classifier that performed at par with deep neural networks if features were carefully selected.",
            "source_entities": [
                "RANDOM FOREST"
            ]
        },
        {
            "entity_name": "LOGISTIC REGRESSION",
            "entity_type": "ORGANIZATION",
            "description": "Logistic regression is a classifier that performed at par with deep neural networks if features were carefully selected.",
            "source_entities": [
                "LOGISTIC REGRESSION"
            ]
        },
        {
            "entity_name": "DEEP NEURAL NETWORKS",
            "entity_type": "ORGANIZATION",
            "description": "Deep neural networks were used by 14 systems in the task, either solely or as part of an ensemble.",
            "source_entities": [
                "DEEP NEURAL NETWORKS"
            ]
        }
    ],
    "chunk-6f6b92982f709bef955487739a170eda": [
        {
            "entity_name": "Trolling, Aggression and Cyberbullying (TRAC-I)",
            "entity_type": "EVENT",
            "description": "An event held in Santa Fe, USA, focusing on trolling, aggression, and cyberbullying, with various researchers presenting their work in the field.",
            "source_entities": [
                "\"TROLLING, AGGRESSION AND CYBERBULLYING (TRAC-I)\""
            ]
        },
        {
            "entity_name": "Santa Fe",
            "entity_type": "GEO",
            "description": "A city in the USA where the TRAC-I event took place and serves as a location for various conferences and workshops on topics like cyberbullying and hate speech detection.",
            "source_entities": [
                "\"SANTA FE\""
            ]
        }
    ]
}