{
  "chunk-56777949b4249e22d0f1a8701ed0355d": {
    "tokens": 1200,
    "content": "VOL. CLXXII . . . . No. 59,628 © 2022  The New York Times Company NEW YORK, MONDAY, DECEMBER 5, 2022  \n\n# WAR’S SANCTIONS SLOWLY UNDERCUT RUSSIAN ECONOMY  \n\n# PROGRESS THREATENED  \n\nRestrictions Have Stalled Moscow’s Attempts to Modernize  \n\n# By VALERIE HOPKINS and ANATOLY KURMANAEV  \n\nKALUGA,  Russia  —  Valery Volodin, a welder at a sprawling Volkswagen plant in western Russia, relaxed for most of the summer at his dacha, or weekend house, planting his garden and looking  after  his  children.  Mr. Volodin, 41, had little choice: The car factory closed down in March, joining more than 1,000 multinational companies that had curtailed operations in Russia because of its invasion of Ukraine. Since then, he has been sitting at home while Volkswagen looks for a buyer. He goes into the plant, in Kaluga’s industrial zone, once a month to collect $50{,}000$ rubles, about \\$800, a payment required by Russian labor law that is the equivalent of two-thirds of his previous salary.  \n\nThe morality police are overseen by the Iranian police, not the attorney general, and there were suggestions that the government might be trying to play down the significance of Mr. Montazeri’s remarks.  \n\n![](images/image_1.jpg)  \nThe Peace That Follows Fighting Snow blanketed a neighborhood in Irpin, Ukraine, a suburb of Kyiv, on Sunday. The city was badly damaged early in the war, when battles raged on the capital’s edge.  \n\nThe morality police were “abolished by the same authorities who installed it,” Attorney General Mohammad Javad Montazeri said on Saturday during a meeting at which officials were discussing the unrest, according to state media reports.  \n\nBut if the force is abolished, the change will be unlikely to appease protesters who are still clashing with other security forces and have become so emboldened that some are calling for an end of the Islamic Republic.  \n\nOne state television channel, the Arabic-language Al Alam, said that the comments had been taken out of context, and other state channels  said  the  government was not backing down from the mandatory hijab law.  \n\nA senior Iranian official said this weekend that Iran had abolished the morality police, the state media reported, after months of protests set off by the death of a young woman who was detained by the force for supposedly violating the country’s strict Islamic dress laws.  \n\nIt  was  unclear  whether  the statement amounted to a final decision by the theocratic government,  which  has  neither  announced the abolition of the morality police nor denied it.  \n\nIran’s foreign minister, Hossein Amir Abdollahian, when asked about the abolishment of the morality police at a news conference in Belgrade, Serbia, where he was on an official visit, did not deny it, but said, “In Iran, everything is moving forward well in the framework of democracy and freedom.” For his part, Mr. Montazeri also said on Saturday that the judiciary would still enforce restrictions on “social behavior.” Days earlier, he said that the authorities were reviewing the law requiring womContinued on Page A6  \n\n# Cracks in Iran? Morality Police Are Said to End.  \n\n# By VIVIAN YEE and FARNAZ FASSIHI  \n\nThe basic arguments in the case, which will be made before the Supreme Court on Monday, are as familiar as they are polarizing.  \n\nThat controversy has now arrived, and the facts are indeed similar. A graphic designer named Lorie Smith, who works just a few miles from Mr. Phillips’s bakery, Masterpiece Cakeshop, has challenged the same Colorado law on the same grounds.  \n\nLITTLETON, Colo. — Ten years ago, a Colorado baker named Jack Phillips turned away a gay couple who had asked him for a wedding cake, saying that a state law forbidding discrimination based on sexual orientation must yield to his faith.  \n\nOn one side are people who say the government should not force them to violate their principles to make a living. On the other are same-sex couples and others who say they are entitled to equal treatment from businesses open to the public.  \n\n“He’s an artist,” Ms. Smith said of Mr. Phillips. “I’m also an artist. We shouldn’t be punished for creating consistently with our convictions.”  \n\nBoth sides say that the consequences of the court’s ruling could be enormous, though for different reasons. Ms. Smith’s supporters say a ruling for the state would allow the government to force all sorts of artists to state things at odds with their beliefs. Her opponents say a ruling in her favor would blow a hole through antidiscrimination  laws  and  allow Continued on Page A11  \n\nThe dispute, a white-hot flash point in the culture wars, made it to the Supreme Court. But Justice Anthony M. Kennedy’s narrow majority opinion in 2018 did not settle the question of whether the First Amendment permits discrimination by businesses open to the public based on their owners’ religious convictions. Indeed, the opinion acknowledged that the court had merely kicked the can down the road and would have to decide “some future controversy  \n\n# Justices Face A New Clash On Gay Rights  \n\n# By ADAM LIPTAK  \n\nATLANTA —The  closely watched rematch between Senator Raphael Warnock and Herschel Walker has reached its final hours, capping an intense and turbulent campaign that has prompted debate over issues of race, class and power in a state with a pivotal role in American politics.  \n\nThis article is by Jazmine Ulloa, Maya King and Reid J. Epstein.  \n\nThis article is by Michael Rothfeld,",
    "chunk_order_index": 0,
    "full_doc_id": "doc-6a4596ce251d696c71abf7364347603e"
  },
  "chunk-781f82ecfb0e620925d42bd3650fe2c8": {
    "tokens": 1200,
    "content": "Justices Face A New Clash On Gay Rights  \n\n# By ADAM LIPTAK  \n\nATLANTA —The  closely watched rematch between Senator Raphael Warnock and Herschel Walker has reached its final hours, capping an intense and turbulent campaign that has prompted debate over issues of race, class and power in a state with a pivotal role in American politics.  \n\nThis article is by Jazmine Ulloa, Maya King and Reid J. Epstein.  \n\nThis article is by Michael Rothfeld, William K. Rashbaum and Susan C. Beachy.  \n\nOn Sunday morning at the historic Ebenezer Baptist Church in Atlanta, where Mr. Warnock is a senior pastor, he peppered his sermon with thinly veiled allusions to the  election,  reminding  people multiple times to vote and joking  \n\nVadim Shubaderov, a 35-yearold businessman, thought he had stumbled on the perfect opportunity when he met a charismatic pair of identical twins in Brooklyn. The  brothers,  Johnny  and Robert  Petrosyants,  were  successful bar operators who rou  \n\n![](images/image_2.jpg)  \nLines at some Atlanta polling sites have been so long that people have had to try again to vote.  \n\n# Walker and Warnock Lean Into the Final Stretch  \n\n# Twin Friends of Adams Are Dogged by Allegations and Debts  \n\nthat they had a choice between two candidates whose “last name starts with W.”  \n\ntinely dropped thousands of dollars at a Russian restaurant in the Flatiron  district,  were  driven around in a Mercedes-Benz and, most impressively, counted the new Brooklyn borough president, Eric Adams, as a good friend. When  the  twins  invited  Mr. Shubaderov to invest in a catering company  in  2014,  he  plunked down \\$350,000, virtually his entire life savings.  \n\nMore than 1.8 million Georgians have already cast ballots for Tuesday’s runoff, topping early vote  \n\nMr. Walker on Sunday urged his supporters to vote, on part of what his campaign has been calling an “Evict Warnock Bus Tour.” “If you don’t have a friend, go make a friend and get them out to vote,” he told supporters.  \n\n# Taking to Tailgate Party and Pulpit as Runoff Winds Down  \n\n“They wined and dined me,” said Mr. Shubaderov. “They built up an image of super successful entrepreneurs with deep political connections.” He never saw his money again.  \n\nThe outcome Tuesday will also provide an early test of the impact Continued on Page A13  \n\nrecords in a contest that will determine whether Mr. Warnock gives Democrats a 51st vote in the Senate, an addition that would offer some procedural benefits. For Republicans, a win by Mr. Walker would  reassert  the  state’s  red streak despite a blue surge two years ago.  \n\nIn 2020, energized Democratic voters propelled Mr. Warnock and Jon Ossoff into the Senate, after fierce showdowns with Republican  incumbents,  swinging  the Senate’s balance of power. And for the first time in 28 years, Georgia voted for a Democrat for president.  \n\n# Questionable Dealings Follow Convictions  \n\nfrom getting worse,’ and that’s an important shift,” Mr. Inozemtsev said. “Even the government has stopped betting on national development.”  \n\nThe  sanctions  have  stymied Russia’s  faltering  attempts  to modernize  its  economy  along Western lines and to catch up to European living standards after the fall of the Soviet Union, said Vladislav Inozemtsev, the Washington-based director of the Center for Post-Industrial Studies, a Russian research group. That has dimmed the hope that the country could become a modern, prosperous nation in the near term. “The slogan now is ‘Keep things  \n\nMore than nine months after the invasion, neither the war effort nor the economy has collapsed, and the economic pain is still limited for many Russians. Mr. Putin has avoided any substantive domestic pressure that would  threaten  his  leadership. But the impact of what some have described as the most coordinated and deepest economic sanctions in modern history is evident in communities across Russia — and the worst may be yet to come.  \n\nHis experience is playing out across Russia for hundreds of thousands of workers after the West imposed sweeping economic sanctions that were intended to hobble Moscow’s ability to wage war and to undercut public support for President Vladimir V. Putin.  \n\n“We go into work, but the plant stands empty,” Mr. Volodin said in an interview. He does not mind a temporary break from the physically demanding work, but he is not sure how to plan for the future. “We live day to day, for now,” he said.  \n\nTime and again over the past decade, the Petrosyants brothers have boasted of their friendship with Mr. Adams, New York City’s mayor, while courting partners like Mr. Shubaderov for a range of ventures.  The  relationship  has helped them gloss over something less savory: Both pleaded guilty in 2014 to financial crimes related to insurance claims. Continued on Page A14  \n\nBeneath  the  veneer  of  normalcy, he said, key drivers of growth, like technology transfer and investment, are eroding. “It’s like a cake that was dropped on the table and it looks more or less fine, but inside it’s all blown up,’’ Mr. Inozemtsev said.  \n\nThe most visible and dramatic Continued on Page A8  \n\n![](images/image_3.jpg)  \n\n# BUSINESS B1-6  \n\nThe Future of Heating The boxy heat pumps function like air conditioners. Germans hope they hold the key to fossil-free heating.  PAGE B Defamation Suit Against Fox Lach",
    "chunk_order_index": 1,
    "full_doc_id": "doc-6a4596ce251d696c71abf7364347603e"
  },
  "chunk-52c48a23cf268604827984f64fc2d728": {
    "tokens": 481,
    "content": ". “It’s like a cake that was dropped on the table and it looks more or less fine, but inside it’s all blown up,’’ Mr. Inozemtsev said.  \n\nThe most visible and dramatic Continued on Page A8  \n\n![](images/image_3.jpg)  \n\n# BUSINESS B1-6  \n\nThe Future of Heating The boxy heat pumps function like air conditioners. Germans hope they hold the key to fossil-free heating.  PAGE B Defamation Suit Against Fox Lachlan Murdoch is set to be deposed on Monday as the case brought by Dominion grows contentious.  PAGE B1  \n\n# INTERNATIONAL A4-8  \n\nAccusations of Abuse in K-Pop A dispute between members of Omega X and their agency adds to a list of claims about the exploitation of South Korea’s young musicians. PAGE A4 Skyrocketing Prices in Turkey Inflation is up some 80 percent, devastating families and leaving Turkey’s president politically vulnerable. PAGE A6 OBITUARIES D10-11 Pioneering Comics Memoirist Aline Kominsky-Crumb’s autobiographical cartoons made an impact in underground comics. She was 74.  PAGE D10  \n\n![](images/image_4.jpg)  \n\n# SPORTS D1-9  \n\nIn a Soccer Wilderness The Afghan women’s team is 7,000 miles from home and is not recognized by its country or by FIFA. PAGE D1 College Football’s Final Four Georgia, Michigan, T.C.U. and Ohio State, not Alabama, were selected for the playoff semifinals. PAGE D5  \n\n# NATIONAL A10-16  \n\nPastor Returns After Scandal Matt Chandler of the Village Church received a standing ovation following his leave over an “inappropriate” relationship, part of a period of turmoil among evangelical churches.  PAGE A1 North Carolina County in Dark About 45,000 customers were without power in Moore County after two electric substations were damaged by gunfire. The outages were called “intentional, willful and malicious.”  PAGE A16  \n\nOPINION A18-19 Pamela Paul  \n\n![](images/image_5.jpg)  \n\n# ARTS C1-6  \n\nAn Ever-Evolving Project Emma Corrin, the nonbinary star of “Lady Chatterley’s Lover, ” has been exploring gender and the cost and responsibility of being heard.  PAGE C1",
    "chunk_order_index": 2,
    "full_doc_id": "doc-6a4596ce251d696c71abf7364347603e"
  }
}