{
    "image_1": {
        "image_id": 1,
        "image_path": "./fusion_research/fusion_dataset/news/20221205/images/image_1.jpg",
        "caption": [
            "The Peace That Follows Fighting Snow blanketed a neighborhood in Irpin, Ukraine, a suburb of Kyiv, on Sunday. The city was badly damaged early in the war, when battles raged on the capital’s edge. "
        ],
        "footnote": [],
        "context": "One state television channel, the Arabic-language Al Alam, said that the comments had been taken out of context, and other state channels said the government was not But if the force is abolished, the change will be unlikely to appease protesters who are still clashing with other security forces and have become so emboldened that some are calling for an end of the Islamic Republic. The morality police were “abolished by the same authorities who installed it,” Attorney General Mohammad Javad Montazeri said on Saturday during a meeting at which officials were discussing the unrest, according to state media reports. March, joining more than 1,000 multinational companies that had curtailed operations in Russia because of its invasion of Ukraine. Since then, he has been sitting at home while Volkswagen looks for a buyer. He goes into the plant, in Kaluga’s industrial zone, once a month to collect $50{,}000$ rubles, about \\$800, a payment required by Russian labor law that is the equivalent of two-thirds of his previous salary. The morality police are overseen by the Iranian police, not the attorney general, and there were suggestions that the government might be trying to play down the significance of Mr. Montazeri’s remarks. ",
        "chunk_order_index": 0,
        "chunk_id": "chunk-56777949b4249e22d0f1a8701ed0355d",
        "description": "The image depicts a winter scene in Irpin, Ukraine, a suburb of Kyiv. The area is covered in snow, and the landscape shows significant signs of destruction. On the left side of the image, there are numerous buildings that appear to be residential houses, many of which are severely damaged or destroyed. The roofs and walls of these houses are missing, and some structures are reduced to rubble. In the middle ground, there is a road that runs diagonally across the image, with a few vehicles visible on it. To the right, there is a larger building complex that also shows signs of damage, with exposed interiors and broken windows. A yellow bus is seen on the road near this building. In the background, there is a dense forest of tall trees, also covered in snow. The overall atmosphere is one of desolation and aftermath, with the snow adding a stark contrast to the ruined buildings.",
        "segmentation": true
    },
    "image_2": {
        "image_id": 2,
        "image_path": "./fusion_research/fusion_dataset/news/20221205/images/image_2.jpg",
        "caption": [
            "Lines at some Atlanta polling sites have been so long that people have had to try again to vote. "
        ],
        "footnote": [],
        "context": "More than 1.8 million Georgians have already cast ballots for Tuesday’s tinely dropped thousands of dollars at a Russian restaurant in the Flatiron district, were driven around in a Mercedes-Benz and, most impressively, counted the new Brooklyn borough president, Eric Adams, as a good friend. When the twins invited Mr. Shubaderov to invest in a catering company in 2014, he plunked down \\$350,000, virtually his entire life savings. that they had a choice between two candidates whose “last name starts with W.” Twin Friends of Adams Are Dogged by Allegations and Debts Walker and Warnock Lean Into the Final Stretch American politics. This article is by Jazmine Ulloa, Maya King and Reid J. Epstein. This article is by Michael Rothfeld, William K. Rashbaum and Susan C. Beachy. On Sunday morning at the historic Ebenezer Baptist Church in Atlanta, where Mr. Warnock is a senior pastor, he peppered his sermon with thinly veiled allusions to the election, reminding people multiple times to vote and joking Vadim Shubaderov, a 35-yearold businessman, thought he had stumbled on the perfect opportunity when he met a charismatic pair of identical twins in Brooklyn. The brothers, Johnny and Robert Petrosyants, were successful bar operators who rou ",
        "chunk_order_index": 1,
        "chunk_id": "chunk-781f82ecfb0e620925d42bd3650fe2c8",
        "description": "The image depicts a scene of people standing in line outside a polling site. The line extends along a sidewalk, with individuals dressed in various winter clothing, suggesting cold weather. The people appear to be waiting patiently, some looking at their phones or engaged in conversation. A 'VOTE HERE' sign is prominently placed on the ground near the front of the line, indicating the direction to the polling station. The background shows residential houses and parked cars, with leafless trees indicating it might be late fall or winter. The overall atmosphere conveys a sense of civic duty and patience as people wait to cast their votes.",
        "segmentation": true
    },
    "image_3": {
        "image_id": 3,
        "image_path": "./fusion_research/fusion_dataset/news/20221205/images/image_3.jpg",
        "caption": [],
        "footnote": [],
        "context": "Accusations of Abuse in K-Pop A dispute between members of Omega X and their agency adds to a list of claims about the exploitation of South Korea’s young musicians. PAGE A4 Skyrocketing Prices in Turkey Inflation is up some 80 percent, devastating families and leaving Turkey’s president politically vulnerable. PAGE INTERNATIONAL A4-8  The Future of Heating The boxy heat pumps function like air conditioners. Germans hope they hold the key to fossil-free heating. PAGE B Defamation Suit Against Fox Lachlan Murdoch is set to be deposed on Monday as the case brought by Dominion grows contentious. PAGE B1 BUSINESS B1-6 of their friendship with Mr. Adams, New York City’s mayor, while courting partners like Mr. Shubaderov for a range of ventures. The relationship has helped them gloss over something less savory: Both pleaded guilty in 2014 to financial crimes related to insurance claims. Continued on Page A14 Beneath the veneer of normalcy, he said, key drivers of growth, like technology transfer and investment, are eroding. “It’s like a cake that was dropped on the table and it looks more or less fine, but inside it’s all blown up,’’ Mr. Inozemtsev said. The most visible and dramatic Continued on Page A8 ",
        "chunk_order_index": 2,
        "chunk_id": "chunk-52c48a23cf268604827984f64fc2d728",
        "description": "The image depicts a white refrigerator standing upright on a wooden pallet in what appears to be an anechoic chamber. The walls of the chamber are covered with pyramidal acoustic foam panels, which are designed to absorb sound and reduce echo. The foam panels are arranged in a grid pattern and have a distinct triangular shape with pointed tops. The floor is smooth and reflective, suggesting it is made of a polished material. The refrigerator itself is a standard design with a freezer compartment at the top and a larger refrigeration section below. There are no visible people or other objects in the image. The overall atmosphere is sterile and technical, indicative of a controlled environment used for testing or research purposes.",
        "segmentation": true
    },
    "image_4": {
        "image_id": 4,
        "image_path": "./fusion_research/fusion_dataset/news/20221205/images/image_4.jpg",
        "caption": [],
        "footnote": [],
        "context": "Pastor Returns After Scandal Matt Chandler of the Village Church received a standing ovation following his leave over an “inappropriate” relationship, part of a period of turmoil among evangelical churches. PAGE A1 North Carolina County in Dark About 45,000 customers were without power in Moore County after two electric substations were NATIONAL A10-16  In a Soccer Wilderness The Afghan women’s team is 7,000 miles from home and is not recognized by its country or by FIFA. PAGE D1 College Football’s Final Four Georgia, Michigan, T.C.U. and Ohio State, not Alabama, were selected for the playoff semifinals. PAGE D5 SPORTS D1-9 fossil-free heating. PAGE B Defamation Suit Against Fox Lachlan Murdoch is set to be deposed on Monday as the case brought by Dominion grows contentious. PAGE B1  INTERNATIONAL A4-8 Accusations of Abuse in K-Pop A dispute between members of Omega X and their agency adds to a list of claims about the exploitation of South Korea’s young musicians. PAGE A4 Skyrocketing Prices in Turkey Inflation is up some 80 percent, devastating families and leaving Turkey’s president politically vulnerable. PAGE A6 OBITUARIES D10-11 Pioneering Comics Memoirist Aline Kominsky-Crumb’s autobiographical cartoons made an impact in underground comics. She was 74. PAGE D10   ",
        "chunk_order_index": 2,
        "chunk_id": "chunk-52c48a23cf268604827984f64fc2d728",
        "description": "The image captures a moment of unity and celebration among a group of female soccer players. They are dressed in white jerseys with black accents, indicating they are part of a team. The players are huddled together, their hands stacked in the center of the group, a common gesture of teamwork and motivation before or after a game. Their expressions convey a mix of joy, determination, and camaraderie. Some of the players are smiling broadly, while others have more serious, focused looks on their faces. In the background, there are other individuals who appear to be coaches or teammates, clapping and cheering for the group. The setting seems to be an outdoor sports field, as suggested by the natural lighting and the casual attire of the people in the background. The overall atmosphere is one of positive energy and shared purpose, typical of a sports team preparing for or celebrating a match.",
        "segmentation": true
    },
    "image_5": {
        "image_id": 5,
        "image_path": "./fusion_research/fusion_dataset/news/20221205/images/image_5.jpg",
        "caption": [],
        "footnote": [],
        "context": "An Ever-Evolving Project Emma Corrin, the nonbinary star of “Lady Chatterley’s Lover, ” has been exploring gender and the cost and responsibility of being heard. PAGE C1 ARTS C1-6 not recognized by its country or by FIFA. PAGE D1 College Football’s Final Four Georgia, Michigan, T.C.U. and Ohio State, not Alabama, were selected for the playoff semifinals. PAGE D5  NATIONAL A10-16 Pastor Returns After Scandal Matt Chandler of the Village Church received a standing ovation following his leave over an “inappropriate” relationship, part of a period of turmoil among evangelical churches. PAGE A1 North Carolina County in Dark About 45,000 customers were without power in Moore County after two electric substations were damaged by gunfire. The outages were called “intentional, willful and malicious.” PAGE A16  OPINION A18-19 Pamela Paul ",
        "chunk_order_index": 2,
        "chunk_id": "chunk-52c48a23cf268604827984f64fc2d728",
        "description": "The image features a person with short, platinum blonde hair styled in a pixie cut. They are wearing a sleeveless navy blue dress that has a structured, almost military-like appearance with visible buttons and a high collar. The individual is seated on what appears to be a metal bench or railing, with one leg extended outward and the other bent at the knee. They are wearing black lace-up shoes and white socks. The background includes a building with large windows and some architectural details, suggesting an urban setting. The overall mood of the image conveys a sense of casual confidence and modern style.",
        "segmentation": true
    }
}