{
    "image_1": [
        {
            "entity_name": "LINGUNET",
            "entity_type": "ORGANIZATION",
            "description": "LINGUNET is a language-conditioned image generation network used in the research to map raw visual observations to goals, specifically a variant of the U-NET image-to-image architecture.",
            "source_image_entities": [],
            "source_text_entities": [
                "LINGUNET",
                "U-NET"
            ]
        },
        {
            "entity_name": "CHAI",
            "entity_type": "EVENT",
            "description": "CHAI is a benchmark for instruction following, where an agent executes household instructions in the CHALET environment, requiring a combination of navigation and simple manipulation tasks.",
            "source_image_entities": [],
            "source_text_entities": [
                "CHAI",
                "CHALET ENVIRONMENT"
            ]
        },
        {
            "entity_name": "LANI",
            "entity_type": "EVENT",
            "description": "LANI is a benchmark for instruction following, specifically a navigation task used to evaluate the model's performance, where actions include moving the agent and changing its orientation.",
            "source_image_entities": [],
            "source_text_entities": [
                "LANI",
                "HCRC MAP TASK"
            ]
        }
    ],
    "image_2": [
        {
            "merged_entity_name": "INSTRUCTION REPRESENTATION X",
            "entity_type": "EVENT",
            "description": "The representation of the instruction 'Turn left and go to the red oil drum' processed by the system, which is a sequence of natural language commands used to guide the LINGUNET architecture in generating the goal prediction.",
            "source_image_entities": [
                "INSTRUCTION REPRESENTATION X"
            ],
            "source_text_entities": [
                "INSTRUCTION"
            ]
        },
        {
            "merged_entity_name": "PANORAMA IMAGE I_P",
            "entity_type": "GEO",
            "description": "A panoramic image used as input for the system, showing a scene with various objects and landmarks, which serves as the initial input to the LINGUNET architecture, from which a feature map is generated.",
            "source_image_entities": [
                "PANORAMA IMAGE I_P"
            ],
            "source_text_entities": [
                "PANORAMA OBSERVATION"
            ]
        },
        {
            "merged_entity_name": "TEXT KERNELS",
            "entity_type": "OBJECT",
            "description": "Components of the system that process text information from the instruction, which are 1x1 kernels generated from the instruction representation, used in the convolution process to create text-conditioned feature maps.",
            "source_image_entities": [
                "TEXT KERNELS"
            ],
            "source_text_entities": [
                "TEXT KERNEL"
            ]
        },
        {
            "merged_entity_name": "SOFTMAX",
            "entity_type": "OBJECT",
            "description": "A function used in the system to convert scores into probabilities, which is applied to the feature map to generate the probability distribution over the goal location, including a learned scalar bias term for events where the goal is out of sight.",
            "source_image_entities": [
                "SOFTMAX"
            ],
            "source_text_entities": [
                "SOFTMAX",
                "LEARNED SCALAR BIAS TERM"
            ]
        },
        {
            "merged_entity_name": "GOAL DISTRIBUTION P_G",
            "entity_type": "OBJECT",
            "description": "A distribution representing possible goal locations based on the processed instruction and image, which is generated over a feature map by LINGUNET, representing the likelihood of different areas being the goal location.",
            "source_image_entities": [
                "GOAL DISTRIBUTION P_G"
            ],
            "source_text_entities": [
                "PROBABILITY DISTRIBUTION"
            ]
        },
        {
            "merged_entity_name": "GOAL LOCATION L_G",
            "entity_type": "GEO",
            "description": "The specific location within the image identified as the goal based on the instruction, which is the predicted destination in the environment, inferred from the max probability in the probability distribution generated by LINGUNET.",
            "source_image_entities": [
                "GOAL LOCATION L_G"
            ],
            "source_text_entities": [
                "GOAL LOCATION"
            ]
        },
        {
            "merged_entity_name": "POSES P1, P2, P3",
            "entity_type": "OBJECT",
            "description": "Different poses or viewpoints considered by the system to reach the goal, which are part of the agent's context and include the agent's pose and an RGB image of the environment from its point of view.",
            "source_image_entities": [
                "POSES P1, P2, P3"
            ],
            "source_text_entities": [
                "AGENT CONTEXT $\\TILDE{S}$"
            ]
        },
        {
            "merged_entity_name": "GOAL MASKS M1, M2, M3",
            "entity_type": "OBJECT",
            "description": "Masks highlighting areas of the image that are relevant to the goal, which are computed based on the predicted goal location and used as input to an RNN for action generation.",
            "source_image_entities": [
                "GOAL MASKS M1, M2, M3"
            ],
            "source_text_entities": [
                "GOAL MASK"
            ]
        },
        {
            "merged_entity_name": "ACTIONS TURNLEFT, FORWARD",
            "entity_type": "EVENT",
            "description": "Commands generated by the system to navigate towards the goal, which are the output of the LINGUNET architecture based on the goal mask, guiding the agent's movement and orientation in the environment.",
            "source_image_entities": [
                "ACTIONS TURNLEFT, FORWARD"
            ],
            "source_text_entities": [
                "AGENT"
            ]
        }
    ],
    "image_3": [
        {
            "merged_entity_name": "LANI",
            "entity_type": "ORGANIZATION",
            "description": "LANI is a dataset designed to evaluate an agent's ability to follow navigation instructions in an environment with landmarks. It consists of 6,000 paragraphs, with 4.7 mean instructions per paragraph, 24.6 mean actions per instruction, 12.1 mean tokens per instruction, and a vocabulary size of 2,292. The agent's task is to follow a sequence of instructions specifying a path in an environment with multiple landmarks. The environment is a fenced, square, grass field with randomly placed landmarks, and the agent can take four types of discrete actions: FORWARD, TURNRIGHT, TURNLEFT, and STOP. Agent performance is evaluated using task completion accuracy and stop distance error.",
            "source_image_entities": [
                "LANI"
            ],
            "source_text_entities": [
                "LANI"
            ]
        },
        {
            "merged_entity_name": "CHAI",
            "entity_type": "ORGANIZATION",
            "description": "CHAI is a dataset that combines both navigation and simple manipulation in a complex, simulated household environment. It consists of 1,596 paragraphs, with 7.7 mean instructions per paragraph, 54.5 mean actions per instruction, 8.4 mean tokens per instruction, and a vocabulary size of 1,018. The CHAI corpus uses the CHALET simulator, a 3D house simulator that provides multiple houses, each with multiple rooms, supporting moving between rooms, picking and placing objects, and opening and closing cabinets and similar containers. Objects can be moved between rooms, and the environment supports a variety of actions for navigation and manipulation tasks.",
            "source_image_entities": [
                "CHAI"
            ],
            "source_text_entities": [
                "CHAI"
            ]
        }
    ],
    "image_4": [
        {
            "merged_entity_name": "ENCLOSURE",
            "entity_type": "GEO",
            "description": "A fenced, square, grass field which is the environment where the agent performs actions and navigates according to instructions. It is enclosed by a blue and red fence with grassy ground inside.",
            "source_image_entities": [
                "ENCLOSURE"
            ],
            "source_text_entities": [
                "AGENT",
                "GOAL POSITION",
                "FIRST PERSON VIEW"
            ]
        },
        {
            "merged_entity_name": "RED BOOTH",
            "entity_type": "OBJECT",
            "description": "A red booth located near the entrance of the enclosure, which serves as one of the landmarks within the environment.",
            "source_image_entities": [
                "RED BOOTH"
            ],
            "source_text_entities": [
                "LANI"
            ]
        },
        {
            "merged_entity_name": "PATHWAY",
            "entity_type": "GEO",
            "description": "A pathway marked by colored dots (yellow, purple, blue) winding through the enclosure, which the agent follows as part of the navigation task.",
            "source_image_entities": [
                "PATHWAY"
            ],
            "source_text_entities": [
                "FOLLOWER PATH"
            ]
        },
        {
            "merged_entity_name": "PERSON IN RED SUIT",
            "entity_type": "PERSON",
            "description": "A person dressed in a red suit standing on the pathway, which could be one of the workers providing instructions or demonstrations within the environment.",
            "source_image_entities": [
                "PERSON IN RED SUIT"
            ],
            "source_text_entities": [
                "DEMONSTRATIONS",
                "AGENT"
            ]
        },
        {
            "merged_entity_name": "PERSON IN BROWN HAT",
            "entity_type": "PERSON",
            "description": "A person wearing a brown hat standing near the pathway, possibly another worker involved in providing instructions or demonstrations.",
            "source_image_entities": [
                "PERSON IN BROWN HAT"
            ],
            "source_text_entities": [
                "DEMONSTRATIONS",
                "AGENT"
            ]
        },
        {
            "merged_entity_name": "TREE",
            "entity_type": "GEO",
            "description": "A tree located at the edge of the enclosure, which is one of the landmarks that can be used for navigation within the environment.",
            "source_image_entities": [
                "TREE"
            ],
            "source_text_entities": [
                "LANI"
            ]
        }
    ],
    "image_5": [
        {
            "merged_entity_name": "LANI",
            "entity_type": "EVENT",
            "description": "LANI is an event or task designed to evaluate an agent's ability to follow navigation instructions in an environment with landmarks. It involves the agent navigating through a square, grass field with randomly placed landmarks and performing actions such as FORWARD, TURNRIGHT, TURNLEFT, and STOP.",
            "source_image_entities": [
                "PILLAR",
                "BOAT",
                "TREE",
                "CONE",
                "HYDRANT",
                "TREE STUMP",
                "PATH"
            ],
            "source_text_entities": [
                "LANI"
            ]
        },
        {
            "merged_entity_name": "CHAI",
            "entity_type": "ORGANIZATION",
            "description": "CHAI is an organization that combines navigation and manipulation tasks in a simulated household environment, using the CHALET simulator. It provides a complex, simulated household environment with multiple houses, each with multiple rooms, supporting moving between rooms, picking and placing objects, and opening and closing cabinets and similar containers.",
            "source_image_entities": [],
            "source_text_entities": [
                "CHAI",
                "CHAI",
                "CHALET SIMULATOR"
            ]
        }
    ],
    "image_6": [
        {
            "merged_entity_name": "LANI",
            "entity_type": "ORGANIZATION",
            "description": "LANI is an event or task designed to evaluate an agent's ability to follow navigation instructions in an environment with landmarks. It contains a dataset with 123 spatial relations between locations, 36 conjunctions of two or more locations, 65 temporal coordinations of sub-goals, 94 constraints on the shape of trajectory, 32 co-references, and 2 comparatives.",
            "source_image_entities": [
                "LANI"
            ],
            "source_text_entities": [
                "\"LANI\""
            ]
        },
        {
            "merged_entity_name": "CHAI",
            "entity_type": "ORGANIZATION",
            "description": "CHAI is an organization that combines navigation and manipulation tasks in a simulated household environment, using the CHALET simulator. It contains a dataset with 52 spatial relations between locations, 5 conjunctions of two or more locations, 68 temporal coordinations of sub-goals, 0 constraints on the shape of trajectory, 18 co-references, and 0 comparatives.",
            "source_image_entities": [
                "CHAI"
            ],
            "source_text_entities": [
                "\"CHAI\"",
                "\"CHAI\""
            ]
        },
        {
            "merged_entity_name": "CHALET SIMULATOR",
            "entity_type": "TECHNOLOGY",
            "description": "The CHALET simulator is a 3D house simulator used by the CHAI organization to create a complex, simulated household environment. It provides multiple houses, each with multiple rooms, and supports moving between rooms, picking and placing objects, and opening and closing cabinets and similar containers.",
            "source_image_entities": [],
            "source_text_entities": [
                "\"CHALET SIMULATOR\"",
                "\"CHALET SIMULATOR\""
            ]
        }
    ],
    "image_7": "[\n    {\n        \"entity_name\": \"CHAI Organization\",\n        \"entity_type\": \"ORGANIZATION\",\n        \"description\": \"CHAI is an organization that combines navigation and manipulation tasks in a simulated household environment, using the CHALET simulator. It has developed a corpus combining navigation and simple manipulation in a simulated household environment and is involved in evaluating the performance of approaches in stop distance and manipulation accuracy.\",\n        \"source_image_entities\": [],\n        \"source_text_entities\": [\"CHAI\", \"CHAI\", \"CHAI\"]\n    },\n    {\n        \"entity_name\": \"CHALET Simulator\",\n        \"entity_type\": \"TECHNOLOGY\",\n        \"description\": \"The CHALET simulator is a 3D house simulator used by the CHAI organization to create a complex, simulated household environment. It provides multiple houses with rooms for navigation and object manipulation tasks.\",\n        \"source_image_entities\": [],\n        \"source_text_entities\": [\"CHALET SIMULATOR\", \"CHALET SIMULATOR\"]\n    },\n    {\n        \"entity_name\": \"Amazon Mechanical Turk\",\n        \"entity_type\": \"ORGANIZATION\",\n        \"description\": \"Amazon Mechanical Turk is a crowdsourcing platform used to collect a corpus of navigation instructions for the LANI task and by CHAI to collect a corpus of navigation and manipulation instructions.\",\n        \"source_image_entities\": [],\n        \"source_text_entities\": [\"AMAZON MECHANICAL TURK\", \"AMAZON MECHANICAL TURK\"]\n    },\n    {\n        \"entity_name\": \"LANI Task\",\n        \"entity_type\": \"EVENT\",\n        \"description\": \"LANI is an event or task designed to evaluate an agent's ability to follow navigation instructions in an environment with landmarks. It is also an organization involved in evaluating the performance of approaches in task completion and stop distance accuracy.\",\n        \"source_image_entities\": [],\n        \"source_text_entities\": [\"LANI\", \"LANI\", \"LANI\"]\n    },\n    {\n        \"entity_name\": \"Agent\",\n        \"entity_type\": \"CONCEPT\",\n        \"description\": \"The agent in the text refers to a computational entity that is being trained to follow navigation instructions and perform tasks in a simulated environment.\",\n        \"source_image_entities\": [],\n        \"source_text_entities\": [\"AGENT\"]\n    },\n    {\n        \"entity_name\": \"Goal Position\",\n        \"entity_type\": \"GEO\",\n        \"description\": \"The goal position is a specific location in the environment that the agent is trying to reach, as part of the navigation task.\",\n        \"source_image_entities\": [],\n        \"source_text_entities\": [\"GOAL POSITION\"]\n    },\n    {\n        \"entity_name\": \"RGB Image\",\n        \"entity_type\": \"TECHNOLOGY\",\n        \"description\": \"An RGB image is the type of visual data the agent receives as input when observing the environment, representing color images.\",\n        \"source_image_entities\": [],\n        \"source_text_entities\": [\"RGB IMAGE\"]\n    },\n    {\n        \"entity_name\": \"Scalar Reward\",\n        \"entity_type\": \"CONCEPT\",\n        \"description\": \"A scalar reward is a single numerical value provided to the agent as feedback for its actions in the environment.\",\n        \"source_image_entities\": [],\n        \"source_text_entities\": [\"SCALAR REWARD\"]\n    },\n    {\n        \"entity_name\": \"Socket API\",\n        \"entity_type\": \"TECHNOLOGY\",\n        \"description\": \"The socket API is the interface used by the simulator to control the agent and the environment in the LANI task.\",\n        \"source_image_entities\": [],\n        \"source_text_entities\": [\"SOCKET API\"]\n    },\n    {\n        \"entity_name\": \"Task Completion Accuracy\",\n        \"entity_type\": \"CONCEPT\",\n        \"description\": \"Task completion accuracy is a metric used to evaluate how accurately the agent completes the navigation task and is used for measuring whether the agent has successfully completed a task in the CHAI corpus.\",\n        \"source_image_entities\": [],\n        \"source_text_entities\": [\"TASK COMPLETION ACCURACY\", \"TASK COMPLETION (TC)\"]\n    },\n    {\n        \"entity_name\": \"Stop Distance Error\",\n        \"entity_type\": \"CONCEPT\",\n        \"description\": \"Stop distance error is a metric used to evaluate the agent's performance, specifically how close the agent stops to the goal, and measures the distance of the agent’s final state to the final annotated position in the CHAI corpus.\",\n        \"source_image_entities\": [],\n        \"source_text_entities\": [\"STOP DISTANCE ERROR\", \"STOP DISTANCE (SD)\"]\n    },\n    {\n        \"entity_name\": \"Aerial Distance\",\n        \"",
    "image_8": "[\n    {\n        \"entity_name\": \"LANI\",\n        \"entity_type\": \"GEO\",\n        \"description\": \"LANI is an event or task designed to evaluate an agent's ability to follow navigation instructions in an environment with landmarks. It is also an organization involved in evaluating the performance of approaches in task completion and stop distance accuracy.\",\n        \"source_image_entities\": [\"LANI\"],\n        \"source_text_entities\": [\"\\\"LANI\\\"\", \"\\\"LANI\\\"\"]\n    },\n    {\n        \"entity_name\": \"CHAI\",\n        \"entity_type\": \"GEO\",\n        \"description\": \"CHAI is an organization that combines navigation and manipulation tasks in a simulated household environment, using the CHALET simulator. It also represents a different environment or task in the table and is involved in evaluating the performance of approaches in stop distance and manipulation accuracy.\",\n        \"source_image_entities\": [\"CHAI\"],\n        \"source_text_entities\": [\"\\\"CHAI\\\"\", \"\\\"CHAI\\\"\", \"\\\"CHAI\\\"\"]\n    },\n    {\n        \"entity_name\": \"STOP\",\n        \"entity_type\": \"METHOD\",\n        \"description\": \"STOP is a method listed in the table with performance metrics on both LANI and CHAI datasets. It is also a baseline event used for comparison in performance metrics such as stop distance.\",\n        \"source_image_entities\": [\"STOP\"],\n        \"source_text_entities\": [\"\\\"STOP\\\"\"]\n    },\n    {\n        \"entity_name\": \"RANDOMWALK\",\n        \"entity_type\": \"METHOD\",\n        \"description\": \"RANDOMWALK is a method listed in the table with performance metrics on both LANI and CHAI datasets. It is also a baseline event used for comparison in performance metrics.\",\n        \"source_image_entities\": [\"RANDOMWALK\"],\n        \"source_text_entities\": [\"\\\"RANDOMWALK\\\"\"]\n    },\n    {\n        \"entity_name\": \"MOSTFREQUENT\",\n        \"entity_type\": \"METHOD\",\n        \"description\": \"MOSTFREQUENT is a method listed in the table with performance metrics on both LANI and CHAI datasets. It is also a baseline event used for comparison in performance metrics.\",\n        \"source_image_entities\": [\"MOSTFREQUENT\"],\n        \"source_text_entities\": [\"\\\"MOSTFREQUENT\\\"\"]\n    },\n    {\n        \"entity_name\": \"MISRA17\",\n        \"entity_type\": \"METHOD\",\n        \"description\": \"MISRA17 is a method from 2017 listed in the table with performance metrics on both LANI and CHAI datasets. It is also an approach that is compared with others in terms of task completion accuracy on LANI.\",\n        \"source_image_entities\": [\"MISRA17\"],\n        \"source_text_entities\": [\"\\\"MISRA17\\\"\"]\n    },\n    {\n        \"entity_name\": \"CHAPLOT18\",\n        \"entity_type\": \"METHOD\",\n        \"description\": \"CHAPLOT18 is a method from 2018 listed in the table with performance metrics on both LANI and CHAI datasets. It is also an approach that is compared with others in terms of task completion accuracy on LANI.\",\n        \"source_image_entities\": [\"CHAPLOT18\"],\n        \"source_text_entities\": [\"\\\"CHAPLOT18\\\"\"]\n    }\n]",
    "image_9": [
        {
            "merged_entity_name": "LANI",
            "entity_type": "GEO",
            "description": "LANI is a dataset used for evaluating performance, with metrics SD (Success Distance) and TC (Task Completion). LANI is also an organization involved in evaluating the performance of approaches in task completion and stop distance accuracy.",
            "source_image_entities": [
                "LANI"
            ],
            "source_text_entities": [
                "LANI"
            ]
        },
        {
            "merged_entity_name": "CHAI",
            "entity_type": "GEO",
            "description": "CHAI is a dataset used for evaluating performance, with metrics SD (Success Distance) and MA (Metric Accuracy). CHAI is an organization that has developed a corpus combining navigation and simple manipulation in a simulated household environment, and is involved in evaluating the performance of approaches in stop distance and manipulation accuracy.",
            "source_image_entities": [
                "CHAI"
            ],
            "source_text_entities": [
                "CHAI"
            ]
        },
        {
            "merged_entity_name": "TABLE 4",
            "entity_type": "EVENT",
            "description": "Table 4 showcases development and test results, demonstrating similar trends in both sets of experiments. It highlights the low performance of STOP, RANDOMWALK, and MOSTFREQUENT, showing the challenges of both tasks and their robustness to simple biases. The table also presents the performance of different approaches on LANI and CHAI datasets, including task completion (TC) accuracy and stop distance (SD).",
            "source_image_entities": [
                "TABLE 4"
            ],
            "source_text_entities": [
                "Tables 3 and 4"
            ]
        }
    ],
    "image_10": [
        {
            "merged_entity_name": "SPATIAL RELATIONS",
            "entity_type": "UNKNOWN",
            "description": "The category 'Spatial relations' is a row in the table, showing values for 'Present' and 'Absent', and a p-value, which is part of the analysis categories used in the CHAI corpus.",
            "source_image_entities": [
                "SPATIAL RELATIONS"
            ],
            "source_text_entities": [
                "LANI"
            ]
        },
        {
            "merged_entity_name": "LOCATION CONJUNCTION",
            "entity_type": "UNKNOWN",
            "description": "The category 'Location conjunction' is a row in the table, showing values for 'Present' and 'Absent', and a p-value, which is part of the analysis categories used in the CHAI corpus.",
            "source_image_entities": [
                "LOCATION CONJUNCTION"
            ],
            "source_text_entities": [
                "LANI"
            ]
        },
        {
            "merged_entity_name": "TEMPORAL COORDINATION",
            "entity_type": "UNKNOWN",
            "description": "The category 'Temporal coordination' is a row in the table, showing values for 'Present' and 'Absent', and a p-value, which is part of the analysis categories used in the CHAI corpus.",
            "source_image_entities": [
                "TEMPORAL COORDINATION"
            ],
            "source_text_entities": [
                "LANI"
            ]
        },
        {
            "merged_entity_name": "TRAJECTORY CONSTRAINTS",
            "entity_type": "UNKNOWN",
            "description": "The category 'Trajectory constraints' is a row in the table, showing values for 'Present' and 'Absent', and a p-value, which is part of the analysis categories used in the CHAI corpus.",
            "source_image_entities": [
                "TRAJECTORY CONSTRAINTS"
            ],
            "source_text_entities": [
                "LANI"
            ]
        },
        {
            "merged_entity_name": "CO-REFERENCE",
            "entity_type": "UNKNOWN",
            "description": "The category 'Co-reference' is a row in the table, showing values for 'Present' and 'Absent', and a p-value, which is part of the analysis categories used in the CHAI corpus.",
            "source_image_entities": [
                "CO-REFERENCE"
            ],
            "source_text_entities": [
                "LANI"
            ]
        },
        {
            "merged_entity_name": "COMPARATIVES",
            "entity_type": "UNKNOWN",
            "description": "The category 'Comparatives' is a row in the table, showing values for 'Present' and 'Absent', and a p-value, which is part of the analysis categories used in the CHAI corpus.",
            "source_image_entities": [
                "COMPARATIVES"
            ],
            "source_text_entities": [
                "LANI"
            ]
        }
    ],
    "image_11": [
        {
            "merged_entity_name": "CHAI",
            "entity_type": "ORGANIZATION",
            "description": "CHAI is an organization that has developed a corpus combining navigation and simple manipulation in a simulated household environment, involved in evaluating the performance of approaches in stop distance and manipulation accuracy.",
            "source_image_entities": [
                "OUR APPROACH"
            ],
            "source_text_entities": [
                "\"CHAI\"",
                "\"CHAI\""
            ]
        },
        {
            "merged_entity_name": "LANI",
            "entity_type": "ORGANIZATION",
            "description": "LANI is another organization mentioned in the context of the CHAI corpus, possibly related to language or instruction analysis, and is involved in evaluating the performance of approaches in task completion and stop distance accuracy.",
            "source_image_entities": [
                "HUMAN"
            ],
            "source_text_entities": [
                "\"LANI\"",
                "\"LANI\""
            ]
        },
        {
            "merged_entity_name": "Goal Prediction",
            "entity_type": "EVENT",
            "description": "Goal prediction is an event in the CHAI corpus where an additional RNN predicts the sequence of intermediate goals given the instruction only, and is a process that is explicitly separated from action generation in the proposed model.",
            "source_image_entities": [
                "OUR APPROACH"
            ],
            "source_text_entities": [
                "\"GOAL PREDICTION\"",
                "\"GOAL PREDICTION\""
            ]
        }
    ],
    "image_12": [
        {
            "merged_entity_name": "CHAI",
            "entity_type": "ORGANIZATION",
            "description": "CHAI is an organization that has developed a corpus combining navigation and simple manipulation in a simulated household environment, involved in evaluating the performance of approaches in stop distance and manipulation accuracy.",
            "source_image_entities": [
                "INDOOR ENVIRONMENT"
            ],
            "source_text_entities": [
                "\"CHAI\"",
                "\"CHAI\""
            ]
        },
        {
            "merged_entity_name": "LANI",
            "entity_type": "ORGANIZATION",
            "description": "LANI is another organization mentioned in the context of the CHAI corpus, possibly related to language or instruction analysis, and is involved in evaluating the performance of approaches in task completion and stop distance accuracy.",
            "source_image_entities": [],
            "source_text_entities": [
                "\"LANI\"",
                "\"LANI\""
            ]
        },
        {
            "merged_entity_name": "NAVIGATION",
            "entity_type": "EVENT",
            "description": "NAVIGATION is an event type in the CHAI corpus, representing action sequences that require movement and end with the STOP action, and is an open area with grass and a path that curves around the big rock.",
            "source_image_entities": [
                "OUTDOOR ENVIRONMENT"
            ],
            "source_text_entities": [
                "\"NAVIGATION\""
            ]
        },
        {
            "merged_entity_name": "INTERACT",
            "entity_type": "EVENT",
            "description": "INTERACT is an event in the CHAI corpus where the agent interacts with objects, requiring a 2D position in the agent’s view.",
            "source_image_entities": [],
            "source_text_entities": [
                "\"INTERACT\""
            ]
        },
        {
            "merged_entity_name": "STOP",
            "entity_type": "EVENT",
            "description": "STOP is an event in the CHAI corpus where the agent ceases movement, used as an endpoint for NAVIGATION and INTERACTION sequences, and is a baseline event used for comparison in performance metrics such as stop distance.",
            "source_image_entities": [],
            "source_text_entities": [
                "\"STOP\"",
                "\"STOP\""
            ]
        },
        {
            "merged_entity_name": "INTERMEDIATE GOALS",
            "entity_type": "CONCEPT",
            "description": "Intermediate Goals are used in CHAI, with the horizon applied separately for each goal.",
            "source_image_entities": [],
            "source_text_entities": [
                "\"INTERMEDIATE GOALS\""
            ]
        },
        {
            "merged_entity_name": "GOAL PREDICTION",
            "entity_type": "EVENT",
            "description": "Goal Prediction is a process that is explicitly separated from action generation in the proposed model, where an additional RNN predicts the sequence of intermediate goals given the instruction only.",
            "source_image_entities": [],
            "source_text_entities": [
                "\"GOAL PREDICTION\"",
                "\"GOAL PREDICTION\""
            ]
        },
        {
            "merged_entity_name": "ACTION GENERATION",
            "entity_type": "EVENT",
            "description": "Action Generation is a process that relies on the predicted goal in the proposed model.",
            "source_image_entities": [],
            "source_text_entities": [
                "\"ACTION GENERATION\""
            ]
        }
    ]
}