{
  "chunk-417215f91ee0a37cc2f6daa4d63375cc": {
    "tokens": 1200,
    "content": "![](images/image_1.jpg)  \n\nhow. But cheer up, you don't need a web. Zuckerman supplies you with three big meals a day. Why should you worry about trapping food?\"  \n\nWilbur sighed. \"You're ever so much cleverer and brighter than I am, Charlotte. I guess I was just trying to show off. Serves me right.\"  \n\nTempleton untied his string and took it back to his home. Charlotte returned to her weaving.  \n\n\"You needn't feel too badly, Wilbur,\" she said. \"Not many creatures can spin webs. Even men aren't as good at it as spiders, although they think they're pretty good, and they'll try anything. Did you ever hear of the Queensborough Bridge?\"  \n\nWilbur shook his head. \"Is it a web?\"  \n\n\"Son of,\" replied Charlotte. \"But do you know how long it took men to build it? Eight whole years. My goodness, I would have starved to death waiting that long. I can make a web in a single evening.\"  \n\n\"What do people catch in the Queensborough Bridge -bugs?\" asked Wilbur.  \n\n\"No,\" said Charlotte. \"They don't catch anything. They just keep trotting back and fonh across the bridge thinking there is something better on the other side. If they'd hang head-down at the top of the thing and wait quietly, maybe something good would come along. But no--with men it's rush, rush, rush, every minute. I'm glad I'm a sedentary spider.\"  \n\n\"What does sedentary mean?\" asked Wilbur.  \n\n\"Means I sit still a good part of the time and don't go wandering all over creation. I know a good thing when I see it, and my web is a good thing. I stay put and wait for what comes. Gives me a chance to think.\"  \n\n\"Well, I'm son of sedentary myself, I guess,\" said the pig. \"I have to hang around here whether I want to or not. You know where I'd really like to be this eve­ ning?\"  \n\n\"Where?\"  \n\n\"In a forest looking for beechnuts and truffles and delectable roots, pushing leaves aside with my wonder­ ful strong nose, searching and sniffing along the ground, smelling, smelling, smelling . . . \"  \n\n\"You smell just the way you are,\" remarked a lamb who had just walked in. \"I can smell you from here. You're the smelliest creature in the place.\"  \n\nWilbur hung his head. His eyes grew wet with tears. Charlotte noticed his embarrassment and she spoke sharply to the lamb.  \n\n\"Let Wilbur alone!\" she said. \"He has a perfect right to smell, considering his surroundings. You're no bundle of sweet peas yourself. Funhermore, you are interrupting a very pleasant conversation. What were we talking about, Wilbur, when we were so rudely in­ terrupted?\"  \n\n\"Oh, I don't remember,\" said Wilbur. \"It doesn't make any difference. Let's not talk any more for a while, Charlotte. I'm getting sleepy. You go ahead and finish fixing your web and I'll just lie here and watch you. It's a lovely evening.\" Wilbur stretched out on his side.  \n\nTwilight settled over Zuckerman's barn, and a feel­ ing of peace. Fern knew it was almost suppertime but she couldn't bear to leave. Swallows passed on silent wings, in and out of the doorways, bringing food to their young ones. From across the road a bird sang \"Whippoorwill, whippoorwill!\" Lurvy sat down under an apple tree and lit his pipe; the animals sniffed the familiar smell of strong tobacco. Wilbur heard the trill of the tree toad and the occasional slamming of the kitchen door. All these sounds made him feel comfort­ able and happy, for he loved life and loved to be a part of the world on a summer evening. But as he lay there he remembered what the old sheep had told him. The thought of death came to him and he began to tremble with fear.  \n\n\"Charlotte?\" he said, softly. \"Yes, Wilbur?\" \"I don't want to die.\"  \n\n\"Of course you don't,\" said Charlotte in a comfort­ ing voice.  \n\n\"I just love it here in the barn,\" said Wilbur. \"I love everything about this place.\"  \n\n\"Of course you do,\" said Charlotte. \"We all do.\"  \n\nThe goose appeared, followed by her seven goslings. They thrust their little necks out and kept up a musical whistling, like a tiny troupe of pipers. Wilbur listened to the sound with love in his heart.  \n\n\"Charlotte?\" he said.   \n\"Yes?\" said the spider.  \n\n\"Were you serious when you promised you would keep them from killing me?\"  \n\n\"I was never more serious in my life. I am not going to let you die, Wilbur.\"  \n\n\"How are you going to save me?\" asked Wilbur, whose curiosity was very strong on this point.  \n\n\"Well,\"  said Charlotte, vaguely, \"I don't  really know. But I'm working on a plan.\"  \n\n\"That's wonderful,\" said Wilbur. \"How is the plan coming, Charlotte? Have you got very far with it? Is it coming along pretty well?\" Wilbur was trembling again, but Charlotte was cool and collected.  \n\n\"Oh, it's coming all right,\" she said, lightly. \"The plan is still in its early stages and hasn't completely shaped up yet, but I'm working on it.\"  \n\n\"When do you work on it?\" begged Wilbur.  \n\n\"When I'm hanging head-down at the top of my web. That's when I do my thinking, because then al the blood is in my head.\"  \n\n\"I'd be only too glad to help in any way I can.\"  \n\n\"Oh",
    "chunk_order_index": 0,
    "full_doc_id": "doc-c91e729d8909ae8a0a51a6f7fd241fee"
  },
  "chunk-e3b9278be90606f3d30147cbe7130ac3": {
    "tokens": 1200,
    "content": "Charlotte was cool and collected.  \n\n\"Oh, it's coming all right,\" she said, lightly. \"The plan is still in its early stages and hasn't completely shaped up yet, but I'm working on it.\"  \n\n\"When do you work on it?\" begged Wilbur.  \n\n\"When I'm hanging head-down at the top of my web. That's when I do my thinking, because then al the blood is in my head.\"  \n\n\"I'd be only too glad to help in any way I can.\"  \n\n\"Oh, I'll work it out alone,\" said Charlotte. \"I can think better if I think alone.\"  \n\n\"All right,\" said Wilbur. \"But don't fail to let me know if there's anything I can do to help, no matter how slight.\"  \n\n\"Well,\" replied Charlotte, \"you must try to build yourself up. I want you to get plenty of sleep, and stop worrying. Never hurry and never worry! Chew your food thoroughly and eat every bit of it, except you must leave just enough for Templeton. Gain weight and stay well-that's the way you can help. Keep fit, and don't lose your nerve. Do you think you under­ stand?\"  \n\n\"Yes, I understand,\" said Wilbur.  \n\n\"Go along to bed, then,\" said Charlotte. \"Sleep is im­ portant.\"  \n\nWilbur trotted over to the darkest corner of his pen and threw himself down. He closed his eyes. In another minute he spoke.  \n\n\"Charlotte?\" he said. \"Yes, Wilbur?\"  \n\n\"May I go out to my trough and see if I left any of my supper? I think I left just a tiny bit of mashed po­ tato.\"  \n\n\"Very well,\" said Charlotte. \"But I want you in bed again without delay.\"  \n\nWilbur started to race out to his yard.  \n\n\"Slowly, slowly!\" said Charlotte. \"Never hurry and never worry!\"  \n\nWilbur checked himself and crept slowly to his trough. He found a bit of potato, chewed it l:arefully, swallowed it, and walked back to bed. He closed his eyes and was silent for a while.  \n\n\"Charlotte?\" he said, in a whisper.  \n\n\"Y cs?\"  \n\n\"May I get a drink of milk? I think there are a few drops of milk left in my trough.\"  \n\n\"No, the trough is dry, and I want you to go to sleep. No more talking! Close your eyes and go to sleep!\"  \n\nWilbur shut his eyes. Fern got up from her stool and started for home, her mind full of everything she had seen and heard.  \n\n\"Good night, Charlotte!\" said Wilbur. \"Good night, Wilbur!\"   \nThere was a pause.   \n\"Good night, Charlotte! \"   \n\"Good night, Wilbur!\"   \n\"Good night!\"   \n\"Good night!\"  \n\n# Chapter X  \n\n# An Explosion  \n\nAFTER day the spider waited, head­ down, for an idea to come to her. Hour by hour she sat motionless, deep in thought. Having promised Wilbur that she would save his life, she was determined to keep her promise. Charlotte was naturally patient. She knew from experience that if she waited long enough, a fly would come to her web; and she felt sure that if she thought long enough about Wilbur's problem, an idea would come to her mind.  \n\n![](images/image_2.jpg)  \n\nFinally, one morning toward the middle of July, the idea came. \"Why, how perfectly simple! \" she said to herself. \"The way to save Wilbur's life is to play a trick on Zuckerman. If I can fool a bug,\" thought Char­ lotte, \"I can surely fool a man. People are not as smart as bugs.\"  \n\nWilbur walked into his yard just at that moment.   \n\"What are you thinking about, Charlotte?\" he asked.  \n\n\"I was just thinking,\" said the spider, \"that people are very gullible.\"  \n\n\"What does 'gullible' mean?\" \"Easy to fool,\" said Charlotte.  \n\n\"That's a mercy,\" replied Wilbur, and he lay down in the shade of his fence and went fast asleep. The spider, however, stayed wide awake, gazing affection­ ately at him and making plans for his future. Summer was half gone. She knew she didn't have much time.  \n\nThat morning, just as Wilbur fell asleep, Avery Arable wandered into the Zuckerman's front yard, fol­ lowed by Fern. Avery carried a live frog in his hand.  \n\nFern had a crown of daisies in her hair. The children ran for the kitchen.  \n\n\"Just in time for a piece of blueberry pie,\" said J\\lrs. Zuckerman.  \n\n\"Look at my frog!\" said Avery, placing the frog on the drainboard and holding out his hand for pie.  \n\n\"Take that thing out of here! \" said Mrs. Zuckerman. \"He's hot,\" said Fern. \"He's almost dead, that frog.\"  \n\n\"He is not,\" said Avery. \"He lets me scratch him between the eyes.\" The frog jumped and landed in Mrs. Zuckerman's dishpan full of soapy water.  \n\n\"You're getting your pie on you,\" said Fern. \"Can I look for eggs in the henhouse, Aunt Edith?\"  \n\n\"Run outdoors, both of you! And don't bother the hens! \"  \n\n\"It's getting all over everything,\" shouted Fern. \"His pie is all over his front.\"  \n\n\"Come on, frog!\" cried Avery. He scooped up his frog. The frog kicked, splashing soapy water onto the blueberry pie.  \n\n\"Another crisis!\" groaned Fern.  \n\n\"Let's swing in the swing!\" said Avery.  \n\nThe children ran to the barn.  \n\nMr. Z",
    "chunk_order_index": 1,
    "full_doc_id": "doc-c91e729d8909ae8a0a51a6f7fd241fee"
  },
  "chunk-e39885fdee9f8b4971f0d379dbf3376c": {
    "tokens": 1200,
    "content": "Edith?\"  \n\n\"Run outdoors, both of you! And don't bother the hens! \"  \n\n\"It's getting all over everything,\" shouted Fern. \"His pie is all over his front.\"  \n\n\"Come on, frog!\" cried Avery. He scooped up his frog. The frog kicked, splashing soapy water onto the blueberry pie.  \n\n\"Another crisis!\" groaned Fern.  \n\n\"Let's swing in the swing!\" said Avery.  \n\nThe children ran to the barn.  \n\nMr. Zuckerman had the best swing in the county. It was a single long piece of heavy rope tied to the beam over the north doorway. At the bottom end of the rope was a fat knot to sit oq. It was arranged so that you could swing without being pushed. You climbed a ladder to the hayloft. Then, holding the rope, you stood at the edge and looked down, and were scared and dizzy. Then you straddled the knot, so that it acted as a seat. Then you got up all your nerve, took a deep breath, and jumped. For a second you seemed to be falling to the barn floor far below, but then sud­ denly the rope would begin to catch you, and you would sail through the barn door going a mile a minute, with the wind whistling in your eyes and ears and hair. Then you would zoom upward into the sky, and look up at the clouds, and the rope would twist and you would twist and turn with the rope. Then you would drop down, down, down out of the sky and come sail­ ing back into the bam almost into the hayloft, then sail out again (not quite so far this time), then in again (not quite so high), then out again, then in again, then out, then in; and then you'd jump off and fall down and let somebody else try it.  \n\nMothers for miles around worried about Zucker­ man's swing. They feared some child would fall off. But no child ever did. Children almost always hang onto things tighter than their parents think they will.  \n\nA very put the frog in his pocket and climbed to the hayloft. \"The last time I swang in this swing, I almost crashed into a bam swallow,\" he yelled.  \n\n\"Take that frog out!\" ordered Fern.  \n\nA very straddled the rope and jumped. He sailed out through the door, frog and all, and into the sky, frog and all. Then he sailed back into the barn.  \n\n\"Your tongue is purple! \" screamed Fern.  \n\n\"So is yours!\" cried Avery, sailing out again with the frog.  \n\n\"I have hay inside my dress! It itches!\" called Fern. \"Scratch it! \" yelled Avery, as he sailed back.   \n\"It's my turn,\" said Fern. \"Jump off!\"   \n\"Fern's got the itch! \" sang Avery.  \n\nWhen he jumped off, he threw the swing up to his sister. She shut her eyes tight and jumped. She felt the dizzy drop, then the supponing lift of the swing. When she opened her eyes she was looking up into the blue sky and was about to fly back through the door.  \n\nThey took turns for an hour.  \n\nWhen the children grew tired of swinging, they went down toward the pasture and picked wild rasp­ berries and ate them. Their tongues turned from purple to red. Fern bit into a raspberry that had a bad-tasting bug inside it, and got discouraged. Avery found an empty candy box and put his frog in it. The frog seemed tired after his morning in the swing. The chil­ dren walked slowly up toward the barn. They, too, were tired and hardly had energy enough to walk.  \n\n\"Let's build a tree house,\" suggested Avery. \"I want to live in a tree, with my frog.\"  \n\n![](images/image_3.jpg)  \n\n\"I'm going to visit Wilbur,\" Fern announced.  \n\nThey climbed the fence into the lane and walked lazily toward the pigpen. Wilbur heard them coming and got up.  \n\nAvery noticed the spider web, and, coming closer, he saw Charlotte.  \n\n\"Hey, look at that big spider!\" he said. \"It's tre­ menjus.\"  \n\n\"Leave it alone!\" commanded Fern. \"You've got a frog-isn't that enough?\"  \n\n\"That's a fine spider and I'm going to capture it,\" said Avery. He took the cover off the candy box. Then he picked up a stick. \"I'm going to knock that ol' spider into this box,\" he said.  \n\nWilbur's heart almost stopped when he saw what was going on. This might be the end of Charlotte if the boy succeeded in catching her.  \n\n\"You stop it, Avery!\" cried Fern.  \n\nAvery put one leg over the fence of the pigpen. He was just about to raise his stick to hit Charlotte when he lost his balance. He swayed and toppled and landed on the edge of Wilbur's trough. The trough tipped up and then came down with a slap. The goose egg was right underneath. There was a dull explosion as the egg broke, and then a horrible smell.  \n\nFern screamed. Avery jumped to his feet. The air was filled with the terrible gases and smells from the rotten egg. Templeton, who had been resting in his home, scuttled away into the barn.  \n\n\"Good  night!\" screamed Avery.  \"Good  night! What a stink! Let's get out of here!\"  \n\nFern was crying. She held her nose and ran toward the house. Avery ran after her,  holding his nose.  \n\nCharlotte felt greatly relieved to see him go. It had been a narrow escape.  \n\nLater on that morning, the animals came up from the pasture-the sheep, the lambs, the gander, the goose, and the seven",
    "chunk_order_index": 2,
    "full_doc_id": "doc-c91e729d8909ae8a0a51a6f7fd241fee"
  },
  "chunk-25b382c4a6005e001365fd3060174b9a": {
    "tokens": 1200,
    "content": "the barn.  \n\n\"Good  night!\" screamed Avery.  \"Good  night! What a stink! Let's get out of here!\"  \n\nFern was crying. She held her nose and ran toward the house. Avery ran after her,  holding his nose.  \n\nCharlotte felt greatly relieved to see him go. It had been a narrow escape.  \n\nLater on that morning, the animals came up from the pasture-the sheep, the lambs, the gander, the goose, and the seven goslings. There were many complaints about the awful smell, and vVilbur had to tell the story over and over again, of how the Arable boy had tried to capture Charlotte, and how the smell of the broken egg drove him away just in time. \"It was that rotten goose egg that saved Charlotte's life,\" said Wilbur.  \n\n![](images/image_4.jpg)  \n\nThe goose was proud of her share in the adventure.  \n\n\"I'm delighted that the egg never hatched,\" she gab­ bled.  \n\nTempleton, of course, was miserable over the loss of his beloved egg. But he couldn't resist boasting. \"It pays to save things,\" he said in his surly voice. \"A rat never knows when something is going to come in handy. I never throw anything away.\"  \n\n\"Well,\" said one of the lambs, \"this whole business is all well and good for Charlotte, but what about the rest of us? The smell is unbearable. Who wants to live in a barn that is perfumed with rotten egg?\"  \n\n\"Don't worry, you'll get used to it,\" said Templeton. He sat up and pulled wisely at his long whiskers, then crept away to pay a visit to the dump.  \n\nWhen Lurvy showed up at lunchtime carrying a pail of food for Wilbur, he stopped shon a few paces from the pigpen. He sniffed the air and made a face.  \n\n\"What in thunder?\" he said. Setting the pail down, he picked up the stick that Avery had dropped and pried the trough up. \"Rats!\" he said. \"Fhew! I might a' known a rat would make a nest under this trough. How I hate a rat! \"  \n\nAnd Lurvy dragged Wilbur's trough across the yard and kicked some dirt into the rat's nest, burying the broken egg and all Templeton's other possessions. Then he picked up the pail. Wilbur stood in the trough, drooling with hunger. Lurvy poured. The slops ran creamily down around the pig's eyes and ears. Wilbur grunted.  He  gulped  and  sucked,  and  sucked  and gulped, making swishing and swooshing noises, anxious to get everything at once. It was a delicious meal­ skim milk, wheat middlings, leftover pancakes, half a doughnut, the rind of a summer squash, two pieces of stale toast, a third of a gingersnap, a fish tail, one orange peel, several noodles from a noodle soup, the scum off a cup of cocoa, an ancient jelly roll, a strip of paper from the lining of the garbage pail, and a spoonful of raspberry jello.  \n\nlVilbur ate heartily.  He planned to leave half a noodle and a few drops of milk for Templeton. Then he remembered that the rat had been useful in saving Charlotte's life, and that Charlotte was trying to save his life. So he left a whole noodle, instead of a half.  \n\nNow that the broken egg was buried, the air cleared and  the  barn  smelled  good  again.  The  afternoon passed, and evening came. Shadows lengthened. The cool and kindly breath of evening entered through doors and windows. Astride her web, Charlotte sat moodily  eating  a  horsefly  and  thinking  about  the future. After a while she bestirred herself.  \n\nShe descended to the center of the web and there she began to cut some of her lines. She worked slowly but steadily while the other creatures drowsed. None of the others, not even the goose, noticed that she was at work. Deep in his soft bed, Wilbur snoozed. Over in their favorite comer, the goslings whistled a night song.  \n\nCharlotte tore quite a section out of her web, leaving an open space in the middle. Then she staned weaving something to take the place of the threads she had removed. When Templeton got back from the dump, around midnight, the spider was still at work.  \n\n# Chapter XI  \n\n# <fhe Miracle  \n\n# T  \n\nHE NEXT day was foggy. Everything on the fann was dripping wet. The grass looked like a magic carpet. The asparagus patch looked like a silver forest.  \n\nOn foggy mornings, Charlotte's web was truly a thing of beauty. This morning each thin strand was decorated with dozens of tiny beads of water. The web glistened in the light and made a pattern of love­ liness and mystery, like a delicate veil. Even Lurvy, who wasn't panicularly interested in beauty, noticed the web when he came with the pig's breakfast. He noted how clearly it showed up and he noted how big and carefully built it was. And then he took another look and he saw something that made him set his pail down. There, in the center of the web, neatly woven in block letters, was a message. It said:  \n\n# SOME PIG!  \n\nLurvy felt weak. He brushed his hand across his eyes and stared harder at Charlotte's web.  \n\n![](images/image_5.jpg)  \n\n\"I'm seeing things,\" he whispered. He dropped to his knees and uttered a short prayer. Then, forgetting all about \\",
    "chunk_order_index": 3,
    "full_doc_id": "doc-c91e729d8909ae8a0a51a6f7fd241fee"
  },
  "chunk-b69896b8e49f84b8a8220596093a66df": {
    "tokens": 1200,
    "content": "another look and he saw something that made him set his pail down. There, in the center of the web, neatly woven in block letters, was a message. It said:  \n\n# SOME PIG!  \n\nLurvy felt weak. He brushed his hand across his eyes and stared harder at Charlotte's web.  \n\n![](images/image_5.jpg)  \n\n\"I'm seeing things,\" he whispered. He dropped to his knees and uttered a short prayer. Then, forgetting all about \\Vilbur's breakfast, he walked back to the house and called Mr. Zuckerman.  \n\n\"I think you'd better come down to the pigpen,\" he said.  \n\n\"\\Vhat's the trouble?\" asked Mr. Zuckerman. \"Any­ thing wrong with the pig?\"  \n\n\"N-not exactly,\" said Lurvy. \"Come and see for yourself.\"  \n\nThe two men walked silently down to Wilbur's yard. Lurvy pointed to the spider's web. \"Do you see what I see?\" he asked.  \n\nZuckerman stared at the writing on the web. Then he munnured the words \"Some Pig.\" Then he looked at Lurvy. Then they both began to tremble. Charlotte, sleepy after her night's exenions, smiled as she watched. Wilbur came and stood directly under the web.  \n\n\"Some pig!\" muttered Lurvy in a low voice.  \n\n\"Some pig!\" whispered  Mr.  Zuckennan. They stared and stared for a long time at Wilbur. Then they stared at Charlotte.  \n\n\"You don't suppose that that spider . . .\"   began Mr. Zuckennan-but he shook his head and didn't finish the sentence. Instead, he walked solemnly back up to the house and spoke to his wife. \"Edith, some­ thing has happened,\" he said, in a weak voice. He went into the living room and sat down, and Mrs. Zuckerman followed.  \n\n\"I've got something to tell you, Edith,\" he said. \"You better sit down.\"  \n\nMrs. Zuckennan sank into a chair. She looked pale and frightened.  \n\n\"Edith,'' he said, trying to keep his voice steady, \"I think you had best be told that we have a very unusual pig.\"  \n\nA look of complete bewilderment came over Mrs. Zuckerman's face. \"Homer Zuckerman, what in the world are you talking about?\" she said.  \n\n\"This is a very serious thing, Edith,\" he replied. \"Our pig is completely out of the ordinary.\"  \n\n\"What's unusual about the pig?\" asked Mrs. Zucker­ man, who was beginning to recover from her scare.  \n\n\"Well, I don't really know yet,\" said Mr. Zucker­ man. \"But we have received a sign, Edith-a myste­ rious sign. A miracle has happened on this farm. There is a large spider's web in the doorway of the barn cellar, right over the pigpen, and when Lurvy went to feed the pig this morning, he noticed the web because it was foggy, and you know how a spider's web looks very distinct in a fog. And right spang in the middle of the web there were the words 'Some Pig.' The words were woven right into the web. They were actually part of the web, Edith. I know, because I have been down there and seen them. It says, 'Some Pig,' just as clear as clear can be. There can be no mistake about it. A miracle has happened and a sign has occurred here on earth, right on our farm, and we have no ordinary pig.\"  \n\nuw ell,\"  said 1\\frs.  Zuckerman,  \"it seems to me you're a little off. It seems to me we have no ordinary spider.''  \n\n\"Oh, no,\" said Zuckerman. \"It's the pig that's un­ usual. It says so, right there in the middle of the web.\"  \n\n\"Maybe so,\" said Mrs. Zuckerman. \"Just the same, I intend to have a look at that spider.\"  \n\n\"It's just a common grey spider,\" said Zuckerman. They got up, and together they walked down to Wilbur's yard. \"You see, Edith? It's just a common grey spider.\"  \n\nWilbur was pleased to receive so much attention. Lurvy was still standing there, and Mr. and Mrs. Zuckerman, all three, stood for about an hour, reading the words on the web over and over, and watching Wilbur.  \n\nCharlotte was delighted with the way her trick was working. She sat without moving a muscle, and lis­ tened to the conversation of the people. When a small fly blundered into the web, just beyond the word \"pig,\" Charlotte dropped quickly down, rolled the fly up, and carried it out of the way.  \n\nAfter a while the fog lifted. The web dried otf and the words didn't show up so plainly. The Zuckermans and Lurvy walked back to the house. Just before they left the pigpen, Mr. Zuckerman took one last look at Wilbur.  \n\n\"You know,\" he said, in an imponant voice, \"I've thought all along that that pig of ours was an extra good one. He's a solid pig. That pig is as solid as they come.  \n\nYou notice how solid he is around the shoulders, Lurvy?\"  \n\n\"Sure. Sure I do,\" said Lurvy. \"I've always noticed that pig. He's quite a pig.\"  \n\n\"He's long, and he's smooth,\" said Zuckerman.  \n\n\"That's right,\" agreed Lurvy. \"He's as smooth as they come. He's some pig.\"  \n\nWhen Mr. Zuckennan got back to the house, he",
    "chunk_order_index": 4,
    "full_doc_id": "doc-c91e729d8909ae8a0a51a6f7fd241fee"
  },
  "chunk-e599d86e8b65bf951fe236e711378110": {
    "tokens": 1200,
    "content": ". That pig is as solid as they come.  \n\nYou notice how solid he is around the shoulders, Lurvy?\"  \n\n\"Sure. Sure I do,\" said Lurvy. \"I've always noticed that pig. He's quite a pig.\"  \n\n\"He's long, and he's smooth,\" said Zuckerman.  \n\n\"That's right,\" agreed Lurvy. \"He's as smooth as they come. He's some pig.\"  \n\nWhen Mr. Zuckennan got back to the house, he took off his work clothes and put on his best suit. Then he got into his car and drove to the minister's house. He stayed for an hour and explained to the minister that a miracle had happened on the farm.  \n\n\"So far,\" said Zuckerman, \"only four people on earth know about this miracle-myself, my wife Edith, my hired man Lurvy, and you.\"  \n\n\"Don't tell anybody else,\" said the minister. \"We don't know what it means yet, but perhaps if I give thought to it, I can explain it in my sermon next Sun­ day. There can be no doubt that you have a most un­ usual pig. I intend to speak about it in my sermon and point out the fact that this community has been visited with a wondrous animal. By the way, does the pig have a name?\"  \n\n\"Why, yes,\" said Mr. Zuckerman. \"My little niece calls him Wilbur. She's a rather queer child-full of notions. She raised the pig on a bottle and I bought him from her when he was a month old.\"  \n\nHe shook hands with the minister, and left.  \n\nSecrets are hard to keep. Long before Sunday came, the news spread all over the county. Everybody knew that a sign had appeared in a spider's web on the Zuck­ erman place. Everybody knew that the Zuckermans had a wondrous pig. People came from miles around to look at Wilbur and to read the words on Charlotte's web. The Zuckermans' driveway was full of cars and trucks from morning till night-Fords and Chevvies and Buick roadmasters and GMC pickups and Plymouths and Studebakers and Packards and De Sotos with gyromatic transmissions and Oldsmobiles with rocket engines and Jeep station wagons and Pontiacs. The news of the wonderful pig spread clear up into the hills, and farmers came rattling down in buggies and buckboards, to stand hour after hour at Wilb''s pen admiring the miraculous animal. All said they had never seen such a pig before in their lives.  \n\n![](images/image_6.jpg)  \n\nWhen Fern told her mother that A very had tried to hit the Zuckermans' spider with a stick, Mrs. Arable was so shocked that she sent Avery to bed without any supper, as punishment.  \n\nIn the days that followed, Mr. Zuckerman was so busy entertaining visitors that he neglected his farm work. He wore his good clothes all the time now-got right into them when he got up in the morning. Mrs. Zuckerman prepared special meals for Wilbur. Lurvy shaved and got a haircut; and his principal farm duty was to feed the pig while people looked on.  \n\nMr. Zuckerman ordered Lurvy to increase Wilbur's feedings from three meals a day to four meals a day. The Zuckermans were so busy with visitors they forgot about other things on the farm. The blackberries got ripe, and Mrs. Zuckerman failed to put up any black­ berry jam. The com needed hoeing, and Lurvy didn't find time to hoe it.  \n\nOn Sunday the church was full. The minister explained the miracle. He said that the words on the spider's web proved that human beings must always be on the watch for the corning of wonders.  \n\nAll in all, the Zuckennans' pigpen was the center of attraction. Fern was happy, for she felt that Char­ lotte's trick was working and that Wilbur's life would be saved. But she found that the bam was not nearly as pleasant-too many people. She liked it better when she could be all alone with her friends the animals.  \n\n# Chapter XII  \n\n# A Meeting  \n\n![](images/image_7.jpg)  \n\nEVENING, a few days after the writ­ ing had appeared in Charlotte's web, the spider called a meeting of all the animals in the bam cellar.  \n\n\"I shall begin by calling the roll. Wilbur?\" \"Here!\" said the pig.   \n\"Gander?\"  \n\n\"Here, here, here!\" said the gander.  \n\n\"You sound like three ganders,\" muttered Char­ lotte. \"Why can't you just say 'here'? Why do you have to repeat everything?\"  \n\n\"It's my idio-idio-idiosyncrasy,\" replied the gander.   \n\"Goose?\" said Charlotte.  \n\n\"Here, here, here!\" said the goose. Charlotte glared at her.  \n\n\"Goslings, one through seven?\"  \n\n\"Bee-bee-bee!\" \"Bee-bee-bee!\"  \"Bee-bee-bee!\" \"Bee-bee-bee!\" \"Bee-bee-bee!\" \"Bee-bee-bee!\" \"Bee­ bee-bee!\" said the goslings.  \n\n\"This is getting to be quite a meeting,\" said Charlotte.  \n\n\"Anybody would think we had three ganders, three geese, and twenty-one goslings. Sheep?\"  \n\n\"He-aa-aa! \"  answered the sheep all together.  \n\n\"Lambs?\"   \n\"He-aa-aa!\" answered the lambs all together. \"Templeton?\"   \nNo answer.   \n\"Templeton?\"   \nNo answer.  \n\n\"Well, we are all here except the rat,\" said Charlotte. \"I",
    "chunk_order_index": 5,
    "full_doc_id": "doc-c91e729d8909ae8a0a51a6f7fd241fee"
  },
  "chunk-aacf791abd702456b6896d9c0fb0ba77": {
    "tokens": 1200,
    "content": "\"This is getting to be quite a meeting,\" said Charlotte.  \n\n\"Anybody would think we had three ganders, three geese, and twenty-one goslings. Sheep?\"  \n\n\"He-aa-aa! \"  answered the sheep all together.  \n\n\"Lambs?\"   \n\"He-aa-aa!\" answered the lambs all together. \"Templeton?\"   \nNo answer.   \n\"Templeton?\"   \nNo answer.  \n\n\"Well, we are all here except the rat,\" said Charlotte. \"I guess we can proceed without him. Now, all of you must have noticed what's been going on around here the last few days. The message I wrote in my web, praising Wilbur, has been received. The Zuckermans have fallen for it, and so has everybody else. Zuckerman thinks Wilbur is an unusual pig, and therefore he won't want to kill him and eat him. I dare say my trick will work and Wilbur's life can be saved.  \n\n\"Hurray!\" cried everybody.  \n\n\"Thank you very much,\" said Charlotte. \"Now I called this meeting in order to get suggestions. I need new ideas for the web. People are already getting sick of reading the words 'Some Pig!' If anybody can think of another message, or remark, I'll be glad to weave it into the web. Any suggestions for a new slogan?\"  \n\n\"How about 'Pig Supreme'?\" asked one of the lambs.  \n\n![](images/image_8.jpg)  \n\n\"No good,\" said Charlotte. \"It sounds like a rich des­ sert.\"  \n\n\"How about 'Terrific, terrific, terrific'?\" asked the goose.  \n\n\"Cut that down to one 'terrific' and it will do ver nicely,\" said Charlotte. \"I think 'terrific' might impress Zuckerman.\"  \n\n\"But Charlotte,\" said Wilbur, \"I'm not terrific.\"  \n\n\"That doesn't make a particle of difference,\" replied Charlotte. \"Not a particle. People believe almost any­ thing they see in print. Does anybody here know how to spell 'terrific'?\"  \n\n\"I think,\" said the gander, \"it's tee double ee double rr double rr double eye double ff double eye double see see see see see.\"  \n\n\"What kind of an acrobat do you think I am?\" said Charlotte in disgust. \"I would have to have St. Vitus's Dance to weave a word like that into my web.\"  \n\n\"Sorry, sorry, sorry,\" said the gander.  \n\nThen the oldest sheep spoke up. \"I agree that there should be something new written in the web if Wilbur's life is to be saved. And if Charlotte needs help in finding words, I think she can get it from our friend Templeton. The rat visits the dump regularly and has access to old magazines. He can tear out bits of advertisements and bring them up here to the barn cellar, so that Charlotte can have something to copy.\"  \n\n\"Good idea,\" said Charlotte. \"But I'm not sure Tem­ pleton will be willing to help. You know how he is always looking out for himself, never thinking of the other fellow.\"  \n\n\"I bet I can get him to help,\" said the old sheep. \"I'll appeal to his baser instincts, of which he has plenty. Here he comes now. Everybody keep quiet while I put the matter up to him!\"  \n\nThe rat entered the barn the way he always did­ creeping along close to the wall.  \n\n\"What's up?\" he asked, seeing the animals assembled. \"We're holding a directors' meeting,\" replied the old sheep.  \n\n\"Well, break it up!\" said Templeton. \"Meetings bore me.\" And the rat began to climb a rope that hung against the wall.  \n\n\"Look,\" said the old sheep, \"next time you go to the dump, Templeton, bring back a clipping from a magazine. Charlotte needs new ideas so she can write messages in her web and save Wilbur's life.\"  \n\n\"Let him die,\" said the rat. \"I should worry.\"  \n\n\"You'll worry all right when next winter comes,\" said the sheep. \"You'll worry all right on a zero morn­ ing next January when Wilbur is dead and nobody comes down here with a nice pail of warm slops to pour into the trough. Wilbur's leftover food is your chief source of supply, Templeton. You know that. Wilbur's food is your food; therefore Wilbur's destiny and your destiny are closely linked. If Wilbur is killed and his trough stands empty day after day, you'll grow so thin we can look right through your stomach and see objects on the other side.\"  \n\n# A Meeting  \n\nTempleton's whiskers quivered.  \n\n\"Maybe you're right,\" he said gruffly. \"I'm making a trip to the dump tomorrow afternoon. I'll bring back a magazine clipping if I can find one.\"  \n\n\"Thanks,\" said Charlotte. \"The meeting is now ad­ journed. I have a busy evening ahead of me. I've got to tear my web apart and write 'Terrific.' \"  \n\nWilbur blushed. \"But I'm not terrific, Charlotte. I'm just about average for a pig.\"  \n\n\"You're terrific as far as I'm concerned,\" replied Charlotte, sweetly, \"and that's what counts. You're my best friend, and I think you're sensational. Now stop arguing and go get some sleep!\"  \n\nChapter XIII  \n\n# Good Progress  \n\nter. She left the radial lines alone, as they were needed for support. As she worked, her eight legs were a great help to her. So were her teeth. She loved to weave and she was an expert at it. When she was finished ripping things out, her web looked something like this:  \n\n![](images/image_9.jpg)  \n\nA spider can produce several kinds of thread. She uses a dry, tough thread for foundation",
    "chunk_order_index": 6,
    "full_doc_id": "doc-c91e729d8909ae8a0a51a6f7fd241fee"
  },
  "chunk-2a5bb81c871a434bad8471ea8a9ef202": {
    "tokens": 1200,
    "content": "sleep!\"  \n\nChapter XIII  \n\n# Good Progress  \n\nter. She left the radial lines alone, as they were needed for support. As she worked, her eight legs were a great help to her. So were her teeth. She loved to weave and she was an expert at it. When she was finished ripping things out, her web looked something like this:  \n\n![](images/image_9.jpg)  \n\nA spider can produce several kinds of thread. She uses a dry, tough thread for foundation lines, and she uses a sticky thread for snare lines-the ones that catch and hold insects. Charlotte decided to use her dry thread for writing the new message.  \n\n\"If I write the word 'Terrific' with sticky thread,\" she thought, \"every bug that comes along will get stuck in it and spoil the effect.\"  \n\n\"Now let's see, the first letter is T.\"  \n\nCharlotte climbed to a point at the top of the left hand side of the web. Swinging her spinnerets into posi­ tion, she attached her бhread and then dropped down. As she dropped, her spinning tubes went into action and she let out thread. At the bottom, she attached the thread. This formed the upright part of the letter T. Charlotte was not satisfied, however. She climbed up and made another attachment, right next to the first. Then she carried the line down, so that she had a double line instead of a single line. \"It will show up better if I make the whole thing with double lines.\"  \n\nShe climbed back up, moved over about an inch to the left, touched her spinnerets to the web, and then carried a line across to the right, forming the top of the T. She repeated this, making it double. Her eight legs were very busy helping.  \n\n\"Now for the E! \"  \n\nCharlotte got so interested in her work, she began to talk to herself, as though to cheer herself on. If you had been sitting quietly in the barn cellar that evening, you would have heard something like this:  \n\n\"Now for the R! Up we go! Attach! Descend! Pay out line! Whoa! Attach! Good! Up you go! Repeat! Attach! Descend! Pay out line. Whoa, girl! Steady now! Attach! Climb! Attach! Over to the right! Pay out line! Attach! Now right and down and swing that loop and around and around! Now in to the left! Attach! Climb! Repeat! O.K.! Easy, keep those lines together! Now, then, out and do\\vn for the leg of the R! Pay out line!  Whoa! Attach!  Ascend! Repeat! Good girl! \"  \n\nAnd so, talking to herself, the spider worked at her diffciult task. When it was completed, she felt hungry. She ate a small bug that she had been saving. Then she slept.  \n\nNext morning, Wilbur arose and stood beneath the web. He breathed the morning air into his lungs. Drops of dew, catching the sun, made the web stand out clearly. When Lurvy arrived with breakfast, there was the handsome pig, and over him, woven neatly in block letters, was the word TERRIFIC. Another miracle.  \n\nLurvy rushed and called Mr. Zuckerman. Mr. Zuck­ erman rushed and called Mrs. Zuckerman. Mrs. Zuck­ erman ran to the phone and called the Arables. The Arables climbed into their truck and hurried over.  \n\n![](images/image_10.jpg)  \n\nEverybody stood at the pigpen and stared at the web and read the word, over and over, while Wilbur, who really felt terrific, stood quietly swelling out his chest and swinging his snout from side to side.  \n\n\"Terrific!\" breathed Zuckerman, in joyful admira­ tion. \"Edith, you better phone the reponer on the Weekly Chronicle and tell him what has happened. He will want to know about this. He may want to bring a photographer. There isn't a pig in the whole state that is as terrific as our pig.\"  \n\nThe news spread. People who had journeyed to see Wilbur when he was \"some pig\" came back again to see him now that he was \"terrific.\"  \n\nThat afternoon, when Mr. Zuckerman went to milk the cows and clean out the tie-ups, he was still thinking about what a wondrous pig he owned.  \n\n\"Lurvy!\" he called. \"There is to be no more cow manure thrown down into that pigpen. I have a terrific pig. I want that pig to have clean, bright straw every day for his bedding. Understand?\"  \n\n\"Yes, sir,\" said Lurvy.  \n\n\"Furthermore,\" said Mr. Zuckerman, \"I want you to start building a crate for Wilbur. I have decided to take the pig to the County Fair on September sixth. Make the crate large and paint it green with gold letters! \"  \n\n\"What will the letters say?\" asked Lurvy. \"They should say Zuckerman's Famous Pig.\"  \n\nLurvy picked up a pitchfork and walked away to get some clean straw. Having such an important pig was going to mean plenty of extra work, he could see that.  \n\nBelow the apple orchard, at the end of a path, was the dump where Mr. Zuckerman threw all sorts of trash and stuff that nobody wanted any more. Here, in a small clearing hidden by young alders and wild raspberry bushes, was an astonishing pile of old bottles and empty tin cans and dirty rags and bits of metal and broken bottles and broken hinges and broken springs and dead batteries and last month's magazines and old discarded dishmops and tattered overalls and rusty spikes and leaky pails and",
    "chunk_order_index": 7,
    "full_doc_id": "doc-c91e729d8909ae8a0a51a6f7fd241fee"
  },
  "chunk-c376858a7f20ef13f1444e16e78edb12": {
    "tokens": 1200,
    "content": "at the end of a path, was the dump where Mr. Zuckerman threw all sorts of trash and stuff that nobody wanted any more. Here, in a small clearing hidden by young alders and wild raspberry bushes, was an astonishing pile of old bottles and empty tin cans and dirty rags and bits of metal and broken bottles and broken hinges and broken springs and dead batteries and last month's magazines and old discarded dishmops and tattered overalls and rusty spikes and leaky pails and forgotten stoppers and useless junk of all kinds, including a wrong-size crank for a broken ice-cream freezer.  \n\nTempleton knew the dump and liked it. There were good hiding places there-excellent cover for a rat. And there was usually a tin can with food still clinging to the inside.  \n\nTempleton  was  down  there  now,  rummaging around. When he returned to the bam, he carried in his mouth an advertisement he had tom from a crum­ pled magazine.  \n\n\"How's this?\" he asked, showing the ad to Charlotte.  \n\n\"It says 'Crunchy.' 'Crunchy' would be a good word to write in your web.\"  \n\n\"Just the wrong idea,\" replied Charlotte. \"Couldn't be worse. We don't want Zuckerman to think Wilbur is crunchy.  He might start thinking about crisp, crunchy bacon and tasty ham. That would put ideas into his head. We must advertise Wilbur's noble qual­ ities, not his tastiness. Go get another word, please, Templeton!\"  \n\n![](images/image_11.jpg)  \n\nThe rat looked disgusted. But he sneaked away to the dump and was back in a while with a strip of cotton cloth. \"How's this?\" he asked. \"It's a label off an old shirt.\"  \n\nCharlotte  examined  the  label.  It  said  PRE­ SHRUNK.  \n\n\"I'm sorry, Templeton,\" she said, \"but 'Pre-shrunk' is out of the question. We want Zuckerman to think Wilbur is nicely filled out, not all shrunk up. I'll have to ask you to try again.\"  \n\n\"What do you think I am, a messenger boy?\" grumbled the rat. \"I'm not going to spend all my time chasing down to the dump after advertising material.\"  \n\n\"Just once more-please!\" said Charlotte.  \n\n\"I'll tell you what I'll do,\" said Templeton. \"I know where there's a package of soap flakes in the woodshed. It has writing on it. I'll bring you a piece of the pack­ age.\"  \n\nHe climbed the rope that hung on the wall and dis­ appeared through a hole in the ceiling. When he came back he had a strip of blue-and-white cardboard in his teeth.  \n\n\"There!\" he said, triumphantly. \"How's that?\"  \n\nCharlotte read the words:  \"With New Radiant Action.\"  \n\n\"What does it mean?\" asked Charlotte, who had never used any soap flakes in her life.  \n\n\"How should I know?\" said Templeton. \"You asked for words and I brought them. I suppose the next thing you'll want me to fetch is a dictionary.\"  \n\nT ogerher they studied the soap ad. \" 'With new radiant action,' \" repeated Charlotte, slowly. \"Wilbur!\" she called.  \n\nWilbur, who v:as asleep in the straw, jumped up.  \n\n\"Run around!\" commanded Charlotte. \"I want to see you in action, to see if you are radiant.\"  \n\nWilbur raced to the end of his yard.  \n\n\"Now back again, faster!\" said Charlotte.  \n\nWilbur galloped back. His skin shone. His tail had a fine, tight curl in it.  \n\n\"Jump into the air!\" cried Charlotte.   \nWilbur jumped as high as he could.  \n\n\"Keep your knees straight and touch the ground with your ears!\" called Charlotte.  \n\n![](images/image_12.jpg)  \n\n# Wilbur obeyed.  \n\n\"Do a back flip with a half twist in it!\" cried Char­ lotte.  \n\nWilbur went over backwards, writhing and twisting as he went.  \n\n\"O.K., Wilbur,\" said Charlotte. \"You can go back to sleep. O.K., Templeton, the soap ad will do, I guess. I'm not sure Wilbur's action is exactly radiant, but it's interesting.\"  \n\n\"Actually,\" said Wilbur, \"I feel radiant.\"  \n\n\"Do you?\" said Charlotte, looking at him with affection. \"Well, you're a good little pig, and radiant you shall be. I'm in this thing pretty deep now-I might as well go the limit.\"  \n\nTired from his romp, Wilbur lay down in the clean straw. He closed his eyes. The straw seemed scratchy -not as comfonable as the cow manure, which was always delightfully soft to lie in. So he pushed the straw to one side and stretched out in the manure. Wilbur sighed. It had been a busy day-his first day of being terrific. Dozens of people had visited his yard during the afternoon, llnd he had had to stand and pose, looking as terrific as he could. Now he was tired. Fern had arrived and seated herself quietly on her stool in the corner.  \n\n\"Tell me a story, Charlotte!\" said Wilbur, as he lay waiting for sleep to come. \"Tell me a story!\"  \n\nSo Charlotte, although she, too, was tired, did what Wilbur wanted.  \n\n\"Once upon a time,\" she began, \"I had a beautiful cousin who managed to build her web across a small stream. One day a tiny fish leaped into the air and got tangled in the web. My cousin was very much sur­ prised, of course. The fish was thr",
    "chunk_order_index": 8,
    "full_doc_id": "doc-c91e729d8909ae8a0a51a6f7fd241fee"
  },
  "chunk-f4bddce6de487359621fa3a88599dcc6": {
    "tokens": 1200,
    "content": "Charlotte!\" said Wilbur, as he lay waiting for sleep to come. \"Tell me a story!\"  \n\nSo Charlotte, although she, too, was tired, did what Wilbur wanted.  \n\n\"Once upon a time,\" she began, \"I had a beautiful cousin who managed to build her web across a small stream. One day a tiny fish leaped into the air and got tangled in the web. My cousin was very much sur­ prised, of course. The fish was thrashing wildly. My cousin hardly dared tackle it. But she did. She swooped down and threw great masses of wrapping material around the fish and fought bravely to capture it.\"  \n\n![](images/image_13.jpg)  \n\n\"Did she succeed?\" asked Wilbur.  \n\n\"It was a never-to-be-forgotten battle,\" said Char­ lotte. \"There was the fish, caught only by one fin, and its tail wildly thrashing and shining in the sun. There was the web, sagging dangerously under the weight of the fish.\"  \n\n\"How much did the fish weigh?\" asked Wilbur eagerly.  \n\n\"I don't know,\" said Charlotte. \"There was my cousin, slipping in,  dodging out, beaten mercilessly over the head by the wildly thrashing fish, dancing in, dancing out, throwing her threads and fighting hard. First she threw a left around the tail. The fish lashed back. Then a left to the tail and a right to the mid­ section. The fish lashed back. Then she dodged to one side and threw a right, and another right to the fin. Then a hard left to the head, while the web swayed and stretched.\"  \n\n\"Then what happened?\" asked Wilbur.  \n\n\"Nothing,\" said Charlotte. \"The fish lost the fight. My cousin wrapped it up so tight it couldn't budge.\"  \n\n\"Then what happened?\" asked Wilbur.  \n\n\"Nothing,\" said Charlotte. \"My cousin kept the fish for a while, and then, when she got good and ready, she ate it.\"  \n\n\"Tell me another story!\" begged Wilbur.  \n\nSo Charlotte told him about another cousin of hers who was an aeronaut.  \n\n\"What is an aeronaut?\" asked Wilbur.  \n\n\"A balloonist,\" said Charlotte. \"My cousin used to stand on her head and let out enough thread to form a balloon. Then she'd let go and be lifted into the air and carried upward on the warm wind.\"  \n\n\"Is that true?\" asked Wilbur. \"Or are you just making it up?\"  \n\n\"It's true,\" replied Charlotte. \"I have some very remarkable cousins. And now, Wilbur, it's time you went to sleep.\"  \n\n\"Sing something!\" begged Wilbur, closing his eyes. So Charlotte sang a lullaby, while crickets chirped in the grass and the barn grew dark. This was the song she sang.  \n\n\"Sleep, sleep, my love, my only,   \nDeep, deep, in the dung and the dark;   \nBe not afraid and be not lonely!   \nThis is the hour when frogs and thrushes   \nPraise the world from the woods and the rushes. Rest from care, my one and only,   \nDeep in the dung :md the dark!\"  \n\nBut Wilbur was already asleep. When the song ended, Fern got up and went home.  \n\n# Chapter XIV  \n\n# Dr. Dorian  \n\nNEXT day was Saturday. Fern stood at the kitchen sink drying the breakfast dishes as her mother washed them. Mrs.  \n\n1 Arable worked silently. She hoped Fern would go out and play with other children, instead of heading for the Zuckermans' bam to sit and watch animals.  \n\n\"Charlotte is the best storyteller I ever heard,\" said Fern, poking her dish towel into a cereal bowl.  \n\n\"Fern,\" said her mother sternly, \"you must not in­ vent things. You know spiders don't tell stories. Spiders can't talk.\"  \n\n\"Charlotte can,\" replied Fern.  \"She doesn't talk very loud, but she talks.\"  \n\n\"What kind of story did she tell?\" asked Mrs. Arable.  \n\n\"Well,\" began Fern, \"she told us about a cousin of hers who caught a fish in her web. Don't you think that's fascinating?\"  \n\n\"Fern, dear, how would a fish get in a spider's web?\" said Mrs. Arable. \"You know it couldn't happen. You're making this up.\"  \n\n\"Oh, it happened all right,\" replied F em. \"Charlotte never fibs. This cousin of hers built a web across a stream. One day she was hanging around on the web and a tiny fish leaped into the air and got tangled in the web. The fish was caught by one fin, Mother; its tail was wildly thrashing and shining in the sun. Can't you just see the web, sagging dangerously under the weight of the fish? Charlotte's cousin kept slipping in, dodging out, and she was beaten mercilessly over the head by the wildly thrashing fish, dancing in, dancing out, throwmg . . .  \n\n\"Fern!\" snapped her mother. \"Stop it! Stop invent­ ing these wild tales! \"  \n\n\"I'm not inventing,\" said Fern. \"I'm just telling you the facts.\"  \n\n\"What finally happened?\" asked her mother, whose curiosity began to get the better of her.  \n\n\"Charlotte's cousin won. She wrapped the fish up, then she ate him when she got good and ready. Spiders have to eat, the same as the rest of us.\"  \n\n\"Yes, I suppose they do,\" said Mrs. Arable, vaguely.  \n\n\"Charlotte has another cousin who is a balloonist. She stands on her head, lets out a lot of line, and is car­ ried aloft on the wind. Mother, wouldn't you simply",
    "chunk_order_index": 9,
    "full_doc_id": "doc-c91e729d8909ae8a0a51a6f7fd241fee"
  },
  "chunk-4fc4d4f193065cd59d45ad3f038fc420": {
    "tokens": 1200,
    "content": "of her.  \n\n\"Charlotte's cousin won. She wrapped the fish up, then she ate him when she got good and ready. Spiders have to eat, the same as the rest of us.\"  \n\n\"Yes, I suppose they do,\" said Mrs. Arable, vaguely.  \n\n\"Charlotte has another cousin who is a balloonist. She stands on her head, lets out a lot of line, and is car­ ried aloft on the wind. Mother, wouldn't you simply love to do that?\"  \n\n\"Yes, I would, come to think of it,\" replied Mrs. Arable. \"But Fern, darling, I wish you would play outdoors today instead of going to Uncle Homer's barn. Find some of your playmates and do something nice outdoors. You're spending too much time in that bam -it isn't good for you to be alone so much.\"  \n\n\"Alone?\" said Fern. \"Alone? My best friends are in the barn cellar. It is a very sociable place. Not at all lonely.\"  \n\nFern disappeared after a while, walking down the road toward Zuckermans'. Her mother dusted the sitting room. As she worked she kept thinking about Fern. It didn't seem natural for a little girl to be so in­ terested in animals. Finally Mrs. Arable made up her mind she would pay a call on old Doctor Dorian and ask his advice. She got in the car and drove to his office in the village.  \n\nDr. Dorian had a thick beard. He was glad to see Mrs. Arable and gave her a comfonable chair.  \n\n\"It's about Fern,\" she explained. \"Fern spends en­ tirely too much time in the Zuckermans'  bam. It doesn't seem normal. She sits on a milk stool in a comer of the barn cellar, near the pigpen, and watches animals, hour after hour. She just sits and listens.\"  \n\nDr. Dorian leaned back and closed his eyes.  \n\n\"How enchanting!\" he said. \"It must be real nice and quiet down there. Homer has some sheep, hasn't he?\"  \n\n\"Yes,\" said Mrs. Arable. \"But it all started with that pig we let Fern raise on a bottle. She calls him Wilbur. Homer bought the pig, and ever since it left our place Fern has been going to her uncle's to be near it.\"  \n\n\"I've been hearing things about that pig,\" said Dr. Dorian, opening his eyes. \"They say he's quite a pig.\"  \n\n![](images/image_14.jpg)  \n\n\"Have you heard about the words that appeared in the spider's web?\" asked Mrs. Arable nervously.  \n\n\"Yes,\" replied the doctor.  \n\n\"Well, do you' understand it?\" asked Mrs. Arable. \"Understand what?\"  \n\n\"Do you understand how there could be any writing in a spider's web?\"  \n\n\"Oh, no,\" said Dr. Dorian. \"I don't understand it.  \n\nBut for that matter I don't understand how a spider learned to spin a web in the first place. When the words appeared, everyone said they were a miracle. But no­ body pointed out that the web itself is a miracle.\"  \n\n\"What's miraculous about a spider's web?\" said Mrs.  \n\n![](images/image_15.jpg)  \n\nArable. \"I don't see why you say a web is a miracle­ it's just a web.\"  \n\n\"Ever try to spin one?\" asked Dr. Dorian.  \n\nMrs. Arable shifted uneasily in her chair. \"No,\" she replied. \"But I can crochet a doily and I can knit a sock.\"  \n\n\"Sure,\" said the doctor. \"But somebody taught you, didn't they?\"  \n\n\"My mother taught me.\"  \n\n\"Well, who taught a spider? A young spider knows how to spin a web without any instructions from any­ body. Don't you regard that as a miracle?\"  \n\n\"I suppose so,\" said Mrs. Arable. \"I never looked at it that way before. Still, I don't understand how those words got into the web. I don't understand it, and I don't like what I can't understand.\"  \n\n\"None of us do,\" said Dr. Dorian, sighing. \"I'm a doctor. Doctors are supposed to understand everything. But I don't understand everything, and I don't intend to let it worry me.\"  \n\nMrs. Arable fidgeted. \"Fern says the animals talk to each other. Dr. Dorian, do you believe animals talk?\"  \n\n\"I never heard one say anything,\" he replied. \"But that proves nothing. It is quite possible that an animal has spoken civilly to me and that I didn't catch the remark because I wasn't paying attention. Children pay better attention than grownups. If Fern says that the animals in Zuckerman's barn talk, I'm quite ready to believe her. Perhaps if people talked less, animals would talk more. People are incessant talkers-I can give you my word on that.\"  \n\n\"Well, I feel better about Fern,\" said Mrs. Arable. \"You don't think I need worry about her?\"  \n\n\"Does she look well?\" asked the doctor. \"Oh, yes.\"  \n\n\"Appetite good?\" \"Oh, yes, she's always hungry.\"  \n\n\"Sleep well at night?\"  \n\n\"Oh, yes.\"  \n\n\"Then don't worry,\" said the doctor.  \n\n\"Do you think she'll ever start thinking about something besides pigs and sheep and geese and spiders?\"  \n\n\"How old is Fern?\"  \n\n\"She's eight.\"  \n\n\"Well,\" said Dr. Dorian, \"I think she will always love animals. But I doubt that she spends her entire life in Homer Zuckerman's bam cellar. How about boys­ does she know any boys?\"  \n\n\"She  knows  Henry  Fussy,\"",
    "chunk_order_index": 10,
    "full_doc_id": "doc-c91e729d8909ae8a0a51a6f7fd241fee"
  },
  "chunk-da87ec13f46735d836009a6315d6cd92": {
    "tokens": 1200,
    "content": "\"Then don't worry,\" said the doctor.  \n\n\"Do you think she'll ever start thinking about something besides pigs and sheep and geese and spiders?\"  \n\n\"How old is Fern?\"  \n\n\"She's eight.\"  \n\n\"Well,\" said Dr. Dorian, \"I think she will always love animals. But I doubt that she spends her entire life in Homer Zuckerman's bam cellar. How about boys­ does she know any boys?\"  \n\n\"She  knows  Henry  Fussy,\"  said  Mrs.  Arable brightly.  \n\nDr. Dorian closed his eyes again and went into deep thought. \"Henry Fussy,\" he mumbled. \"Hmm. Re­ markable. Well, I don't think you have anything to worry about. Let Fern associate with her friends in the barn if she wants to. I would say, offhand, that spiders and pigs were fully as interesting as Henry Fussy. Yet I predict that the day will come when even Henry will drop some chance remark that catches Fern's attention. It's amazing how children change from year to year. How's Avery?\" he asked, opening his eyes wide.  \n\n\"Oh, Avery,\" chuckled Mrs. Arable. \"Avery is al­ ways fine. Of course, he gets into poison ivy and gets stung by wasps and bees and brings frogs and snakes home and breaks everything he lays his hands on. He's fine.\"  \n\n\"Good!\" said the doctor.  \n\nMrs. Arable said goodbye anJ thanked Dr. Dorian very much for his advice. She felt greatly relieved.  \n\n# Chapter XV  \n\n# 'The Crickets  \n\nHE CRICKETS sang in the grasses. They sang the song of summer's ending, a sad, mo­ notonous song. \"Summer is over and gone,\" they sang. \"Over and gone, over and gone.  \n\nSummer is dying, dying.\"  \n\nThe crickets felt it was their duty to warn every­ body that summertime cannot last forever. Even on the most beautiful days in the whole year-the days when summer is changing into fall-the crickets spread the rumor of sadness and change.  \n\nEverybody heard the song of the crickets. Avery and Fern Arable heard it as they walked the dusty road. They knew that school would soon begin again. The young geese heard it and knew that they would never be little goslings again. Charlotte heard it and knew that she hadn't much time left. Mrs. Zuckerman, at work in the kitchen, heard the crickets, and a sadness came over her, too. \"Another summer gone,\" she sighed. Lurvy, at work building a crate for Wilbur, heard the song and knew it was time to dig potatoes.  \n\n\"Summer is over and gone,\" repeated the crickets. \"How  many nights till frost?\" sang the crickets. \"Good-bye, summer, good-bye, good-bye! \"  \n\nThe sheep heard the crickets, and they felt so uneasy they broke a hole in the pasture fence and wandered up into the field across the road. The gander discovered the hole and led his family through, and they walked to the orchard and ate the apples that were lying on the ground. A little maple tree in the swamp heard the cricket song and turned bright red with anxiety.  \n\nWilbur was now the center of attraction on the farm. Good food and regular hours were showing results: vVilbur was a pig any man would be proud of. One day more than a hundred people carne to stand at his yard and admire him. Charlotte had written the word RA­ DIANT, and Wilbur really looked radiant as he stood in the golden sunlight. Ever since the spider had be­ friended him, he had done his best to live up to his repu­ tation. When Charlotte's web said SOME PIG, Wilbur had tried hard to look like some pig. When Charlotte's web said TERRIFIC, Wilbur had tried to look terrific. And now that the web said RADIANT, he did every­ thing possible to make himself glow.  \n\nIt is not easy to look radiant, but Wilbur threw him­ self into it with a will. He would turn his head slightly and blink his long eye-lashes. Then he would breathe deeply. And when his audience grew bored, he would spring into the air and do a back flip with a half twist. At this the crowd would yell and cheer. \"How's that for a pig?\" Mr. Zuckerman would ask, well pleased with himself. \"That pig is radiant.\"  \n\nSome of Wilbur's friends in the barn worried for fear all this attention would go to his head and make him stuck up. But it never did. Wilbur was modest; fame did not spoil him. He still worried some about the future, as he could hardly believe that a mere spider would be able to save his life. Sometimes at night he would have a bad dream. He would dream that men were coming to get him with knives and guns. But that was only a dream. In the daytime, Wilbur usually felt happy and confident. No pig ever had truer friends, and he realized that friendship is one of the most satis­ fying things in the world. Even the song of the crickets did not make Wilbur too sad. He knew it was almost time for the County Fair, and he was looking forward to the trip. If he could distinguish himself at the Fair, and maybe win some prize money, he was sure Zucker­ man would let him live.  \n\nCharlotte had worries of her own, but she kept quiet about them. One morning Wilbur asked her about the Fair.  \n\n\"You're going with me, aren't you, Charlotte?\" he said.  \n\n\"Well, I don't know,\" replied Charlotte. \"The Fair comes at a bad time for me",
    "chunk_order_index": 11,
    "full_doc_id": "doc-c91e729d8909ae8a0a51a6f7fd241fee"
  },
  "chunk-e49223905f9e7bb8908e24abc7825c81": {
    "tokens": 1200,
    "content": "County Fair, and he was looking forward to the trip. If he could distinguish himself at the Fair, and maybe win some prize money, he was sure Zucker­ man would let him live.  \n\nCharlotte had worries of her own, but she kept quiet about them. One morning Wilbur asked her about the Fair.  \n\n\"You're going with me, aren't you, Charlotte?\" he said.  \n\n\"Well, I don't know,\" replied Charlotte. \"The Fair comes at a bad time for me. I shall find it inconvenient to leave home, even for a few days.\"  \n\n\"Why?\" asked Wilbur.  \n\n\"Oh, I just don't feel like leaving my web. Too much going on around here.\"  \n\n\"Please come with me!\" begged Wilbur. \"I need you, Charlotte. I can't stand going to the Fair without you. You've just got to come.\"  \n\n\"No,\" said Charlotte, \"I believe I'd better stay home and see if I can't get some work done.\"  \n\n\"What kind of work?\" asked Wilbur.  \n\n\"Egg laying. It's time I made an egg sac and filled it with eggs.\"  \n\n\"I didn't know you could lay eggs,\" said Wilbur in amazement.  \n\n\"Oh, sure,\" said the spider. \"I'm versatile.\"  \n\n\"What does 'versatile' mean-full of eggs?\" asked Wilbur.  \n\n\"Certainly not,\" said Charlotte. \" 'Versatile' means I can turn with ease from one thing to another. It means I don't have to limit my activities to spinning and trap­ ping and stunts like that.\"  \n\n\"Why don't you come with me to the Fair Grounds and lay your eggs there?\" pleaded Wilbur. \"It would be wonderful fun.\"  \n\nCharlotte gave her web a twitch and moodily watched it sway. \"I'm afraid not,\" she said. \"You don't know the first thing about egg laying, Wilbur. I can't arrange my family duties to suit the management of the County Fair. When I get ready to lay eggs, I have to lay eggs, Fair or no Fair. However, I don't want you to worry about it-you might lose weight. We'll leave it this way: I'll come to the Fair if I possibly can.\"  \n\n\"Oh, good!\" said Wilbur. \"I knew you wouldn't for­ sake me just when I need you most.\"  \n\nAll that day Wilbur stayed inside, taking life easy in the straw. Charlotte rested and ate a grasshopper. She knew that she couldn't help Wilbur much longer. In a few days she would have to drop everything and build the beautiful little sac that would hold her eggs.  \n\n# Chapter XVI  \n\n# Off to the Fair  \n\nHE NIGHT before the County Fair, every­ body went to bed early. Fern and Avery were in bed by eight. Avery lay dreaming that the Ferris wheel had stopped and that he was in the top car. Fern lay dreaming that she was getting sick in the swings.  \n\nLurvy was in bed by eight-thirty. He lay dreaming that he was throwing baseballs at a cloth cat and winning a genuine Navajo blanket. Mr. and Mrs. Zuckerman were in bed by nine. Mrs. Zuckerman lay dreaming about a deep freeze unit. Mr. Zuckerman lay dreaming about Wilbur. He dreamt that Wilbur had grown until he was one hundred and sixteen feet long and ninety-two feet high and that he had won all the prizes at the Fair and was covered with blue ribbons and even had a blue ribbon tied to the end of his tail.  \n\n![](images/image_16.jpg)  \n\nDown in the barn cellar, the animals, too, went to sleep early, all except Charlotte. Tomorrow would be Fair Day. Every creature planned to get up early to see Wilbur off on his great adventure.  \n\nWhen morning came, everybody got up at daylight. The day was hot. Up the road at the Arables' house, Fern lugged a pail of hot water to her room and took a sponge bath. Then she put on her prettiest dress be­ cause she knew she would see boys at the Fair. Mrs. Arable scrubbed the back of Avery's neck, and wet his hair, and parted it, and brushed it down hard till it stuck to the top of his head-all but about six hairs that stood straight up. Avery put on clean underwear, clean blue jeans, and a clean shirt. Mr. Arable dressed, ate breakfast, and then went out and polished his truck. He had offered to drive everybody to the Fair, includ­ ing Wilbur.  \n\nBright and early, Lurvy put clean straw in Wilbur's crate and lifted it into the pigpen. The crate was green. In gold letters it said:  \n\n# ZUCKERMAN'S FAMOUS PIG  \n\nCharlotte had her web looking fine for the occasion. Wilbur ate his breakfast slowly. He tried to look ra­ diant without getting food in his ears.  \n\nIn the kitchen, Mrs. Zuckerman suddenly made an announcement.  \n\n\"Homer,\" she said to her husband, \"I am going to give that pig a buttermilk bath.\"  \n\n\"A what?\" said Mr. Zuckerman.  \n\n\"A buttermilk bath. My grandmother used to bathe her pig with buttermilk when it got dirty-1 just re­ membered.\"  \n\n\"Wilbur's not dirty,\" said Mr. Zuckerman proudly.  \n\n\"He's filthy behind the ears,\" said Mrs. Zuckerman. \"Every time Lurvy slops him, the food runs down around the ears. Then it dries and forms a crust. He also has a smudge on one side where he lays in the manure.\"  \n\n\"He lays in clean straw,\" corrected Mr. Zuckerman. \"Well, he's dirty, and he's going to have a bath.\"  \n\nMr. Z",
    "chunk_order_index": 12,
    "full_doc_id": "doc-c91e729d8909ae8a0a51a6f7fd241fee"
  },
  "chunk-e6d5713ca7b6dd74608a2636e04ae13a": {
    "tokens": 663,
    "content": "not dirty,\" said Mr. Zuckerman proudly.  \n\n\"He's filthy behind the ears,\" said Mrs. Zuckerman. \"Every time Lurvy slops him, the food runs down around the ears. Then it dries and forms a crust. He also has a smudge on one side where he lays in the manure.\"  \n\n\"He lays in clean straw,\" corrected Mr. Zuckerman. \"Well, he's dirty, and he's going to have a bath.\"  \n\nMr. Zuckerman sat down weakly and ate a doughnut. His wife went to the woodshed. When she re­ turned, she wore rubber boots and an old raincoat, and she carried a bucket of buttermilk and a small wooden paddle.  \n\n\"Edith, you're crazy,\" mumbled Zuckerman.  \n\nBut she paid no attention to him. Together they walked to the pigpen. Mrs. Zuckerman wasted no time. She climbed in with Wilbur and went to work. Dipping her paddle in the buttennilk, she rubbed him al over. The geese gathered around to see the fun, and so did the sheep and lambs. Even Templeton poked his head out cautiously, to watch Wilbur get a buttermilk bath. Charlotte got so interested, she lowered herself on a dragline so she could see better. Wilbur stood still and closed his eyes. He could feel the buttennilk trick­ ling down his sides. He opened his mouth and some buttennilk ran in. It was delicious. He felt radiant and happy. When Mrs. Zuckennan got through and rubbed him dry, he was the deanest, prettiest pig you ever saw.  \n\n![](images/image_17.jpg)  \n\nHe was pure white, pink around the ears and snout, and smooth as silk.  \n\nThe Zuckermans went up to change into their best clothes. Lurvy went to shave and put on his plaid shirt and his purple necktie. The animals were left to them­ selves in the bam.  \n\nThe seven goslings paraded round and round their mother.  \n\n\"Please, please, please take us to the Fair!\" begged a gosling. Then all 6even began teasing to go.  \n\n\"Please, please, please, please, please, please . . .   \nThey made quite a racket.  \n\n\"Children!\" snapped the  goose.  \"We're staying quietly-ietly-ietly at home. Only Wilbur-ilbur-ilbur is going to the Fair.\"  \n\nJust then Charlotte interrupted.  \n\n\"I shall go, too,\" she said, softly. \"I have decided to go with Wilbur. He may need me. We can't tell what may happen at the Fair Grounds. Somebody's got to go along who knows how to write. And I think Temple­ ton better come, too-l might need somebody to run errands and do general work.а'  \n\n\"I'm staying right here,\" grumbled the rat. \"I haven't the slightest interest in fairs.\"  \n\n\"That's because you've never been to one,\" remarked the old sheep. \"A fair is a rat's paradise. Everybody spills food at a fair. A rat can creep out late at night and",
    "chunk_order_index": 13,
    "full_doc_id": "doc-c91e729d8909ae8a0a51a6f7fd241fee"
  }
}