{
  "chunk-84ace6753f0e3d29d1edddce0663ee70": {
    "tokens": 1200,
    "content": "VOL. CLXXII . . . No. 59,723 © 2023  The New York Times Company  \n\nNEW YORK, FRIDAY, MARCH 10, 2023  \n\n![](images/image_1.jpg)  \nGreg Mascher with his granddaughter Raylix. It could be months, if ever, before health officials have answers about East Palestine.  \n\n# D.A. Signaling Trump Is Likely To Be Charged  \n\nThis article is by William K. Rashbaum, Ben Protess and Jonah E. Bromwich.  \n\nThe Manhattan district attorney’s office recently signaled to Donald J. Trump’s lawyers that he could face criminal charges for his role in the payment of hush money to a porn star, the strongest indication yet that prosecutors are nearing an indictment of the former president, according to four people with knowledge of the matter. The  prosecutors  offered  Mr. Trump the chance to testify next week before the grand jury that has been hearing evidence in the potential case, the people said. Such offers almost always indicate an indictment is close; it would be unusual for the district attorney, Alvin L. Bragg, to notify a potential defendant without ultimately seeking charges against him.  \n\nIn New York, potential defendants have the right to answer questions in the grand jury before they are indicted, but they rarely testify, and Mr. Trump is likely to decline  the  offer.  His  lawyers could also meet privately with the prosecutors in hopes of fending off criminal charges.  \n\nAny case would be the first indictment of a former American president and could upend the 2024 presidential race in which Mr. Trump remains a leading contender. It would also elevate Mr. Bragg  to  the  national  stage, though not without risk, and a conviction in the complex case is far from assured.  \n\nMr. Trump has faced an array of criminal investigations and special counsel inquiries over the years but has never been charged with a crime, underscoring the  \n\n# After Derailment, Health Fears in an Ohio Town  \n\n# By EMILY BAUMGAERTNER  \n\nEAST PALESTINE, Ohio — When the railroad crossing gate lowered in front of Greg Mascher’s Chevy Tahoe, his youngest granddaughter shrank down in the back seat and pulled a worn American flag blanket over her eyes. She worried that the train was going to wreck — again. “Tell  me  when  it’s  all  over, Papa,” his granddaughter, Raylix, 7, pleaded as the rail cars rumbled through — ones much like the Norfolk Southern cars that had derailed here almost three weeks earlier, resulting in a toxic spill that appeared to cause symptoms of chemical poisoning in hundreds of households.  \n\n# Absence of Information  \n\nAdds to Concern for Long-Term Effects  \n\nMr. Mascher, 61, who is raising three  granddaughters  with  his wife, Traci, had not sent them back to school since they had developed  rashes,  vomiting  and headaches. He glanced at Raylix, still cowering under the blanket, in his rearview mirror. “When it’s all over, huh?” he sighed,  adjusting  the  crucifix around his neck. “Not sure anybody can tell you girls that.” Mobile health clinics and camera crews have begun to pack up and leave this town of 4,700, but for the Mascher family and their neighbors, frightening questions remain: How could they know if they had been poisoned by the spill? Were toxins still lingering in the air, the water and the soil surrounding  their  houses?  Would they develop lifelong health problems? And would the relatives who had evacuated the town — like Mr. Mascher’s daughter, her husband and their three daughters, cousins who are like sisters to Raylix — come back?  \n\nOn Thursday, the chief executive of Norfolk Southern, Alan H. Shaw, encountered more angry questions, when he appeared beContinued on Page A14  \n\n![](images/image_2.jpg)  \n\n# A Race to Clear Roofs  \n\nContinued on Page A18  \n\nAfter blizzards, the Lake Tahoe region braced for rain and the risk of collapsing ceilings. Page A18.  \n\n# As Legacy of Elvis Is Rekindled, the Family Fights Over His Estate  \n\n# By MATT STEVENS  \n\nWhen the camera panned to Priscilla Presley and her daughter, Lisa Marie, they appeared enraptured.  \n\nAustin Butler had rekindled the good memories of Elvis with his portrayal in a lauded biopic. And for a few magical minutes on that January evening, Mr. Butler was there, on the stage at the Golden Globes, conjuring the voice and radiating the charm of the King of Rock ’n’ Roll as he accepted a best actor award.  \n\nLisa Marie clasped her hands around  her  mouth.  Priscilla placed her hand on her heart. Mother and daughter had had their run-ins over the years, but they  were  together  again nestled at a table, like family.  \n\n# Ex-Wife Sues to Steer a Trust’s Millions  \n\n“One of the greatest nights of my career,” said Jerry Schilling, a Presley family friend and business associate who escorted Lisa Marie that evening.  \n\nBut days later, the sadness that has long trailed the family had again taken hold. Lisa Marie, only 54, died suddenly. Within weeks, Priscilla, who had long helped administer Elvis’s estate, went to court to challenge the validity of documents that say her granddaughter,  the  actress  Riley Keough, is now the sole trustee.  \n\n# In \\$6.8 Trillion Budget,  \n\n# Biden Seeks to Tax Rich And Increase Social Aid  \n\nNEWS ANALYSIS   \nA Move to Recapture   \nCentrist Identity  \n\nfor Fiscal Ruin’",
    "chunk_order_index": 0,
    "full_doc_id": "doc-b5af4142dc421a39198e3575b3c241d2"
  },
  "chunk-28dc4ea73403f05f696621b093e81a4a": {
    "tokens": 1200,
    "content": ". Lisa Marie, only 54, died suddenly. Within weeks, Priscilla, who had long helped administer Elvis’s estate, went to court to challenge the validity of documents that say her granddaughter,  the  actress  Riley Keough, is now the sole trustee.  \n\n# In \\$6.8 Trillion Budget,  \n\n# Biden Seeks to Tax Rich And Increase Social Aid  \n\nNEWS ANALYSIS   \nA Move to Recapture   \nCentrist Identity  \n\nfor Fiscal Ruin’  \n\n# By PETER BAKER  \n\nWASHINGTON — In his announcement video kicking off his presidential campaign in the spring of 2019, Joseph R. Biden Jr. never mentioned the word “deficit.” Nor did the word escape his lips when he accepted the Democratic Party nomination a year later. Nor did it appear once in the party platform he approved.  \n\nBut as he unveiled a budget proposal on Thursday, Mr. Biden made curbing the budget gap one of his centerpiece promises. The budget plan, the White House said in a statement, would strengthen the country by “reducing the deficit by nearly \\$3 trillion over the next decade.” The newfound attention to the nation’s fiscal health comes as Mr. Biden for the first time faces a Republican-controlled House bent on forcing him to pare spending, and shortly before he is expected to announce a campaign for a second term. After two years championing some of his party’s top progressive priorities, the president lately is speak ing more to the concerns of the political middle, seeking to recapture the more centrist identity that long defined him. Not only is he increasingly focused on deficit reduction, Mr. Biden last week abandoned fellow Democrats by rejecting a new District of Columbia measure reducing mandatory minimum sentences for some violent offenses, rather than be tagged as soft on crime. And more and more, his administration is turning toward tougher policies to stem a near-record-high tide of illegal immigration, including possibly reviving the practice of detaining migrant families who cross the southwestern border illegally.  \n\n“It’s a good day to be a moderate Democrat,” said Matt Bennett, head of Third Way, a centrist Democratic advocacy group. “We’re back, better than ever.” The White House, he said, understands the need to avoid allowing Republicans to outflank Democrats. “They get the necessity of keeping the high ground on culture war issues like crime and immigration.”  \n\nThat does not mean Mr. Biden has suddenly found common cause with Republicans by any means. After signing legislation adding nearly \\$5 trillion to the deficit in the next decade, according to the Congressional Budget Office, Mr. Biden proContinued on Page A12  \n\n# By JIM TANKERSLEY  \n\nWASHINGTON — President Biden on Thursday proposed a \\$6.8 trillion budget that sought to increase spending on the military and a wide range of new social programs while also reducing future budget deficits, defying Republican calls to scale back government and reasserting his economic vision before an expected re-election campaign.  \n\nThe  budget  contains  some \\$5 trillion  in  proposed  tax  increases on high earners and corporations over a decade, much of which would offset new spending programs aimed at the middle class and the poor. It seeks to reduce budget deficits by nearly \\$3 trillion over that time, compared with the country’s current path. It reaffirms Mr. Biden’s case that he can prevent the growing President Biden promoted his plan Thursday in Philadelphia debt burden from weighing on the economy while expanding spending and protecting popular safetynet programs — almost entirely by  asking  companies  and  the wealthy to pay more in taxes. But after claiming credit for a \\$1.7 trillion decline in the annual deficit over the past year, Mr. Biden now sees the deficit increasing again in the 2024 fiscal year, to \\$1.8 trillion. The jump is larger than other forecasters, like the Congressional  Budget  Office, have projected. It is driven by rising costs of servicing the national debt as the Federal Reserve raises interest rates to curb inflation and by new programs the president is proposing that are not fully offset by tax increases in their first year. The plan drew swift criticism from Republicans, who are locked in an economically perilous debate with Mr. Biden over the borrowing limit, which House conservatives refuse to raise unless he agrees to sharp spending cuts. Senator Charles E. Grassley of Continued on Page A12  \n\n![](images/image_3.jpg)  \n\n# Russia Fires Hypersonic Missiles In Largest Air Assault in Weeks  \n\n# By ANDREW E. KRAMER  \n\nKYIV,  Ukraine  — Russia launched its biggest aerial barrage in weeks on Thursday, blasting targets across Ukraine with a diverse array of weapons, including its newest hypersonic missiles, in what it said was retaliation for an armed incursion into Russian territory last week.   \nVolleys of missiles streaked into Kyiv and other cities overnight and in the predawn, setting off air raid  sirens  and  jarring  people from their sleep with thunderous booms, and killing at least six people, Ukrainian officials said.   \nThe strikes included six of the new Russian missiles known as Kinzhals, the most Russia has  \n\nused in a single wave since the war began a year ago, according to Ukraine’s Air Force. They are hypersonic — meaning they travel at more than five times the speed of sound, and Russia has hinted at much higher speeds — and can maneuver in flight, making them all but impossible to shoot down.  \n\nSeveral missiles hit electrical power plants, damaging three of them, continuing a Russian campaign to black out Ukrainian cities and  undermine  morale,  and Moscow’s forces followed their usual  tactic  of  trying  to  overwhelm air defenses with waves of Continued on Page A8  \n\n![](images/image_4.jpg)  \n\n# NATIONAL A10-19  \n\nLouisville Police Report Card The Justice Department’s findings of abusive and discriminatory",
    "chunk_order_index": 1,
    "full_doc_id": "doc-b5af4142dc421a39198e3575b3c241d2"
  },
  "chunk-13b64296070c2afd0e45e5532a07136d": {
    "tokens": 520,
    "content": "maneuver in flight, making them all but impossible to shoot down.  \n\nSeveral missiles hit electrical power plants, damaging three of them, continuing a Russian campaign to black out Ukrainian cities and  undermine  morale,  and Moscow’s forces followed their usual  tactic  of  trying  to  overwhelm air defenses with waves of Continued on Page A8  \n\n![](images/image_4.jpg)  \n\n# NATIONAL A10-19  \n\nLouisville Police Report Card The Justice Department’s findings of abusive and discriminatory behavior by the police came as no surprise to the city’s residents. PAGE A13  \n\n![](images/image_5.jpg)  \n\n# BUSINESS B1-5  \n\nRussia’s Nuclear Superstore Europe moved fast to wean itself off oil and natural gas from Russia, but severing its ties to Rosatom, its state-owned nuclear power company, is proving to be a more difficult proposition.  PAGE B1 INTERNATIONAL A4-9 End of a Philippines Icon? The government wants to replace the country’s passenger vehicles, known as jeepneys, with minibuses. PAGE A4 Africa’s Life Expectancy at Risk The rates of illnesses such as diabetes and hypertension are climbing but are rarely diagnosed or treated.  PAGE A6 Exonerated After 18 Years The Brooklyn district attorney said a flawed photo lineup helped imprison a man for a killing he did not commit. A judge ordered his release. PAGE A17 Fetterman Serving Remotely A dozen miles from the Capitol, the Democratic senator from Pennsylvania is keeping up with his work while being treated for depression. PAGE A10 WEEKEND ARTS C1-14 Focusing on Mom and Dad Larry Sultan’s photos, featured in a play and in a gallery show, raise the issue of who controls a family’s image.  PAGE C9 An Intriguing ‘Doll’s House’ Jamie Lloyd’s revival of Ibsen’s 1879 drama throbs like an episode of “CSI: Norway,” Jesse Green writes.  PAGE C1 Window Into Murdoch Empire Court filings from the Dominion Voting Systems defamation suit against Fox News have provided a peek into how Rupert Murdoch shapes coverage at his news organizations. PAGE B1  \n\n![](images/image_6.jpg)  \n\n# OPINION A22-23  \n\n# David Brooks  \n\nPAGE A23  \n\nSPORTS B6-8 J.R. Smith’s Second Act The former N.B.A. star was bored, and a little lost, when his basketball career ended, so he enrolled at an H.B.C.U. and joined the golf team. PAGE B6",
    "chunk_order_index": 2,
    "full_doc_id": "doc-b5af4142dc421a39198e3575b3c241d2"
  }
}