{
    "image_1": [
        {
            "merged_entity_name": "E.B. WHITE",
            "entity_type": "PERSON",
            "description": "The author of the book 'Charlotte's Web', also known for other works such as 'Stuart Little', and is the copyright holder for the text.",
            "source_image_entities": [
                "E.B. WHITE"
            ],
            "source_text_entities": [
                "\"E. B. WHITE\""
            ]
        },
        {
            "merged_entity_name": "GARTH WILLIAMS",
            "entity_type": "PERSON",
            "description": "The illustrator responsible for creating the pictures in 'Charlotte's Web', and is the copyright holder for the illustrations.",
            "source_image_entities": [
                "GARTH WILLIAMS"
            ],
            "source_text_entities": [
                "\"GARTH WILLIAMS\""
            ]
        },
        {
            "merged_entity_name": "GIRL",
            "entity_type": "PERSON",
            "description": "A young girl depicted on the cover, holding a pig and interacting with other animals, symbolizing Fern, the human character in the story who saves a runt pig named Wilbur.",
            "source_image_entities": [
                "GIRL"
            ],
            "source_text_entities": [
                "\"FERN\""
            ]
        },
        {
            "merged_entity_name": "PIG",
            "entity_type": "OBJECT",
            "description": "A pig being held by the girl, likely representing Wilbur, a central character in the story who is friends with Charlotte and saved by Fern.",
            "source_image_entities": [
                "PIG"
            ],
            "source_text_entities": [
                "\"WILBUR\"",
                "\"WILBUR (THE NEWBORN PIG)\""
            ]
        }
    ],
    "image_2": [
    ],
    "image_3": [
        {
            "merged_entity_name": "MR. ARABLE (JOHN ARABLE)",
            "entity_type": "PERSON",
            "description": "Fern's father, who initially plans to kill the runt pig but is persuaded by his daughter Fern to spare its life. He is involved in the farm's activities and conversations about the happenings on the farm, including the hatching of the goslings and the conspiracy to kill Wilbur.",
            "source_image_entities": [
                "MAN"
            ],
            "source_text_entities": [
                "MR. ARABLE (JOHN ARABLE)"
            ]
        },
        {
            "merged_entity_name": "FERN",
            "entity_type": "PERSON",
            "description": "An eight-year-old girl who saves a runt pig from being killed by her father. She is persistent in her efforts to save the pig, trying to pull the axe out of her father's hand and arguing that the pig couldn't help being born small. Fern later takes care of the pig, naming it Wilbur.",
            "source_image_entities": [
                "GIRL"
            ],
            "source_text_entities": [
                "FERN"
            ]
        }
    ],
    "image_4": [
        {
            "merged_entity_name": "Avery",
            "entity_type": "PERSON",
            "description": "Avery is Fern's brother, who is interested in the pig and is described as heavily armed with an air rifle and a wooden dagger, similar to the young boy with short hair, wearing a t-shirt and pants, holding a rifle over his shoulder as depicted in the image.",
            "source_image_entities": [
                "BOY"
            ],
            "source_text_entities": [
                "AVERY"
            ]
        }
    ],
    "image_5": [
        {
            "merged_entity_name": "Fern",
            "entity_type": "PERSON",
            "description": "Fern is an eight-year-old girl who saves a newborn pig from being killed by her father and takes care of it, naming it Wilbur. She is also seen playing with a baby doll and feeding it from a bottle, similar to how she feeds Wilbur.",
            "source_image_entities": [
                "GIRL"
            ],
            "source_text_entities": [
                "FERN"
            ]
        },
        {
            "merged_entity_name": "Wilbur",
            "entity_type": "OBJECT",
            "description": "Wilbur is a white newborn piglet saved by Mr. Arable from an untimely death and given to his daughter Fern, who becomes attached to it and names it Wilbur. Fern feeds Wilbur using a baby's nursing bottle with warm milk, just as she is seen feeding a baby doll in the image.",
            "source_image_entities": [
                "BABY DOLL"
            ],
            "source_text_entities": [
                "WILBUR (THE NEWBORN PIG)"
            ]
        }
    ],
    "image_6": [
        {
            "merged_entity_name": "Fern",
            "entity_type": "PERSON",
            "description": "Fern is an eight-year-old girl who saves a runt pig from being killed by her father and takes care of it, naming it Wilbur. She is also seen interacting with a small animal and is跪在草地上.",
            "source_image_entities": [
                "GIRL"
            ],
            "source_text_entities": [
                "FERN"
            ]
        },
        {
            "merged_entity_name": "Wilbur",
            "entity_type": "ANIMAL",
            "description": "Wilbur is a white newborn piglet saved by Mr. Arable from an untimely death and given to his daughter Fern, who becomes attached to it and names it Wilbur. He is the small furry animal, possibly a puppy or a kitten, near the girl in the image.",
            "source_image_entities": [
                "SMALL ANIMAL"
            ],
            "source_text_entities": [
                "WILBUR (THE NEWBORN PIG)"
            ]
        },
        {
            "merged_entity_name": "The Apple Tree",
            "entity_type": "GEO",
            "description": "The Apple Tree is mentioned as the location where Mr. Arable fixes a small yard for Wilbur, providing a natural shelter and a place for the pig to live outdoors, and is also the tree with dense foliage providing shade over the scene in the image.",
            "source_image_entities": [
                "TREE"
            ],
            "source_text_entities": [
                "THE APPLE TREE"
            ]
        }
    ],
    "image_7": [
        {
            "merged_entity_name": "Fern",
            "entity_type": "PERSON",
            "description": "Fern is a young girl who receives a newborn pig from her father and takes care of it, naming it Wilbur. She is also seen tending to a baby in a stroller, which is likely Wilbur, and is very attached to him, ensuring his comfort and well-being.",
            "source_image_entities": [
                "WOMAN"
            ],
            "source_text_entities": [
                "FERN",
                "FERN"
            ]
        },
        {
            "merged_entity_name": "Wilbur",
            "entity_type": "PERSON",
            "description": "Wilbur, also known as Wilbur the newborn pig, is a character who is cared for by Fern. He is depicted as a baby lying in a stroller, appearing to be asleep or resting. He is later sold to Uncle Homer and moved to live in a manure pile in the cellar of Zuckerman's barn.",
            "source_image_entities": [
                "BABY"
            ],
            "source_text_entities": [
                "WILBUR (THE NEWBORN PIG)",
                "WILBUR"
            ]
        }
    ],
    "image_8": [
        {
            "merged_entity_name": "Wilbur",
            "entity_type": "ANIMAL",
            "description": "Wilbur is a large pig with a curly tail, eating from a trough, and is known to be a spring pig, born in springtime. He was saved from an untimely death by Mr. Arable and given to his daughter Fern, who becomes attached to him. Wilbur is moved from a box near the stove in the kitchen to a bigger box in the woodshed, and later to a small yard under an apple tree. Eventually, he is sold to Uncle Homer and taken to live in a manure pile in the cellar of Zuckerman's barn.",
            "source_image_entities": [
                "PIG"
            ],
            "source_text_entities": [
                "WILBUR (THE NEWBORN PIG)",
                "WILBUR"
            ]
        }
    ],
    "image_9": [
        {
            "merged_entity_name": "Fern",
            "entity_type": "PERSON",
            "description": "Fern is a young girl who takes care of and has a close bond with Wilbur, the pig. She is also depicted as sitting on a stool near the sheepfold, quietly watching Wilbur and gaining the trust of the sheep and geese.",
            "source_image_entities": [
                "GIRL"
            ],
            "source_text_entities": [
                "\"FERN\""
            ]
        },
        {
            "merged_entity_name": "Sheep",
            "entity_type": "ANIMAL",
            "description": "The sheep are animals in the barn that get to know and trust Fern, who sits near their pen to watch Wilbur. They are also depicted as standing behind the fence, facing the girl.",
            "source_image_entities": [
                "SHEEP"
            ],
            "source_text_entities": [
                "\"SHEEP\"",
                "\"SHEEP\""
            ]
        },
        {
            "merged_entity_name": "Goose",
            "entity_type": "ANIMAL",
            "description": "The goose is a character who takes command and gives orders to Wilbur during his escape, trying to help him evade capture. It is also shown lying on the ground in front of the fence, near the girl's feet.",
            "source_image_entities": [
                "GOOSE"
            ],
            "source_text_entities": [
                "\"THE GOOSE\"",
                "\"GEESE\""
            ]
        }
    ],
    "image_10": [
        {
            "merged_entity_name": "MR. ZUCKERMAN",
            "entity_type": "PERSON",
            "description": "Mr. Zuckerman is the owner of the pig Wilbur and makes decisions regarding his care and well-being. He is also seen mending a tool in the machine shed and later lures Wilbur back to his pen with a bucket of slops.",
            "source_image_entities": [
                "MAN"
            ],
            "source_text_entities": [
                "MR. ZUCKERMAN",
                "MR. ZUCKERMAN",
                "MR. ZUCKERMAN"
            ]
        },
        {
            "merged_entity_name": "WOMAN",
            "entity_type": "PERSON",
            "description": "This entity corresponds to Mrs. Zuckerman, who is part of the Zuckerman family and is ready to head off Wilbur if he starts for the garden, also screaming at Lurvy during the chase.",
            "source_image_entities": [
                "WOMAN"
            ],
            "source_text_entities": [
                "MRS. ZUCKERMAN",
                "MRS. ZUCKERMAN"
            ]
        }
    ],
    "image_11": [
        {
            "merged_entity_name": "The Goose",
            "entity_type": "ANIMAL",
            "description": "The goose is standing on the left side of the image, appearing to be vocalizing or reacting to the boy's actions. In the text, the goose takes command and begins to give orders to Wilbur during his escape, trying to help him evade capture.",
            "source_image_entities": [
                "GOOSE"
            ],
            "source_text_entities": [
                "THE GOOSE"
            ]
        },
        {
            "merged_entity_name": "The Sheep",
            "entity_type": "ANIMAL",
            "description": "A sheep is lying down near the center of the image, looking towards the boy. In the text, the sheep are informed about Wilbur's escape by one of the cows and pass the information along to the lambs, also giving Wilbur advice on how to evade capture.",
            "source_image_entities": [
                "SHEEP"
            ],
            "source_text_entities": [
                "THE SHEEP"
            ]
        },
        {
            "merged_entity_name": "Lurvy",
            "entity_type": "PERSON",
            "description": "Lurvy is the hired man who responds to Mrs. Zuckerman's call about Wilbur escaping and comes from the asparagus patch to help catch Wilbur, accidentally grabbing the spaniel instead of Wilbur.",
            "source_image_entities": [
                "BOY"
            ],
            "source_text_entities": [
                "LURVY"
            ]
        }
    ],
    "image_12": [
        {
            "merged_entity_name": "SHEEP",
            "entity_type": "ANIMAL",
            "description": "Sheep are animals on Zuckerman's farm, mentioned in the context of the rain affecting their grazing, and are part of the barn's community, interacting with Wilbur and providing commentary on his search for a friend.",
            "source_image_entities": [
                "SHEEP"
            ],
            "source_text_entities": [
                "SHEEP"
            ]
        },
        {
            "merged_entity_name": "PIG",
            "entity_type": "ANIMAL",
            "description": "A pig, specifically Wilbur, who is peeking through a hole in a wooden fence and is the main character in the story, trying to find a friend and dealing with loneliness.",
            "source_image_entities": [
                "PIG"
            ],
            "source_text_entities": [
                "WILBUR"
            ]
        },
        {
            "merged_entity_name": "RAIN",
            "entity_type": "EVENT",
            "description": "Rain is a weather event that disrupts Wilbur's plans, affects the mood and setting of the story, and is falling on the sheep and the ground.",
            "source_image_entities": [
                "RAIN"
            ],
            "source_text_entities": [
                "RAIN"
            ]
        },
        {
            "merged_entity_name": "GROUND",
            "entity_type": "UNKNOWN",
            "description": "The ground where the rain is falling and the sheep is standing, and is part of the barnyard environment affected by the rain.",
            "source_image_entities": [
                "GROUND"
            ],
            "source_text_entities": [
                "BARNYARD"
            ]
        }
    ],
    "image_13": [
        {
            "merged_entity_name": "Wilbur",
            "entity_type": "PERSON",
            "description": "Wilbur is a pig character in the story who is feeling lonely and desires a friend to play with. He is the central character around which many interactions occur, including with the goose, lamb, and Templeton the rat. Wilbur is also the one who is resting on the grass as described in the image.",
            "source_image_entities": [
                "PIG"
            ],
            "source_text_entities": [
                "\"WILBUR\"",
                "\"WILBUR\"",
                "\"WILBUR\""
            ]
        }
    ],
    "image_14": [
        {
            "merged_entity_name": "Wilbur",
            "entity_type": "ANIMAL",
            "description": "Wilbur is a pig who is fond of by Charlotte and Fern, and his smelly pen and stale food attract flies that Charlotte needs. He is a character who tries to spin a web using a string but fails due to lacking the necessary equipment, showing a persistent but ultimately unsuccessful effort.",
            "source_image_entities": [
                "PIG"
            ],
            "source_text_entities": [
                "WILBUR"
            ]
        },
        {
            "merged_entity_name": "Barn",
            "entity_type": "BUILDING",
            "description": "The barn is a central location on the farm where many of the story's events take place, including the hatching of the goslings. It is the location where the interactions between Wilbur, Templeton, the goose, and other animals take place. Wilbur, the pig, is located here, and it is described as a rustic barn with a slanted roof and open doors.",
            "source_image_entities": [
                "BARN"
            ],
            "source_text_entities": [
                "BARN"
            ]
        },
        {
            "merged_entity_name": "Spiderweb",
            "entity_type": "OBJECT",
            "description": "The spiderweb is the location where Charlotte, the spider, resides and where she interacts with Wilbur. It is a big spiderweb stretched across the upper part of the doorway in the barn.",
            "source_image_entities": [
                "SPIDER WEB"
            ],
            "source_text_entities": [
                "SPIDERWEB"
            ]
        },
        {
            "merged_entity_name": "Goose",
            "entity_type": "ANIMAL",
            "description": "The goose is a character that interacts with Wilbur, providing information about the time and her own situation of sitting on eggs. She is also a character who listens to the conversation between Wilbur and Charlotte and reacts with amusement.",
            "source_image_entities": [
                "GOOSE"
            ],
            "source_text_entities": [
                "GOOSE",
                "THE GOOSE"
            ]
        },
        {
            "merged_entity_name": "Cow",
            "entity_type": "ANIMAL",
            "description": "Cows are part of the barn's community, resting during the night and part of the setting in which Wilbur interacts with other animals. They are also described as grazing inside the fenced area.",
            "source_image_entities": [
                "COW"
            ],
            "source_text_entities": [
                "COWS"
            ]
        }
    ],
    "image_15": [
        {
            "merged_entity_name": "Charlotte",
            "entity_type": "PERSON",
            "description": "Charlotte is a large grey spider with a round body and long legs, positioned upside down on her web in the corner of the doorway. She is known for her friendly greeting to Wilbur and her role in controlling insect populations.",
            "source_image_entities": [
                "SPIDER"
            ],
            "source_text_entities": [
                "CHARLOTTE",
                "CHARLOTTE"
            ]
        },
        {
            "merged_entity_name": "Web",
            "entity_type": "OBJECT",
            "description": "A network of thin lines forming a web, with Charlotte, the spider, at its center, located in the upper part of the doorway.",
            "source_image_entities": [
                "WEB"
            ],
            "source_text_entities": [
                "SPIDERWEB"
            ]
        }
    ],
    "image_16": [
        {
            "merged_entity_name": "Goose",
            "entity_type": "PERSON",
            "description": "The Goose is a character who hatches goslings and is aware of the plot against Wilbur. She is the mother of the goslings, who has been working hard and patiently to hatch them.",
            "source_image_entities": [
                "GOOSE 1",
                "GOOSE 2"
            ],
            "source_text_entities": [
                "THE GOOSE",
                "GOOSE",
                "GOOSE"
            ]
        },
        {
            "merged_entity_name": "Templeton",
            "entity_type": "PERSON",
            "description": "Templeton is a rat who is not well-liked or trusted, and who takes the unhatched egg to add to his collection. He is known for his habit of picking up unusual objects around the farm and storing them in his home.",
            "source_image_entities": [
                "RAT"
            ],
            "source_text_entities": [
                "TEMPLETON",
                "TEMPLETON",
                "TEMPLETON"
            ]
        }
    ],
    "image_17": [
    ],
    "image_18": [
        {
            "merged_entity_name": "SHEEP",
            "entity_type": "ANIMAL",
            "description": "The SHEEP is an animal on the farm, part of the community in the barn cellar, and is known to comment on Wilbur's weight gain, indicating a level of observation and interaction with Wilbur.",
            "source_image_entities": [
                "SHEEP"
            ],
            "source_text_entities": [
                "SHEEP",
                "OLDEST SHEEP",
                "OLD SHEEP"
            ]
        },
        {
            "merged_entity_name": "PIG",
            "entity_type": "ANIMAL",
            "description": "The PIG, named Wilbur, is a character central to the story, living in the barn and is the focus of concern regarding his fate on the farm. He is described as gaining weight and is warned by the old sheep about the intentions of the farmers.",
            "source_image_entities": [
                "PIG"
            ],
            "source_text_entities": [
                "WILBUR"
            ]
        }
    ],
    "image_19": [
    ],
    "image_20": [
        {
            "merged_entity_name": "Wilbur",
            "entity_type": "ANIMAL",
            "description": "Wilbur is a pig who tries to spin a web using a string but fails due to lacking the necessary equipment, showing a persistent but ultimately unsuccessful effort. He is fond of by Charlotte and Fern, and his smelly pen and stale food attract flies that Charlotte needs.",
            "source_image_entities": [
                "PIG"
            ],
            "source_text_entities": [
                "WILBUR"
            ]
        },
        {
            "merged_entity_name": "Templeton",
            "entity_type": "ANIMAL",
            "description": "Templeton is a rat who provides string to Wilbur and assists in tying it to Wilbur's tail, showing a helpful nature. He also resides in the trough and retrieves a piece of string for Wilbur from there.",
            "source_image_entities": [
                "MOUSE"
            ],
            "source_text_entities": [
                "TEMPLETON"
            ]
        }
    ]
}