{
  "chunk-88d8d5ab304640079a5248faddab5504": {
    "tokens": 1200,
    "content": "![](images/image_1.jpg)  \n\n# Charlotte's Web  \n\n# by E. B. WHITE  \n\nPICTURES BY GARTH WILLIAMS  \n\nA HARPER TROPHY BOOK HARPER & ROW, PUBLISHER NEW YORK, EVANSTON, SAN FRANCIS<D, LONDON  \n\n# CHARLOTTE'S WEB  \n\nCopyright@ 1952 by E. B. White  \n\nText copyright $\\circledcirc$ renewed 1980 by E. B. White Illustrations copyright renewed 1980 by Garth Williams All rights reserved. No part of this book may be used or reproduced in any manner whatsoever without wriuen permission except in the case of brief quotations embodied in critical articles and reviews. Printed in the United States of America. For information address Harper&: Row, Publishers Inc., 10 East 53rd Street, New York, N.Y. 10022. Published simultaneously in Canada by Fitzhenry&: Whiteside Limited, Toronto.  \n\nStandard Book Number: 06-440055-7 First printed in 1952.  \n\n# Contents  \n\nI. BEFORE BREAKFAST II. WILBUR 8 III. ESCAPE I J IV.LONELINESSz;v. CHARLOTTE J2 VI. SUMMER DAYS 42 VII. BAD NEWS 48   \nVIII.A TALK AT HOME52IX. WILBURS BOAST 55 X. AN EXPLOSION 66 XI. THE MIRACLE 77 XII. A MEETING 86   \nXIII. GOOD PROGRESS 92   \nXIV. DR. DORIAN 105 XV. THE CRICKETS I I J   \nXVI. OFF TO THE FAIR 118   \nXVII. UNCLE lJO   \nXVIII. THE COOL OF THE EVENING IJ8   \nXIX. THE EGG SAC 144 XX. THE HOUR OF TRIUMPH 155   \nXXI.LAST DAY163  \nXXII.A WARM WIND172  \n\n# Charlotte's Web  \n\n# Chapter 1  \n\n# Before Breakfast  \n\n![](images/image_2.jpg)  \n\nHERE'S Papa going with that ax?\" said  Fern  to  her  mother  as  they were setting the table for breakfast. \"Out  to  the  hoghouse,\"  replied Mrs. Arable. \"Some pigs were born last night.\"  \n\n\"I don't see why he needs an ax,\" continued Fern, who was only eight.  \n\n\"Well,\" said her mother, \"one of the pigs is a runt. It's very small and weak, and it will never amount to anything. So your father has decided to do away with it.\"  \n\n\"Do away with it?\" shrieked Fern. \"You mean kill it? Just because it's smaller than the others?\"  \n\nMrs. Arable put a pitcher of cream on the table. \"Don't yell, Fern!\" she said. \"Your father is right. The pig would probably die anyway.\"  \n\nFern pushed a chair out of the way and ran outdoors. The grass was wet and the earth smelled of springtime. Fern's sneakers were sopping by the time she caught up. with her father.  \n\n![](images/image_3.jpg)  \n\n\"Please don't kill it!\" she sobbed. \"It's unfair.\" Mr. Arable stopped walking.  \n\n\"Fern,\" he said gently, \"you will have to learn to control yourself.\"  \n\n\"Control myself?\" yelled F em. \"This is a matter of life and death, and you talk about controlling myself.\"  \n\nTears ran down her cheeks and she took hold of the ax and tried to pull it out of her father's hand.  \n\n\"Fern,\" said Mr. Arable, \"I know more about raising a litter of pigs than you do. A weakling makes trouble. Now run along!\"  \n\n\"But it's unfair,\" cried Fern. \"The pig couldn't help being born small, could it? If I had been very small at birth, would you have killed me?\"  \n\nMr. Arable smiled. \"Certainly not,\" he said, looking down at his daughter with love. \"But this is different. A little girl is one thing, a little runty pig is another.\"  \n\n\"I see no difference,\" replied Fern, still hanging on to the ax. \"This is the most terrible case of injustice I ever heard of.\"  \n\nA queer look came over John Arable's face. He seemed almost ready to cry himself.  \n\n\"All right,\" he said. \"You go back to the house and I will bring the runt when I come in. I'll let you start it on a bottle, like a baby. Then you'll see what trouble a pig can be.\"  \n\nWhen Mr. Arable returned to the house half an hour later, he carried a carton under his arm. Fern was upstairs changing her sneakers. The kitchen table was set for breakfast, and the room smelled of coffee, bacon, damp plaster, and wood smoke from the stove.  \n\n\"Put it on her chair!\" said Mrs. Arable. Mr. Arable set the carton down at Fern's place. Then he walked to the sink and washed his hands and dried them on the roller towel.  \n\nFern came slowly down the stairs. Her eyes were red from crying. As she approached her chair, the carton wobbled, and there was a scratching noise. F em looked at her father. Then she lifted the lid of the car­ ton. There, inside, looking up at her, was the newborn pig. It was a white one. The morning light shone through its ears, turning them pink.  \n\n\"He's yours,\" said Mr. Arable. \"Saved from an un­ timely death. And may the good Lord forgive me for this foolishness.\"  \n\nFern couldn't take her eyes off the tiny pig. $\\rightsquigarrow$ ,\" she whispered. \"Oh, look at him! He's",
    "chunk_order_index": 0,
    "full_doc_id": "doc-3b08298f563d8870cdc33f4b784a593e"
  },
  "chunk-6af6d5471c45dac92b433fd22aa6f6ff": {
    "tokens": 1200,
    "content": "of the car­ ton. There, inside, looking up at her, was the newborn pig. It was a white one. The morning light shone through its ears, turning them pink.  \n\n\"He's yours,\" said Mr. Arable. \"Saved from an un­ timely death. And may the good Lord forgive me for this foolishness.\"  \n\nFern couldn't take her eyes off the tiny pig. $\\rightsquigarrow$ ,\" she whispered. \"Oh, look at him! He's absolutely per­ fect.\"  \n\nShe closed the canon carefully. First she kissed her father, then she kissed her mother. Then she opened the lid again, lifted the pig out, and held it against her cheek. At this moment her brother A very came into the room. A very was ten. He was heavily armed -an air rifle in one hand, a wooden dagger in the other.  \n\n\"What's that?\" he demanded. \"What's Fern got?\"  \n\n11She's got a guest for breakfast,\" said Mrs. Arable. 11Wash your hands and face, Avery!\"  \n\n\"Let's see it!\" said Avery, setting his gun down. uy ou call that miserable thing a pig? That's a fine specimen of a pig-it's no bigger than a white rat.\"  \n\n![](images/image_4.jpg)  \n\n\"Wash up and eat your breakfast, Avery!\" said his mother. \"The school bus will be along in half an hour.\"  \n\n\"Can I have a pig, too, Pop?\" asked Avery.  \n\n\"No, I only distribute pigs to early risers,\" said Mr. Arable. \"F em was up at daylight, trying to rid the world of injustice. As a result, she now has a pig. A small one, to be sure, but nevertheless a pig. It just shows what can happen if a person gets out of bed promptly. Let's eat!\"  \n\nBut Fern couldn't eat until her pig had had a drink of milk. Mrs. Arable found a baby's nursing bottle and a rubber nipple. She poured warm milk into the bottle, fitted the nipple over the top, and handed it to Fer \"Give him his breakfast!\" she said.  \n\n![](images/image_5.jpg)  \n\nA minute later, Fern was seated on the floor in the comer of the kitchen with her infant between her knees, teaching it to suck from the bottle. The pig, although tiny, had a good appetite and caught on quickly.  \n\nThe school bus honked from the road.  \n\n\"Run!\" commanded Mrs. Arable, taking the pig from Fern and slipping a doughnut into her hand. Avery grabbed his gun and another doughnut.  \n\nThe children ran out to the road and climbed into the bus. Fern took no notice of the others in the bus. She just sat and stared out of the window, thinking what a blissful world it was and how lucky she was to have entire charge of a pig. By the time the bus reached school, F em had named her pet, selecting the most beautiful name she could think of.  \n\n\"Its name is Wilbur,\" she whispered to herself.  \n\nShe was still thinking about the pig when the teacher said: \"Fern, what is the capital of Pennsylvania?\"  \n\n\"Wilbur,\" replied Fern, dreamily. The pupils gig­ gled. F em blushed.  \n\n# Chapter II Wilbur  \n\nERN loved Wilbur more than anything. She loved to stroke him, to feed him, to put him to bed. Every morning, as soon as she got up, she warmed his milk, tied his bib on, and held the bottle for him. Every afternoon, when the school bus stopped in front of her house, she jumped out and ran to the kitchen to fix another bottle for him. She fed him again at suppertime, and again just before going to bed. Mrs. Arable gave him a feeding around noontime each day, when Fern was away in school. Wilbur loved his milk, and he was never happier than when Fern was wanning up a bottle for him. He would stand and gaze up at her with adoring eyes.  \n\nFor the first few days of his life, Wilbur was allowed to live in a box near the stove in the kitchen. Then, when Mrs. Arable complained, he was moved to a big­ ger box in the woodshed. At two weeks of age, he was moved outdoors. It was apple-blossom time, and the days were getting warmer. Mr. Arable fixed a small yard specially for Wilbur under an apple tree, and gave him a large wooden box full of straw, with a doorway cut in it so he could walk in and out as he pleased.  \n\n\"Won't he be cold at night?\" asked F em.  \n\n\"No,\" said her father. \"You watch and see what he does.\"  \n\nCarrying a bottle of milk, Fern sat down under the apple tree inside the yard. Wilbur ran to her and she held the bottle for him while he sucked. \\Vhen he had finished the last drop, he grunted and walked sleepily into the box. Fern peered through the door. Wilbur was poking the straw with his snout. In a short time he had dug a tunnel in the straw. He crawled into the tunnel and disappeared from sight, completely cov­ ered with straw. Fern was enchanted. It relieved her mind to know that her baby would sleep covered up, and would stay warm.  \n\n![](images/image_6.jpg)  \n\nEvery morning after breakfast, Wilbur walked out to the road with Fern and waited with her till the bus came. She would wave good-bye to him, and he would stand and watch the bus until it vanished around a turn. While Fern was in school, Wilbur was shut up inside his yard. But as soon as she got home in",
    "chunk_order_index": 1,
    "full_doc_id": "doc-3b08298f563d8870cdc33f4b784a593e"
  },
  "chunk-af0922057792e2694b52ac7347267e32": {
    "tokens": 1200,
    "content": ". It relieved her mind to know that her baby would sleep covered up, and would stay warm.  \n\n![](images/image_6.jpg)  \n\nEvery morning after breakfast, Wilbur walked out to the road with Fern and waited with her till the bus came. She would wave good-bye to him, and he would stand and watch the bus until it vanished around a turn. While Fern was in school, Wilbur was shut up inside his yard. But as soon as she got home in the afternoon, she would take him out and he would follow her around the place. If she went into the house, Wilbur went, too. If she went upstairs, Wilbur would wait at the bottom step until she came down again. If she took her doll for a walk in the doll car­ riage, Wilbur followed along. Sometimes, on these journeys, Wilbur would get tired, and Fern would pick him up and put him in the carriage alongside the doll. He liked this. And if he was very tired, he would close his eyes and go to sleep under the doll's blanket. He looked cute when his eyes were closed, because his lashes were so long. The doll would close her eyes, too, and Fern would wheel the carriage very slowly and smoothly so as not to wake her infants.  \n\nOne warm afternoon, Fern and A very put on bath­ ing suits and went down to the brook for a swim. Wilbur tagged along at Fern's heels. When she waded into the brook, Wilbur waded in with her. He found the water quite cold-too cold for his liking. So while the children swam and played and splashed water at each other, Wilbur amused himself in the mud along the edge of the brook, where it was wann and moist and delightfully sticky and oozy.  \n\n![](images/image_7.jpg)  \n\nEvery day was a happy day, and every night was peaceful.  \n\nWilbur was what farmers call a spring pig, which simply means that he was born in springtime. When he was five weeks old, Mr. Arable said he was now big enough to sell, and would have to be sold. Fern broke down and wept. But her father was finn about it. Wil­ bur's appetite \u0004d increased; he was beginning to eat scraps of food in addition to milk. Mr. Arable was not willing to provide for him any longer. He had already sold Wilbur's ten brothers and sisters.  \n\n\"He's got to go, Fern,\" he said. \"You have had your fun raising a baby pig, but Wilbur is not a baby any longer and he has got to be sold.\"  \n\n\"Call up the Zuckermans, \" suggested Mrs. Arable to Fern. \"Your Uncle Homer sometimes raises a pig. And if Wilbur goes there to live, you can walk down the road and visit him as often as you like.\"  \n\n\"How much money should I ask for him?\" Fern wanted to know.  \n\n\"Well,\" said her father,  \"he's a runt. Tell your Uncle Homer you've got a pig  you'll  sell for six dollars, and see what he says.\"  \n\nIt was soon arranged. Fern phoned and got her Aunt Edith, and her Aunt Edith hollered for Uncle Homer, and Uncle Homer came in from the bam and talked to Fern. When he heard that the price was only six dollars, he said he would buy the pig. Next day Wilbur was taken from his home under the apple tree and went to live in a manure pile in the cellar of Zuck­ erman's bam.  \n\nChapter Ill  \n\n# Escape  \n\nBARN was very large. It was very old. It smelled of hay and it smelled of manure. It smelled of the perspiration of tired horses  \n\nand the wonderful sweet breath of patient cows. It often had a sort of peaceful smell-as though nothing bad could happen ever again in the world. It smelled of grain and of harness dressing and of axle grease and of rubber boots and of new rope. And whenever the cat was given a fish-head to eat, the barn would smell of fish. But mostly it smelled of hay, for there was always hay in the great loft up overhead. And there was always hay being pitched down to the cows and the horses and the sheep.  \n\nThe bam was pleasantly warm in winter when the animals spent most of their time indoors, and it was pleasantly cool in summer when the big doors stood wide open to the breeze. The bam had stalls on the main floor for the work horses, tie-ups on the main floor for the cows, a sheepfold down below for the sheep, a pigpen down below for Wilbur, and it was full of all sons of things that you find in barns: ladders, grindstones, pitch forks, monkey wrenches, scythes, lawn mowers, snow shovels, ax handles, milk pails, water buckets, empty grain sacks, and rusty rat traps. It was the kind of barn that swallows like to build their nests in. It was the kind of barn that children like to play in. And the whole thing was owned by Fern's uncle, Mr. Horner L. Zuckerman.  \n\n![](images/image_8.jpg)  \n\nWilbur's new home was in the lower part of the barn, directly underneath the cows. Mr. Zuckerman knew that a manure pile is a good place to keep a young pig. Pigs need warmth, and it was warm and com­ fonable down there in the barn cellar on the south si4e.  \n\nFern came almost every day to visit him. She found an old milking stool that had been discarded, and she placed the stool in the sheepfold next to Wilbur's pen. Here  she  sat  quietly  during  the",
    "chunk_order_index": 2,
    "full_doc_id": "doc-3b08298f563d8870cdc33f4b784a593e"
  },
  "chunk-3981b1c5af4e3842504974dea9036f28": {
    "tokens": 1200,
    "content": "underneath the cows. Mr. Zuckerman knew that a manure pile is a good place to keep a young pig. Pigs need warmth, and it was warm and com­ fonable down there in the barn cellar on the south si4e.  \n\nFern came almost every day to visit him. She found an old milking stool that had been discarded, and she placed the stool in the sheepfold next to Wilbur's pen. Here  she  sat  quietly  during  the  long  afternoons, thinking and listening and watching  Wilbur.  The sheep soon got to know her and trust her. So did the geese, who lived with the sheep. All the animals trusted her, she was so quiet and friendly. Mr. Zuckerman did not allow her to take Wilbur out, and he did not allow her to get into the pigpen. But he told Fern that she could sit on the stool and watch Wilbur as long as she wanted to. It made her happy just to be near the pig, and it made Wilbur happy to know that she was sitting there, right outside his pen. But he never had any fun­ no walks, no rides, no swims.  \n\n![](images/image_9.jpg)  \n\nOne afternoon in June, when Wilbur was almost two months old, he wandered out into his small yard outside the barn. Fern had not arrived for her usual visit. Wilbur stood in the sun feeling lonely and bored.  \n\n\"There's never anything to do around here,\" he thought. He walked slowly to his food trough and sniffed  to  see  if  anything  had  been  overlooked  at lunch. He found a small strip of potato skin and ate it. His back itched, so he leaned against the fence and rubbed against the boards. When he tired of this, he walked indoors, climbed to the top of the manure pile, and sat down. He didn't feel like going to sleep, he didn't feel like digging, he was tired of standing still, tired of lying down. \"I'm less than two months old and I'm tired of living,\" he said. He walked out to the yard agatn.  \n\n\"\\Vhen I'm out here,\" he said, \"there's no place to go but in. When I'm indoors, there's no place to go but out in the yard.\"  \n\n\"That's where you're wrong, my friend, my friend,\" said a voice.  \n\nWilbur looked through the fence and saw the goose standing there.  \n\n\"You don't have to stay in that dirty-little dirty­ little  dirty-little  yard,\"  said the  goose,  who  talked rather fast. \"One of the boards is loose. Push on it, push-push-push on it, and come on out!\"  \n\n\"What?\" said Wilbur. \"Say it slower!\"  \n\n\"At-at-at, at the risk of repeating mysdf,\" said the goose, \"I suggest that you come on out. It's wonderful out here.\"  \n\n\"Did you say a board was loose?\"  \n\n\"That I did, that I did,\" said the goose.  \n\nWilbur walked up to the fence and saw that the goose was right--one board was loose. He put his head down, shut his eyes, and pushed. The board gave way. In a minute he had squeezed through the fence and was standing in the long grass outside his yard. The goose chuckled.  \n\n\"How does it feel to be free?\" she asked.  \n\n\"I like it,\" said Wilbur. \"That is, I guess I like it.\" Actually, Wilbur felt queer to be outside his fence, with nothing between him and the big world.  \n\n\"Where do you think I'd better go?\"  \n\n\"Anywhere you like, anywhere you like,\" said the goose. \"Go down through the orchard, root up the sod! Go down through the garden, dig up the radishes! Root up everything! Eat grass! Look for corn! Look for oats! Run all over! Skip and dance, jump and prance! Go down through the orchard and stroll in the woods! The world is a wonderful place when you're young.\"  \n\n\"I can see that,\" replied Wilbur. He gave a jump in the air, twirled, ran a few steps, stopped, looked all around, sniffed the smells of afternoon, and then set off walking down through the orchard. Pausing in the shade of an apple tree, he put his strong snout into the ground and began pushing, digging, and rooting. He felt very happy. He had plowed up quite a piece of ground before anyone noticed him. Mrs. Zuckerman was the first to see him. She saw him from the kitchen window, and she immediately shouted for the men.  \n\n\"Ho-mer!\" she cried. \"Pig's out! Lurvy! Pig's out! Homer! Lurvy! Pig's out. He's down there under that apple tree.\"  \n\n\"Now the trouble starts,\" thought Wilbur. \"Now I'll catch it.\"  \n\nThe goose heard the racket and she, too, started hollering.  \"Run-run-run  downhill,  make  for  the woods, the woods!\" she shouted to Wilbur. \"They'll never-never-never catch you in the woods.\"  \n\nThe cocker spaniel heard the commotion and he ran out from the bam to join the chase. Mr. Zuckerman heard, and he came out of the machine shed where he was mending a tool. Lurvy, the hired man, heard the noise and came up from the asparagus patch where he was pulling weeds. Everybody walked toward Wilbur and Wilbur didn't know what to do. The woods seemed a long way off, and anyway, he had never been down there in the woods and wasn't sure he would like it",
    "chunk_order_index": 3,
    "full_doc_id": "doc-3b08298f563d8870cdc33f4b784a593e"
  },
  "chunk-5bf5bf2191af13969f9f78ef8892d98b": {
    "tokens": 1200,
    "content": "and he ran out from the bam to join the chase. Mr. Zuckerman heard, and he came out of the machine shed where he was mending a tool. Lurvy, the hired man, heard the noise and came up from the asparagus patch where he was pulling weeds. Everybody walked toward Wilbur and Wilbur didn't know what to do. The woods seemed a long way off, and anyway, he had never been down there in the woods and wasn't sure he would like it.  \n\n\"Get around behind him, Lurvy,\" said Mr. Zucker­ man, \"and drive him toward the barn! And take it easy--don't rush him! I'll go and get a bucket of slops.\"  \n\nThe news of Wilbur's escape spread rapidly among the animals on the place. Whenever any creature broke loose on Zuckerman's farm, the event was of great interest to the others. The goose shouted to the nearest cow that Wilbur was free, and soon all the cows knew. Then one of the cows told one of the sheep, and soon all the sheep knew. The lambs learned about it from their mothers. The horses, in their stalls in the barn, pricked up their ears when they heard the goose hol­ lering; and soon the horses had caught on to what was happening. \"Wilbur's out,\" they said. Every animal stirred and lifted its head and became excited to know that one of his friends had got free and was no longer penned up or tied fast.  \n\nWilbur didn't know what to do or which way to run. It seemed as though everybody was after him. \"If this is what it's like to be free,\" he thought, \"I believe I'd rather be penned up in my own yard.\"  \n\nThe cocker spaniel was sneaking up on him from one side, Lurvy the hired man was sneaking up on him from the other side. Mrs. Zuckerman stood ready to head him off if he started for the garden, and now Mr. Zuckerman was coming down toward him carrying a pail. \"This is really awful,\" thought Wilbur. \"Why doesn't Fern come?\" He began to cry.  \n\n![](images/image_10.jpg)  \n\nThe goose took command and began to give orders. \"Don't  just  stand  there, Wilbur! Dodge  about, dodge  about!\"  cried the goose. \"Skip around, run toward me, slip in and out, in and out, in and out! Make for the woods! Twist and tum!\"  \n\nThe cocker spaniel sprang for Wilbur's hind leg. Wilbur  jumped  and  ran.  Lurvy reached out  and grabbed. Mrs. Zuckerman screamed at Lurvy. The goose cheered for Wilbur. Wilbur dodged between Lurvy's legs. Lurvy missed Wilbur and grabbed the spaniel instead. \"Nicely done, nicely done!\" cried the goose. \"Try it again, try it again!\"  \n\n\"Run downhill!\" suggested the cows.   \n\"Run toward me!\" yelled the gander.   \n\"Run uphill!\" cried the sheep.   \n\"Turn and twist!\" honked the goose.   \n\"Jump and dance!\" said the rooster.  \n\n![](images/image_11.jpg)  \n\n\"Look out for Lurvy!\" called the cows.  \n\n\"Look out for Zuckerman!\" yelled the gander.   \n\"Watch out for the dog!\" cried the sheep.  \n\n\"Listen to me, listen to me!\" screamed the goose.  \n\nPoor Wilbur was dazed and frightened by this hullabaloo. He didn't like being the center of all this fuss. He tried to follow the instructions his friends were giving him, but he couldn't run downhill and uphill at the same time, and he couldn't turn and twist when he was jumping and dancing, and he was crying so hard he could barely see anything that was happening. After all, Wilbur was a very young pig-not much more than a baby, really. He wished Fern were there to take him in her anns and comfort him. When he looked up and saw Mr. Zuckerman standing quite close to him, holding a pail of wann slops, he felt relieved. He lifted his nose and sniffed. The smell was delicious -wann milk, potato skins, wheat middlings, Kellogg's Com Flakes, and a popover left from the Zuckennans' breakfast.  \n\n\"Come, pig!\" said Mr. Zuckerman, tapping the pail. \"Come pig!,  \n\nWilbur took a step toward the pail.  \n\n\"No-no-no!\" said the goose. \"It's the old pail trick, Wilbur. Don't fall for it, don't fall for it! He's trying to lure you back into captivity-iviry. He's appealing to your stomach.\"  \n\nWilbur didn't care. The food smelled appetizing. He took another step toward the pail.  \n\n\"Pig, pig!\" said Mr. Zuckerman in a kind voice, and began walking slowly toward the barnyard, looking all about him innocently, as if he didn't know that a little white pig was following along behind him.  \n\n\"You'll be sorry-sorry-sorry,\" called the goose.  \n\nWilbur didn't care. He kept walking toward the pail of slops.  \n\n\"You'll miss your freedom,\" honked the goose. \"An hour of freedom is worth a barrel of slops.\"  \n\nWilbur didn't care.  \n\nWhen  Mr.  Zuckerman reached the  pigpen,  he climbed over the fence and poured the slops into the trough. Then he pulled the loose board away from the fence, so that there was a wide hole for Wilbur to walk through.  \n\n\"Reconsider, reconsider!\" cried the goose.  \n\nWilbur",
    "chunk_order_index": 4,
    "full_doc_id": "doc-3b08298f563d8870cdc33f4b784a593e"
  },
  "chunk-0acb5866fe2f814f086e6fd350b30429": {
    "tokens": 1200,
    "content": "\"You'll miss your freedom,\" honked the goose. \"An hour of freedom is worth a barrel of slops.\"  \n\nWilbur didn't care.  \n\nWhen  Mr.  Zuckerman reached the  pigpen,  he climbed over the fence and poured the slops into the trough. Then he pulled the loose board away from the fence, so that there was a wide hole for Wilbur to walk through.  \n\n\"Reconsider, reconsider!\" cried the goose.  \n\nWilbur paid no attention. He stepped through the fence into his yard. He walked to the trough and took a long drink of slops, sucking in the milk hungrily and chewing the popover. It was good to be home again.  \n\nWhile Wilbur ate, Lurvy fetched a hammer and some 8-penny nails and nailed the board in place. Then he and Mr. Zuckerman leaned lazily on the fence and Mr. Zuckerman scratched Wilbur's back with a stick.  \n\n\"He's quite a pig,\" said Lurvy.  \n\n# Charlotte's Web  \n\n\"Yes, he'll make a good pig,\" said Mr. Zuckerman.  \n\nWilbur heard the words of praise. He felt the warm milk inside his stomach. He felt the pleasant rubbing of the stick along his itchy back. He felt peaceful and happy and sleepy. This had been a tiring afternoon. It was still only about four o'clock but Wilbur was ready for bed.  \n\n\"I'm really too young to go out into the world alone,\" he thought as he lay down.  \n\n# Chapter IV  \n\n# Loneliness  \n\nHE NEXT day was rainy and dark. Rain fell on the roof of the bam and dripped steadily from the eaves. Rain fell in the barnyard and ran in crooked courses down into the lane where thistles and pigweed grew. Rain spattered against .Mrs. Zuckerman's kitchen windows and came gushing out of the downspouts. Rain fell on the backs of the sheep as they grazed in the meadow. When the sheep tired of standing in the rain, they walked slowly up the lane and into the fold.  \n\nRain upset Wilbur's plans. Wilbur had planned to go out, this day, and dig a new hole in his yard. He had other plans, too. His plans for the day went something like this:  \n\nBreakfast at six-thiny. Skim milk, crusts, middlings, bits of doughnuts, wheat cakes with drops of maple syrup sticking to them, potato skins, leftover custard pudding with raisins, and bits of Shredded Wheat.  \n\nBreakfast would be finished at seven.  \n\nFrom seven to eight, Wilbur planned to have a talk with Templeton, the rat that lived under his trough. Talking with Templeton was not the most interesting occupation in the world but it was better than nothing.  \n\nFrom eight to nine, Wilbur planned to take a nap outdoors in the sun.  \n\nFrom nine to eleven he planned to dig a hole, or trench, and possibly find something good to eat buried in the dirt.  \n\nFrom eleven to twelve he planned to stand still and watch flies on the boards, watch bees in the clover, and watch swallows in the air.  \n\nTwelve  o'clock-lunchtime. Middlings, warm water, apple parings, meat gravy, carrot scrapings, meat scraps, stale hominy, and the wrapper off a package of cheese. Lunch would be over at one.  \n\nFrom one to two, Wilbur planned to sleep.  \n\nFrom two to three, he planned to scratch itchy places by rubbing against the fence.  \n\nFrom three to four, he planned to stand perfectly still and think of what it was like to be alive, and to wait for Fern.  \n\nAt four would come supper. Skim milk, provender, leftover sandwich from Lurvy's lunchbox, prune skins, a morsel of this, a bit of that, fried potatoes, marmalade drippings, a little more of this, a little more of that, a piece of baked apple, a scrap of upsidedown cake.  \n\nWilbur had gone to sleep thinking about these plans.  \n\nHe awoke at six and saw the rain, and it seemed as though he couldn't bear it.  \n\n\"I get everything all beautifully planned out and it has to go and rain,\" he said.  \n\nFor a while he stood gloomily indoors. Then he walked to the door and looked out. Drops of rain struck his face. His yard was cold and wet. His trough had an inch of rainwater in it. Templeton was nowhere to be seen.  \n\n\"Are you out there, Templeton?\" called Wilbur. There was no answer. Suddenly Wilbur felt lonely and friendless.  \n\n\"One day just like another,\" he groaned. \"I'm very young, I have no real friend here in the barn, it's going to rain all morning and all afternoon, and Fern won't come in such bad weather. Oh, honestly!\" And Wil­ bur was crying again, for the second time in two days.  \n\nAt six-thiny Wilbur heard the banging of a pail. Lurvy was standing outside in the rain, stirring up breakfast.  \n\n\"C'mon, pig!\" said Lurvy.  \n\nWilbur did not budge. Lurvy dumped the slops, scraped the pail, and walked away. He noticed that something was wrong with the pig.  \n\nWilbur didn't want food, he wanted love.  He wanted a friend-someone who would play with him. He mentioned this to the goose, who was sitting quietly in a comer of the sheepfold.  \n\n\"Will you come over and play with me?\" he asked.  \n\n\"Sorry, sonny, sorry,\" said the goose. \"I'm sitting­ sitting on my eggs. Eight",
    "chunk_order_index": 5,
    "full_doc_id": "doc-3b08298f563d8870cdc33f4b784a593e"
  },
  "chunk-6185f58346fe09cf899808ae2d44c5f3": {
    "tokens": 1200,
    "content": "scraped the pail, and walked away. He noticed that something was wrong with the pig.  \n\nWilbur didn't want food, he wanted love.  He wanted a friend-someone who would play with him. He mentioned this to the goose, who was sitting quietly in a comer of the sheepfold.  \n\n\"Will you come over and play with me?\" he asked.  \n\n\"Sorry, sonny, sorry,\" said the goose. \"I'm sitting­ sitting on my eggs. Eight of them. Got to keep them toasty-oasty-oasty warm. I have to stay right here, I'm no flibberty-ibberty-gibbet. I do not play when there are eggs to hatch. I'm expecting goslings.\"  \n\n\"Well, I didn't think you were expecting woodpeckers,\" said Wilbur, bitterly.  \n\nWilbur next tried one of the 'lambs.  \n\n\"Will you please play with me?\" he asked.  \n\n\"Certainly not,\" said the lamb. \"In the first place, I cannot get into your pen, as I am not old enough to jump over the fence. In the second place, I am not in­ terested in pigs. Pigs mean less than nothing to me.\"  \n\n\"What do you mean, less than nothing?\" replied Wilbur. \"I don't think there is any such thing as less than nothing. Nothing is absolutely the limit of noth­ ingness. It's the lowest you can go. It's the end of the line. How can something be less than nothing? If there were something that was less than nothing, then noth­ ing would not be nothing, it would be something­ even though it's just a very little bit of something. But if nothing is nothing, then nothing has nothing that is less than it is.\"  \n\n\"Oh, be quiet!\" said the lamb. \"Go play by yourself! I don't play with pigs.\"  \n\nSadly, Wilbur lay down and listened to the rain. Soon he saw the rat climbing down a slanting board that he used as a stairway.  \n\n\"Will you play with me, Templeton?\" asked Wil­ bur.  \n\n![](images/image_12.jpg)  \n\n\"Play?\"  said  Templeton,  twirling  his  whiskers. \"Play? I hardly know the meaning of the word.\"  \n\n\"Well,\" said Wilbur, \"it means to have fun, to frolic, to run and skip and make merry.\"  \n\n\"I never do those things if I can avoid them,\" replied the rat, sourly. \"I prefer to spend my time eating, gnaw­ ing, spying, and hiding. I am a glutton but not a merrymaker. Right now I am on my way to your trough to eat your breakfast, since you haven't got sense enough to eat it yourself.\" And Templeton, the rat, crept stealthily along the wall and disappeared into a private tunnel that he had dug between the door and the trough in Wilbur's yard. Templeton was a crafty rat, and he had things pretty much his own way. The tunnel was an example of his skill and cunning. The tunnel en­ abled him to get from the barn to his hiding place under the pig trough without coming out into the open. He had tunnels and runways all over Mr. Zuckerman's farm and could get from one place to another without being seen. Usually he slept during the daytime and was abroad only after dark.  \n\nWilbur watched him disappear into his tunnel. In a moment he saw the rat's sharp nose poke out from un­ derneath the wooden trough. Cautiously Templeton pulled himself up over the edge of the trough. This was almost more than Wilbur could stand: on this dreary, rainy day to see his breakfast being eaten by somebody else. He knew Templeton was getting soaked, out there in the pouring rain, but even that didn't comfon him. Friendless,  dejected, and hungry, he threw himself down in the manure and sobbed.  \n\nLate that afternoon, Lurvy went to Mr. Zuckerman. \"I think there's something wrong with that pig of yours. He hasn't touched his food.\"  \n\n\"Give him two spoonfuls of sulphur and a little mo­ lasses,\" said Mr. Zuckerman.  \n\nWilbur couldn't believe what was happening to him when Lurvy caught him and forced the medicine down his throat. This was cenainly the worst day of his life. He didn't know whether he could endure the awful loneliness any more.  \n\n![](images/image_13.jpg)  \n\nDarkness settled over everything. Soon there were only shadows and the noises of the sheep chewing their cuds, and occasionally the rattle of a cow-chain up overhead. You can imagine Wilbur's surprise when, out of the darkness, came a small voice he had never heard before. It sounded rather thin, but pleasant. \"Do you want a friend, Wilbur?\" it said. \"I'll be a friend to you. I've watched you all day and I like you.\"  \n\n\"But I can't see you,\" said Wilbur, jumping to his feet. \"Where are you? And who are you?\"  \n\n\"I'm right up here,\" said the voice. \"Go to sleep. You'll see me in the morning.\"  \n\n# Chapter V  \n\n# Charlotte  \n\nHE NIGHT seemed long. Wilbur's stom­ ach was empty and his mind was full. And when your stomach is empty and your mind is full, it's always hard to sleep.  \n\nA dozen times during the night Wilbur woke and stared into the blackness, listening to the sounds and trying to figure out what time it was. A bam is never perfectly quiet. Even at midnight there is usually some­ thing stirring.  \n\nThe first time he woke, he",
    "chunk_order_index": 6,
    "full_doc_id": "doc-3b08298f563d8870cdc33f4b784a593e"
  },
  "chunk-cc7d0d2e82b28c6ec9e0a44bf797718b": {
    "tokens": 1200,
    "content": "Chapter V  \n\n# Charlotte  \n\nHE NIGHT seemed long. Wilbur's stom­ ach was empty and his mind was full. And when your stomach is empty and your mind is full, it's always hard to sleep.  \n\nA dozen times during the night Wilbur woke and stared into the blackness, listening to the sounds and trying to figure out what time it was. A bam is never perfectly quiet. Even at midnight there is usually some­ thing stirring.  \n\nThe first time he woke, he heard Templeton gnaw­ ing a hole in the grain bin. Templeton's teeth scraped loudly against the wood and made quite a racket. \"That crazy rat!\" thought Wilbur. \"Why does he have to stay up all night, grinding his clashers and destroying people's property? Why can't he go to sleep, like any decent animal?\"  \n\nThe second time Wilbur woke, he heard the goose turning on her nest and chuckling to herself.  \n\n\"What time is it?\" whispered Wilbur to the goose.  \n\n\"Probably-obably-obably about half-past eleven,\" said the goose. \"Why aren't you asleep, Wilbur?\"  \n\n\"Too many things on my mind,\" said Wilbur.  \n\n\"Well,\" said the goose, \"that's not my trouble. I have nothing at all on my mind, but I've too many things under my behind. Have you ever tried to sleep while sitting on eight eggs?\"  \n\n\"No,\" replied Wilbur. \"I suppose it is uncomforta­ ble. How long does it take a goose egg to hatch?\"  \n\n\"Approximately-oxirnately thirty days, all told,\" an­ swered the goose. \"But I cheat a little. On warm after­ noons, I just pull a little straw over the eggs and go out for a walk.\"  \n\nWilbur yawned and went back to sleep. In his dreams he heard again the voice saying, \"I'll be a friend to you. Go to sleep--you'll see me in the morning.\"  \n\nAbout half an hour before dawn. Wilbur woke and listened. The barn was still dark. The sheep lay motion­ less. Even the goose was quiet. Overhead, on the main floor, nothing stirred: the cows were resting, the horses dozed. Templeton had quit work and gone off some­ where on an errand. The only sound was a slight scrap­ ing noise from the rooftop, where the weather-vane swung back and fonh. Wilbur loved the barn when it was like this-calm and quiet, waiting for light.  \n\n\"Day is almost here,\" he thought.  \n\nThrough a small window, a faint gleam appeared.  \n\nOne by one the stars went out. Wilbur could see the goose a few feet away. She sat with head tucked under a wing. Then he could see the sheep and the lambs. The sky lightened.  \n\n\"Oh, beautiful day, it is here at last! Today I shall find my friend.\"  \n\nWilbur looked everywhere. He searched his pen thoroughly. He examined the window ledge, stared up at the ceiling. But he saw nothing new. Finally he de­ cided he would have to speak up. He hated to break the lovely stillness of dawn by using his voice, but he couldn't think of any other way to locate the mysteri­ ous new friend who was nowhere to be seen. So Wil­ bur cleared his throat.  \n\n\"Attention, please!\" he said in a loud, finn voice. \"Will the party who addressed me at bedtime last night kindly make himself or herself known by giving an appropriate sign or signal!\"  \n\nWilbur paused and listened. All the other animals lifted their heads and stared at him. Wilbur blushed. But he was determined to get in touch with his un­ known friend.  \n\n\"Attention, please!\" he said. \"I will repeat the mes­ sage. Will the party who addressed me at bedtime last night kindly speak up. Please tell me where you are, if you are my friend!\"  \n\nThe sheep looked at each other in disgust.  \n\n\"Stop your nonsense, Wilbur!\" said the oldest sheep. \"If you have a new friend here, you are probably dis­ turbing his rest; and the quickest way to spoil a friend­ ship is to wake somebody up in the morning before he is ready. How can you be sure your friend is an early riser?\"  \n\n\"I beg everyone's pardon,\" whispered Wilbur. \"I didn't mean to be objectionable.\"  \n\nHe lay down meekly in the manure, facing the door. He did not know it, but his friend was very near. And the old sheep was right-the friend was still asleep.  \n\nSoon Lurvy appeared with slops for breakfast. Wil­ bur rushed out, ate everything in a hurry, and licked the trough. The sheep moved off down the lane, the gander waddled along behind them, pulling grass. And then, just as Wilbur was settling down for his morning nap, he heard again the thin voice that had addressed him the night before.  \n\n\"Salutations!\" said the voice.  \n\nWilbur jumped to his feet. \"Salu-what?\" he cried.   \n\"Salutations!\" repeated the voice.  \n\n\"What are they, and where are you?\" screamed Wil­ bur. \"Please, please, tell me where you are. And what are salutations?\"  \n\n\"Salutations are greetings,\" said the voice. \"When I say 'salutations,' it's just my fancy way of saying hello or good morning. Actually, it's a silly expression, and I am surprised that I used it at all. As for my where­ abouts, that's easy. Look up here in the corner of the doorway! Here I am. Look, I'm waving!\"  \n\nAt last Wilbur saw the creature that had spoken to",
    "chunk_order_index": 7,
    "full_doc_id": "doc-3b08298f563d8870cdc33f4b784a593e"
  },
  "chunk-72091dc3be025b69229e82edc06c0445": {
    "tokens": 1200,
    "content": "you are. And what are salutations?\"  \n\n\"Salutations are greetings,\" said the voice. \"When I say 'salutations,' it's just my fancy way of saying hello or good morning. Actually, it's a silly expression, and I am surprised that I used it at all. As for my where­ abouts, that's easy. Look up here in the corner of the doorway! Here I am. Look, I'm waving!\"  \n\nAt last Wilbur saw the creature that had spoken to him in such a kindly way. Stretched across the upper part of the doorway was a big spiderweb, and hanging from the top of the web, head down, was a large grey spider. She was about the size of a gumdrop. She had eight legs, and she was waving one of them at Wilbur in friendly greeting. \"See me now?\" she asked.  \n\n![](images/image_14.jpg)  \n\n\"Oh, yes indeed,\" said Wilbur. \"Yes indeed! How are you? Good morning! Salutations! Very pleased to meet you. What is your name, please? May I have your name?\"  \n\n\"My name,\" said the spider, \"is Charlotte.\" \"Charlotte what?\" asked Wilbur, eagerly. \"Charlotte A. Cavatica. But just call me Charlotte.\" \"I think you're beautiful,\" said Wilbur.  \n\n\"Well, I am pretty,\" replied Charlotte. \"There's no denying that. Almost all spiders are rather nice-looking. I'm not as flashy as some, but I'll do. I wish I could see you, Wilbur, as clearly as you can see me.\"  \n\n\"Why can't you?\" asked the pig. \"I'm right here.\"  \n\n\"Yes, but I'm near-sighted,\" replied Charlotte. \"I've always been dreadfully near-sighted. It's good in some ways, not so good in others. Watch me wrap up this fly.\"  \n\nA fly that had been crawling along Wilbur's trough had flown up and blundered into the lower part of Charlotte's web and was tangled in the sticky threads. The fly was beating its wings furiously, trying to break loose and free itself.  \n\n\"First,\" said Charlotte, \"I dive at him.\" She plunged headfirst toward the fly. As she dropped, a tiny silken thread unwound from her rear end.  \n\n\"Next, I wrap him up.\" She grabbed the fly, threw a few jets of silk around it, and rolled it over and over, wrapping it so that it couldn't move. Wilbur watched in horror. He could hardly believe what he was seeing, and although he detested flies, he was sorry for this one.  \n\n![](images/image_15.jpg)  \n\n\"There!\" said Charlotte. \"Now I knock him out, so he'll be more comfortable.\" She bit the fly. \"He can't feel a thing now,\" she remarked. \"He'll make a perfect breakfast for me.\"  \n\n\"You mean you eat flies?\" gasped Wilbur.  \n\n''Certainly. Flies, bugs, grasshoppers, choice beedes, moths,  butterflies, tasty cockroaches, gnats, midges, daddy longlegs, centipedes, mosquitoes, crickets-'.Uly­ thing that is careless enough to get caught in my web. I have to live, don't I?\"  \n\n\"Why, yes, of course,\" said Wilbur. \"Do they taste good?\"  \n\n\"Delicious. Of course, I don't really eat them. I drink them-drink their blood. I love blood,\" said Charlotte, and her pleasant, thin voice grew even thinner and more pleasant.  \n\n\"Don't say that!\" groaned Wilbur. \"Please don't say things like that!\"  \n\n\"Why not? It's true, and I have to say what is true. I am not entirely happy about my diet of flies and bugs, but it's the way I'm made. A spider has to pick up a living somehow or other, and I happen to be a trapper. I just naturally build a web and trap flies and other in­ sects. My mother was a trapper before me. Her mother was a trapper before her. All our family have been trap­ pers. Way back for thousands and thousands of years we spiders have been laying for flies and bugs.\"  \n\n\"It's a miserable inheritance,\" said Wilbur, gloomily. He was sad because his new friend was so bloodthirsty.  \n\n\"Yes, it is,\" agreed Charlotte. \"But I can't help it. I don't know how the first spider in the early days of the world happened to think up this fancy idea of spinning a web, but she did, and it was clever of her, too. And since then, all of us spiders have had to work the same trick. It's not a bad pitch, on the whole.\"  \n\n\"It's cruel,\" replied Wilbur, who did not intend to be argued out of his position.  \n\n\"Well, you can't talk\" said Charlotte. \"You have your meals brought to you in a pail. Nobody feeds me. I have to get my own living. I live by my wits. I have to be sharp and clever, lest I go hungry. I have to think things out, catch what I can, take what comes. And it just so happens, my friend, that what comes is flies and insects and bugs. And furthermore,\" said Charlotte, shaking one of her legs, \"do you realize that if I didn't catch bugs and eat them, bugs would increase and mul­ tiply and get so numerous that they'd destroy the earth, wipe out everything?  \n\n\"Really?\" said Wilbur. \"I wouldn't want that to hap­ pen. Perhaps your web is a good thing after all.\"  \n\nThe goose had been listening to this conversation and chuckling to herself. \"There are a lot of things Wilbur doesn't know",
    "chunk_order_index": 8,
    "full_doc_id": "doc-3b08298f563d8870cdc33f4b784a593e"
  },
  "chunk-7e108d5dd32fbfc810df031e3df250e2": {
    "tokens": 1200,
    "content": ",\" said Charlotte, shaking one of her legs, \"do you realize that if I didn't catch bugs and eat them, bugs would increase and mul­ tiply and get so numerous that they'd destroy the earth, wipe out everything?  \n\n\"Really?\" said Wilbur. \"I wouldn't want that to hap­ pen. Perhaps your web is a good thing after all.\"  \n\nThe goose had been listening to this conversation and chuckling to herself. \"There are a lot of things Wilbur doesn't know about life,\" she thought. \"He's really a very innocent little pig. He doesn't even know what's going to happen to him around Christmastime; he has no idea that Mr. Zuckerman and Lurvy are plotting to kill him.\" And the goose raised herself a bit and poked her eggs a little further under her so that they would receive the full heat from her wann body and soft feathers.  \n\nCharlotte stood quietly over the fly, preparing to eat it. Wilbur lay down and closed his eyes. He was tired from his wakeful night and from the excitement of meeting someone for the first time. A breeze brought him the smell of clover-the sweet-smelling world be­ yond his fence. \"Well,\" he thought, \"I've got a new friend, all right. But what a gamble friendship is! Char­ lotte is fierce, brutal, scheming, bloodthirsty-every­ thing I don't like. How can I learn to like her, even though she is pretty and, of course, clever?\"  \n\nWilbur was merely suffering the doubts and fears that often go with finding a new friend. In good time he was to discover that he was mistaken about Char­ lotte. Underneath her rather bold and cruel exterior, she had a kind heart, and she was to prove loyal and true to the very end.  \n\n# Chapter VI  \n\n# Summer Days  \n\nHE EARLY summer days on a farm are the happiest and fairest days of the year. Lilacs bloom and make the air sweet, and then fade. Apple blossoms come with the lilacs, and the bees visit around among the apple trees. The days grow warm and soft. School ends, and children have time to play and to fish for trouts in the brook. Avery often brought a trout home in his pocket, warm and stiff and ready to be fried for supper.  \n\nNow that school was over, Fern visited the barn al­ most every day, to sit quietly on her stool. The animals treated her as an equal. The sheep lay calmly at her feet.  \n\nAround the first of July, the work horses were hitched to the mowing machine, and Mr. Zuckerman climbed into the seat and drove into the field. All morn­ ing you could hear the rattle of the machine as it went round and round, while the tall grass fell down behind the cutter bar in long green swathes. Next day, if there was no thunder shower, all hands would help rake and pitch and load, and the hay would be hauled to the bam in the high hay wagon, with Fern and Avery rid­ ing at the top of the load. Then the hay would be hoisted, sweet and warm, into the big loft, until the whole bam seemed like a wonderful bed of timothy and clover. It was fine to jump in, and perfect to hide in. And sometimes A very would find a little grass snake in the hay, and would add it to the other things in his pocket.  \n\nEarly summer days are a jubilee time for birds. In the fields, around the house, in the barn, in the woods, in,.the swamp-everywhere love and songs and nests and eggs. From the edge of the woods, the white­ throated sparrow (which must come all the way from Boston) calls, $\\rightsquigarrow$ , Peabody, Peabody, Peabody!\" On an apple bough, the phoebe teeters and wags its tail and says, \"Phoebe, phoe-bee!\" The song sparrow, who knows how brief and lovely life is, says, \"Sweet, sweet, sweet interlude; sweet, sweet, sweet interlude.\" If you enter the barn, the swallows swoop down from their nests and scold. \"Cheeky, cheeky!\" they say.  \n\nIn early summer there are plenty of things for a child to eat and drink and suck and chew. Dandelion stems are full of milk, clover heads are loaded with nectar, the Frigidaire is full of ice-cold drinks. Everywhere you look is life; even the little ball of spit on the weed stalk, if you poke it apan, has a green worm inside it. And on the under side of the leaf of the potato vine are the bright orange eggs of the potato bug.  \n\nIt was on a day in early summer that the goose eggs hatched. This was an important event in the barn cellar. Fern was there, sitting on her stool, when it happened.  \n\nExcept for the goose herself, Charlotte was the first to know that the goslings had at last arrived. The goose knew a day in advance that they were coming-she could hear their weak voices calling from inside the egg. She knew that they were in a desperately cramped po­ sition inside the shell and were most anxious to break through and get out. So she sat quite still, and talked less than usual.  \n\nWhen the first gosling poked its grey-green head through the goose's feathers and looked around, Char­ lotte spied it and made the announcement.  \n\n\"I am sure,\" she said, \"that every one of us here will be gratified to learn that after four weeks of unremit­ ting effon and patience on the pan of our friend the goose, she now has",
    "chunk_order_index": 9,
    "full_doc_id": "doc-3b08298f563d8870cdc33f4b784a593e"
  },
  "chunk-7863557e56e0faf8efd1f9fac73b9514": {
    "tokens": 1200,
    "content": "anxious to break through and get out. So she sat quite still, and talked less than usual.  \n\nWhen the first gosling poked its grey-green head through the goose's feathers and looked around, Char­ lotte spied it and made the announcement.  \n\n\"I am sure,\" she said, \"that every one of us here will be gratified to learn that after four weeks of unremit­ ting effon and patience on the pan of our friend the goose, she now has something to show for it. The gos­ lings have arrived. May I offer my sincere congratula­ tions!\"  \n\n\"Thank you, thank you, thank you!\" said the goose, nodding and bowing shamelessly.  \n\n\"Thank you,\" said the gander.  \n\n\"Congratulations!\" shouted Wilbur. \"How many goslings are there? I can only see one.\"  \n\n\"There are seven,\" said the goose.  \n\n\"Fine!\" said Charlotte. \"Seven is a lucky number.\"  \n\n\"Luck had nothing to do with this,\" said the goose. \"It was good management and hard work.\"  \n\nAt this point, T ernpleton showed his nose from his hiding place under Wilbur's trough. He glant:ed at Fern, then crept cautiously toward the goose, keeping close to the wall. Everyone watched him, for he was not well liked, not trusted.  \n\n\"Look,\" he began in his sharp voice, \"you say you have seven goslings. There were eight eggs. What hap­ pened to the other egg? Why didn't it hatch?\"  \n\n\"It's a dud, I guess,\" said the goose.  \n\n\"What are you going to do with it?\" continued T em­ pleton, his little round beady eyes fixed on the goose.  \n\n\"You can have it,\" replied the goose. \"Roll it away and add it to that nasty collection of yours.\" (Temple­ ton had a habit of picking up unusual objects around the farm and storing them in his horne. He saved every­ thing.)  \n\n\"Certainly-enainly-ertainly,\" said the gander. \"You may have the egg. But I'll tell you one thing, Temple­ ton, if I ever catch you poking-oking-oking your ugly nose around our goslings, I'll give you the worst pound­ ing a rat ever took.\" And the gander opened his strong wings and beat the air with them to show his power. He was strong and brave, but the truth is, both the goose and the gander were worried about Templeton. And with good reason. The rat had no morals, no con­ science, no scruples, no consideration, no decency, no milk of rodent kindness, no compunctions, no higher feeling, no friendliness, no anything. He would kill a gosling if he could get away with it-the goose knew that. Everybody knew it.  \n\n![](images/image_16.jpg)  \n\nWith her broad bill the goose pushed the unhatched egg out of the nest, and the entire company watched in disgust while the rat rolled it away. Even Wilbur, who could  eat almost anything, was appalled. \"Imagine wanting a junky old rotten egg!\" he muttered.  \n\n\"A rat is a rat,\" said Charlotte. She laughed a tinkling little laugh. \"But, my friends, if that ancient egg ever breaks, this barn will be untenable.\"  \n\n\"What's that mean?\" asked Wilbur.  \n\n\"It means nobody will be able to live here on account of the smell. A rotten egg is a regular stink bomb.\"  \n\n\"I won't break it,\" snarled Templeton. \"I know what I'm doing. I handle stuff like this all the time.\"  \n\nHe disappeared into his tunnel, pushing the goose egg in front of him. He pushed and nudged till he suc­ ceeded in rolling it to his lair under the trough.  \n\nThat afternoon, when the wind had died down and the barnyard was quiet and warm, the grey goose led her seven goslings off the nest and out into the world. Mr. Zuckerman spied them when he came with Wil­ bur's supper.  \n\n\"Well, hello there!\" he said, smiling all over. \"Let's see ... one, two, three, four, five, six, seven. Seven baby geese. Now isn't that lovely!\"  \n\nChapter Vl  \n\n# Bad J\\[ews  \n\n![](images/image_17.jpg)  \n\nLBUR liked Charlotte better  and better each day. Her campaign against insects  seemed  sensible  and useful. Hardly anybody around the farm had a good word to say for a fly. Flies spent their time pes­ tering others. The cows hated them. The horses de­ tested them. The sheep loathed them. Mr. and Mrs. Zuckerman were always complaining about them, and putting up screens.  \n\nWilbur admired the way Charlotte managed. He was particularly glad that she always put her victim to sleep before eating it.  \n\n\"It's real thoughtful of you to do that, Charlotte,\" he said.  \n\n\"Yes,\" she replied in her sweet, musical voice, \"I al­ ways give them an anaesthetic so they won't feel pain. It's a little service I throw in.\"  \n\nAs the days went by, \\Vilbur grew and grew. He ate three big meals a day. He spent long hours lying on his side, half asleep, dreaming pleasant dreams. He enjoyed good health and he gained a lot of weight. One after­ noon, when Fern was sitting on her stool, the oldest sheep walked into the barn, and stopped to pay a call on Wilbur.  \n\n\"Hello!\" she said. \"Seems to me you're putting on weight.\"  \n\n\"Yes, I guess I am,\" replied Wilbur. \"At my age it's a good",
    "chunk_order_index": 10,
    "full_doc_id": "doc-3b08298f563d8870cdc33f4b784a593e"
  },
  "chunk-de679bdf72b2d074303f713bbe79e1f4": {
    "tokens": 1200,
    "content": "big meals a day. He spent long hours lying on his side, half asleep, dreaming pleasant dreams. He enjoyed good health and he gained a lot of weight. One after­ noon, when Fern was sitting on her stool, the oldest sheep walked into the barn, and stopped to pay a call on Wilbur.  \n\n\"Hello!\" she said. \"Seems to me you're putting on weight.\"  \n\n\"Yes, I guess I am,\" replied Wilbur. \"At my age it's a good idea to keep gaining.\"  \n\n\"Just the same, I don't envy you,\" said the old sheep. \"You know why they're fattening you up, don't you?\"  \n\n\"No,\" said Wilbur.  \n\n\"Well, I don't like to spread bad news,\" said the sheep, \"but they're fattening you up because they're going to kill you, that's why.\"  \n\n\"They're going to what?\" screamed Wilbur. Fern grew rigid on her stool.  \n\n\"Kill you. Turn you into smoked bacon and ham,'' continued the old sheep. \"Almost all young pigs get murdered by the farmer as soon as the real cold weather sets in. There's a regular conspiracy around here to kill you at Christmastime.  Everybody is in the plot­ Lurvy, Zuckerman, even John Arable.\"  \n\n\"Mr. Arable?\" sobbed Wilbur. \"Fern's father?\"  \n\n\"Cenainly. When a pig is to be butchered, every­ body helps. I'm an old sheep and I see the same thing, same old business, year after year. Arable arrives with his .:z. shoots the •..\"  \n\n\"Stop!\" screamed Wilbur. \"I don't want to die! Save me, somebody! Save me!\" Fern was just about to jump up when a voice was heard.  \n\n\"Be quiet, Wilbur!\" said Charlotte, who had been listening to this awful conversation.  \n\n![](images/image_18.jpg)  \n\n\"I can't be quiet,\" screamed Wilbur, racing up and down. \"I don't want to be killed. I don't want to die. Is it true what the old sheep says, Charlotte? Is it true they are going to  kill me when the cold weather comes?\"  \n\n\"Well,\" said the spider, plucking thoughtfully at her web, \"the old sheep has been around this barn a long time. She has seen many a spring pig come and go. If she says they plan to kill you, I'm sure it's true. It's also the diniest trick I ever heard of. What people don't think of!\"  \n\nWilbur burst into tears. \"I don't want to die,\" he moaned. \"I want to stay alive, right here in my com­ fonable manure pile with all my friends. I want to breathe the beautiful air and lie in the beautiful sun.\"  \n\n\"You're certainly making a beautiful noise,\" snapped the old sheep.  \n\n\"I don't want to die!\" screamed Wilbur, throwing himself to the ground.  \n\n\"You shall not die,\" said Charlotte, briskly.  \n\n\"What? Really?\" cried Wilbur. \"Who's going to save me?\"  \n\n\"I am,\" said Charlotte.   \n\"How?\" asked Wilbur.  \n\n\"That remains to be seen. But I am going to save you, and I want you to quiet down immediately. You're car­ rying on in a childish way. Stop your crying! I can't stand hysterics.\"  \n\n# Chapter VIII  \n\n# A 'f alk At Home  \n\n![](images/image_19.jpg)  \n\nN SUNDAY morning Mr. and Mrs. Arable and F em were sitting at breakfast in the kitchen. Avery had finished and was up­ stairs looking for his slingshot.  \n\n\"Did you know that Uncle Homer's goslings had hatched?\" asked Fern.  \n\n\"How many?\" asked Mr. Arable.  \n\n\"Seven,\" replied Fern. \"There were eight eggs but one egg didn't hatch and the goose told Templeton she didn't want it any more, so he took it away.\"  \n\n\"The goose did what?\" asked Mrs. Arable, gazing at her daughter with a queer, worried look.  \n\n\"Told Templeton she didn't want the egg any more,\" repeated Fern.  \n\n\"Who is Templeton?\" asked Mrs. Arable.  \n\n\"He's the rat,\" replied Fern. \"None of us like him much.\"  \n\n\"Who's 'us'?\" asked Mr. Arable.  \n\n\"Oh, everybody in the barn cellar. Wilbur and the sheep and the lambs and the goose and the gander and the goslings and Charlotte and me.\"  \n\n\"Charlotte? \" said Mrs. Arable. \"Who's Charlotte?\" \"She's Wilbur's best friend. She's terribly clever.\" \"What does she look like?\" asked Mrs. Arable.  \n\n\"Weil-l,\" said Fern, thoughtfully, \"she has eight legs. All spiders do, I guess.\"  \n\n\"Charlotte is a spider?\" asked Fern's mother.  \n\nFern nodded. \"A big grey one. She has a web across the top of Wilbur's doorway. She catches flies and sucks their blood. Wilbur adores her.\"  \n\n\"Does he really?\" said Mrs. Arable, rather vaguely. She was staring at Fern with a worried expression on her face.  \n\n\"Oh, yes, Wilbur adores Charlotte,\" said Fern. \"Do you know what Charlotte said  when the goslings hatched?\"  \n\n\"I haven't the faintest idea,\" said Mr. Arable. \"Tell us.\"  \n\n\"Well, when the first gosling stuck its little head out from under the goose, I was sitting on my stool in the corner and Charlotte was on her web. She made a speech. She said: 'I am sure that every one of us here in the barn cellar will be gratified to learn that after four weeks of unremitting effort",
    "chunk_order_index": 11,
    "full_doc_id": "doc-3b08298f563d8870cdc33f4b784a593e"
  },
  "chunk-c4c63ef9745dc52a9eda2cbc151ca5be": {
    "tokens": 1200,
    "content": "Charlotte said  when the goslings hatched?\"  \n\n\"I haven't the faintest idea,\" said Mr. Arable. \"Tell us.\"  \n\n\"Well, when the first gosling stuck its little head out from under the goose, I was sitting on my stool in the corner and Charlotte was on her web. She made a speech. She said: 'I am sure that every one of us here in the barn cellar will be gratified to learn that after four weeks of unremitting effort and patience on the part of the goose, she now has something to show for it.' Don't you think that was a pleasant thing for her to say?\"  \n\n\"Yes, I do,\" said Mrs. Arable. \"And now, Fern, it's time to get ready for Sunday School. And tell Avery to get ready. And this afternoon you can tell me more about what goes on in Uncle Homer's barn. Aren't you spending quite a lot of time there? You go there almost every afternoon, don't you?\"  \n\n\"I like it there,\" replied Fern. She wiped her mouth and ran upstairs. After she had left the room, Mrs. Arable spoke in a low voice to her husband.  \n\n\"I worry about Fern,\" she said. \"Did you hear the way she rambled on about the animals, pretending that they talked?\"  \n\nMr. Arable chuckled. \"Maybe they do talk,\" he said. \"I've sometimes wondered. At any rate, don't worry about Fern-she's just got a lively imagination. Kids think they hear all sorts of things.\"  \n\n\"Just the same, I do worry about her,\" replied Mrs. Arable. \"I think I shall ask Dr. Doriap about her the next time I see him. He loves Fern almost as much as we do, and I want him to know how queerly she is act­ ing about that pig and everything. I don't think it's nor­ mal. You know perfectly well animals don't talk.\"  \n\nMr. Arable grinned. \"Maybe our ears aren't as sharp as Fern's,\" he said.  \n\n# Chapter IX  \n\n# Wilbur's Boast  \n\nSPIDER'S web is stronger than it looks. Al­ though it is made of thin, delicate strands, the web is not easily broken. However, a web gets tom every day by the insects that kick around in it, and a spider must rebuild it when it gets full of holes. Charlotte liked to do her weaving during the late afternoon, and Fern liked to sit nearby and watch. One afternoon she heard a most interesting conversation and witnessed a strange event.  \n\n\"You have awfully hairy legs, Charlotte,\" said Wil­ bur, as the spider busily worked at her task.  \n\n\"My legs are hairy for a good reason,\" replied Char­ lotte. \"Funhermore, each leg of mine has seven sec­ tions--the coxa, the trochanter, the femur, the patella, the tibia, the metatarsus, and the tarsus.\"  \n\nWilbur sat bolt upright. \"You're kidding,\" he said. \"No, I'm not, either.\"  \n\n\"Say those names again, I didn't catch them the first time.\"  \n\n\"Coxa, trochanter, femur, patella, tibia, metatarsus, and tarsus.\"  \n\n\"Goodness!\" said Wilbur, looking down at his own chubby legs. \"I don't think my legs have seven sec­ tions.\"  \n\n\"Well,\" said Charlotte, \"you and I lead different lives. You don't have to spin a web. That takes real leg work.\"  \n\n\"I could spin a web if I tried,\" said Wilbur, boasting. \"I've just never tried.\"  \n\n\"Let's see you do it,\" said Charlotte. Fern chuckled softly, and her eyes grew wide with love for the pig.  \n\n\"O.K.,\" replied Wilbur. \"You coach me and I'll spin one. It must be a lot of fun to spin a web. How do I starr?\"  \n\n\"Take a deep breath!\" said Charlotte, smiling. Wil­ bur breathed deeply. \"Now climb to the highest place you can get to, like this.\" Charlotte raced up to the top of the doorway. Wilbur scrambled to the top of the manure pile.  \n\n\"Very good! \" said Charlotte. \"Now make an attach­ ment with your spinnerets, hurl yourself into space, and let out a drag line as you go down!\"  \n\nWilbur hesitated a moment, then jumped out into the air. He glanced hastily behind to see if a piece of rope was following him to check his fall, but nothing seemed to be happening in his rear, and the next thing he knew he landed with a thump. \"Ooomp!\" he grunted.  \n\nCharlotte laughed so hard her web began to sway.  \n\n\"What did I do wrong?\" asked the pig, when he re­ covered from his bump.  \n\n\"Nothing,\" said Charlotte. \"It was a nice try.\"  \n\n\"I think I'll try again,\" said Wilbur, cheerfully. \"I believe what I need is a little piece of string to hold me.\"  \n\nThe pig walked out to his yard. \"You there, Temple­ ton?\" he called. The rat poked his head out from under the trough.  \n\n\"Got a little piece of string I could borrow?\" asked \\Vilbur. \"I need it to spin a web.\"  \n\n\"Yes, indeed,\" replied Templeton, who saved string. \"No trouble at all. Anything to oblige.\" He crept down into his hole, pushed the goose egg out of the way, and returned with an old piece of dirty white string. Wilbur examined it.  \n\n\"That's just the thing,\" he said. \"Tie one end to my tail, will you, Templeton?\"",
    "chunk_order_index": 12,
    "full_doc_id": "doc-3b08298f563d8870cdc33f4b784a593e"
  },
  "chunk-8283e172a34b705e2bf78188f93cb933": {
    "tokens": 388,
    "content": "I could borrow?\" asked \\Vilbur. \"I need it to spin a web.\"  \n\n\"Yes, indeed,\" replied Templeton, who saved string. \"No trouble at all. Anything to oblige.\" He crept down into his hole, pushed the goose egg out of the way, and returned with an old piece of dirty white string. Wilbur examined it.  \n\n\"That's just the thing,\" he said. \"Tie one end to my tail, will you, Templeton?\"  \n\n\\Vilbur crouched low, with his thin, curly tail toward the rat. Templeton seized the string, passed it around the end of the pig's tail, and tied two half hitches. Char­ lotte watched in delight. Like Fern, she was truly fond of Wilbur, whose smelly pen and stale food attracted the flies that she needed, and she was proud to see thar he was not a quitter and was willing to try again to spin a web.  \n\n![](images/image_20.jpg)  \n\nWhile the rat and the spider and the little girl watched, Wilbur climbed again to the top of the ma­ nure pile, full of energy and hope.  \n\n\"Everybody watch!\" he cried. And summoning all his strength, he threw himself into the air, headfirst. The string trailed behind him. But as he had neglected to fasten the other end to anything, it didn't really do any good, and Wilbur landed with a thud, crushed and hurt. Tears came to his eyes. Templeton grinned. Char­ lotte just sat quietly. After a bit she spoke.  \n\n\"You can't spin a web, Wilbur, and I advise you to put the idea out of your mind. You lack two things needed for spinning a web.\"  \n\n\"What are they?\" asked Wilbur, sadly.  \n\n\"You lack a set of spinnerets, and you lack know",
    "chunk_order_index": 13,
    "full_doc_id": "doc-3b08298f563d8870cdc33f4b784a593e"
  }
}