{
    "image_1": {
        "image_id": 1,
        "image_path": "./fusion_research/fusion_dataset/novel/Charlottes Web (E. B. White) (1)/images/image_1.jpg",
        "caption": [],
        "footnote": [],
        "context": "Text copyright $\\circledcirc$ renewed 1980 by E. B. White Illustrations copyright renewed 1980 by Garth Williams All rights reserved. No part of this book may be used or reproduced in any manner whatsoever without wriuen permission except in the case of brief quotations embodied in critical articles and reviews. Printed in the United States of America. For information address Harper&: Row, Publishers Inc., 10 East 53rd Street, New Copyright@ 1952 by E. B. White CHARLOTTE'S WEB A HARPER TROPHY BOOK HARPER & ROW, PUBLISHER NEW YORK, EVANSTON, SAN FRANCIS<D, LONDON PICTURES BY GARTH WILLIAMS by E. B. WHITE Charlotte's Web ",
        "chunk_order_index": 0,
        "chunk_id": "chunk-88d8d5ab304640079a5248faddab5504",
        "description": "The image is the cover of the book 'Charlotte's Web' by E.B. White, illustrated by Garth Williams. The cover features a young girl with light brown hair tied back in a ponytail, wearing a red dress and a white collar. She is holding a piglet in her arms, and to her right is a goose. In the background, there is a sheep looking at the girl and the piglet. The title 'Charlotte's Web' is written in large, blue, cursive letters at the top of the cover, with a spider web design behind it. The price of the book, $2.50, is indicated in the top right corner. The bottom of the cover includes the author's name, E.B. White, and mentions that he is also the author of 'Stuart Little'. The illustrator's name, Garth Williams, is also mentioned. The overall atmosphere of the image is warm and nostalgic, evoking a sense of childhood and the bond between humans and animals.",
        "segmentation": true
    },
    "image_2": {
        "image_id": 2,
        "image_path": "./fusion_research/fusion_dataset/novel/Charlottes Web (E. B. White) (1)/images/image_2.jpg",
        "caption": [],
        "footnote": [],
        "context": "Mrs. Arable put a \"Do away with it?\" shrieked Fern. \"You mean kill it? Just because it's smaller than the others?\" \"Well,\" said her mother, \"one of the pigs is a runt. It's very small and weak, and it will never amount to anything. So your father has decided to do away with it.\" \"I don't see why he needs an ax,\" continued Fern, who was only eight.  HERE'S Papa going with that ax?\" said Fern to her mother as they were setting the table for breakfast. \"Out to the hoghouse,\" replied Mrs. Arable. \"Some pigs were born last night.\" Book Number: 06-440055-7 First printed in 1952. Contents I. BEFORE BREAKFAST II. WILBUR 8 III. ESCAPE I J IV.LONELINESSz;v. CHARLOTTE J2 VI. SUMMER DAYS 42 VII. BAD NEWS 48 VIII.A TALK AT HOME52IX. WILBURS BOAST 55 X. AN EXPLOSION 66 XI. THE MIRACLE 77 XII. A MEETING 86 XIII. GOOD PROGRESS 92 XIV. DR. DORIAN 105 XV. THE CRICKETS I I J XVI. OFF TO THE FAIR 118 XVII. UNCLE lJO XVIII. THE COOL OF THE EVENING IJ8 XIX. THE EGG SAC 144 XX. THE HOUR OF TRIUMPH 155 XXI.LAST DAY163 XXII.A WARM WIND172 Charlotte's Web Chapter 1 Before Breakfast ",
        "chunk_order_index": 0,
        "chunk_id": "chunk-88d8d5ab304640079a5248faddab5504",
        "description": "The image displays a large, bold black letter 'W' on a white background. The letter is serifed and appears to be part of a larger text or title. The font is classic and formal, with thick strokes and pronounced serifs at the ends of the letter's lines.",
        "segmentation": false
    },
    "image_3": {
        "image_id": 3,
        "image_path": "./fusion_research/fusion_dataset/novel/Charlottes Web (E. B. White) (1)/images/image_3.jpg",
        "caption": [],
        "footnote": [],
        "context": "\"But it's unfair,\" cried Fern. \"The pig couldn't help being born small, \"Fern,\" said Mr. Arable, \"I know more about raising a litter of pigs than you do. A weakling makes trouble. Now run along!\" Tears ran down her cheeks and she took hold of the ax and tried to pull it out of her father's hand. \"Control myself?\" yelled F em. \"This is a matter of life and death, and you talk about controlling myself.\" \"Fern,\" he said gently, \"you will have to learn to control yourself.\" \"Please don't kill it!\" she sobbed. \"It's unfair.\" Mr. Arable stopped walking. a runt. It's very small and weak, and it will never amount to anything. So your father has decided to do away with it.\" \"Do away with it?\" shrieked Fern. \"You mean kill it? Just because it's smaller than the others?\" Mrs. Arable put a pitcher of cream on the table. \"Don't yell, Fern!\" she said. \"Your father is right. The pig would probably die anyway.\" Fern pushed a chair out of the way and ran outdoors. The grass was wet and the earth smelled of springtime. Fern's sneakers were sopping by the time she caught up. with her father. ",
        "chunk_order_index": 0,
        "chunk_id": "chunk-88d8d5ab304640079a5248faddab5504",
        "description": "The image is a black and white illustration depicting a dramatic scene between two characters. A man, wearing overalls and a hat, is holding an ax in his right hand, seemingly preparing to strike. His facial expression conveys determination or resolve. A young girl, with her hair tied back and wearing a dress, is clinging to the man's arm with both hands, trying to prevent him from using the ax. Her posture and expression suggest desperation and fear. The background is minimalistic, focusing entirely on the interaction between the two characters. The grass at their feet indicates they are outdoors. The overall atmosphere of the image is tense and emotional, capturing a moment of conflict and urgency.",
        "segmentation": true
    },
    "image_4": {
        "image_id": 4,
        "image_path": "./fusion_research/fusion_dataset/novel/Charlottes Web (E. B. White) (1)/images/image_4.jpg",
        "caption": [],
        "footnote": [],
        "context": "But Fern couldn't eat until her pig had had a drink of milk. \"No, I only distribute pigs to early risers,\" said Mr. Arable. \"F em was up at daylight, trying to rid the world of injustice. As a result, she now has a pig. A small one, to be sure, but nevertheless a pig. It just shows what can happen if a person gets out of bed promptly. Let's eat!\" \"Can I have a pig, too, Pop?\" asked Avery. \"Wash up and eat your breakfast, Avery!\" said his mother. \"The school bus will be along in half an hour.\"  mother. Then she opened the lid again, lifted the pig out, and held it against her cheek. At this moment her brother A very came into the room. A very was ten. He was heavily armed -an air rifle in one hand, a wooden dagger in the other. \"What's that?\" he demanded. \"What's Fern got?\" 11She's got a guest for breakfast,\" said Mrs. Arable. 11Wash your hands and face, Avery!\" \"Let's see it!\" said Avery, setting his gun down. uy ou call that miserable thing a pig? That's a fine specimen of a pig-it's no bigger than a white rat.\" ",
        "chunk_order_index": 1,
        "chunk_id": "chunk-6af6d5471c45dac92b433fd22aa6f6ff",
        "description": "The image is a black-and-white illustration of a young boy holding a rifle. The boy has short hair and is depicted in a side profile, facing to the right. He is wearing a sleeveless shirt with a visible strap over his shoulder, which appears to be part of a bag or pouch. The rifle is slung over his shoulder and rests on his left arm, with the barrel pointing downward. The boy's expression is serious and focused, suggesting a sense of determination or readiness. The background is plain and does not provide any additional context or details.",
        "segmentation": true
    },
    "image_5": {
        "image_id": 5,
        "image_path": "./fusion_research/fusion_dataset/novel/Charlottes Web (E. B. White) (1)/images/image_5.jpg",
        "caption": [],
        "footnote": [],
        "context": "The children ran out to the road and climbed into the bus. Fern took no notice of the others in the bus. She just sat and stared out of the \"Run!\" commanded Mrs. Arable, taking the pig from Fern and slipping a doughnut into her hand. Avery grabbed his gun and another doughnut. The school bus honked from the road.  A minute later, Fern was seated on the floor in the comer of the kitchen with her infant between her knees, teaching it to suck from the bottle. The pig, although tiny, had a good appetite and caught on quickly.  early risers,\" said Mr. Arable. \"F em was up at daylight, trying to rid the world of injustice. As a result, she now has a pig. A small one, to be sure, but nevertheless a pig. It just shows what can happen if a person gets out of bed promptly. Let's eat!\" But Fern couldn't eat until her pig had had a drink of milk. Mrs. Arable found a baby's nursing bottle and a rubber nipple. She poured warm milk into the bottle, fitted the nipple over the top, and handed it to Fer \"Give him his breakfast!\" she said. ",
        "chunk_order_index": 1,
        "chunk_id": "chunk-6af6d5471c45dac92b433fd22aa6f6ff",
        "description": "The image is a black-and-white line drawing depicting a young girl feeding a baby pig from a bottle. The girl is seated cross-legged on the floor, wearing a long-sleeved shirt and pants with socks. Her hair is shoulder-length and appears to be tied back. She holds the baby pig securely in her lap with one hand while feeding it with the other. The baby pig is small and round, with its head tilted up to drink from the bottle. The girl's expression is gentle and attentive, conveying a sense of care and nurturing. The overall atmosphere of the image is warm and serene, highlighting the bond between the girl and the baby pig.",
        "segmentation": true
    },
    "image_6": {
        "image_id": 6,
        "image_path": "./fusion_research/fusion_dataset/novel/Charlottes Web (E. B. White) (1)/images/image_6.jpg",
        "caption": [],
        "footnote": [],
        "context": "Every morning after breakfast, Wilbur walked out to the road with Fern and waited with her till the bus came. She would wave good-bye to him, and he would stand and watch the bus until it vanished around a turn. While Fern was in school, Wilbur was shut up inside his yard. But as soon as she got home in the afternoon, she would take him out and he would follow her around the place. If she went into the house, Wilbur went, too. If she went upstairs, Wilbur would wait at the bottom step until she came down again.  of milk, Fern sat down under the apple tree inside the yard. Wilbur ran to her and she held the bottle for him while he sucked. \\Vhen he had finished the last drop, he grunted and walked sleepily into the box. Fern peered through the door. Wilbur was poking the straw with his snout. In a short time he had dug a tunnel in the straw. He crawled into the tunnel and disappeared from sight, completely cov­ ered with straw. Fern was enchanted. It relieved her mind to know that her baby would sleep covered up, and would stay warm. ",
        "chunk_order_index": 1,
        "chunk_id": "chunk-6af6d5471c45dac92b433fd22aa6f6ff",
        "description": "The image is a black-and-white illustration depicting a serene outdoor scene. A young girl with long hair is kneeling on the ground, holding a bottle of milk and feeding a small piglet. The girl appears to be smiling gently, conveying a sense of warmth and affection towards the piglet. The piglet is standing close to her, eagerly drinking from the bottle. To the left of the girl, there is a wooden box that seems to be the piglet's shelter. Inside the box, there is some straw, and the piglet has already started digging into it, creating a tunnel-like structure. The girl is looking at the piglet with a caring and attentive expression. In the background, there is an apple tree with leaves, providing shade over the scene. The setting appears to be a farmyard or a rural area, as indicated by the fence and the natural surroundings. The overall atmosphere of the image is one of tranquility and tender interaction between the girl and the piglet.",
        "segmentation": true
    },
    "image_7": {
        "image_id": 7,
        "image_path": "./fusion_research/fusion_dataset/novel/Charlottes Web (E. B. White) (1)/images/image_7.jpg",
        "caption": [],
        "footnote": [],
        "context": "\"He's  Wilbur was what farmers call a spring pig, which simply means that he was born in springtime. When he was five weeks old, Mr. Arable said he was now big enough to sell, and would have to be sold. Fern broke down and wept. But her father was finn about it. Wil­ bur's appetite \u0004d increased; he was beginning to eat scraps of food in addition to milk. Mr. Arable was not willing to provide for him any longer. He had already sold Wilbur's ten brothers and sisters. Every day was a happy day, and every night was peaceful.  Fern would wheel the carriage very slowly and smoothly so as not to wake her infants. One warm afternoon, Fern and A very put on bath­ ing suits and went down to the brook for a swim. Wilbur tagged along at Fern's heels. When she waded into the brook, Wilbur waded in with her. He found the water quite cold-too cold for his liking. So while the children swam and played and splashed water at each other, Wilbur amused himself in the mud along the edge of the brook, where it was wann and moist and delightfully sticky and oozy. ",
        "chunk_order_index": 2,
        "chunk_id": "chunk-af0922057792e2694b52ac7347267e32",
        "description": "The image is a black-and-white illustration depicting a woman pushing a baby carriage. The woman appears to be in motion, as indicated by her posture and the position of her legs. She is bending forward slightly, suggesting she is actively pushing the carriage. Her hair is tied back in a messy bun, and she is wearing a loose-fitting shirt and pants. The baby carriage is old-fashioned, with large wheels and a canopy. Inside the carriage, there are two infants lying down. The background is minimalistic, with only a few lines indicating grass or ground, which gives the impression that they are outdoors. The overall atmosphere conveyed by the image is one of care and routine, capturing a moment of daily life.",
        "segmentation": true
    },
    "image_8": {
        "image_id": 8,
        "image_path": "./fusion_research/fusion_dataset/novel/Charlottes Web (E. B. White) (1)/images/image_8.jpg",
        "caption": [],
        "footnote": [],
        "context": "Fern came almost every day to visit him. She found an old milking stool that had been discarded, and she placed the stool in the sheepfold next to Wilbur's pen. Here she sat quietly during the long afternoons, thinking and listening and watching Wilbur. The sheep soon got to Wilbur's new home was in the lower part of the barn, directly underneath the cows. Mr. Zuckerman knew that a manure pile is a good place to keep a young pig. Pigs need warmth, and it was warm and com­ fonable down there in the barn cellar on the south si4e. work horses, tie-ups on the main floor for the cows, a sheepfold down below for the sheep, a pigpen down below for Wilbur, and it was full of all sons of things that you find in barns: ladders, grindstones, pitch forks, monkey wrenches, scythes, lawn mowers, snow shovels, ax handles, milk pails, water buckets, empty grain sacks, and rusty rat traps. It was the kind of barn that swallows like to build their nests in. It was the kind of barn that children like to play in. And the whole thing was owned by Fern's uncle, Mr. Horner L. Zuckerman.  ",
        "chunk_order_index": 2,
        "chunk_id": "chunk-af0922057792e2694b52ac7347267e32",
        "description": "The image is a black-and-white illustration depicting a pig feeding from a manger. The pig is positioned in the foreground, with its head lowered into the manger, suggesting it is eating. The manger is rectangular and appears to be made of wood. The background shows a rustic farm setting with various elements such as hay or straw scattered on the ground. There is also a fence or barrier in the background, indicating that the pig is in an enclosed area, likely a barn or sheepfold. The overall atmosphere conveyed by the image is one of simplicity and rural life, capturing a moment of routine activity on a farm.",
        "segmentation": true
    },
    "image_9": {
        "image_id": 9,
        "image_path": "./fusion_research/fusion_dataset/novel/Charlottes Web (E. B. White) (1)/images/image_9.jpg",
        "caption": [],
        "footnote": [],
        "context": "\"There's never anything to do around here,\" he thought. He walked slowly to his food trough and sniffed to see if anything had been overlooked at lunch. He found a small strip of potato skin and ate it. His back itched, so he leaned against the fence and rubbed against the boards. When he tired of this, he walked indoors, climbed to One afternoon in June, when Wilbur was almost two months old, he wandered out into his small yard outside the barn. Fern had not arrived for her usual visit. Wilbur stood in the sun feeling lonely and bored.   her. So did the geese, who lived with the sheep. All the animals trusted her, she was so quiet and friendly. Mr. Zuckerman did not allow her to take Wilbur out, and he did not allow her to get into the pigpen. But he told Fern that she could sit on the stool and watch Wilbur as long as she wanted to. It made her happy just to be near the pig, and it made Wilbur happy to know that she was sitting there, right outside his pen. But he never had any fun­ no walks, no rides, no swims.  ",
        "chunk_order_index": 3,
        "chunk_id": "chunk-3981b1c5af4e3842504974dea9036f28",
        "description": "The image is a black-and-white illustration depicting a young girl sitting on a stool outside a barn, leaning against the wooden fence. She has her hair tied back and is wearing a dress. Her posture suggests she is observing something with interest or concern. To her left, there is a goose lying on the ground, facing away from her. The goose appears to be resting or possibly brooding. To her right, there is a sheep with a fluffy wool coat, also facing away from her. The sheep seems to be grazing or looking around. The scene is set in a rural environment, with hay scattered on the ground and the wooden structure of the barn visible in the background. The overall atmosphere conveys a sense of quiet companionship and observation between the girl and the animals.",
        "segmentation": true
    },
    "image_10": {
        "image_id": 10,
        "image_path": "./fusion_research/fusion_dataset/novel/Charlottes Web (E. B. White) (1)/images/image_10.jpg",
        "caption": [],
        "footnote": [],
        "context": "\"Run downhill!\" suggested the  The cocker spaniel sprang for Wilbur's hind leg. Wilbur jumped and ran. Lurvy reached out and grabbed. Mrs. Zuckerman screamed at Lurvy. The goose cheered for Wilbur. Wilbur dodged between Lurvy's legs. Lurvy missed Wilbur and grabbed the spaniel instead. \"Nicely done, nicely done!\" cried the goose. \"Try it again, try it again!\" The goose took command and began to give orders. \"Don't just stand there, Wilbur! Dodge about, dodge about!\" cried the goose. \"Skip around, run toward me, slip in and out, in and out, in and out! Make for the woods! Twist and tum!\"  do or which way to run. It seemed as though everybody was after him. \"If this is what it's like to be free,\" he thought, \"I believe I'd rather be penned up in my own yard.\" The cocker spaniel was sneaking up on him from one side, Lurvy the hired man was sneaking up on him from the other side. Mrs. Zuckerman stood ready to head him off if he started for the garden, and now Mr. Zuckerman was coming down toward him carrying a pail. \"This is really awful,\" thought Wilbur. \"Why doesn't Fern come?\" He began to cry. ",
        "chunk_order_index": 4,
        "chunk_id": "chunk-5bf5bf2191af13969f9f78ef8892d98b",
        "description": "The image is a black-and-white illustration depicting two characters in an outdoor setting. On the left, there is a man wearing a wide-brimmed hat and a long-sleeved shirt with rolled-up sleeves. He appears to be in motion, stepping forward with one foot raised, suggesting he is walking or running. His posture is upright, and he has a calm expression on his face. To his right, there is a woman dressed in a long, patterned dress with a full skirt. She is also in motion, with one arm extended outward and her other hand resting on her hip. Her expression conveys urgency or concern, as if she is trying to reach out to someone or something. The background is minimalistic, featuring only a few tufts of grass, which suggests they are in a field or open area. The overall atmosphere of the image conveys a sense of action and urgency, possibly related to a chase or pursuit.",
        "segmentation": true
    },
    "image_11": {
        "image_id": 11,
        "image_path": "./fusion_research/fusion_dataset/novel/Charlottes Web (E. B. White) (1)/images/image_11.jpg",
        "caption": [],
        "footnote": [],
        "context": "Poor Wilbur was dazed and frightened by this hullabaloo. He didn't like being the center of all this fuss. He tried to follow the instructions his friends were giving him, but he couldn't run downhill and uphill at the same time, and he couldn't turn and twist when he was jumping and dancing, and he was crying so hard he could barely see anything that was happening. After all, \"Listen to me, listen to me!\" screamed the goose. \"Look out for Zuckerman!\" yelled the gander. \"Watch out for the dog!\" cried the sheep. \"Look out for Lurvy!\" called the cows. toward me, slip in and out, in and out, in and out! Make for the woods! Twist and tum!\" The cocker spaniel sprang for Wilbur's hind leg. Wilbur jumped and ran. Lurvy reached out and grabbed. Mrs. Zuckerman screamed at Lurvy. The goose cheered for Wilbur. Wilbur dodged between Lurvy's legs. Lurvy missed Wilbur and grabbed the spaniel instead. \"Nicely done, nicely done!\" cried the goose. \"Try it again, try it again!\"  \"Run downhill!\" suggested the cows. \"Run toward me!\" yelled the gander. \"Run uphill!\" cried the sheep. \"Turn and twist!\" honked the goose. \"Jump and dance!\" said the rooster. ",
        "chunk_order_index": 4,
        "chunk_id": "chunk-5bf5bf2191af13969f9f78ef8892d98b",
        "description": "The image is a black-and-white illustration depicting a chaotic scene on a farm. At the center of the image, a boy is depicted in a dynamic pose, seemingly falling or tumbling over two piglets. The boy is wearing a short-sleeved shirt and pants, with one leg raised and the other bent at the knee, suggesting movement and distress. His hair is tousled, and his expression appears to be one of surprise or fear. The piglets are positioned under him, with one facing forward and the other turned away, both appearing to be startled by the boy's fall. In the background, various farm animals are shown in different states of activity. To the left, a goose stands with its wings spread, its beak open as if it is shouting. Next to the goose, a rooster is depicted with its head turned, possibly calling out. On the right side of the image, a sheep is shown with its woolly coat detailed, standing near a fence. Behind the sheep, a horse is partially visible, peeking over the fence with an alert expression. The overall atmosphere of the image conveys a sense of urgency and confusion, with the animals appearing to be in a state of alarm or excitement.",
        "segmentation": true
    },
    "image_12": {
        "image_id": 12,
        "image_path": "./fusion_research/fusion_dataset/novel/Charlottes Web (E. B. White) (1)/images/image_12.jpg",
        "caption": [],
        "footnote": [],
        "context": "\"I never do those things if I can avoid them,\" replied the rat, sourly. \"I prefer to spend my time eating, gnaw­ ing, spying, and hiding. I am a glutton but not a merrymaker. Right now I am on my way to your trough to eat your breakfast, since you haven't got sense enough to eat it yourself.\" And Templeton, the rat, crept stealthily along the wall and \"Well,\" said Wilbur, \"it means to have fun, to frolic, to run and skip and make merry.\" \"Play?\" said Templeton, twirling his whiskers. \"Play? I hardly know the meaning of the word.\" can something be less than nothing? If there were something that was less than nothing, then noth­ ing would not be nothing, it would be something­ even though it's just a very little bit of something. But if nothing is nothing, then nothing has nothing that is less than it is.\" \"Oh, be quiet!\" said the lamb. \"Go play by yourself! I don't play with pigs.\" Sadly, Wilbur lay down and listened to the rain. Soon he saw the rat climbing down a slanting board that he used as a stairway. \"Will you play with me, Templeton?\" asked Wil­ bur. ",
        "chunk_order_index": 6,
        "chunk_id": "chunk-6185f58346fe09cf899808ae2d44c5f3",
        "description": "The image is a black and white illustration depicting a scene on a rainy day. In the foreground, there is a lamb standing in a muddy area with puddles of water. The lamb has a woolly coat and appears to be looking upwards, possibly at the rain or something out of the frame. Behind the lamb, there is a wooden fence with a small hole through which a pig's face is visible. The pig looks curious and is peering through the hole. The background shows raindrops falling, adding to the atmosphere of the scene. The overall mood conveyed is one of solitude and perhaps a bit of melancholy due to the rainy weather and the solitary figure of the lamb.",
        "segmentation": true
    },
    "image_13": {
        "image_id": 13,
        "image_path": "./fusion_research/fusion_dataset/novel/Charlottes Web (E. B. White) (1)/images/image_13.jpg",
        "caption": [],
        "footnote": [],
        "context": "\"I'm right up here,\" said the voice. \"But I can't see you,\" said Wilbur, jumping to his feet. \"Where are you? And who are you?\" Darkness settled over everything. Soon there were only shadows and the noises of the sheep chewing their cuds, and occasionally the rattle of a cow-chain up overhead. You can imagine Wilbur's surprise when, out of the darkness, came a small voice he had never heard before. It sounded rather thin, but pleasant. \"Do you want a friend, Wilbur?\" it said. \"I'll be a friend to you. I've watched you all day and I like you.\" in the pouring rain, but even that didn't comfon him. Friendless, dejected, and hungry, he threw himself down in the manure and sobbed. Late that afternoon, Lurvy went to Mr. Zuckerman. \"I think there's something wrong with that pig of yours. He hasn't touched his food.\" \"Give him two spoonfuls of sulphur and a little mo­ lasses,\" said Mr. Zuckerman. Wilbur couldn't believe what was happening to him when Lurvy caught him and forced the medicine down his throat. This was cenainly the worst day of his life. He didn't know whether he could endure the awful loneliness any more. ",
        "chunk_order_index": 6,
        "chunk_id": "chunk-6185f58346fe09cf899808ae2d44c5f3",
        "description": "The image is a black and white line drawing of a small pig lying down on the ground. The pig appears to be resting or sleeping, with its body curled up in a relaxed position. Its head is nestled into its front legs, and its eyes are closed, suggesting a state of rest or sleep. The pig's fur is depicted with fine lines, giving it a textured appearance. The background is minimalistic, with only a few lines indicating some grass or hay beneath the pig. The overall atmosphere conveyed by the image is one of tranquility and peacefulness, as the pig seems content and at ease in its environment.",
        "segmentation": true
    },
    "image_14": {
        "image_id": 14,
        "image_path": "./fusion_research/fusion_dataset/novel/Charlottes Web (E. B. White) (1)/images/image_14.jpg",
        "caption": [],
        "footnote": [],
        "context": "\"Why can't you?\" asked the pig. \"I'm \"Well, I am pretty,\" replied Charlotte. \"There's no denying that. Almost all spiders are rather nice-looking. I'm not as flashy as some, but I'll do. I wish I could see you, Wilbur, as clearly as you can see me.\" \"My name,\" said the spider, \"is Charlotte.\" \"Charlotte what?\" asked Wilbur, eagerly. \"Charlotte A. Cavatica. But just call me Charlotte.\" \"I think you're beautiful,\" said Wilbur. \"Oh, yes indeed,\" said Wilbur. \"Yes indeed! How are you? Good morning! Salutations! Very pleased to meet you. What is your name, please? May I have your name?\"  that I used it at all. As for my where­ abouts, that's easy. Look up here in the corner of the doorway! Here I am. Look, I'm waving!\"  At last Wilbur saw the creature that had spoken to him in such a kindly way. Stretched across the upper part of the doorway was a big spiderweb, and hanging from the top of the web, head down, was a large grey spider. She was about the size of a gumdrop. She had eight legs, and she was waving one of them at Wilbur in friendly greeting. \"See me now?\" she asked. ",
        "chunk_order_index": 8,
        "chunk_id": "chunk-72091dc3be025b69229e82edc06c0445",
        "description": "The image is a black-and-white illustration depicting a scene from a farmyard. In the foreground, a pig is standing on its hind legs, looking up at a spiderweb that spans across the upper part of the doorway. The spiderweb is intricately drawn, with a spider hanging upside down from the top of the web, waving one of its legs in a friendly gesture. The spider appears to be about the size of a gumdrop and has eight legs. To the right of the spiderweb, there is a wooden structure, possibly a barn or a shed, with a tree nearby. In the background, various farm animals can be seen, including cows and chickens, grazing and moving around. The overall atmosphere of the image conveys a sense of curiosity and friendliness as the pig interacts with the spider.",
        "segmentation": true
    },
    "image_15": {
        "image_id": 15,
        "image_path": "./fusion_research/fusion_dataset/novel/Charlottes Web (E. B. White) (1)/images/image_15.jpg",
        "caption": [],
        "footnote": [],
        "context": "\"Delicious. Of course, I don't really eat them. I drink them-drink their blood. I love blood,\" said \"Why, yes, of course,\" said Wilbur. \"Do they taste good?\" ''Certainly. Flies, bugs, grasshoppers, choice beedes, moths, butterflies, tasty cockroaches, gnats, midges, daddy longlegs, centipedes, mosquitoes, crickets-'.Uly­ thing that is careless enough to get caught in my web. I have to live, don't I?\" \"You mean you eat flies?\" gasped Wilbur. \"There!\" said Charlotte. \"Now I knock him out, so he'll be more comfortable.\" She bit the fly. \"He can't feel a thing now,\" she remarked. \"He'll make a perfect breakfast for me.\"  web and was tangled in the sticky threads. The fly was beating its wings furiously, trying to break loose and free itself. \"First,\" said Charlotte, \"I dive at him.\" She plunged headfirst toward the fly. As she dropped, a tiny silken thread unwound from her rear end.  \"Next, I wrap him up.\" She grabbed the fly, threw a few jets of silk around it, and rolled it over and over, wrapping it so that it couldn't move. Wilbur watched in horror. He could hardly believe what he was seeing, and although he detested flies, he was sorry for this one. ",
        "chunk_order_index": 8,
        "chunk_id": "chunk-72091dc3be025b69229e82edc06c0445",
        "description": "The image is a black and white illustration depicting a spider capturing a fly in its web. The spider is positioned at the center of the web, with its body oriented towards the bottom right corner of the image. The spider's legs are extended, and it appears to be in the process of wrapping the fly with silk. The fly is located near the center of the web, entangled in the sticky threads. Its wings are spread out, and it seems to be struggling to break free. The web is drawn with multiple intersecting lines, creating a complex pattern that ensnares the fly. The overall atmosphere conveyed by the image is one of tension and struggle, as the fly fights for its freedom while the spider methodically secures its prey.",
        "segmentation": true
    },
    "image_16": {
        "image_id": 16,
        "image_path": "./fusion_research/fusion_dataset/novel/Charlottes Web (E. B. White) (1)/images/image_16.jpg",
        "caption": [],
        "footnote": [],
        "context": "\"I \"It means nobody will be able to live here on account of the smell. A rotten egg is a regular stink bomb.\" \"What's that mean?\" asked Wilbur. \"A rat is a rat,\" said Charlotte. She laughed a tinkling little laugh. \"But, my friends, if that ancient egg ever breaks, this barn will be untenable.\" With her broad bill the goose pushed the unhatched egg out of the nest, and the entire company watched in disgust while the rat rolled it away. Even Wilbur, who could eat almost anything, was appalled. \"Imagine wanting a junky old rotten egg!\" he muttered.  around our goslings, I'll give you the worst pound­ ing a rat ever took.\" And the gander opened his strong wings and beat the air with them to show his power. He was strong and brave, but the truth is, both the goose and the gander were worried about Templeton. And with good reason. The rat had no morals, no con­ science, no scruples, no consideration, no decency, no milk of rodent kindness, no compunctions, no higher feeling, no friendliness, no anything. He would kill a gosling if he could get away with it-the goose knew that. Everybody knew it. ",
        "chunk_order_index": 10,
        "chunk_id": "chunk-7863557e56e0faf8efd1f9fac73b9514",
        "description": "The image is a black-and-white illustration depicting a scene from a barnyard. A young girl with braided hair is kneeling on the ground, observing two geese and a rat. The girl is dressed in a short-sleeved shirt and pants, with her hair tied back in two braids. One of the geese is standing upright, looking towards the right side of the image, while the other goose is sitting on a nest. The rat is positioned in front of the nest, appearing to be interacting with the egg inside. In the background, there is a wooden fence and a spider web with a spider hanging from it. The overall atmosphere of the image conveys a sense of curiosity and interaction between the girl and the animals.",
        "segmentation": true
    },
    "image_17": {
        "image_id": 17,
        "image_path": "./fusion_research/fusion_dataset/novel/Charlottes Web (E. B. White) (1)/images/image_17.jpg",
        "caption": [],
        "footnote": [],
        "context": "\"Yes,\" she replied in her \"It's real thoughtful of you to do that, Charlotte,\" he said. Wilbur admired the way Charlotte managed. He was particularly glad that she always put her victim to sleep before eating it.  LBUR liked Charlotte better and better each day. Her campaign against insects seemed sensible and useful. Hardly anybody around the farm had a good word to say for a fly. Flies spent their time pes­ tering others. The cows hated them. The horses de­ tested them. The sheep loathed them. Mr. and Mrs. Zuckerman were always complaining about them, and putting up screens. He disappeared into his tunnel, pushing the goose egg in front of him. He pushed and nudged till he suc­ ceeded in rolling it to his lair under the trough. That afternoon, when the wind had died down and the barnyard was quiet and warm, the grey goose led her seven goslings off the nest and out into the world. Mr. Zuckerman spied them when he came with Wil­ bur's supper. \"Well, hello there!\" he said, smiling all over. \"Let's see ... one, two, three, four, five, six, seven. Seven baby geese. Now isn't that lovely!\" Chapter Vl Bad J\\[ews ",
        "chunk_order_index": 10,
        "chunk_id": "chunk-7863557e56e0faf8efd1f9fac73b9514",
        "description": "The image displays a large, bold black letter 'W' on a white background. The letter 'W' is the only object in the image, and it is centered both horizontally and vertically. The font used for the letter appears to be serif, with thick strokes and pronounced serifs at the ends of the strokes. The background is plain white, providing a stark contrast to the black letter. There are no other objects, people, or activities depicted in the image.",
        "segmentation": false
    },
    "image_18": {
        "image_id": 18,
        "image_path": "./fusion_research/fusion_dataset/novel/Charlottes Web (E. B. White) (1)/images/image_18.jpg",
        "caption": [],
        "footnote": [],
        "context": "\"Well,\" said the spider, plucking thoughtfully at her web, \"the old sheep has been around this barn a long time. She has seen many a spring pig come and go. If she says they plan to kill you, I'm sure it's true. It's also the diniest trick I ever heard of. What people don't think of!\" \"I can't be quiet,\" screamed Wilbur, racing up and down. \"I don't want to be killed. I don't want to die. Is it true what the old sheep says, Charlotte? Is it true they are going to kill me when the cold weather comes?\" There's a regular conspiracy around here to kill you at Christmastime. Everybody is in the plot­ Lurvy, Zuckerman, even John Arable.\" \"Mr. Arable?\" sobbed Wilbur. \"Fern's father?\" \"Cenainly. When a pig is to be butchered, every­ body helps. I'm an old sheep and I see the same thing, same old business, year after year. Arable arrives with his .:z. shoots the •..\" \"Stop!\" screamed Wilbur. \"I don't want to die! Save me, somebody! Save me!\" Fern was just about to jump up when a voice was heard. \"Be quiet, Wilbur!\" said Charlotte, who had been listening to this awful conversation. ",
        "chunk_order_index": 11,
        "chunk_id": "chunk-de679bdf72b2d074303f713bbe79e1f4",
        "description": "The image is a black-and-white illustration depicting a scene with two farm animals. In the foreground, there is a pig walking towards the right side of the image. The pig appears to be in motion, with its legs positioned as if it is running or trotting. Its body is robust and rounded, typical of a domesticated pig. Behind a wooden fence, an old sheep is looking over the top rail. The sheep has a thick, woolly coat and a somewhat stern expression on its face. The sheep's head is turned slightly to the left, and it seems to be observing the pig intently. The fence is made of horizontal wooden planks, and there is a post visible on the right side of the image. The background is minimalistic, with some grass at the bottom and no other significant details. The overall atmosphere conveyed by the image is one of tension and concern, reflecting the emotional state of the characters described in the context.",
        "segmentation": true
    },
    "image_19": {
        "image_id": 19,
        "image_path": "./fusion_research/fusion_dataset/novel/Charlottes Web (E. B. White) (1)/images/image_19.jpg",
        "caption": [],
        "footnote": [],
        "context": "\"Who \"Told Templeton she didn't want the egg any more,\" repeated Fern. \"The goose did what?\" asked Mrs. Arable, gazing at her daughter with a queer, worried look. \"Seven,\" replied Fern. \"There were eight eggs but one egg didn't hatch and the goose told Templeton she didn't want it any more, so he took it away.\" \"How many?\" asked Mr. Arable. \"Did you know that Uncle Homer's goslings had hatched?\" asked Fern. N SUNDAY morning Mr. and Mrs. Arable and F em were sitting at breakfast in the kitchen. Avery had finished and was up­ stairs looking for his slingshot. I want to breathe the beautiful air and lie in the beautiful sun.\" \"You're certainly making a beautiful noise,\" snapped the old sheep. \"I don't want to die!\" screamed Wilbur, throwing himself to the ground. \"You shall not die,\" said Charlotte, briskly. \"What? Really?\" cried Wilbur. \"Who's going to save me?\" \"I am,\" said Charlotte. \"How?\" asked Wilbur. \"That remains to be seen. But I am going to save you, and I want you to quiet down immediately. You're car­ rying on in a childish way. Stop your crying! I can't stand hysterics.\" Chapter VIII A 'f alk At Home ",
        "chunk_order_index": 11,
        "chunk_id": "chunk-de679bdf72b2d074303f713bbe79e1f4",
        "description": "The image displays a large, bold black letter 'O' on a white background. The letter 'O' is perfectly circular with a consistent thickness in its stroke. There are no other objects, people, or scenes present in the image. The background is plain and unadorned, providing a stark contrast to the black letter.",
        "segmentation": false
    },
    "image_20": {
        "image_id": 20,
        "image_path": "./fusion_research/fusion_dataset/novel/Charlottes Web (E. B. White) (1)/images/image_20.jpg",
        "caption": [],
        "footnote": [],
        "context": "\"You can't spin a web, Wilbur, and I \"Everybody watch!\" he cried. And summoning all his strength, he threw himself into the air, headfirst. The string trailed behind him. But as he had neglected to fasten the other end to anything, it didn't really do any good, and Wilbur landed with a thud, crushed and hurt. Tears came to his eyes. Templeton grinned. Char­ lotte just sat quietly. After a bit she spoke. While the rat and the spider and the little girl watched, Wilbur climbed again to the top of the ma­ nure pile, full of energy and hope.  old piece of dirty white string. Wilbur examined it. \"That's just the thing,\" he said. \"Tie one end to my tail, will you, Templeton?\" \\Vilbur crouched low, with his thin, curly tail toward the rat. Templeton seized the string, passed it around the end of the pig's tail, and tied two half hitches. Char­ lotte watched in delight. Like Fern, she was truly fond of Wilbur, whose smelly pen and stale food attracted the flies that she needed, and she was proud to see thar he was not a quitter and was willing to try again to spin a web. ",
        "chunk_order_index": 13,
        "chunk_id": "chunk-8283e172a34b705e2bf78188f93cb933",
        "description": "The image is a black-and-white illustration featuring two animals: a rat and a pig. The rat, which has a long tail and is depicted in a detailed, textured style, is holding one end of a string with its front paws. The pig, which appears to be larger and has a round body with a prominent snout and small ears, stands next to the rat. The string trails from the rat's paws to the ground, forming loops. The scene suggests that the rat is assisting the pig in some activity involving the string. The illustration style is reminiscent of classic children's book artwork, with fine lines and attention to detail in the fur and features of the animals. The overall atmosphere conveyed is one of cooperation and effort, as the rat seems to be helping the pig with a task.",
        "segmentation": true
    }
}