{
    "image_1": {
        "image_id": 1,
        "image_path": "./fusion_research/fusion_dataset/news/20220725/images/image_1.jpg",
        "caption": [
            "Some of the buildings in Sanford Solny’s formidable portfolio. There have been only 27 deed theft cases since 2014 in Brooklyn. "
        ],
        "footnote": [],
        "context": "The oil and gas blocks, which will be auctioned in late July, extend into Virunga National Park, the world’s most important gorilla sanctuary, as well as tropical peatlands that store vast amounts of carbon, keeping it out of the atmosphere and from contributing to global DAKAR, Senegal — The Democratic Republic of Congo, home to one of the largest old-growth rainforests on earth, is auctioning off vast amounts of land in a push to become “the new destination for oil investments,” part of a global shift as the world retreats on fighting climate change in a scramble for fossil fuels. Global Warming But since then, the world’s immediate priorities have shifted. Russia’s invasion of Ukraine sent oil prices soaring and led to U.S. and British bans on Russian energy and, last week, a call to ration natural gas in Europe. This article is by Stefanos Chen, Ted Clifford and Camellia Burris. Over the past dozen years, Sanford Solny has built a New York real estate empire, snatching up small residential buildings across the city that churn out hundreds of thousands of dollars in rent. His portfolio would be enviable but for one thing — much of it, prosecutors and homeowners ",
        "chunk_order_index": 0,
        "chunk_id": "chunk-625f261212df523575922a2ca2ef28a0",
        "description": "The image is a collage of twelve photographs, each depicting different residential buildings. The buildings vary in architectural style and condition. Some are standalone houses with front yards, while others are multi-story apartment buildings. The colors of the buildings range from light beige to dark brown, with some having brick exteriors and others painted in various shades. Several buildings have fences or gates in front, and some have parked cars or motorcycles. The overall atmosphere conveyed by the image is that of a diverse urban neighborhood with a mix of older and newer structures. The caption indicates that these buildings are part of Sanford Solny’s real estate portfolio in Brooklyn.",
        "segmentation": true
    },
    "image_2": {
        "image_id": 2,
        "image_path": "./fusion_research/fusion_dataset/news/20220725/images/image_2.jpg",
        "caption": [],
        "footnote": [],
        "context": "The practice is known as deed theft, and as city Courts Are Slow to Act in Deed Theft Cases Deniers Are Recruiting Sheriffs, Unnerving Election Officials American voting system already battered by attacks from Mr. Trump and his allies. One of the conservative sheriffs’ groups, Protect America Now, lists about 70 members, and the other, the Constitutional Sheriffs and Peace Officers Association, does not list its membership but says it conducted training on various issues for about 300 of the nation’s roughly 3,000 sheriffs in re By ALEXANDRA BERZON and NICK CORASANITI When Those Behind a Badge Question the Vote seeks to lend law enforcement credibility to the false claims and has alarmed voting rights advocates. They warn that it could cause chaos in future elections and further weaken trust in an Shelter From the Swelter LAS VEGAS — An influential network of conservative activists fixated on the idea that former President Donald J. Trump won the 2020 election is working to recruit county sheriffs to investigate elections based on the false notion that voter fraud is widespread. Visitors found shade at the Lincoln Memorial in Washington, as much of the U.S. saw summer’s first prolonged heat wave. Page A13. ",
        "chunk_order_index": 0,
        "chunk_id": "chunk-625f261212df523575922a2ca2ef28a0",
        "description": "The image captures a scene at the Lincoln Memorial in Washington, D.C., during a sunny day. In the foreground, two individuals are resting on the steps of the memorial. One person is lying down with their legs stretched out and hands behind their head, wearing sunglasses and a white top. The other person is sitting with their back to the camera, wearing a light-colored shirt. The background features the iconic Washington Monument and the U.S. Capitol building, framed by the columns of the Lincoln Memorial. The reflecting pool is visible in front of the monument, and the National Mall is bustling with people enjoying the sunny weather. American flags are lined up along the path leading to the monument, adding to the patriotic atmosphere. The overall mood of the image conveys a sense of relaxation and leisure, as visitors take a break from the heat under the shade of the memorial's columns.",
        "segmentation": true
    },
    "image_3": {
        "image_id": 3,
        "image_path": "./fusion_research/fusion_dataset/news/20220725/images/image_3.jpg",
        "caption": [],
        "footnote": [],
        "context": "Designer OBITUARIES D7-8  No More Pet Store Puppies? A bill prohibiting the sale of dogs, cats and rabbits in New York shops awaits the governor’s decision. PAGE A15 Examining a Student’s Death The University of Utah acknowledged missteps in its response to concerns about a student who was killed. PAGE A14 NATIONAL A12-17, 20   INTERNATIONAL A4-11 Finding Solace Amid War In a desolate apartment complex outside Kharkiv, Ukraine, survivors take comfort in one another. PAGE A10 Medical Crimes and Nazis A report on the University of Strasbourg’s takeover during World War II sheds light on a dark period. PAGE A4 banned could continue to get abortions in Kansas. The election could give the state’s Republican-controlled Legislature authority to pass new abortion limits or to outlaw the procedure entirely, potentially reshaping the map of abortion access in the nation’s center. The vote, which has been planned since last year but took on far higher stakes after the federal right to abortion was eliminated, is expected to send a message far beyond Kansas as politicians nationwide weigh new abortion measures and watch for signs of how the public is reacting. Lawmakers Could Gain Authority for Ban or Further Limits By MITCH SMITH ",
        "chunk_order_index": 1,
        "chunk_id": "chunk-f1aa38e03a2cdd3122f479f8a521b9a0",
        "description": "The image depicts three individuals sitting outside a building that appears to be in a state of disrepair. The man on the left is wearing a dark jacket over a black shirt and has short, graying hair. He is seated with his arms resting on his knees, appearing relaxed but somewhat contemplative. The woman in the middle is dressed in a red jacket with a floral pattern and has white hair. She is also seated and seems to be engaged in conversation or thought. To the right, another woman is seated, wearing a gray jacket and glasses, and appears to be focused on something in her hands, possibly a piece of paper or a small object. In front of them is a table cluttered with various items, including bowls, cups, and what appears to be food packaging. The background shows a worn-out wall with peeling paint and some greenery growing along it. The overall atmosphere suggests a moment of rest or pause, possibly in a setting affected by conflict or hardship.",
        "segmentation": true
    },
    "image_4": {
        "image_id": 4,
        "image_path": "./fusion_research/fusion_dataset/news/20220725/images/image_4.jpg",
        "caption": [],
        "footnote": [],
        "context": "Big Tech Wants in the Game Companies like Apple and Amazon, seeking more viewers for their streaming services, are competing for rights to broadcast games from the N.F.L. and other sports leagues. PAGE B1 Gen Z Designers Set Up Shop Depop, a social shopping app, became BUSINESS B1-6  Style, on the Court and Off Players in women’s basketball are styling themselves however they want. And for many, it’s paying off. PAGE D1 A Sudden Ascent to the Top Jonas Vingegaard, 25, won the Tour de France in only his second time riding cycling’s most prestigious race. PAGE D6 SPORTS D1-6 on the University of Strasbourg’s takeover during World War II sheds light on a dark period. PAGE A4   NATIONAL A12-17, 20 No More Pet Store Puppies? A bill prohibiting the sale of dogs, cats and rabbits in New York shops awaits the governor’s decision. PAGE A15 Examining a Student’s Death The University of Utah acknowledged missteps in its response to concerns about a student who was killed. PAGE A14  OBITUARIES D7-8 Designer Known as Mr. Color Carleton Varney was trained by the decorator Dorothy Draper and inherited her aversion to the bland and the beige. He was 85. PAGE D8 ",
        "chunk_order_index": 2,
        "chunk_id": "chunk-e9e3e5db7c871eceddadfa7b878a4638",
        "description": "The image shows a person with dark hair, wearing a white top, standing in front of a mirror. The individual is applying lipstick using a compact mirror and a tube of lipstick. The reflection in the mirror reveals the person's face, which is focused on the task at hand. The background includes multiple mirrors, suggesting that this scene takes place in a bathroom or a dressing area. The lighting is warm, creating a cozy and intimate atmosphere. The person appears to be engaged in a personal grooming routine, possibly preparing for an event or daily activities.",
        "segmentation": true
    },
    "image_5": {
        "image_id": 5,
        "image_path": "./fusion_research/fusion_dataset/news/20220725/images/image_5.jpg",
        "caption": [],
        "footnote": [],
        "context": "What She Sees in Glasses What makes Meryl Streep such a fine actress? Maybe it’s all that eyewear she puts on, takes off, waves around and sometimes even looks through. PAGE C1 ARTS C1-6 to the Top Jonas Vingegaard, 25, won the Tour de France in only his second time riding cycling’s most prestigious race. PAGE D6  BUSINESS B1-6 Big Tech Wants in the Game Companies like Apple and Amazon, seeking more viewers for their streaming services, are competing for rights to broadcast games from the N.F.L. and other sports leagues. PAGE B1 Gen Z Designers Set Up Shop Depop, a social shopping app, became a springboard for young talent in the fashion world, and some of its most successful creators are going into business for themselves. PAGE B1  OPINION A18-19 Charles M. Blow ",
        "chunk_order_index": 2,
        "chunk_id": "chunk-e9e3e5db7c871eceddadfa7b878a4638",
        "description": "The image features a person with short, platinum blonde hair styled in an elegant updo. The individual is wearing a black top and is holding a pair of glasses with red frames, which they are adjusting with their right hand. On the same hand, there is a prominent green ring. The background consists of a bookshelf filled with various books, suggesting an indoor setting, possibly an office or a study room. The overall atmosphere conveys a sense of sophistication and authority.",
        "segmentation": true
    }
}