{
    "image_1": [
        {
            "merged_entity_name": "Velyka Komyshuvakha",
            "entity_type": "GEO",
            "description": "Velyka Komyshuvakha is a village in eastern Ukraine that was occupied by Russian forces and later retaken by Ukraine, where the soldiers had turned every wall into a handwritten message board of phrases, rhymes, and expletives.",
            "source_image_entities": [
                "RUINED BUILDING"
            ],
            "source_text_entities": [
                "VELYKA KOMYSHUVAKHA"
            ]
        },
        {
            "merged_entity_name": "Russian Forces",
            "entity_type": "ORGANIZATION",
            "description": "Russian forces occupied a village in eastern Ukraine for four and a half months, using a local bar as a small outpost and leaving behind graffiti in the local bar.",
            "source_image_entities": [
                "SOLDIER 1",
                "SOLDIER 2",
                "SOLDIER 3"
            ],
            "source_text_entities": [
                "RUSSIAN FORCES"
            ]
        }
    ],
    "image_2": [
        {
            "merged_entity_name": "RED GLOVES INSTALLATION",
            "entity_type": "EVENT",
            "description": "An art installation consisting of numerous red gloves arranged in a mound-like structure, interspersed with black thorny branches, created by artist Ebony G. Patterson and displayed at the New York Botanical Garden.",
            "source_image_entities": [
                "RED GLOVES INSTALLATION"
            ],
            "source_text_entities": [
                "EBONY G. PATTERSON",
                "NEW YORK BOTANICAL GARDEN"
            ]
        },
        {
            "merged_entity_name": "DOME CEILING",
            "entity_type": "GEO",
            "description": "A large, white, domed ceiling with a central skylight that allows natural light to illuminate the space, located at the New York Botanical Garden.",
            "source_image_entities": [
                "DOME CEILING"
            ],
            "source_text_entities": [
                "NEW YORK BOTANICAL GARDEN"
            ]
        }
    ],
    "image_3": [
        {
            "merged_entity_name": "PROTEST SIGNS AGAINST ICWA",
            "entity_type": "OBJECT",
            "description": "Two protest signs, one held by Woman 1 and the other by Woman 2, both reading 'STOP STEALING NATIVE KIDS PROTECT ICWA'. These signs are part of a protest related to the Indian Child Welfare Act, a 1978 law upheld by the Supreme Court which gives preference to Native American families in adoption cases.",
            "source_image_entities": [
                "PROTEST SIGN 1",
                "PROTEST SIGN 2"
            ],
            "source_text_entities": [
                "INDIAN CHILD WELFARE ACT"
            ]
        }
    ],
    "image_4": [
        {
            "merged_entity_name": "NORDSTROM",
            "entity_type": "ORGANIZATION",
            "description": "Nordstrom is a retail store with a visible sign and entrance, located in a shopping mall, which is part of the exodus from urban malls as retailers are fleeing from downtown areas in cities across the country, including San Francisco.",
            "source_image_entities": [
                "NORDSTROM"
            ],
            "source_text_entities": [
                "EXODUS FROM URBAN MALLS"
            ]
        },
        {
            "merged_entity_name": "SHOPPING MALL",
            "entity_type": "GEO",
            "description": "A shopping mall is an indoor commercial space with tiled floors, featuring multiple stores and walkways, which is experiencing a decline as retailers flee from urban malls, a problem occurring in cities like San Francisco.",
            "source_image_entities": [
                "SHOPPING MALL"
            ],
            "source_text_entities": [
                "EXODUS FROM URBAN MALLS"
            ]
        }
    ],
    "image_5": [
        {
            "merged_entity_name": "GOLF COURSE",
            "entity_type": "GEO",
            "description": "A well-maintained golf course with a green, sand bunkers, and surrounding trees, which is a crucial part of the U.S. Open played at the Los Angeles Country Club.",
            "source_image_entities": [
                "GOLF COURSE"
            ],
            "source_text_entities": [
                "LOS ANGELES COUNTRY CLUB"
            ]
        },
        {
            "merged_entity_name": "SAND BUNKERS",
            "entity_type": "OBJECT",
            "description": "Areas of sand designed to challenge golfers on the golf course, an element found at the Los Angeles Country Club during the U.S. Open.",
            "source_image_entities": [
                "SAND BUNKERS"
            ],
            "source_text_entities": [
                "LOS ANGELES COUNTRY CLUB"
            ]
        },
        {
            "merged_entity_name": "TREES",
            "entity_type": "GEO",
            "description": "Green trees bordering the golf course, providing a natural boundary, which is also a feature of the Los Angeles Country Club.",
            "source_image_entities": [
                "TREES"
            ],
            "source_text_entities": [
                "LOS ANGELES COUNTRY CLUB"
            ]
        },
        {
            "merged_entity_name": "PATHWAY",
            "entity_type": "GEO",
            "description": "A narrow pathway leading towards the green on the golf course, an important feature for navigating the Los Angeles Country Club during the U.S. Open.",
            "source_image_entities": [
                "PATHWAY"
            ],
            "source_text_entities": [
                "LOS ANGELES COUNTRY CLUB"
            ]
        }
    ],
    "image_6": [
        {
            "entity_name": "Eileen Isotalo",
            "entity_type": "PERSON",
            "description": "Eileen Isotalo is a 66-year-old retired interior design coordinator who struggled with weight loss and obesity-related medical problems until she started taking Wegovy, a new class of drug for obesity. She has lost 50 pounds and jettisoned the dark clothes she wore to hide her body. Her obesity-related medical problems have vanished along with much of the stigma that caused her to retreat from family.",
            "source_image_entities": [
                "WOMAN"
            ],
            "source_text_entities": [
                "EILEEN ISOTALO"
            ]
        },
        {
            "entity_name": "Wegovy",
            "entity_type": "TECHNOLOGY",
            "description": "Wegovy is a new class of drug for obesity that was prescribed by Eileen Isotalo's doctor at the University of Michigan's weight management clinic. It has helped her lose weight and alleviate her obesity-related medical problems.",
            "source_image_entities": [],
            "source_text_entities": [
                "WEGOVY"
            ]
        }
    ]
}