{
    "chunk-d7271197dd3b673e8f49863e67ec57ea": [
        {
            "entity_name": "DIACHRONIC WORD EMBEDDINGS AND SEMANTIC SHIFTS DETECTION",
            "entity_type": "EVENT",
            "description": "The main topic of the paper, focusing on tracing temporal changes in lexical semantics using distributional methods, particularly prediction-based word embedding models. It involves the study of semantic shifts over time and the challenges faced in this emerging subfield of natural language processing.",
            "source_entities": [
                "DIACHRONIC WORD EMBEDDINGS AND SEMANTIC SHIFTS DETECTION",
                "LEXICAL SEMANTIC SHIFTS",
                "SEMANTIC SHIFT"
            ]
        },
        {
            "entity_name": "SYSTEMS THAT TRACE SEMANTIC SHIFTS",
            "entity_type": "TECHNOLOGY",
            "description": "These systems utilize word embeddings and co-occurrence data to capture and analyze semantic shifts over time, with potential applications in various research fields.",
            "source_entities": [
                "SYSTEMS THAT TRACE SEMANTIC SHIFTS",
                "WORD EMBEDDINGS",
                "CO-OCCURRENCE DATA"
            ]
        },
        {
            "entity_name": "RESEARCH COMMUNITIES IN DIACHRONIC WORD EMBEDDINGS",
            "entity_type": "ORGANIZATION",
            "description": "Three different research communities interested in diachronic word embeddings and semantic shifts, including natural language processing, information retrieval, and political science.",
            "source_entities": [
                "NATURAL LANGUAGE PROCESSING",
                "INFORMATION RETRIEVAL",
                "POLITICAL SCIENCE"
            ]
        },
        {
            "entity_name": "LAWS OF PHONOLOGICAL CHANGE",
            "entity_type": "EVENT",
            "description": "Examples of laws of phonological change in the field of theoretical (diachronic) linguistics, including Grimm’s law and the great vowel shift.",
            "source_entities": [
                "GRIMM’S LAW",
                "THE GREAT VOWEL SHIFT"
            ]
        },
        {
            "entity_name": "STUDIES INSPIRED BY BLOOMFIELD'S CATEGORIZATION",
            "entity_type": "EVENT",
            "description": "Various studies inspired by Bloomfield's categorization of semantic shifts, including works by Bréal, Stern, Blank and Koch, Geeraerts, and Traugott and Dasher.",
            "source_entities": [
                "BRÉAL",
                "STERN",
                "BLANK AND KOCH",
                "GEERAERTS",
                "TRAUGOTT AND DASHER"
            ]
        },
        {
            "entity_name": "INTERESTING RESULTS IN DIACHRONIC EMBEDDINGS RESEARCH",
            "entity_type": "EVENT",
            "description": "Two particularly interesting results of diachronic embeddings research mentioned in the paper: statistical laws of semantic change and temporal semantic relations.",
            "source_entities": [
                "STATISTICAL LAWS OF SEMANTIC CHANGE",
                "TEMPORAL SEMANTIC RELATIONS"
            ]
        }
    ],
    "chunk-4287d7f1178bbf9cd59c58fb6f13ae24": [
        {
            "entity_name": "Old English cniht (Knight)",
            "entity_type": "CONCEPT",
            "description": "Old English cniht meant 'boy, servant' and has evolved to the more elevated term 'knight', illustrating a semantic shift to a more distinguished meaning.",
            "source_entities": [
                "OLD ENGLISH CNIHT",
                "KNIGHT"
            ]
        },
        {
            "entity_name": "Detweet",
            "entity_type": "CONCEPT",
            "description": "Detweet is a neologism that has developed two separate usages/meanings: 'to delete from Twitter' and 'to avoid tweeting', as studied by Kerremans et al. based on large amounts of web-crawled data.",
            "source_entities": [
                "DETWEET"
            ]
        },
        {
            "entity_name": "Semantic Shifts (Linguistic Drifts, Cultural Shifts)",
            "entity_type": "CONCEPT",
            "description": "Semantic shifts refer to changes in word meaning and can be categorized into linguistic drifts, which are slow and regular changes in the core meaning of words, and cultural shifts, which are culturally determined changes in associations of a given word.",
            "source_entities": [
                "LINGUISTIC DRIFTS",
                "CULTURAL SHIFTS"
            ]
        },
        {
            "entity_name": "English Meat",
            "entity_type": "CONCEPT",
            "description": "English meat is a term derived from Old English mete, which originally meant 'food', and now specifically refers to 'edible flesh', demonstrating a semantic shift towards a more specific meaning.",
            "source_entities": [
                "ENGLISH MEAT"
            ]
        },
        {
            "entity_name": "Middle English Dogge (Dog)",
            "entity_type": "CONCEPT",
            "description": "Middle English dogge described a dog of a particular breed, and is an example of a more general term evolving into a more specific one, as in the word 'dog'.",
            "source_entities": [
                "MIDDLE ENGLISH DOGGE"
            ]
        },
        {
            "entity_name": "Sleep",
            "entity_type": "CONCEPT",
            "description": "Sleep is an example of a word that has acquired more negative connotations related to sleep disorders when comparing its contexts from the 1960s to the 1990s, as shown by Gulordava and Baroni using distributional models.",
            "source_entities": [
                "SLEEP"
            ]
        },
        {
            "entity_name": "Car",
            "entity_type": "CONCEPT",
            "description": "Car is an example of a word that shifted its meaning from non-motorized vehicles to include motorized ones after the introduction of the automobile, illustrating a semantic shift due to technological progress.",
            "source_entities": [
                "CAR"
            ]
        }
    ]
}