{
    "image_1": [
        {
            "merged_entity_name": "ALICE",
            "entity_type": "PERSON",
            "description": "A young girl with long hair, wearing a dress and striped stockings, standing in a forest. The main character who interacts with the Red Queen and the White Queen, and is involved in a series of nonsensical discussions and mathematical riddles. Also referred to as 'CHILD' by the Red Queen, indicating her youth and implying a lack of understanding or importance.",
            "source_image_entities": [
                "ALICE"
            ],
            "source_text_entities": [
                "ALICE"
            ]
        },
        {
            "merged_entity_name": "TWEEDLEDEE AND TWEEDLEDUM",
            "entity_type": "PERSON",
            "description": "Two identical men in uniforms, standing next to each other in the forest. Tweedledum is one of the two characters, often paired with Tweedledee, known for their peculiar behavior and logic. Tweedledee is the other character, often paired with Tweedledum, known for their peculiar behavior and logic.",
            "source_image_entities": [
                "TWEEDLEDEE AND TWEEDLEDUM"
            ],
            "source_text_entities": [
                "TWEEDLEDUM",
                "TWEEDLEDEE"
            ]
        }
    ],
    "image_2": [
        {
            "merged_entity_name": "Walrus",
            "entity_type": "PERSON",
            "description": "The Walrus is a character in the story told by Tweedledee and Tweedledum, who lures oysters for a meal, dressed in a suit and shoes, standing on the left side of the image, with his right hand resting on his hip.",
            "source_image_entities": [
                "WALRUS"
            ],
            "source_text_entities": [
                "THE WALRUS"
            ]
        },
        {
            "merged_entity_name": "Carpenter",
            "entity_type": "PERSON",
            "description": "The Carpenter is a character in the story told by Tweedledee and Tweedledum, who also lures oysters for a meal, dressed in a suit and hat, holding a piece of paper in his left hand, standing on the right side of the image, with a tear drop visible near his eye.",
            "source_image_entities": [
                "CARPENTER"
            ],
            "source_text_entities": [
                "THE CARPENTER"
            ]
        },
        {
            "merged_entity_name": "Beach",
            "entity_type": "GEO",
            "description": "A sandy beach with waves in the background and some debris scattered around, which is the location where the Walrus and the Carpenter invite the oysters for a walk.",
            "source_image_entities": [
                "BEACH"
            ],
            "source_text_entities": [
                "THE BEACH"
            ]
        }
    ],
    "image_3": [
        {
            "merged_entity_name": "Walrus",
            "entity_type": "PERSON",
            "description": "The Walrus is a character in the story told by Tweedledee and Tweedledum, who lures oysters for a meal, dressed in a suit, sitting on a rock, with a thoughtful expression.",
            "source_image_entities": [
                "WALRUS"
            ],
            "source_text_entities": [
                "THE WALRUS"
            ]
        },
        {
            "merged_entity_name": "Carpenter",
            "entity_type": "PERSON",
            "description": "The Carpenter is a character in the story told by Tweedledee and Tweedledum, who also lures oysters for a meal, dressed as a carpenter, sitting next to the walrus, also with a thoughtful expression.",
            "source_image_entities": [
                "CARPENTER"
            ],
            "source_text_entities": [
                "THE CARPENTER"
            ]
        },
        {
            "merged_entity_name": "Oysters",
            "entity_type": "PERSON",
            "description": "Oysters are characters in the story, depicted as being lured and eaten by the Walrus and the Carpenter, gathered around the walrus and the carpenter, seemingly listening to their conversation.",
            "source_image_entities": [
                "OYSTERS"
            ],
            "source_text_entities": [
                "OYSTERS"
            ]
        },
        {
            "merged_entity_name": "Rocky Shore",
            "entity_type": "GEO",
            "description": "The background shows a rocky shore with waves crashing against it, which is the geographical location where the story of the Walrus and the Carpenter takes place.",
            "source_image_entities": [
                "ROCKY SHORE"
            ],
            "source_text_entities": [
                "THE SEA",
                "THE BEACH"
            ]
        }
    ],
    "image_4": [
        {
            "merged_entity_name": "Walrus",
            "entity_type": "PERSON",
            "description": "The Walrus is a character in the story told by Tweedledee and Tweedledum, who lures oysters for a meal, dressed in human clothing, and is standing on the beach.",
            "source_image_entities": [
                "WALRUS"
            ],
            "source_text_entities": [
                "THE WALRUS"
            ]
        },
        {
            "merged_entity_name": "Carpenter",
            "entity_type": "PERSON",
            "description": "The Carpenter is a character in the story told by Tweedledee and Tweedledum, who also lures oysters for a meal, with a large nose and mustache, holding a spoon and a piece of bread, sitting on a rock on the beach.",
            "source_image_entities": [
                "CARPENTER"
            ],
            "source_text_entities": [
                "THE CARPENTER"
            ]
        },
        {
            "merged_entity_name": "Beach",
            "entity_type": "GEO",
            "description": "The beach is the location where the Walrus and the Carpenter invite the oysters for a walk, a sandy beach with waves in the background and rocks scattered around.",
            "source_image_entities": [
                "BEACH"
            ],
            "source_text_entities": [
                "THE BEACH"
            ]
        },
        {
            "merged_entity_name": "Bread",
            "entity_type": "OBJECT",
            "description": "Bread is mentioned as the main thing needed for the meal with the Oysters, a piece of bread held by the Carpenter.",
            "source_image_entities": [
                "BREAD"
            ],
            "source_text_entities": [
                "BREAD"
            ]
        },
        {
            "merged_entity_name": "Spoons",
            "entity_type": "OBJECT",
            "description": "Several spoons lying on the sand near the Carpenter, mentioned as needed for the meal with the Oysters.",
            "source_image_entities": [
                "SPOONS"
            ],
            "source_text_entities": [
                "PEPPER",
                "VINEGAR"
            ]
        }
    ],
    "image_5": [
        {
            "merged_entity_name": "DORMOUSE",
            "entity_type": "PERSON",
            "description": "A small, plump creature with a long tail, wearing a hat and a coat, sitting under a tree.",
            "source_image_entities": [
                "DORMOUSE"
            ],
            "source_text_entities": []
        },
        {
            "merged_entity_name": "TREE",
            "entity_type": "GEO",
            "description": "A large tree with a thick trunk and branches, under which various objects and events take place, such as the discovery of the rattle and the Red King's sleep.",
            "source_image_entities": [
                "TREE"
            ],
            "source_text_entities": [
                "WOOD"
            ]
        },
        {
            "merged_entity_name": "GRASS",
            "entity_type": "GEO",
            "description": "Green grass covering the ground, where the Red King is sleeping and which is a point of concern for Alice regarding the King's comfort and health.",
            "source_image_entities": [
                "GRASS"
            ],
            "source_text_entities": [
                "DAMP GRASS"
            ]
        },
        {
            "merged_entity_name": "RED KING",
            "entity_type": "PERSON",
            "description": "The Red King is a character whom Alice encounters, known for his loud snoring, and is the subject of the brothers' conversation and Alice's observations while sleeping on the damp grass.",
            "source_image_entities": [],
            "source_text_entities": [
                "RED KING"
            ]
        }
    ],
    "image_6": [
        {
            "merged_entity_name": "ALICE",
            "entity_type": "PERSON",
            "description": "A young girl with long, curly hair, wearing a dress and striped stockings, extending her hand towards another character. The main character who interacts with the Red Queen and the White Queen, and is involved in a series of nonsensical discussions and mathematical riddles. Also referred to as 'CHILD' by the Red Queen, indicating her youth and implying a lack of understanding or importance.",
            "source_image_entities": [
                "ALICE"
            ],
            "source_text_entities": [
                "ALICE",
                "ALICE"
            ]
        },
        {
            "merged_entity_name": "DODO",
            "entity_type": "PERSON",
            "description": "A whimsical, bird-like creature with a large body, small head, and expressive face, appearing to be in distress. This character is not mentioned in the provided text, so no additional context can be merged from the text entities.",
            "source_image_entities": [
                "DODO"
            ],
            "source_text_entities": []
        },
        {
            "merged_entity_name": "TWEEDLEDEE",
            "entity_type": "PERSON",
            "description": "One of the twins who tells the story of the Walrus and the Carpenter to Alice. Tweedledee is also the other brother who interacts with Alice, often echoing or supporting Tweedledum's statements and actions. He is part of the conversation where the nature of reality and the Red King's dream are discussed, and he is involved in the dispute over the rattle.",
            "source_image_entities": [],
            "source_text_entities": [
                "TWEEDLEDEE",
                "TWEEDLEDEE"
            ]
        },
        {
            "merged_entity_name": "TWEEDLEDUM",
            "entity_type": "PERSON",
            "description": "The other twin who tells the story of the Walrus and the Carpenter to Alice. Tweedledum is one of the brothers who engage in conversation with Alice, often making bold claims and showing a range of emotions. He is also involved in the dispute over the rattle and is part of the conversation where the nature of reality and the Red King's dream are discussed.",
            "source_image_entities": [],
            "source_text_entities": [
                "TWEEDLEDUM",
                "TWEEDLEDUM"
            ]
        }
    ],
    "image_7": [
        {
            "merged_entity_name": "ALICE",
            "entity_type": "PERSON",
            "description": "A young girl with long hair, wearing a dress and apron, interacting with Tweedledum and Tweedledee. She is also involved in a series of nonsensical discussions and mathematical riddles with the Red Queen and the White Queen.",
            "source_image_entities": [
                "ALICE"
            ],
            "source_text_entities": [
                "ALICE"
            ]
        },
        {
            "merged_entity_name": "TWEEDLEDUM",
            "entity_type": "PERSON",
            "description": "A large character with a round body, wearing a tall hat and holding a drum. He is one of the brothers who engage in conversation with Alice, often making bold claims and showing a range of emotions. He also participates in the battle with Tweedledee.",
            "source_image_entities": [
                "TWEEDLEDUM"
            ],
            "source_text_entities": [
                "TWEEDLEDUM"
            ]
        },
        {
            "merged_entity_name": "TWEEDLEDEE",
            "entity_type": "PERSON",
            "description": "Another large character similar to Tweedledum, also wearing a tall hat and holding a drum. He is the other brother who interacts with Alice, often echoing or supporting Tweedledum's statements and actions. He also shares a toothache with Tweedledum and engages in the battle.",
            "source_image_entities": [
                "TWEEDLEDEE"
            ],
            "source_text_entities": [
                "TWEEDLEDEE"
            ]
        }
    ],
    "image_8": [
        {
            "merged_entity_name": "ALICE",
            "entity_type": "PERSON",
            "description": "A young girl with long hair, wearing a dress, and pulling on the ear of a crowned figure. The main character who interacts with the Red Queen and the White Queen, and is involved in a series of nonsensical discussions and mathematical riddles.",
            "source_image_entities": [
                "ALICE"
            ],
            "source_text_entities": [
                "ALICE"
            ]
        },
        {
            "merged_entity_name": "WHITE QUEEN",
            "entity_type": "PERSON",
            "description": "A character who appears in the wood, appears to be in a state of distress, and is helped by Alice with her shawl. She is also described as being in a state of disarray, with her clothing and hair being untidy.",
            "source_image_entities": [],
            "source_text_entities": [
                "WHITE QUEEN",
                "WHITE QUEEN"
            ]
        },
        {
            "merged_entity_name": "KING",
            "entity_type": "PERSON",
            "description": "A crowned figure with a surprised expression, holding a scepter and being pulled by Alice. Indirectly referenced in the context of the King's Messenger, suggesting his existence as a figure of authority.",
            "source_image_entities": [
                "KING"
            ],
            "source_text_entities": [
                "KING"
            ]
        }
    ],
    "image_9": [
        {
            "merged_entity_name": "IMPRISONED MAN",
            "entity_type": "PERSON",
            "description": "A man with wild hair, wearing a hat and chained to a post, sitting in a cell, who is mentioned as the King's Messenger in the text.",
            "source_image_entities": [
                "IMPRISONED MAN"
            ],
            "source_text_entities": [
                "KING'S MESSENGER"
            ]
        },
        {
            "merged_entity_name": "WHITE QUEEN",
            "entity_type": "PERSON",
            "description": "The White Queen is a character who is having a conversation with Alice and is described as being in a state of disarray, with her clothing and hair being untidy, and is also mentioned as being in distress and helped by Alice with her shawl.",
            "source_image_entities": [
                "IMPRISONED MAN"
            ],
            "source_text_entities": [
                "WHITE QUEEN",
                "WHITE QUEEN"
            ]
        },
        {
            "merged_entity_name": "CELL",
            "entity_type": "GEO",
            "description": "The interior of a cell with stone walls and a straw-covered floor, where the King's Messenger, also known as the IMPRISONED MAN, is held.",
            "source_image_entities": [
                "CELL"
            ],
            "source_text_entities": [
                "KING'S MESSENGER"
            ]
        },
        {
            "merged_entity_name": "HAT",
            "entity_type": "OBJECT",
            "description": "The hat is tilted on the IMPRISONED MAN's head, adding to his disheveled appearance, and is part of the description of the King's Messenger in the cell.",
            "source_image_entities": [
                "HAT"
            ],
            "source_text_entities": [
                "KING'S MESSENGER"
            ]
        },
        {
            "merged_entity_name": "CHAIN AND POST",
            "entity_type": "OBJECT",
            "description": "A heavy chain links the IMPRISONED MAN, who is also known as the King's Messenger, to a sturdy post, symbolizing his captivity.",
            "source_image_entities": [
                "CHAIN AND POST"
            ],
            "source_text_entities": [
                "KING'S MESSENGER"
            ]
        },
        {
            "merged_entity_name": "JAR",
            "entity_type": "OBJECT",
            "description": "A small jar sits on the floor near the IMPRISONED MAN, possibly containing food or drink, and is mentioned in the context of the King's Messenger in the cell.",
            "source_image_entities": [
                "JAR"
            ],
            "source_text_entities": [
                "KING'S MESSENGER"
            ]
        }
    ],
    "image_10": [
        {
            "merged_entity_name": "ASTERISKS",
            "entity_type": "OBJECT",
            "description": "Multiple asterisk symbols arranged in a grid pattern on a white background, as depicted in the image.",
            "source_image_entities": [
                "ASTERISKS"
            ],
            "source_text_entities": []
        },
        {
            "merged_entity_name": "WHITE QUEEN",
            "entity_type": "PERSON",
            "description": "The White Queen is a character who is having a conversation with Alice and is described as being in a state of disarray, with her clothing and hair being untidy. She is also involved in discussions about pricking her finger and the nature of belief.",
            "source_image_entities": [],
            "source_text_entities": [
                "\"WHITE QUEEN\"",
                "\"QUEEN\""
            ]
        },
        {
            "merged_entity_name": "ALICE",
            "entity_type": "PERSON",
            "description": "The main character who interacts with the Red Queen and the White Queen, and is involved in a series of nonsensical discussions and mathematical riddles. Alice also encounters the Sheep in a shop and experiences the peculiar nature of the shop's shelves. She is referred to as 'CHILD' by the Red Queen, indicating her youth and implying a lack of understanding or importance.",
            "source_image_entities": [],
            "source_text_entities": [
                "\"ALICE\"",
                "\"ALICE\""
            ]
        },
        {
            "merged_entity_name": "SHOP",
            "entity_type": "GEO",
            "description": "The shop is a location where Alice finds herself after crossing a brook, interacting with the Sheep. It is filled with curious things that seem to move around, always eluding Alice's attempts to examine them closely.",
            "source_image_entities": [],
            "source_text_entities": [
                "\"SHOP\"",
                "\"SHOP\""
            ]
        },
        {
            "merged_entity_name": "SHEEP",
            "entity_type": "PERSON",
            "description": "The Sheep is a character that Alice encounters in a shop, knitting and wearing spectacles. The Sheep also provides Alice with a pair of knitting-needles that turn into oars.",
            "source_image_entities": [],
            "source_text_entities": [
                "\"SHEEP\"",
                "\"SHEEP\""
            ]
        }
    ],
    "image_11": [
        {
            "merged_entity_name": "ALICE",
            "entity_type": "PERSON",
            "description": "A young girl with long hair, wearing a dress, standing and looking at the sheep. The main character who interacts with the Red Queen and the White Queen, and is involved in a series of nonsensical discussions and mathematical riddles. Also referred to as 'CHILD' by the Red Queen, indicating her youth and implying a lack of understanding or importance.",
            "source_image_entities": [
                "ALICE"
            ],
            "source_text_entities": [
                "\"ALICE\""
            ]
        },
        {
            "merged_entity_name": "SHEEP",
            "entity_type": "PERSON",
            "description": "An anthropomorphic sheep wearing glasses and a hat, sitting behind a counter with various items on display. The Sheep is a character that Alice encounters in a shop, knitting and wearing spectacles. The Sheep is a character who is knitting and interacting with Alice, providing her with a pair of knitting-needles that turn into oars.",
            "source_image_entities": [
                "SHEEP"
            ],
            "source_text_entities": [
                "\"SHEEP\"",
                "\"SHEEP\""
            ]
        },
        {
            "merged_entity_name": "SHOP INTERIOR",
            "entity_type": "GEO",
            "description": "The interior of a shop with shelves displaying various items and a window in the background. The shop is a location where Alice finds herself after crossing a brook, interacting with the Sheep. The shop is a place filled with curious things that seem to move around, always eluding Alice's attempts to examine them closely.",
            "source_image_entities": [
                "SHOP INTERIOR"
            ],
            "source_text_entities": [
                "\"SHOP\"",
                "\"SHOP\""
            ]
        },
        {
            "merged_entity_name": "COUNTER",
            "entity_type": "OBJECT",
            "description": "A wooden counter with a basket of eggs and other items on it. The counter is the object that Alice leans on with her elbows in the shop, opposite the Sheep.",
            "source_image_entities": [
                "COUNTER"
            ],
            "source_text_entities": [
                "\"COUNTER\""
            ]
        },
        {
            "merged_entity_name": "BASKET OF EGGS",
            "entity_type": "OBJECT",
            "description": "A basket filled with eggs placed on the counter.",
            "source_image_entities": [
                "BASKET OF EGGS"
            ],
            "source_text_entities": []
        }
    ],
    "image_12": [
        {
            "merged_entity_name": "ALICE",
            "entity_type": "PERSON",
            "description": "A young girl with long hair, sitting in a chair and knitting, interacting with the Sheep and involved in a series of nonsensical discussions and mathematical riddles.",
            "source_image_entities": [
                "ALICE"
            ],
            "source_text_entities": [
                "ALICE"
            ]
        },
        {
            "merged_entity_name": "SHEEP",
            "entity_type": "PERSON",
            "description": "A character who is knitting and interacting with Alice, providing her with a pair of knitting-needles that turn into oars, and selling eggs in a dark shop.",
            "source_image_entities": [
                "SHEEP"
            ],
            "source_text_entities": [
                "SHEEP"
            ]
        },
        {
            "merged_entity_name": "COTTAGE",
            "entity_type": "GEO",
            "description": "A small cottage with a window displaying various items, which might be a shop or a home with a hobbyist's collection, filled with curious things that seem to move around, always eluding Alice's attempts to examine them closely.",
            "source_image_entities": [
                "COTTAGE"
            ],
            "source_text_entities": [
                "SHOP"
            ]
        },
        {
            "merged_entity_name": "WINDOW DISPLAY",
            "entity_type": "UNKNOWN",
            "description": "The cottage has a window displaying various items, suggesting it might be a shop or a home with a hobbyist's collection, filled with curious things that seem to move around, always eluding Alice's attempts to examine them closely.",
            "source_image_entities": [
                "WINDOW DISPLAY"
            ],
            "source_text_entities": [
                "SHOP"
            ]
        },
        {
            "merged_entity_name": "HUMPTY DUMPTY",
            "entity_type": "PERSON",
            "description": "A character Alice encounters, initially mistaken for an egg due to his egg-like appearance, and is sitting on a high wall. He is portrayed as having an enormous face and is later revealed to be a person when he speaks.",
            "source_image_entities": [],
            "source_text_entities": [
                "HUMPTY DUMPTY"
            ]
        }
    ],
    "image_13": [
        {
            "merged_entity_name": "STAR PATTERN",
            "entity_type": "OBJECT",
            "description": "A pattern of black stars distributed across a white background in three rows with varying spacing, as depicted in the image.",
            "source_image_entities": [
                "STAR PATTERN"
            ],
            "source_text_entities": []
        },
        {
            "merged_entity_name": "ALICE",
            "entity_type": "PERSON",
            "description": "The main character who interacts with the Red Queen, the White Queen, and the Sheep, and is involved in a series of nonsensical discussions and mathematical riddles. Also referred to as 'CHILD' by the Red Queen, indicating her youth and implying a lack of understanding or importance.",
            "source_image_entities": [],
            "source_text_entities": [
                "ALICE",
                "ALICE"
            ]
        },
        {
            "merged_entity_name": "SHEEP",
            "entity_type": "PERSON",
            "description": "The Sheep is a character who is knitting and interacting with Alice, providing her with a pair of knitting-needles that turn into oars, and later selling eggs in the dark shop.",
            "source_image_entities": [],
            "source_text_entities": [
                "SHEEP",
                "SHEEP"
            ]
        },
        {
            "merged_entity_name": "HUMPTY DUMPTY",
            "entity_type": "PERSON",
            "description": "Humpty Dumpty is a character Alice encounters, initially mistaken for an egg due to his egg-like appearance, and is sitting on a high wall. He is portrayed as having an enormous face and is later revealed to be a person when he speaks.",
            "source_image_entities": [],
            "source_text_entities": [
                "HUMPTY DUMPTY",
                "HUMPTY DUMPTY"
            ]
        },
        {
            "merged_entity_name": "HIGH WALL",
            "entity_type": "GEO",
            "description": "The High Wall is the location where Humpty Dumpty is sitting, a narrow structure that makes Alice wonder about his balance.",
            "source_image_entities": [],
            "source_text_entities": [
                "HIGH WALL",
                "THE WALL"
            ]
        }
    ],
    "image_14": [
        {
            "merged_entity_name": "ALICE",
            "entity_type": "PERSON",
            "description": "A young girl with long hair, wearing a dress and standing on the ground, who is the main character interacting with various entities, including the Red Queen, the White Queen, and Humpty Dumpty, and is involved in nonsensical discussions and mathematical riddles.",
            "source_image_entities": [
                "ALICE"
            ],
            "source_text_entities": [
                "\"ALICE\"",
                "\"ALICE\""
            ]
        },
        {
            "merged_entity_name": "HUMPTY DUMPTY",
            "entity_type": "PERSON",
            "description": "An egg-shaped character sitting on a wall, extending his hand to Alice, who is portrayed as having an enormous face and is later revealed to be a person when he speaks. He is involved in a series of nonsensical discussions and mathematical riddles with Alice and is known for his egg-like appearance and sitting on a high wall.",
            "source_image_entities": [
                "HUMPTY DUMPTY"
            ],
            "source_text_entities": [
                "\"HUMPTY DUMPTY\"",
                "\"HUMPTY DUMPTY\""
            ]
        },
        {
            "merged_entity_name": "WALL",
            "entity_type": "GEO",
            "description": "A stone wall on which Humpty Dumpty is seated, and it plays a significant role in the conversation as it is the potential site of a fall, making Alice wonder about Humpty Dumpty's balance.",
            "source_image_entities": [
                "WALL"
            ],
            "source_text_entities": [
                "\"HIGH WALL\"",
                "\"THE WALL\""
            ]
        },
        {
            "merged_entity_name": "GROUND",
            "entity_type": "GEO",
            "description": "The surface where Alice is standing, adjacent to the wall, and is a point of reference for Alice's concern about Humpty Dumpty's safety, as she suggests he might be safer down on the ground.",
            "source_image_entities": [
                "GROUND"
            ],
            "source_text_entities": []
        }
    ],
    "image_15": [
        {
            "merged_entity_name": "SUNDIAL",
            "entity_type": "OBJECT",
            "description": "An ornate sundial on a pedestal, located in the foreground of the scene, also known as 'the wabe' which is the grass-plot around a sundial, characterized by its extensive reach in all directions.",
            "source_image_entities": [
                "SUNDIAL"
            ],
            "source_text_entities": [
                "WABE"
            ]
        },
        {
            "merged_entity_name": "HUMPTY DUMPTY",
            "entity_type": "PERSON",
            "description": "Humpty Dumpty is a character Alice encounters, initially mistaken for an egg due to his egg-like appearance, and is sitting on a high wall. He is portrayed as having an enormous face and is later revealed to be a person when he speaks. He is also the one who explains the meaning of the poem 'Jabberwocky' to Alice, and mentions that 'toves' make their nests under sun-dials.",
            "source_image_entities": [
                "DODO"
            ],
            "source_text_entities": [
                "HUMPTY DUMPTY"
            ]
        },
        {
            "merged_entity_name": "MOLE",
            "entity_type": "PERSON",
            "description": "Moles are creatures that are something like badgers, lizards, and corkscrews. They live on cheese and make their nests under sun-dials, which are similar to the two moles with long snouts and spiky fur, engaged in an activity near the sundial in the image.",
            "source_image_entities": [
                "MOLES"
            ],
            "source_text_entities": [
                "TOVES"
            ]
        }
    ],
    "image_16": [
        {
            "merged_entity_name": "HUMPTY DUMPTY",
            "entity_type": "PERSON",
            "description": "Humpty Dumpty is a character with a round body and a human face, wearing a hat, standing on a stool, and initially mistaken for an egg due to his egg-like appearance. He is portrayed as having an enormous face and is later revealed to be a person when he speaks. He engages in a conversation with Alice, discussing various nonsensical topics and mathematical riddles.",
            "source_image_entities": [
                "HUMPTY DUMPTY"
            ],
            "source_text_entities": [
                "HUMPTY DUMPTY",
                "DUMPTY"
            ]
        },
        {
            "merged_entity_name": "ALICE",
            "entity_type": "PERSON",
            "description": "Alice is a character in a long dress and apron, standing next to Humpty Dumpty and appearing to be in conversation with him. She is the main character who interacts with the Red Queen, the White Queen, and Humpty Dumpty, and is involved in a series of nonsensical discussions and mathematical riddles. Alice is also referred to as 'CHILD' by the Red Queen, indicating her youth and implying a lack of understanding or importance.",
            "source_image_entities": [
                "ALICE"
            ],
            "source_text_entities": [
                "ALICE"
            ]
        },
        {
            "merged_entity_name": "STOOL",
            "entity_type": "OBJECT",
            "description": "The stool is a three-legged object that Humpty Dumpty is standing on, as described in the narrative where he sits on a high wall.",
            "source_image_entities": [
                "STOOL"
            ],
            "source_text_entities": []
        },
        {
            "merged_entity_name": "TEAPOT",
            "entity_type": "OBJECT",
            "description": "The teapot is an object placed on the ground near the stool, as depicted in the image.",
            "source_image_entities": [
                "TEAPOT"
            ],
            "source_text_entities": []
        }
    ],
    "image_17": [
        {
            "merged_entity_name": "HORSES",
            "entity_type": "OBJECT",
            "description": "Horses carrying the knights into battle, some with armor, and mentioned as managing better than the foot-soldiers but still stumbling occasionally, causing their riders to fall off.",
            "source_image_entities": [
                "HORSES"
            ],
            "source_text_entities": [
                "HORSES"
            ]
        },
        {
            "merged_entity_name": "BATTLEFIELD",
            "entity_type": "GEO",
            "description": "A chaotic battlefield with fallen knights and horses, surrounded by trees, and also described as a location where Alice observes the soldiers and horses, and later exits to find the White King.",
            "source_image_entities": [
                "BATTLEFIELD"
            ],
            "source_text_entities": [
                "WOOD"
            ]
        },
        {
            "merged_entity_name": "TREES",
            "entity_type": "GEO",
            "description": "Trees surrounding the battlefield, providing a backdrop to the scene, and also mentioned as part of the wood where Alice observes the soldiers and horses.",
            "source_image_entities": [
                "TREES"
            ],
            "source_text_entities": [
                "WOOD"
            ]
        }
    ],
    "image_18": [
        {
            "merged_entity_name": "KING",
            "entity_type": "PERSON",
            "description": "A character with a crown and a scepter, dressed in a peculiar outfit with circular layers, who converses with Alice and comments on the fight between the Lion and the Unicorn.",
            "source_image_entities": [
                "KING"
            ],
            "source_text_entities": [
                "KING"
            ]
        },
        {
            "merged_entity_name": "ALICE",
            "entity_type": "PERSON",
            "description": "A young girl with long hair, wearing a dress, standing between the King and the White Rabbit, who is the main character interacting with various entities and involved in nonsensical discussions and mathematical riddles.",
            "source_image_entities": [
                "ALICE"
            ],
            "source_text_entities": [
                "ALICE"
            ]
        },
        {
            "merged_entity_name": "WHITE RABBIT",
            "entity_type": "PERSON",
            "description": "A rabbit-like character wearing a coat and holding a bag, pointing forward, who is part of the scene with Alice and the King.",
            "source_image_entities": [
                "WHITE RABBIT"
            ],
            "source_text_entities": []
        },
        {
            "merged_entity_name": "HAIGHA (ANGLO-SAXON MESSENGER)",
            "entity_type": "PERSON",
            "description": "Haigha, also known as the Anglo-Saxon Messenger, is an Anglo-Saxon who uses peculiar attitudes to express happiness and delivers messages and food to the King, living on the Hill.",
            "source_image_entities": [],
            "source_text_entities": [
                "HAIGHA (ANGLO-SAXON MESSENGER)"
            ]
        },
        {
            "merged_entity_name": "HATTA",
            "entity_type": "PERSON",
            "description": "Hatta is the other Messenger, necessary for the King to have two messengers for coming and going, and is described as having just come out of prison and is watching the fight with a cup of tea and bread-and-butter.",
            "source_image_entities": [],
            "source_text_entities": [
                "HATTA"
            ]
        }
    ],
    "image_19": [
        {
            "merged_entity_name": "ALICE",
            "entity_type": "PERSON",
            "description": "A young girl with long hair, wearing a dress, standing next to the White Rabbit and the King of Hearts. The main character who interacts with the Red Queen and the White Queen, and is involved in a series of nonsensical discussions and mathematical riddles. Also referred to as 'CHILD' by the Red Queen, indicating her youth and implying a lack of understanding or importance.",
            "source_image_entities": [
                "ALICE"
            ],
            "source_text_entities": [
                "\"ALICE\""
            ]
        },
        {
            "merged_entity_name": "WHITE RABBIT",
            "entity_type": "PERSON",
            "description": "A rabbit dressed in formal attire, holding a cup and saucer, standing next to Alice and the King of Hearts.",
            "source_image_entities": [
                "WHITE RABBIT"
            ],
            "source_text_entities": []
        },
        {
            "merged_entity_name": "KING OF HEARTS",
            "entity_type": "PERSON",
            "description": "A king wearing a crown and a robe, holding a scepter, standing next to Alice and the White Rabbit. The King is a character who converses with Alice and the Messenger, displaying fretfulness and a desire to see Nobody.",
            "source_image_entities": [
                "KING OF HEARTS"
            ],
            "source_text_entities": [
                "\"KING\""
            ]
        },
        {
            "merged_entity_name": "LION",
            "entity_type": "PERSON",
            "description": "A lion standing on its hind legs, appearing to be roaring or speaking. The Lion is one of the combatants in the fight for the crown, battling against the Unicorn.",
            "source_image_entities": [
                "LION"
            ],
            "source_text_entities": [
                "\"LION\""
            ]
        },
        {
            "merged_entity_name": "UNICORN",
            "entity_type": "PERSON",
            "description": "An unicorn standing next to the lion, also appearing to be engaged in conversation. The Unicorn is the other combatant in the fight for the crown, fighting against the Lion.",
            "source_image_entities": [
                "UNICORN"
            ],
            "source_text_entities": [
                "\"UNICORN\""
            ]
        },
        {
            "merged_entity_name": "HAIGHA (ANGLO-SAXON MESSENGER)",
            "entity_type": "PERSON",
            "description": "Haigha, also known as the Anglo-Saxon Messenger, is an Anglo-Saxon who uses peculiar attitudes to express happiness and delivers messages and food to the King. He is one of the two messengers, living on the Hill.",
            "source_image_entities": [],
            "source_text_entities": [
                "\"HAIGHA (ANGLO-SAXON MESSENGER)\""
            ]
        },
        {
            "merged_entity_name": "HATTA",
            "entity_type": "PERSON",
            "description": "Hatta is the other Messenger, necessary for the King to have two messengers for coming and going. Hatta is the other Messenger, who is described as having just come out of prison and is watching the fight with a cup of tea and bread-and-butter.",
            "source_image_entities": [],
            "source_text_entities": [
                "\"HATTA\""
            ]
        }
    ],
    "image_20": [
        {
            "merged_entity_name": "ALICE",
            "entity_type": "PERSON",
            "description": "A young girl with long hair, wearing a dress and striped stockings, holding a large cake on a platter, who is the main character interacting with the Red Queen, the White Queen, and other characters, involved in nonsensical discussions and mathematical riddles.",
            "source_image_entities": [
                "ALICE"
            ],
            "source_text_entities": [
                "ALICE"
            ]
        },
        {
            "merged_entity_name": "UNICORN",
            "entity_type": "PERSON",
            "description": "A mythical creature with a single horn on its forehead, dressed in a patterned cloth, who engages in dialogue with Alice and has a playful interaction over the plum-cake, also known as 'THE UNICORN' in the story.",
            "source_image_entities": [
                "UNICORN"
            ],
            "source_text_entities": [
                "UNICORN"
            ]
        },
        {
            "merged_entity_name": "LION",
            "entity_type": "PERSON",
            "description": "A large feline with a mane, standing on its hind legs, who interacts with Alice and the Unicorn, showing signs of tiredness and engaging in a quarrel over the crown, also known as 'THE LION' in the story.",
            "source_image_entities": [
                "LION"
            ],
            "source_text_entities": [
                "LION"
            ]
        },
        {
            "merged_entity_name": "RABBIT",
            "entity_type": "GEO",
            "description": "A rabbit with long ears, partially visible behind Alice.",
            "source_image_entities": [
                "RABBIT"
            ],
            "source_text_entities": []
        },
        {
            "merged_entity_name": "CAKE",
            "entity_type": "OBJECT",
            "description": "A large, round cake on a platter held by Alice, also known as 'PLUM-CAKE' in the story, which is being distributed among the characters and has peculiar properties.",
            "source_image_entities": [
                "CAKE"
            ],
            "source_text_entities": [
                "PLUM-CAKE"
            ]
        }
    ],
    "image_21": [
    ],
    "image_22": [
        {
            "merged_entity_name": "ALICE",
            "entity_type": "PERSON",
            "description": "A young girl with long hair, dressed in a dress, kneeling on the ground, and the main character who interacts with the Red Queen and the White Queen, involved in a series of nonsensical discussions and mathematical riddles.",
            "source_image_entities": [
                "ALICE"
            ],
            "source_text_entities": [
                "ALICE"
            ]
        },
        {
            "merged_entity_name": "DISH",
            "entity_type": "OBJECT",
            "description": "The dish on which Alice places the plum-cake, used for cutting and serving the cake, and numerous dishes and utensils flying through the air.",
            "source_image_entities": [
                "DISHES"
            ],
            "source_text_entities": [
                "DISH"
            ]
        },
        {
            "merged_entity_name": "GRASS",
            "entity_type": "GEO",
            "description": "The ground Alice is kneeling on, covered in grass, and the bank of a little brook where Alice sits to cut the plum-cake.",
            "source_image_entities": [
                "GRASS"
            ],
            "source_text_entities": [
                "BANK OF A LITTLE BROOK"
            ]
        },
        {
            "merged_entity_name": "PLUM-CAKE",
            "entity_type": "OBJECT",
            "description": "A central object in the story, as it is being distributed among the characters and has peculiar properties, and the plum-cake that Alice tried to cut, signifying a previous event in her adventure.",
            "source_image_entities": [],
            "source_text_entities": [
                "PLUM-CAKE",
                "PLUM-CAKE"
            ]
        }
    ],
    "image_23": [
        {
            "merged_entity_name": "ALICE",
            "entity_type": "PERSON",
            "description": "A young girl with long hair, wearing a dress, sitting on the ground and observing the scene. The main character who interacts with the Red Queen and the White Queen, and is involved in a series of nonsensical discussions and mathematical riddles. Also referred to as 'CHILD' by the Red Queen, indicating her youth and implying a lack of understanding or importance.",
            "source_image_entities": [
                "ALICE"
            ],
            "source_text_entities": [
                "\"ALICE\""
            ]
        },
        {
            "merged_entity_name": "WHITE KNIGHT",
            "entity_type": "PERSON",
            "description": "A character in armor riding a horse, holding a spear and a shield, appearing to be in motion. He drew up at Alice’s side, and tumbled off his horse just as the Red Knight had done: then he got on again, and the two Knights sat and looked at each other for some time without speaking. Alice looked from one to the other in some bewilderment. He is also known as the White Knight, who mistakenly wore the Knight's helmet, causing a mix-up and a humorous situation.",
            "source_image_entities": [
                "WHITE KNIGHT"
            ],
            "source_text_entities": [
                "\"KNIGHT\""
            ]
        },
        {
            "merged_entity_name": "HORSE",
            "entity_type": "ANIMAL",
            "description": "A horse being ridden by the White Knight, depicted in mid-stride. The horse is the mount of the Red Knight, involved in the action of the story as it stops suddenly and the Knight tumbled off. They let them get on and off them just as if they were tables!",
            "source_image_entities": [
                "HORSE"
            ],
            "source_text_entities": [
                "\"HORSE\""
            ]
        },
        {
            "merged_entity_name": "TREE",
            "entity_type": "GEO",
            "description": "A large tree with detailed bark and branches, providing a backdrop to the scene. The tree is the place where Alice hides to be out of the way of the blows during the knights' battle.",
            "source_image_entities": [
                "TREE"
            ],
            "source_text_entities": [
                "\"TREE\""
            ]
        }
    ],
    "image_24": [
        {
            "merged_entity_name": "ALICE",
            "entity_type": "PERSON",
            "description": "A young girl with long hair, wearing a dress and striped stockings, standing next to a horse. The main character who interacts with the Red Queen and the White Queen, and is involved in a series of nonsensical discussions and mathematical riddles. Also referred to as 'CHILD' by the Red Queen, indicating her youth and implying a lack of understanding or importance.",
            "source_image_entities": [
                "ALICE"
            ],
            "source_text_entities": [
                "ALICE",
                "ALICE"
            ]
        },
        {
            "merged_entity_name": "WHITE KNIGHT",
            "entity_type": "PERSON",
            "description": "A man with a large mustache, wearing armor and riding a horse, holding a lantern. A character who frequently falls off his horse, discusses his inventions, and shares his thoughts on various topics with Alice. He is also known as the White Knight, who mistakenly wore the Knight's helmet, causing a mix-up and a humorous situation.",
            "source_image_entities": [
                "WHITE KNIGHT"
            ],
            "source_text_entities": [
                "KNIGHT",
                "KNIGHT"
            ]
        },
        {
            "merged_entity_name": "HORSE",
            "entity_type": "ANIMAL",
            "description": "A horse with a saddle and bridle, carrying the White Knight. The horse is the mode of transportation for the Knight and is often the cause of his falls. It is also involved in discussions about riding and balance.",
            "source_image_entities": [
                "HORSE"
            ],
            "source_text_entities": [
                "HORSE",
                "HORSE",
                "HORSE"
            ]
        },
        {
            "merged_entity_name": "LANTERN",
            "entity_type": "OBJECT",
            "description": "An old-fashioned lantern held by the White Knight.",
            "source_image_entities": [
                "LANTERN"
            ],
            "source_text_entities": []
        },
        {
            "merged_entity_name": "PLUM-CAKE DISH",
            "entity_type": "OBJECT",
            "description": "It’s meant for plum-cake, said Alice. The dish is the object on which the plum-cake was placed, mentioned as evidence that Alice was not dreaming.",
            "source_image_entities": [],
            "source_text_entities": [
                "PLUM-CAKE",
                "DISH"
            ]
        },
        {
            "merged_entity_name": "BAG WITH CANDLESTICKS",
            "entity_type": "OBJECT",
            "description": "And he hung it to the saddle, which was already loaded with bunches of carrots, and fire-irons, and many other things. The bag is used by the Knight to carry various items, including the dish meant for plum-cake. There are so many candlesticks in the bag.",
            "source_image_entities": [],
            "source_text_entities": [
                "BAG",
                "CANDLESTICKS"
            ]
        },
        {
            "merged_entity_name": "BEE-HIVE AND MOUSE-TRAP",
            "entity_type": "OBJECT",
            "description": "‘Yes, it’s a very good bee-hive,’ the Knight said in a discontented tone, ‘one of the best kind. But not a single bee has come near it yet. And the other thing is a mouse-trap. I suppose the mice keep the bees out––or the bees keep the mice out, I don’t know which.’ The bee-hive is an object fastened to the saddle, which the Knight hopes will attract bees for honey. The Mouse-trap is an object carried by the Knight, intended to catch mice that might disturb the bees.",
            "source_image_entities": [],
            "source_text_entities": [
                "BEE-HIVE",
                "MOUSE-TRAP"
            ]
        },
        {
            "merged_entity_name": "ANKLETS",
            "entity_type": "OBJECT",
            "description": "‘To guard against the bites of sharks,’ the Knight replied. ‘It’s an invention of my own. And now help me on. I’ll go with you to the end of the wood——What’s that dish for?’ ‘It’s meant for plum-cake,’ said Alice. The Anklets are objects around the horse's feet, invented by the Knight to guard against shark bites.",
            "source_image_entities": [],
            "source_text_entities": [
                "ANKLETS"
            ]
        }
    ],
    "image_25": [
        {
            "merged_entity_name": "ALICE",
            "entity_type": "PERSON",
            "description": "A young girl with long hair, wearing a dress and apron, interacting with a large creature, and involved in nonsensical discussions and mathematical riddles with the Red Queen and the White Queen.",
            "source_image_entities": [
                "ALICE"
            ],
            "source_text_entities": [
                "\"ALICE\""
            ]
        },
        {
            "merged_entity_name": "KNIGHT",
            "entity_type": "PERSON",
            "description": "A character who frequently falls off his horse, discusses his inventions, and shares his thoughts on various topics with Alice. He is also known as the White Knight, who mistakenly wore the Knight's helmet, causing a mix-up and a humorous situation.",
            "source_image_entities": [
                "TWEEDLEDUM"
            ],
            "source_text_entities": [
                "\"KNIGHT\""
            ]
        },
        {
            "merged_entity_name": "GAME SETTING",
            "entity_type": "EVENT",
            "description": "The scene depicts a playful interaction between Alice and the Knight, involving the hedgehog as part of a game, and showcases the Knight's inventive nature and humorous incidents.",
            "source_image_entities": [
                "GAME SETTING"
            ],
            "source_text_entities": [
                "\"THROUGH THE LOOKING-GLASS\"",
                "\"HADDOCKS' EYES\"",
                "\"THE AGED AGED MAN\"",
                "\"WAYS AND MEANS\"",
                "\"SPADESUIT-SITTING ON A GATE\""
            ]
        }
    ],
    "image_26": [
        {
            "merged_entity_name": "MAN",
            "entity_type": "PERSON",
            "description": "A man with wild hair, wearing a large hat and coat, sitting on a wooden fence, similar to the 'Aged aged man' described in the Knight's song.",
            "source_image_entities": [
                "MAN"
            ],
            "source_text_entities": [
                "AGED AGED MAN"
            ]
        },
        {
            "merged_entity_name": "FENCE",
            "entity_type": "OBJECT",
            "description": "A wooden fence with the man sitting on it, as referenced in the description of the 'Aged aged man' in the Knight's song.",
            "source_image_entities": [
                "FENCE"
            ],
            "source_text_entities": [
                "SPADESUIT-SITTING ON A GATE"
            ]
        }
    ],
    "image_27": [
        {
            "merged_entity_name": "ALICE",
            "entity_type": "PERSON",
            "description": "The main character who interacts with the Red Queen and the White Queen, and is involved in a series of nonsensical discussions and mathematical riddles. Also referred to as 'CHILD' by the Red Queen, indicating her youth and implying a lack of understanding or importance. She finds a golden crown, signifying her new status as a Queen.",
            "source_image_entities": [
                "WHITE BACKGROUND"
            ],
            "source_text_entities": [
                "ALICE"
            ]
        },
        {
            "merged_entity_name": "KNIGHT",
            "entity_type": "PERSON",
            "description": "A character who frequently falls off his horse, discusses his inventions, and shares his thoughts on various topics with Alice. He is also known as the White Knight, who mistakenly wore the Knight's helmet, causing a mix-up and a humorous situation.",
            "source_image_entities": [],
            "source_text_entities": [
                "KNIGHT"
            ]
        },
        {
            "merged_entity_name": "RED QUEEN",
            "entity_type": "PERSON",
            "description": "The Red Queen is a character Alice encounters, who is associated with the concept of royalty and known for her sharp interruptions and insistence on manners and logic, often leading to absurd conclusions.",
            "source_image_entities": [],
            "source_text_entities": [
                "RED QUEEN"
            ]
        },
        {
            "merged_entity_name": "WHITE QUEEN",
            "entity_type": "PERSON",
            "description": "The White Queen is the other queen Alice interacts with, who also engages in illogical conversations and mathematical puzzles with Alice.",
            "source_image_entities": [],
            "source_text_entities": [
                "WHITE QUEEN"
            ]
        },
        {
            "merged_entity_name": "QUEEN",
            "entity_type": "PERSON",
            "description": "A generic reference to a queen, used by Alice when she is unsure of the specific identity of the queens she is addressing, and also refers to Alice's new status after finding a golden crown.",
            "source_image_entities": [
                "STAR PATTERN"
            ],
            "source_text_entities": [
                "QUEEN"
            ]
        }
    ],
    "image_28": [
        {
            "merged_entity_name": "ALICE",
            "entity_type": "PERSON",
            "description": "A young girl with long hair, wearing a crown and a dress, sitting on the ground. She is the main character who interacts with the Red Queen and the White Queen, and is involved in a series of nonsensical discussions and mathematical riddles.",
            "source_image_entities": [
                "ALICE"
            ],
            "source_text_entities": [
                "ALICE"
            ]
        },
        {
            "merged_entity_name": "CROWN",
            "entity_type": "OBJECT",
            "description": "A golden crown worn by Alice on her head, symbolizing her new status as a queen.",
            "source_image_entities": [
                "CROWN"
            ],
            "source_text_entities": [
                "\"QUEEN\""
            ]
        },
        {
            "merged_entity_name": "DRESS",
            "entity_type": "OBJECT",
            "description": "A dress worn by Alice, covering her body, part of her attire as she assumes the role of a queen.",
            "source_image_entities": [
                "DRESS"
            ],
            "source_text_entities": [
                "\"QUEEN\""
            ]
        }
    ],
    "image_29": [
        {
            "merged_entity_name": "ALICE",
            "entity_type": "PERSON",
            "description": "A young girl with long hair, wearing a dress and a crown, holding a scepter, who interacts with the Red Queen and the White Queen, and is involved in a series of nonsensical discussions and mathematical riddles.",
            "source_image_entities": [
                "ALICE"
            ],
            "source_text_entities": [
                "ALICE"
            ]
        },
        {
            "merged_entity_name": "WHITE QUEEN",
            "entity_type": "PERSON",
            "description": "An elderly man with a crown, dressed in a striped robe, sitting on the ground, who engages in illogical conversations and mathematical puzzles with Alice.",
            "source_image_entities": [
                "WHITE KING"
            ],
            "source_text_entities": [
                "WHITE QUEEN"
            ]
        },
        {
            "merged_entity_name": "BLACK KING",
            "entity_type": "PERSON",
            "description": "A dark-skinned man with a crown, dressed in a dark robe, sitting on the ground, who is associated with the concept of royalty and engages in nonsensical dialogue with Alice.",
            "source_image_entities": [
                "BLACK KING"
            ],
            "source_text_entities": [
                "RED QUEEN"
            ]
        }
    ]
}