{
  "chunk-fc8cd8056074dc0bf9f555f4d74b9ff9": {
    "tokens": 1200,
    "content": "![](images/image_1.jpg)  \n\n# CHAPTER IV  \n\ntweedledum and tweedledee\\* They were standing under a tree, each with an arm round the other’s neck, and Alice knew which was which in a moment, because one of them had ‘DUM’ embroidered on his collar, and  the  other  ‘DEE.’ ‘I  suppose  they’ve  each  got “TWEEDLE” round at the back of the collar,’ she said to herself.  \n\nThey stood so still that she quite forgot they were alive, and she was just going round to see if the word ‘TWEEDLE’ was written at the back of each collar, when she was startled by a voice coming from the one marked ‘DUM.’  \n\n‘If you think we’re wax-works,’ he said, ‘you ought to pay, you know. Wax-works weren’t made to be looked at for nothing. Nohow!’  \n\n‘Contrariwise,’  added  the  one  marked  ‘DEE,’ ‘if  you think we’re alive, you ought to speak.’  \n\n‘I’m sure I’m very sorry,’ was all Alice could say; for the words of the old song kept ringing through her head like the ticking of a clock, and she could hardly help saying them out loud:––  \n\n‘Tweedledum and Tweedledee Agreed to have a battle; For Tweedledum said Tweedledee Had spoiled his nice new rattle.  \n\nJust then flew down a monstrous crow, As black as a tar-barrel; Which frightened both the heroes so, They quite forgot their quarrel.’  \n\n‘I know what you’re thinking about,’ said Tweedledum; ‘but it isn’t so, nohow.’  \n\n‘Contrariwise,’  continued  Tweedledee,  ‘if  it  was  so,  it might be; and if it were so, it would be; but as it isn’t, it ain’t. That’s logic.’\\*  \n\n‘I was thinking,’ Alice said very politely, ‘which is the best way out of this wood: it’s getting so dark. Would you tell me, please?’  \n\nBut the fat little men only looked at each other and grinned.  \n\nThey looked so exactly like a couple of great schoolboys, that Alice couldn’t help pointing her finger at Tweedledum, and saying ‘First Boy!’  \n\n‘Nohow!’ Tweedledum cried out briskly, and shut his mouth up again with a snap.  \n\n‘Next Boy!’ said Alice, passing on to Tweedledee, though she felt quite certain he would only shout out ‘Contrariwise!’ and so he did.  \n\n‘You’ve begun wrong!’ cried Tweedledum. ‘The first thing in a visit is to say “How d’ye do?” and shake hands!’ And here the two brothers gave each other a hug, and then they held out the two hands that were free, to shake hands with her.  \n\nAlice did not like shaking hands with either of them first, for fear of hurting the other one’s feelings; so, as the best way out of the difficulty, she took hold of both hands at once: the next moment they were dancing round in a ring. This seemed quite natural (she remembered afterwards), and she was not even surprised to hear music playing: it seemed to come from the tree under which they were dancing, and it was done (as well as she could make it out) by the branches rubbing one across the other, like fiddles and fiddle-sticks.  \n\n‘But it certainly was funny,’ (Alice said afterwards, when she was telling her sister the history of all this,) ‘to find myself singing “Here we go round the mulberry bush.”\\* I don’t know when I began it, but somehow I felt as if I’d been singing it a long long time!’  \n\nThe other two dancers were fat, and very soon out of breath. ‘Four times round is enough for one dance,’ Tweedledum panted out, and they left off dancing as suddenly as they had begun: the music stopped at the same moment.  \n\nThen they let go of Alice’s hands, and stood looking at her for a minute: there was a rather awkward pause, as Alice didn’t know how to begin a conversation with people she had just been dancing with. ‘It would never do to say “How d’ye do?” now,’ she said to herself: ‘we seem to have got beyond that, somehow!’  \n\n‘I hope you’re not much tired?’ she said at last.  \n\n‘Nohow.  And  thank  you  very  much  for  asking,’  said Tweedledum. ‘So much obliged!’ added Tweedledee. ‘You like poetry?’ ‘Ye-es, pretty well––some poetry,’ Alice said doubtfully. ‘Would you tell me which road leads out of the wood?’ ‘What shall I repeat to her?’ said Tweedledee, looking round at Tweedledum with great solemn eyes, and not noticing Alice’s question.  \n\n‘“The Walrus and the Carpenter”\\* is the longest,’ Tweedledum replied, giving his brother an affectionate hug.  \n\nTweedledee began instantly:  \n\nHere Alice ventured to interrupt him. ‘If it’s very long, she said, as politely as she could, ‘would you please tell me first which road—  \n\nTweedledee smiled gently, and began again:  \n\n‘The sun was shining on the sea, Shining with all his might: He did his very best to make The billows smooth and bright–– And this was odd, because it was The middle of the night.  \n\nThe moon was shining sulkily, Because",
    "chunk_order_index": 0,
    "full_doc_id": "doc-0ea2c1c44f0856dc4b4c6159d8d0107f"
  },
  "chunk-a9c7c0e77b59631f5144953245b536d2": {
    "tokens": 1200,
    "content": "Here Alice ventured to interrupt him. ‘If it’s very long, she said, as politely as she could, ‘would you please tell me first which road—  \n\nTweedledee smiled gently, and began again:  \n\n‘The sun was shining on the sea, Shining with all his might: He did his very best to make The billows smooth and bright–– And this was odd, because it was The middle of the night.  \n\nThe moon was shining sulkily, Because she thought the sun Had got no business to be there After the day was done–– “It’s very rude of him,” she said, “To come and spoil the fun!”  \n\nThe sea was wet as wet could be, The sands were dry as dry. You could not see a cloud, because No cloud was in the sky: No birds were flying overhead–– There were no birds to fly.  \n\nThe Walrus and the Carpenter Were walking close at hand:\\* They wept like anything to see Such quantities of sand: “If this were only cleared away,” They said, “it would be grand!”  \n\n“If seven maids with seven mops Swept it for half a year, Do you suppose,” the Walrus said, “That they could get it clear?”  \n\n![](images/image_2.jpg)  \n\n“I doubt it,” said the Carpenter, And shed a bitter tear.  \n\n“O Oysters, come and walk with us!” The Walrus did beseech. “A pleasant walk, a pleasant talk, Along the briny beach: We cannot do with more than four, To give a hand to each.”  \n\nThe eldest Oyster looked at him, But never a word he said: The eldest Oyster winked his eye, And shook his heavy head–– Meaning to say he did not choose To leave the oyster-bed.  \n\nBut four young Oysters hurried up, All eager for the treat:   \nTheir coats were brushed, their faces washed, Their shoes were clean and neat––   \nAnd this was odd, because, you know, They hadn’t any feet.  \n\nFour other Oysters followed them, And yet another four; And thick and fast they came at last, And more, and more, and more–– All hopping through the frothy waves, And scrambling to the shore.  \n\nThe Walrus and the Carpenter Walked on a mile or so, And then they rested on a rock Conveniently low: And all the little Oysters stood And waited in a row.  \n\n“The time has come,” the Walrus said, “To talk of many things: Of shoes––and ships––and sealing-wax–– Of cabbages––and kings–– And why the sea is boiling hot–– And whether pigs have wings.”  \n\n“But wait a bit,” the Oysters cried, “Before we have our chat; For some of us are out of breath, And all of us are fat!” “No hurry!” said the Carpenter. They thanked him much for that.  \n\n“A loaf of bread,” the Walrus said, “Is what we chiefly need: Pepper and vinegar besides Are very good indeed–– Now, if you’re ready, Oysters dear, We can begin to feed.”  \n\n![](images/image_3.jpg)  \n\n“But not on us!” the Oysters cried, Turning a little blue. “After such kindness, that would be A dismal thing to do!” “The night is fine,” the Walrus said. “Do you admire the view?  \n\n“It was so kind of you to come! And you are very nice!” The Carpenter said nothing but “Cut us another slice. I wish you were not quite so deaf–– I’ve had to ask you twice!”  \n\n“It seems a shame,” the Walrus said, “To play them such a trick. After we’ve brought them out so far, And made them trot so quick!” The Carpenter said nothing but “The butter’s spread too thick!”  \n\n![](images/image_4.jpg)  \n\n“I weep for you,” the Walrus said: “I deeply sympathize.” With sobs and tears he sorted out Those of the largest size, Holding his pocket-handkerchief Before his streaming eyes.  \n\n“O Oysters,” said the Carpenter, “You’ve had a pleasant run! Shall we be trotting home again?” But answer came there none–– And this was scarcely odd, because They’d eaten every one.’\\*  \n\n‘I like the Walrus best,’ said Alice: ‘because he was a little sorry for the poor oysters.’  \n\n‘He ate more than the Carpenter, though,’ said Tweedledee. ‘You see he held his handkerchief in front, so that the Carpenter couldn’t count how many he took: contrariwise.’  \n\n‘That was mean!’ Alice said indignantly. ‘Then I like the Carpenter best––if he didn’t eat so many as the Walrus.’  \n\n‘But he ate as many as he could get,’ said Tweedledum.  \n\nThis was a puzzler. After a pause, Alice began, ‘Well! They were both very unpleasant characters——’ Here she checked herself in some alarm, at hearing something that sounded to her like the puffing of a large steam-engine in the wood near them, though she feared it was more likely to be a wild beast. ‘Are there any lions or tigers about here?’ she asked timidly.  \n\n‘It’s only the Red King snoring,’ said Tweedledee. ‘Come and look at him!’ the brothers cried, and they each took one of Alice’s hands, and led her up to where the King was sleeping.  \n\n![](images/image_5.jpg)  \n\n‘Isn’t he a lovely sight?’ said Tweedledum.  \n\nAlice couldn’t say honestly that he was. He had a tall red night-cap on, with a tassel, and he was lying cr",
    "chunk_order_index": 1,
    "full_doc_id": "doc-0ea2c1c44f0856dc4b4c6159d8d0107f"
  },
  "chunk-54d4ffd5ce4e1f0b5fa0dcbae8c91a17": {
    "tokens": 1200,
    "content": "’s only the Red King snoring,’ said Tweedledee. ‘Come and look at him!’ the brothers cried, and they each took one of Alice’s hands, and led her up to where the King was sleeping.  \n\n![](images/image_5.jpg)  \n\n‘Isn’t he a lovely sight?’ said Tweedledum.  \n\nAlice couldn’t say honestly that he was. He had a tall red night-cap on, with a tassel, and he was lying crumpled up into a sort of untidy heap, and snoring loud——‘fit to snore his head off!’ as Tweedledum remarked.  \n\n‘I’m afraid he’ll catch cold with lying on the damp grass,’ said Alice, who was a very thoughtful little girl.  \n\n‘He’s dreaming now,’ said Tweedledee: ‘and what do you think he’s dreaming about?’  \n\nAlice said ‘Nobody can guess that.’  \n\n‘Why, about you!’ Tweedledee exclaimed, clapping his hands triumphantly. ‘And if he left off dreaming about you, where do you suppose you’d be?’  \n\n‘Where I am now, of course,’ said Alice.  \n\n‘Not you!’ Tweedledee retorted contemptuously. ‘You’d be nowhere. Why, you’re only a sort of thing in his dream!’  \n\n‘If that there King was to wake,’ added Tweedledum, ‘you’d go out––bang!––just like a candle!’  \n\n‘I shouldn’t!’ Alice exclaimed indignantly. ‘Besides, if I’m only a sort of thing in his dream, what are you, I should like to know?’  \n\n‘Ditto,’ said Tweedledum.  \n\n‘Ditto, ditto!’ cried Tweedledee.  \n\nHe shouted this so loud that Alice couldn’t help saying ‘Hush! You’ll be waking him, I’m afraid, if you make so much noise.’  \n\n‘Well, it’s no use your talking about waking him,’ said Tweedledum, ‘when you’re only one of the things in his dream. You know very well you’re not real.’  \n\n‘I am real!’ said Alice, and began to cry.  \n\n‘You wo’n’t make yourself a bit realler by crying,’ Tweedledee remarked: ‘there’s nothing to cry about.’  \n\n‘If I wasn’t real,’ Alice said––half-laughing through her tears, it all seemed so ridiculous––‘I shouldn’t be able to cry.  \n\n‘I hope you don’t suppose those are real tears?’ Tweedledum interrupted in a tone of great contempt.  \n\n‘I know they’re talking nonsense,’ Alice thought to herself: ‘and it’s foolish to cry about it.’ So she brushed away her tears, and went on, as cheerfully as she could, ‘At any rate I’d better be getting out of the wood, for really it’s coming on very dark. Do you think it’s going to rain?’  \n\nTweedledum spread a large umbrella over himself and his brother, and looked up into it. ‘No, I don’t think it is,’ he said: ‘at least––not under here. Nohow.’  \n\n‘But it may rain outside?’  \n\n‘It  may––if  it  chooses,’  said  Tweedledee:  ‘we’ve  no objection. Contrariwise.’  \n\n‘Selfish things!’ thought Alice, and she was just going to say ‘Good-night’ and leave them, when Tweedledum sprang out from under the umbrella, and seized her by the wrist.  \n\n‘Do you see that?’ he said, in a voice choking with passion, and his eyes grew large and yellow all in a moment, as he pointed with a trembling finger at a small white thing lying under the tree.  \n\n‘It’s only a rattle,’\\* Alice said, after a careful examination of the little white thing. ‘Not a rattle-snake, you know,’ she added hastily, thinking that he was frightened: ‘only an old rattle–– quite old and broken.’  \n\n‘I knew it was!’ cried Tweedledum, beginning to stamp about wildly and tear his hair. ‘It’s spoilt, of course!’ Here he looked at Tweedledee, who immediately sat down on the ground, and tried to hide himself under the umbrella.  \n\n![](images/image_6.jpg)  \n\nAlice laid her hand upon his arm, and said, in a soothing tone, ‘You needn’t be so angry about an old rattle.’  \n\n‘But it isn’t old!’ Tweedledum cried, in a greater fury than ever. ‘It’s new, I tell you––I bought it yesterday––my nice new RATTLE!’ and his voice rose to a perfect scream.  \n\nAll this time Tweedledee was trying his best to fold up the umbrella, with himself in it: which was such an extraordinary thing to do, that it quite took off Alice’s attention from the angry brother. But he couldn’t quite succeed, and it ended in his rolling over, bundled up in the umbrella, with only his head out: and there he lay, opening and shutting his mouth and his large eyes— —‘looking more like a fish than anything else,’ Alice thought.  \n\n‘Of course you agree to have a battle?’ Tweedledum said in a calmer tone.  \n\n‘I suppose so,’ the other sulkily replied, as he crawled out of the umbrella: ‘only she must help us to dress up, you know.’  \n\nSo the two brothers went off hand-in-hand into the wood, and returned in a minute with their arms full of things––such as bolsters, blankets, hearth-rugs, table-cloths, dish-covers, and coal-scuttles",
    "chunk_order_index": 2,
    "full_doc_id": "doc-0ea2c1c44f0856dc4b4c6159d8d0107f"
  },
  "chunk-e88bbdcba879d85263d57e4dbfd1f008": {
    "tokens": 1200,
    "content": "agree to have a battle?’ Tweedledum said in a calmer tone.  \n\n‘I suppose so,’ the other sulkily replied, as he crawled out of the umbrella: ‘only she must help us to dress up, you know.’  \n\nSo the two brothers went off hand-in-hand into the wood, and returned in a minute with their arms full of things––such as bolsters, blankets, hearth-rugs, table-cloths, dish-covers, and coal-scuttles. ‘I hope you’re a good hand at pinning and tying strings?’ Tweedledum remarked. ‘Every one of these things has got to go on, somehow or other.’  \n\nAlice said afterwards she had never seen such a fuss made about anything in all her life––the way those two bustled about––and the quantity of things they put on––and the trouble they gave her in tying strings and fastening buttons ‘Really they’ll be more like bundles of old clothes than anything else, by the time they’re ready!’ she said to herself, as she arranged a bolster round the neck of Tweedledee, ‘to keep his head from being cut off,’ as he said.  \n\n‘You know,’ he added very gravely, ‘it’s one of the most serious things that can possibly happen to one in a battle–– to get one’s head cut off.’ Alice laughed loud: but she managed to turn it into a cough, for fear of hurting his feelings. ‘Do I look very pale?’ said Tweedledum, coming up to have his helmet tied on. (He called it a helmet, though it certainly looked much more like a saucepan.) ‘Well––yes––a little,’ Alice replied gently. ‘I’m very brave, generally,’ he went on in a low voice: ‘only to-day I happen to have a headache.’ ‘And I’ve got a toothache!’ said Tweedledee, who had overheard the remark. ‘I’m far worse than you!’ ‘Then you’d better not fight to-day,’ said Alice, thinking it a good opportunity to make peace.  \n\n![](images/image_7.jpg)  \n\n‘We must have a bit of a fight, but I don’t care about going on long,’ said Tweedledum. ‘What’s the time now?’  \n\nTweedledee looked at his watch, and said ‘Half-past four.’ ‘Let’s fight till six, and then have dinner,’ said Tweedledum.  \n\n‘Very well,’ the other said, rather sadly: ‘and she can watch us––only you’d better not come very close,’ he added: ‘I generally hit every thing I can see––when I get really excited.’  \n\n‘And $I$ hit every thing within reach,’ cried Tweedledum, ‘whether I can see it or not!’  \n\nAlice laughed. ‘You must hit the trees pretty often, I should think,’ she said.  \n\nTweedledum looked round him with a satisfied smile. ‘I don’t suppose,’ he said, ‘there’ll be a tree left standing, for ever so far round, by the time we’ve finished!’  \n\n‘And all about a rattle!’ said Alice, still hoping to make them a little ashamed of fighting for such a trifle.  \n\n‘I shouldn’t have minded it so much,’ said Tweedledum, ‘if it hadn’t been a new one.’  \n\n‘I wish the monstrous crow would come!’ thought Alice.  \n\n‘There’s only one sword, you know,’ Tweedledum said to his brother: ‘but you can have the umbrella––it’s quite as sharp. Only we must begin quick. It’s getting as dark as it can.’  \n\n‘And darker,’ said Tweedledee.  \n\nIt was getting dark so suddenly that Alice thought there must be a thunderstorm coming on. ‘What a thick black cloud that is!’ she said. ‘And how fast it comes! Why, I do believe it’s got wings!’  \n\n‘It’s the crow!’ Tweedledum cried out in a shrill voice of alarm; and the two brothers took to their heels and were out of sight in a moment.  \n\nAlice ran a little way into the wood, and stopped under a large tree. ‘It can never get at me here,’ she thought: ‘it’s far too large to squeeze itself in among the trees. But I wish it wouldn’t flap its wings so––it makes quite a hurricane in the wood––here’s somebody’s shawl being blown away!’  \n\n# CHAPTER V  \n\nwool and water\\*  \n\nShe caught the shawl as she spoke, and looked about for the owner: in another moment the White Queen came running wildly through the wood,\\* with both arms stretched out wide, as if she were flying, and Alice very civilly went to meet her with the shawl.  \n\n‘I’m very glad I happened to be in the way,’ Alice said, as she helped her to put on her shawl again.  \n\nThe White Queen only looked at her in a helpless frightened sort of way, and kept repeating something in a whisper to herself that sounded like ‘Bread-and-butter, bread-and-butter,’ and Alice felt that if there was to be any conversation at all, she must manage it herself. So she began rather timidly: ‘Am I addressing the White Queen?’  \n\n‘Well, yes, if you call that a-dressing,’ the Queen said. ‘It isn’t my notion of the thing, at all.’  \n\nAlice thought it would never do to have an argument at the very beginning of their conversation, so she smiled and said ‘If your Majesty will only tell me the right way to begin, I’ll do it as well as I can.’  \n\n‘But I don’t want it done at all!’ groaned the poor Queen",
    "chunk_order_index": 3,
    "full_doc_id": "doc-0ea2c1c44f0856dc4b4c6159d8d0107f"
  },
  "chunk-e0508a0320d927bcbf7f1e59996d97a0": {
    "tokens": 1200,
    "content": "the White Queen?’  \n\n‘Well, yes, if you call that a-dressing,’ the Queen said. ‘It isn’t my notion of the thing, at all.’  \n\nAlice thought it would never do to have an argument at the very beginning of their conversation, so she smiled and said ‘If your Majesty will only tell me the right way to begin, I’ll do it as well as I can.’  \n\n‘But I don’t want it done at all!’ groaned the poor Queen. ‘I’ve been a-dressing myself for the last two hours.’  \n\nIt would have been all the better, as it seemed to Alice, if she had got some one else to dress her, she was so dreadfully untidy. ‘Every single thing’s crooked,’ Alice thought to herself, ‘and she’s all over pins!——May I put your shawl straight for you?’ she added aloud.  \n\n‘I don’t know what’s the matter with it!’ the Queen said, in a melancholy voice. ‘It’s out of temper, I think. I’ve pinned it here, and I’ve pinned it there, but there’s no pleasing it!’  \n\n![](images/image_8.jpg)  \n\n‘It ca’n’t go straight, you know, if you pin it all on one side,’ Alice said, as she gently put it right for her; ‘and, dear me, what a state your hair is in!’  \n\n‘The brush has got entangled in it!’ the Queen said with a sigh. ‘And I lost the comb yesterday.’  \n\nAlice carefully released the brush, and did her best to get the hair into order. ‘Come, you look rather better now!’ she said, after altering most of the pins. ‘But really you should have a lady’s-maid!’  \n\n‘I’m sure I’ll take you with pleasure!’ the Queen said. ‘Twopence a week, and jam every other day.’  \n\nAlice couldn’t help laughing, as she said ‘I don’t want you to hire me––and I don’t care for jam.’  \n\n‘It’s very good jam,’ said the Queen. ‘Well, I don’t want any to-day, at any rate.’  \n\n‘You couldn’t have it if you did want it,’ the Queen said. ‘The rule is, jam to-morrow and jam yesterday––but never jam to-day.’\\*  \n\n‘It must come sometimes to “jam to-day,”’ Alice objected.  \n\n‘No, it ca’n’t,’ said the Queen. ‘It’s jam every other day: to-day isn’t any other day, you know.’  \n\n‘I don’t understand you,’ said Alice. ‘It’s dreadfully confusing!’  \n\n‘That’s the effect of living backwards,’ the Queen said kindly: ‘it always makes one a little giddy at first—  \n\n‘Living backwards!’ Alice repeated in great astonishment. ‘I never heard of such a thing!’  \n\n‘––but there’s one great advantage in it, that one’s memory works both ways.’  \n\n‘I’m sure mine only works one way,’ Alice remarked. ‘I ca’n’t remember things before they happen.’  \n\n‘It’s a poor sort of memory that only works backwards,’ the Queen remarked.  \n\n‘What sort of things do you remember best?’ Alice ventured to ask.  \n\n‘Oh, things that happened the week after next,’ the Queen replied in a careless tone. ‘For instance, now,’ she went on,  \n\nsticking a large piece of plaster on her finger as she spoke, ‘there’s the King’s Messenger. He’s in prison now, being punished: and the trial doesn’t even begin till next Wednesday: and of course the crime comes last of all.’  \n\n‘Suppose he never commits the crime?’ said Alice.  \n\n‘That would be all the better,  wouldn’t  it?’  the Queen said, as she bound the plaster round her finger with a bit of ribbon.  \n\nAlice felt there was no denying that. ‘Of course it  \n\n![](images/image_9.jpg)  \n\nwould be all the better,’ she said: ‘but it wouldn’t be all the better his being punished.’  \n\n‘You’re wrong there, at any rate,’ said the Queen. ‘Were you ever punished?’  \n\n‘Only for faults,’ said Alice.  \n\n‘And you were all the better for it, I know!’ the Queen said triumphantly.  \n\n‘Yes, but then I had done the things I was punished for,’ said Alice: ‘that makes all the difference.’  \n\n‘But if you hadn’t done them,’ the Queen said, ‘that would have been better still; better, and better, and better!’ Her voice went higher with each ‘better,’ till it got quite to a squeak at last.  \n\nAlice was just beginning to say ‘There’s a mistake somewhere——,’ when the Queen began screaming, so loud that she had to leave the sentence unfinished. ‘Oh, oh, oh!’ shouted the Queen, shaking her hand about as if she wanted to shake it off. ‘My finger’s bleeding! Oh, oh, oh, oh!’  \n\nHer screams were so exactly like the whistle of a steamengine, that Alice had to hold both her hands over her ears.  \n\n‘What is the matter?’ she said, as soon as there was a chance of making herself heard. ‘Have you pricked your finger?’  \n\n‘I haven’t pricked it yet,’ the Queen said, ‘but I soon shall–– oh, oh, oh!’  \n\n‘When do you expect to do it?’ Alice asked, feeling very much inclined to laugh.  \n\n‘When I fasten my shawl again,’ the poor Queen groaned out: ‘the brooch will come undone directly. Oh, oh!’ As she said the words the brooch flew open, and the Queen clutched wildly",
    "chunk_order_index": 4,
    "full_doc_id": "doc-0ea2c1c44f0856dc4b4c6159d8d0107f"
  },
  "chunk-9015acbd1380cca16515a5b99e6a1ffc": {
    "tokens": 1200,
    "content": "you pricked your finger?’  \n\n‘I haven’t pricked it yet,’ the Queen said, ‘but I soon shall–– oh, oh, oh!’  \n\n‘When do you expect to do it?’ Alice asked, feeling very much inclined to laugh.  \n\n‘When I fasten my shawl again,’ the poor Queen groaned out: ‘the brooch will come undone directly. Oh, oh!’ As she said the words the brooch flew open, and the Queen clutched wildly at it, and tried to clasp it again.  \n\n‘Take care!’ cried Alice. ‘You’re holding it all crooked!’ And she caught at the brooch; but it was too late: the pin had slipped, and the Queen had pricked her finger.  \n\n‘That accounts for the bleeding, you see,’ she said to Alice with a smile. ‘Now you understand the way things happen here.’  \n\n‘But why don’t you scream now?’ Alice asked, holding her hands ready to put over her ears again.  \n\n‘Why, I’ve done all the screaming already,’ said the Queen. ‘What would be the good of having it all over again?’  \n\nBy this time it was getting light. ‘The crow must have flown away, I think,’ said Alice: ‘I’m so glad it’s gone. I thought it was the night coming on.’  \n\n‘I wish $I$ could manage to be glad!’ the Queen said. ‘Only I never can remember the rule. You must be very happy, living in this wood, and being glad whenever you like!’  \n\n‘Only it is so very lonely here!’ Alice said in a melancholy voice; and, at the thought of her loneliness, two large tears came rolling down her cheeks.  \n\n‘Oh, don’t go on like that!’ cried the poor Queen, wringing her hands in despair. ‘Consider what a great girl you are. Consider what a long way you’ve come to-day. Consider what o’clock it is. Consider anything, only don’t cry!’  \n\nAlice could not help laughing at this, even in the midst of her tears. ‘Can you keep from crying by considering things? she asked.  \n\n‘That’s the way it’s done,’ the Queen said with great decision: ‘nobody can do two things at once, you know. Let’s consider your age to begin with——how old are you?’  \n\n‘I’m seven and a half, exactly.’  \n\n‘You needn’t say “exactually,”’ the Queen remarked. ‘I can believe it without that. Now I’ll give you something to believe. I’m just one hundred and one, five months and a day.’  \n\n‘I ca’n’t believe that!’ said Alice.  \n\n‘Ca’n’t you?’ the Queen said in a pitying tone. ‘Try again: draw a long breath, and shut your eyes.’  \n\nAlice laughed. ‘There’s no use trying,’ she said: ‘one ca’n’t believe impossible things.’  \n\n‘I daresay you haven’t had much practice,’ said the Queen. ‘When I was your age, I always did it for half-an-hour a day. Why, sometimes I’ve believed as many as six impossible things before breakfast. There goes the shawl again!’  \n\nThe brooch had come undone as she spoke, and a sudden gust of wind blew the Queen’s shawl across a little brook. The Queen spread out her arms again, and went flying after it, and this time she succeeded in catching it for herself. ‘I’ve got it!’ she cried in a triumphant tone. ‘Now you shall see me pin it on again, all by myself!’  \n\n‘Then I hope your finger is better now?’ Alice said very politely, as she crossed the little brook\\* after the Queen.  \n\n![](images/image_10.jpg)  \n\n‘Oh, much better!’ cried the Queen, her voice rising into a  squeak  as  she  went  on.  ‘Much  be-etter!  Be-etter! Be-e-e-etter! Be-e-ehh!’ The last word ended in a long bleat, so like a sheep that Alice quite started.  \n\nShe looked at the Queen, who seemed to have suddenly wrapped herself up in wool.\\* Alice rubbed her eyes, and looked again. She couldn’t make out what had happened at all. Was she in a shop?\\* And was that really––was it really a sheep that was sitting on the other side of the counter? Rub as she would, she could make nothing more of it: she was in a little dark shop, leaning with her elbows on the counter, and opposite to her was an old Sheep, sitting in an arm-chair, knitting, and every now and then leaving off to look at her through a great pair of spectacles.  \n\n‘What is it you want to buy?’ the Sheep said at last, looking up for a moment from her knitting.  \n\n‘I don’t quite know yet,’ Alice said very gently. ‘I should like to look all round me first, if I might.’  \n\n‘You may look in front of you, and on both sides, if you like,’ said the Sheep; ‘but you ca’n’t look all round you–– unless you’ve got eyes at the back of your head.’  \n\nBut these, as it happened, Alice had not got: so she contented herself with turning round, looking at the shelves as she came to them.  \n\nThe shop seemed to be full of all manner of curious things ––but the oddest part of it all was that, whenever she looked hard at any shelf, to make out exactly what it had on it, that particular shelf was always quite empty, though the others round it were crowded as full as they could hold.  \n\n![](images/image_11.jpg)  \n\n‘Things flow about so here!’",
    "chunk_order_index": 5,
    "full_doc_id": "doc-0ea2c1c44f0856dc4b4c6159d8d0107f"
  },
  "chunk-a9fd49b94f78e09a46e9721f797cd992": {
    "tokens": 1200,
    "content": "contented herself with turning round, looking at the shelves as she came to them.  \n\nThe shop seemed to be full of all manner of curious things ––but the oddest part of it all was that, whenever she looked hard at any shelf, to make out exactly what it had on it, that particular shelf was always quite empty, though the others round it were crowded as full as they could hold.  \n\n![](images/image_11.jpg)  \n\n‘Things flow about so here!’ she said at last in a plaintive tone, after she had spent a minute or so in vainly pursuing a large bright thing, that looked sometimes like a doll and sometimes like a work-box, and was always in the shelf next above the one she was looking at. ‘And this one is the most provoking of all––but I’ll tell you what—— ’ she added, as a sudden thought struck her. ‘I’ll follow it up to the very top shelf of all. It’ll puzzle it to go through the ceiling, I expect!’  \n\nBut even this plan failed: the ‘thing’ went through the ceiling as quietly as possible, as if it were quite used to it.\\*  \n\n‘Are you a child or a teetotum?’\\* the Sheep said, as she took up another pair of needles. ‘You’ll make me giddy soon, if you go on turning round like that.’ She was now working with fourteen pairs at once, and Alice couldn’t help looking at her in great astonishment.  \n\n‘How can she knit with so many?’ the puzzled child thought to herself. ‘She gets more and more like a porcupine every minute!’  \n\n‘Can you row?’ the Sheep asked, handing her a pair of knitting-needles as she spoke.  \n\n‘Yes, a little––but not on land––and not with needles— Alice was beginning to say, when suddenly the needles turned into oars in her hands, and she found they were in a little boat, gliding along between banks: so there was nothing for it but to do her best.  \n\n‘Feather!’\\* cried the Sheep, as she took up another pair of needles.  \n\nThis didn’t sound like a remark that needed any answer: so Alice said nothing, but pulled away. There was something very queer about the water, she thought, as every now and then the oars got fast in it, and would hardly come out again.  \n\n‘Feather! Feather!’ the Sheep cried again, taking more needles. ‘You’ll be catching a crab\\* directly.’  \n\n‘A dear little crab!’ thought Alice. ‘I should like that.’  \n\n‘Didn’t you hear me say “Feather”?’ the Sheep cried angrily, taking up quite a bunch of needles.  \n\n‘Indeed I did,’ said Alice: ‘you’ve said it very often––and very loud. Please where are the crabs?’  \n\n‘In the water, of course!’ said the Sheep, sticking some of the needles into her hair, as her hands were full. ‘Feather, I say!’  \n\n‘Why do you say “Feather” so often?’ Alice asked at last, rather vexed. ‘I’m not a bird!’  \n\n‘You are,’ said the Sheep: ‘you’re a little goose.’  \n\nThis offended Alice a little, so there was no more conversation for a minute or two, while the boat glided gently on, sometimes among beds of weeds (which made the oars stick fast in the water, worse than ever), and sometimes under trees, but always with the same tall river-banks frowning over their heads.  \n\n‘Oh, please! There are some scented rushes!’ Alice cried in a sudden transport of delight. ‘There really are––and such beauties!’\\* ‘You needn’t say “please” to me about ’em,’ the Sheep said, without looking up from her knitting: ‘I didn’t put ’em there, and I’m not going to take ’em away. ‘No, but I meant––please, may we wait and pick some?’ Alice pleaded. ‘If you don’t mind stopping the boat for a minute.’  \n\n‘How am $I$ to stop it?’ said the Sheep. ‘If you leave off rowing, it’ll stop of itself.’  \n\nSo the boat was left to drift down the stream as it would, till it glided gently in among the waving rushes. And then the little sleeves were carefully rolled up, and the little arms were plunged in elbow-deep, to get hold of the rushes a good long way down before breaking them off––and for a while Alice forgot all about the Sheep and the knitting, as she bent over the side of the boat, with just the ends of her tangled hair dipping into the water––while with bright eager eyes she caught at one bunch after another of the darling scented rushes.  \n\n‘I only hope the boat won’t tipple over!’ she said to herself. ‘Oh, what a lovely one! Only I couldn’t quite reach it.’ And it certainly did seem a little provoking (‘almost as if it happened on purpose,’ she thought) that, though she managed to pick plenty of beautiful rushes as the boat glided by, there was always a more lovely one that she couldn’t reach.  \n\n‘The prettiest are always further!’ she said at last, with a sigh at the obstinacy of the rushes in growing so far off, as, with flushed cheeks and dripping hair and hands, she scrambled back into her place, and began to arrange her new-found treasures.  \n\nWhat mattered it to her just then that the rushes had begun to fade, and to lose all their scent and beauty, from the very moment that she picked them? Even real scented rushes, you know, last only a very",
    "chunk_order_index": 6,
    "full_doc_id": "doc-0ea2c1c44f0856dc4b4c6159d8d0107f"
  },
  "chunk-655e59e5d6e63fafc3aba38f4b0967fa": {
    "tokens": 1200,
    "content": "further!’ she said at last, with a sigh at the obstinacy of the rushes in growing so far off, as, with flushed cheeks and dripping hair and hands, she scrambled back into her place, and began to arrange her new-found treasures.  \n\nWhat mattered it to her just then that the rushes had begun to fade, and to lose all their scent and beauty, from the very moment that she picked them? Even real scented rushes, you know, last only a very little while––and these, being dreamrushes, melted away almost like snow, as they lay in heaps at her feet––but Alice hardly noticed this, there were so many other curious things to think about.  \n\nThey hadn’t gone much farther before the blade of one of the oars got fast in the water and wouldn’t come out again (so Alice explained it afterwards), and the consequence was that the handle of it caught her under the chin, and, in spite of a series of little shrieks of ‘Oh, oh, oh!’ from poor Alice, it swept her straight off the seat, and down among the heap of rushes.  \n\n![](images/image_12.jpg)  \n\nHowever, she wasn’t a bit hurt, and was soon up again: the Sheep went on with her knitting all the while, just as if nothing had happened. ‘That was a nice crab you caught!’ she remarked, as Alice got back into her place, very much relieved to find herself still in the boat.  \n\n‘Was it? I didn’t see it,’ said Alice, peeping cautiously over the side of the boat into the dark water. ‘I wish it hadn’t let go––I should so like a little crab to take home with me!’ But the Sheep only laughed scornfully, and went on with her knitting.  \n\n‘Are there many crabs here?’ said Alice.  \n\n‘Crabs, and all sorts of things,’ said the Sheep: ‘plenty of choice, only make up your mind. Now, what do you want to buy?’  \n\n‘To buy!’ Alice echoed in a tone that was half astonished and half frightened––for the oars, and the boat, and the river, had vanished all in a moment, and she was back again in the little dark shop.  \n\n‘I should like to buy an egg, please,’ she said timidly. ‘How do you sell them?’ ‘Fivepence farthing for one––twopence for two,’ the Sheep replied. ‘Then two are cheaper than one?’\\* Alice said in a surprised tone, taking out her purse. ‘Only you must eat them both, if you buy two,’ said the Sheep. ‘Then I’ll have one, please,’ said Alice, as she put the money down on the counter. For she thought to herself, ‘They mightn’t be at all nice, you know.’ The Sheep took the money, and put it away in a box: then she said ‘I never put things into people’s hands––that would never do––you must get it for yourself.’ And so saying, she went off to the other end of the shop,\\* and set the egg upright on a shelf.  \n\n‘I wonder why it wouldn’t do?’ thought Alice, as she groped her way among the tables and chairs, for the shop was very dark towards the end. ‘The egg seems to get further away the more I walk towards it. Let me see, is this a chair? Why, it’s got branches, I declare! How very odd to find trees growing here! And actually here’s a little brook!\\* Well, this is the very queerest shop I ever saw!’  \n\n![](images/image_13.jpg)  \n\nSo she went on, wondering more and more at every step, as everything turned into a tree the moment she came up to it, and she quite expected the egg to do the same.  \n\n# CHAPTER VI  \n\nhumpty dumpty\\*  \n\nHowever, the egg only got larger and larger, and more and more human: when she had come within a few yards of it, she saw that it had eyes and a nose and mouth; and, when she had come close to it, she saw clearly that it was HUMPTY DUMPTY himself. ‘It ca’n’t be anybody else!’ she said to herself. ‘I’m as certain of it, as if his name were written all over his face!’  \n\nIt might have been written a hundred times, easily, on that enormous face. Humpty Dumpty was sitting, with his legs crossed like a Turk, on the top of a high wall––such a narrow one that Alice quite wondered how he could keep his balance–– and, as his eyes were steadily fixed in the opposite direction, and he didn’t take the least notice of her, she thought he must be a stuffed figure, after all.  \n\n‘And how exactly like an egg he is!’ she said aloud, standing with her hands ready to catch him, for she was every moment expecting him to fall.  \n\n‘It’s very provoking,’ Humpty Dumpty said after a long silence, looking away from Alice as he spoke, ‘to be called an egg––very!’  \n\n‘I  said  you  looked  like  an  egg,  Sir,’  Alice  gently  explained. ‘And some eggs are very pretty, you know,’ she added, hoping to turn her remark into a sort of compliment.  \n\n‘Some people,’ said Humpty Dumpty, looking away from her as usual, ‘have no more sense than a baby!’  \n\nAlice didn’t know what to say to this: it wasn’t at all like conversation, she thought, as he never said anything to her; in fact, his last remark was evidently addressed to a tree––so she stood and softly repeated to herself:",
    "chunk_order_index": 7,
    "full_doc_id": "doc-0ea2c1c44f0856dc4b4c6159d8d0107f"
  },
  "chunk-de621d6da18e8cc5591d09e8fc127d25": {
    "tokens": 1200,
    "content": "are very pretty, you know,’ she added, hoping to turn her remark into a sort of compliment.  \n\n‘Some people,’ said Humpty Dumpty, looking away from her as usual, ‘have no more sense than a baby!’  \n\nAlice didn’t know what to say to this: it wasn’t at all like conversation, she thought, as he never said anything to her; in fact, his last remark was evidently addressed to a tree––so she stood and softly repeated to herself:––  \n\n‘Humpty Dumpty sat on a wall:   \nHumpty Dumpty had a great fall.   \nAll the King’s horses and all the King’s men   \nCouldn’t put Humpty Dumpty in his place again.’  \n\n‘That last line is much too long for the poetry,’ she added, almost out loud, forgetting that Humpty Dumpty would hear her.  \n\n‘Don’t stand chattering to yourself like that,’ Humpty Dumpty said, looking at her for the first time, ‘but tell me your name and your business.’  \n\n‘My name is Alice, but—  \n\n‘It’s a stupid name enough!’ Humpty Dumpty interrupted impatiently. ‘What does it mean?’  \n\n‘Must a name mean something?’ Alice asked doubtfully.  \n\n‘Of course it must,’ Humpty Dumpty said with a short laugh: ‘my name means the shape I am––and a good handsome shape it is, too. With a name like yours, you might be any shape, almost.’  \n\n‘Why do you sit out here all alone?’ said Alice, not wishing to begin an argument.  \n\n‘Why, because there’s nobody with me!’ cried Humpty Dumpty. ‘Did you think I didn’t know the answer to that? Ask another.’  \n\n‘Don’t you think you’d be safer down on the ground?’ Alice went on, not with any idea of making another riddle, but simply in her good-natured anxiety for the queer creature. ‘That wall is so very narrow!’  \n\n‘What  tremendously  easy  riddles  you  ask!’  Humpty Dumpty growled out. ‘Of course I don’t think so! Why, if ever I did fall off––which there’s no chance of––but if I did— ’ Here he pursed up his lips, and looked so solemn and grand that Alice could hardly help laughing. ‘If I did fall,’ he went on, ‘the King has promised me––ah, you may turn pale, if you like! You didn’t think I was going to say that, did you? The King has promised me––with his very own mouth–– to––to  \n\n‘To send all his horses and all his men,’ Alice interrupted, rather unwisely.  \n\n‘Now I declare that’s too bad!’ Humpty Dumpty cried, breaking into a sudden passion. ‘You’ve been listening at doors––and  behind  trees––and  down  chimneys––or  you couldn’t have known it!’  \n\n‘I haven’t, indeed!’ Alice said very gently. ‘It’s in a book.’ ‘Ah, well! They may write such things in a book,’ Humpty Dumpty said in a calmer tone. ‘That’s what you call a History of England, that is. Now, take a good look at me! I’m one that has spoken to a King, $I$ am: mayhap you’ll never see such then I don’t know what would happen to his head! I’m afraid it would come off!’  \n\n![](images/image_14.jpg)  \n\n‘Yes, all his horses and all his men,’ Humpty Dumpty went on. ‘They’d pick me up again in a minute, they would! However, this conversation is going on a little too fast: let’s go back to the last remark but one.’  \n\n‘I’m afraid I ca’n’t quite remember it,’ Alice said, very politely.  \n\n‘In that case we start afresh,’ said Humpty Dumpty, ‘and it’s my turn to choose a subject——’ (‘He talks about it justas if it was a game!’ thought Alice.) ‘So here’s a question for you. How old did you say you were?’  \n\nAlice made a short calculation, and said ‘Seven years and six months.’  \n\n‘Wrong!’ Humpty Dumpty exclaimed triumphantly. ‘You never said a word like it!’  \n\n‘I thought you meant “How old are you?”’ Alice explained.  \n\n‘If I’d meant that, I’d have said it,’ said Humpty Dumpty.  \n\nAlice didn’t want to begin another argument, so she said nothing.  \n\n‘Seven years and six months!’ Humpty Dumpty repeated thoughtfully. ‘An uncomfortable sort of age. Now if you’d asked my advice, I’d have said “Leave off at seven”— but it’s too late now.’  \n\n‘I  never  ask  advice  about  growing,’  Alice  said  indignantly.  \n\n‘Too proud?’ the other enquired.  \n\nAlice felt even more indignant at this suggestion. ‘I mean, she said, ‘that one ca’n’t help growing older.  \n\n‘One ca’n’t, perhaps,’ said Humpty Dumpty; ‘but two can. With proper assistance, you might have left off at seven.’  \n\n‘What a beautiful belt you’ve got on!’ Alice suddenly remarked. (They had had quite enough of the subject of age, she thought: and, if they really were to take turns in choosing subjects, it was her turn now.) ‘At least,’ she corrected herself on second thoughts, ‘a beautiful cravat, I should have said–– no, a belt, I mean––I beg your pardon!’ she added in dismay, for Humpty Dumpty looked thoroughly offended, and she began to wish",
    "chunk_order_index": 8,
    "full_doc_id": "doc-0ea2c1c44f0856dc4b4c6159d8d0107f"
  },
  "chunk-e45ce77df486f00608288cc7dc64d880": {
    "tokens": 1200,
    "content": "beautiful belt you’ve got on!’ Alice suddenly remarked. (They had had quite enough of the subject of age, she thought: and, if they really were to take turns in choosing subjects, it was her turn now.) ‘At least,’ she corrected herself on second thoughts, ‘a beautiful cravat, I should have said–– no, a belt, I mean––I beg your pardon!’ she added in dismay, for Humpty Dumpty looked thoroughly offended, and she began to wish she hadn’t chosen that subject. ‘If only I knew,’ she thought to herself, ‘which was neck and which was waist!’  \n\nEvidently Humpty Dumpty was very angry, though he said nothing for a minute or two. When he did speak again, it was  \n\nin a deep growl. ‘It is a––most––provoking––thing,’ he said at last, ‘when   \na person doesn’t know a cravat from a belt!’ ‘I know it’s very ignorant of me,’ Alice said, in so humble   \na tone that Humpty Dumpty relented. ‘It’s a cravat, child, and a beautiful one, as you say. It’s   \na present from the White King and Queen. There now!’ ‘Is it really?’ said Alice, quite pleased to find that she had   \nchosen a good subject, after all. ‘They gave it me,’ Humpty Dumpty continued thought  \nfully, as he crossed one knee over the other and clasped   \nhis hands round it, ‘they gave it me––for an un-birthday   \npresent.’\\* ‘I beg your pardon?’ Alice said with a puzzled air. ‘I’m not offended,’ said Humpty Dumpty. ‘I mean, what is an un-birthday present?’ ‘A present given when it isn’t your birthday, of course.’ Alice considered a little. ‘I like birthday presents best,’ she   \nsaid at last. ‘You don’t know what you’re talking about!’ cried Humpty   \nDumpty. ‘How many days are there in a year?’ ‘Three hundred and sixty-five,’ said Alice. ‘And how many birthdays have you?’ ‘One.’ ‘And if you take one from three hundred and sixty-five,   \nwhat remains?’ ‘Three hundred and sixty-four, of course.’ Humpty Dumpty looked doubtful. ‘I’d rather see that done   \non paper,’ he said.  \n\nAlice couldn’t help smiling as she took out her memorandumbook, and worked the sum for him:  \n\nHumpty Dumpty took the book, and looked at it carefully. ‘That seems to be done right— —’ he began.  \n\n‘You’re holding it upside down!’ Alice interrupted.  \n\n‘To be sure I was!’ Humpty Dumpty said gaily, as she turned it round for him. ‘I thought it looked a little queer. As I was saying, that seems to be done right––though I haven’t time to look it over thoroughly just now––and that shows that there are three hundred and sixty-four days when you might get un-birthday presents— ’  \n\n‘Certainly,’ said Alice.  \n\n‘And only one for birthday presents, you know. There’s glory for you!’  \n\n‘I don’t know what you mean by “glory,”’ Alice said.  \n\nHumpty Dumpty smiled contemptuously. ‘Of course you don’t––till I tell you. I meant “there’s a nice knock-down argument for you!”’  \n\n‘But “glory” doesn’t mean “a nice knock-down argument,” Alice objected.  \n\n‘When $I$ use a word,’\\* Humpty Dumpty said, in rather a scornful tone, ‘it means just what I choose it to mean–– neither more nor less.’  \n\n‘The question is,’ said Alice, ‘whether you can make words mean so many different things.  \n\n‘The question is,’ said Humpty Dumpty, ‘which is to be master— that’s all.’  \n\nAlice was too much puzzled to say anything; so after a minute Humpty Dumpty began again. ‘They’ve a temper, some of them––particularly verbs: they’re the proudest–– adjectives you can do anything with, but not verbs––however, $I$ can manage the whole lot of them! Impenetrability! That’s what $I$ say!’  \n\n‘Would you tell me, please,’ said Alice, ‘what that means?’ ‘Now  you  talk  like  a  reasonable  child,’  said  Humpty Dumpty, looking very much pleased. ‘I meant by “impenetrability” that we’ve had enough of that subject, and it would be just as well if you’d mention what you mean to do next, as I suppose you don’t mean to stop here all the rest of your life.’  \n\n‘That’s a great deal to make one word mean,’ Alice said in a thoughtful tone.  \n\n‘When I make a word do a lot of work like that,’ said Humpty Dumpty, ‘I always pay it extra.’  \n\n‘Oh!’ said Alice. She was too much puzzled to make any other remark.  \n\n‘Ah, you should see ’em come round me of a Saturday night,’ Humpty Dumpty went on, wagging his head gravely from side to side, ‘for to get their wages, you know.’  \n\n(Alice didn’t venture to ask what he paid them with; and so you see I ca’n’t tell you.)  \n\n‘You seem very clever at explaining words, Sir,’ said Alice. ‘Would you kindly tell me the meaning of the poem called “Jabberwocky”?’  \n\n‘Let’s hear it,’ said Humpty Dumpty. ‘I can explain all the poems that ever were invented––and a good many that haven’t",
    "chunk_order_index": 9,
    "full_doc_id": "doc-0ea2c1c44f0856dc4b4c6159d8d0107f"
  },
  "chunk-4147c294af03ca342f69aec02d7c8742": {
    "tokens": 1200,
    "content": "to get their wages, you know.’  \n\n(Alice didn’t venture to ask what he paid them with; and so you see I ca’n’t tell you.)  \n\n‘You seem very clever at explaining words, Sir,’ said Alice. ‘Would you kindly tell me the meaning of the poem called “Jabberwocky”?’  \n\n‘Let’s hear it,’ said Humpty Dumpty. ‘I can explain all the poems that ever were invented––and a good many that haven’t been invented just yet.’  \n\nThis sounded very hopeful, so Alice repeated the first verse:––  \n\n‘That’s enough to begin with,’ Humpty Dumpty interrupted: ‘there are plenty of hard words there. “Brillig” means four o’clock in the afternoon––the time when you begin broiling things for dinner.’  \n\n‘That’ll do very well,’ said Alice: ‘and “slithy”?’  \n\n‘Well, “slithy” means “lithe and slimy.” “Lithe” is the same as “active.” You see it’s like a portmanteau\\*––there are two meanings packed up into one word.’  \n\n‘I see it now,’ Alice remarked thoughtfully: ‘and what are “toves”?’  \n\n‘Well, “toves” are something like badgers––they’re something like lizards––and they’re something like corkscrews.’  \n\n‘They must be very curious-looking creatures.  \n\n![](images/image_15.jpg)  \n\n‘They are that,’ said Humpty Dumpty: ‘also they make their nests under sun-dials––also they live on cheese.’ ‘And what’s to “gyre” and to “gimble”?’ ‘To “gyre” is to go round and round like a gyroscope. To “gimble” is to make holes like a gimblet.’ ‘And “the wabe” is the grass-plot round a sun-dial, I suppose?’ said Alice, surprised at her own ingenuity. ‘Of course it is. It’s called “wabe,” you know, because it goes a long way before it, and a long way behind it——‘And a long way beyond it on each side,’ Alice added. ‘Exactly so. Well then, “mimsy” is “flimsy and miserable” (there’s another portmanteau for you). And a “borogove” is a thin shabby-looking bird with its feathers sticking out all round––something like a live mop.’ ‘And then “mome raths”?’ said Alice. ‘I’m afraid I’m giving you a great deal of trouble.’ ‘Well, a “rath” is a sort of green pig: but “mome” I’m not certain about. I think it’s short for “from home”––meaning that they’d lost their way, you know.’ ‘And what does “outgrabe” mean?’ ‘Well, “outgribing” is something between bellowing and whistling, with a kind of sneeze in the middle: however, you’ll hear it done, maybe––down in the wood yonder––and, when you’ve once heard it, you’ll be quite content. Who’s been repeating all that hard stuff to you?’ ‘I read it in a book,’ said Alice. ‘But I had some poetry repeated to me much easier than that, by––Tweedledee, I think it was.’ ‘As to poetry, you know,’ said Humpty Dumpty, stretching out one of his great hands, $^{\\epsilon}I$ can repeat poetry as well as other folk, if it comes to that——’ ‘Oh, it needn’t come to that!’ Alice hastily said, hoping to keep him from beginning. ‘The piece I’m going to repeat,’ he went on without noticing her remark, ‘was written entirely for your amusement.’ Alice felt that in that case she really ought to listen to it; so she sat down, and said ‘Thank you’ rather sadly.  \n\n‘In winter, when the fields are white,\\* I sing this song for your delight  \n\nonly I don’t sing it,’ he added, as an explanation. ‘I see you don’t,’ said Alice.  \n\n‘If you can see whether I’m singing or not, you’ve sharper eyes than most,’ Humpty Dumpty remarked severely. Alice was silent.  \n\n‘In spring, when woods are getting green, I’ll try and tell you what I mean:’  \n\n‘Thank you very much,’ said Alice.  \n\n‘In summer, when the days are long, Perhaps you’ll understand the song: In autumn, when the leaves are brown, Take pen and ink, and write it down.’ ‘I will, if I can remember it so long,’ said Alice.  \n\n‘You needn’t go on making remarks like that,’ Humpty Dumpty said: ‘they’re not sensible, and they put me out.’  \n\n‘I sent a message to the fish: I told them “This is what I wish.” The little fishes of the sea, They sent an answer back to me. The little fishes’ answer was “We cannot do it, Sir, because— 22  \n\n‘I’m afraid I don’t quite understand,’ said Alice.   \n‘It gets easier further on,’ Humpty Dumpty replied.  \n\n‘I sent to them again to say “It will be better to obey.” The fishes answered, with a grin, “Why, what a temper you are in!”  \n\nI told them once, I told them twice: They would not listen to advice.  \n\nI took a kettle large and new, Fit for the deed I had to do.  \n\nMy heart went hop, my heart went thump: I filled the kettle at the pump.  \n\nThen some one came to",
    "chunk_order_index": 10,
    "full_doc_id": "doc-0ea2c1c44f0856dc4b4c6159d8d0107f"
  },
  "chunk-92dcf7f8c01b64223fb81fdf9cd1f473": {
    "tokens": 1200,
    "content": "Dumpty replied.  \n\n‘I sent to them again to say “It will be better to obey.” The fishes answered, with a grin, “Why, what a temper you are in!”  \n\nI told them once, I told them twice: They would not listen to advice.  \n\nI took a kettle large and new, Fit for the deed I had to do.  \n\nMy heart went hop, my heart went thump: I filled the kettle at the pump.  \n\nThen some one came to me and said “The little fishes are in bed.”  \n\nI said to him, I said it plain, “Then you must wake them up again.”  \n\nI said it very loud and clear: I went and shouted in his ear.’  \n\n![](images/image_16.jpg)  \n\nHumpty Dumpty raised his voice almost to a scream as he repeated this verse, and Alice thought, with a shudder, ‘I wouldn’t have been the messenger for anything!’  \n\n‘But he was very stiff and proud:   \nHe said “You needn’t shout so loud!”   \nAnd he was very proud and stiff:   \nHe said “I’d go and wake them, if——” I took a corkscrew from the shelf:   \nI went to wake them up myself.   \nAnd when I found the door was locked,   \nI pulled and pushed and kicked and knocked. And when I found the door was shut,   \nI tried to turn the handle, but——  \n\nThere was a long pause.  \n\n‘Is that all?’ Alice timidly asked.  \n\n‘That’s all,’ said Humpty Dumpty. ‘Good-bye.’  \n\nThis was rather sudden, Alice thought: but, after such a very strong hint that she ought to be going, she felt that it would hardly be civil to stay. So she got up, and held out her hand. ‘Good-bye, till we meet again!’ she said as cheerfully as she could.  \n\n‘I shouldn’t know you again if we did meet,’ Humpty Dumpty replied in a discontented tone, giving her one of his fingers to shake:\\* ‘you’re so exactly like other people.’  \n\n‘The face is what one goes by, generally,’ Alice remarked in a thoughtful tone.  \n\n‘That’s just what I complain of,’ said Humpty Dumpty. ‘Your face is the same as everybody has––the two eyes, so—— (marking their places in the air with his thumb) ‘nose in the middle, mouth under. It’s always the same. Now if you had the two eyes on the same side of the nose, for instance––or the mouth at the top––that would be some help.’  \n\n‘It  wouldn’t  look  nice,’  Alice  objected.  But  Humpty Dumpty only shut his eyes, and said ‘Wait till you’ve tried.’ Alice waited a minute to see if he would speak again, but, as he never opened his eyes or took any further notice of her, she said ‘Good-bye!’ once more, and, getting no answer to this, she quietly walked away: but she couldn’t help saying to herself, as she went, ‘Of all the unsatisfactory— (she repeated this aloud, as it was a great comfort to have such a long word to say) ‘of all the unsatisfactory people I ever met— ’ She never finished the sentence, for at this moment a heavy crash shook the forest from end to end.  \n\n# CHAPTER VII  \n\n# the lion and the unicorn  \n\nThe next moment soldiers came running through the wood, at first in twos and threes, then ten or twenty together, and at last in such crowds that they seemed to fill the whole forest. Alice got behind a tree, for fear of being run over, and watched them go by.  \n\nShe thought that in all her life she had never seen soldiers so uncertain on their feet: they were always tripping over something or other, and whenever one went down, several more always fell over him, so that the ground was soon covered with little heaps of men.  \n\nThen came the horses. Having four feet, these managed rather better than the foot-soldiers; but even they stumbled now and then; and it seemed to be a regular rule that, whenever a horse stumbled, the rider fell off instantly. The confusion got worse every moment, and Alice was very glad to get out of the wood into an open place, where she found the White King seated on the ground, busily writing in his memorandum-book.  \n\n‘I’ve sent them all!’ the King cried in a tone of delight, on seeing Alice. ‘Did you happen to meet any soldiers, my dear, as you came through the wood?’  \n\n‘Yes,  I  did,’  said  Alice:  ‘several  thousand,  I  should think.’  \n\n‘Four thousand two hundred and seven, that’s the exact number,’ the King said, referring to his book. ‘I couldn’t send all the horses, you know, because two of them are wanted in the game. And I haven’t sent the two Messengers, either. They’re both gone to the town. Just look along the road, and tell me if you can see either of them.’  \n\n‘I see nobody on the road,’ said Alice.  \n\n![](images/image_17.jpg)  \n‘I only wish $I$ had such eyes,’ the King remarked in a fretful tone. ‘To be able to see Nobody! And at that distance too! Why, it’s as much as $I$ can do to see real people, by this light!’  \n\nAll this was lost on Alice, who was still looking intently along the road, shading her eyes with one hand. ‘I see somebody now!’ she exclaimed at last. ‘But he’s coming very slowly –",
    "chunk_order_index": 11,
    "full_doc_id": "doc-0ea2c1c44f0856dc4b4c6159d8d0107f"
  },
  "chunk-89e32c9b67baf561f124619c34d8f9ab": {
    "tokens": 1200,
    "content": ")  \n‘I only wish $I$ had such eyes,’ the King remarked in a fretful tone. ‘To be able to see Nobody! And at that distance too! Why, it’s as much as $I$ can do to see real people, by this light!’  \n\nAll this was lost on Alice, who was still looking intently along the road, shading her eyes with one hand. ‘I see somebody now!’ she exclaimed at last. ‘But he’s coming very slowly ––and what curious attitudes he goes into!’ (For the Messenger kept skipping up and down, and wriggling like an eel, as he came along, with his great hands spread out like fans on each side.)  \n\n‘Not at all,’ said the King. ‘He’s an Anglo-Saxon Messenger ––and those are Anglo-Saxon attitudes.\\* He only does them when he’s happy. His name is Haigha.’\\* (He pronounced it so as to rhyme with ‘mayor.’)  \n\n‘I love my love with an H,’\\* Alice couldn’t help beginning, ‘because he is Happy. I hate him with an H, because he is Hideous. I fed him with––with––with Ham-sandwiches and Hay. His name is Haigha, and he lives—  \n\n‘He lives on the Hill,’ the King remarked simply, without the least idea that he was joining in the game, while Alice was still hesitating for the name of a town beginning with H. ‘The other Messenger’s called Hatta. I must have two, you know–– to come and go. One to come, and one to go.’  \n\n‘I beg your pardon?’ said Alice.  \n\n‘It isn’t respectable to beg,’ said the King.  \n\n‘I only meant that I didn’t understand,’ said Alice. ‘Why one to come and one to go?’  \n\n‘Don’t I tell you?’ the King repeated impatiently. ‘I must have two––to fetch and carry. One to fetch, and one to carry.’  \n\nAt this moment the Messenger arrived: he was far too much out of breath to say a word, and could only wave his hands about, and make the most fearful faces at the poor King.  \n\n‘This young lady loves you with an H,’ the King said, introducing Alice in the hope of turning off the Messenger’s attention from himself––but it was of no use––the AngloSaxon attitudes only got more extraordinary every moment, while the great eyes rolled wildly from side to side.  \n\n‘You alarm me!’ said the King. ‘I feel faint— Give me a ham sandwich!’  \n\nOn which the Messenger, to Alice’s great amusement, opened a bag that hung round his neck, and handed a sandwich to the King, who devoured it greedily.  \n\n‘Another sandwich!’ said the King.  \n\n‘There’s nothing but hay left now,’ the Messenger said, peeping into the bag.  \n\n![](images/image_18.jpg)  \n\n‘Hay, then,’ the King murmured in a faint whisper.  \n\nAlice was glad to see that it revived him a good deal. ‘There’s nothing like eating hay when you’re faint,’ he remarked to her, as he munched away.  \n\n‘I should think throwing cold water over you would be better,’ Alice suggested: ‘––or some sal-volatile.’\\*  \n\n‘I didn’t say there was nothing better,’ the King replied. ‘I said there was nothing like it.’ Which Alice did not venture to deny.  \n\n‘Who did you pass on the road?’ the King went on, holding out his hand to the Messenger for some more hay.  \n\n‘Nobody,’ said the Messenger.  \n\n‘Quite right,’ said the King: ‘this young lady saw him too. So of course Nobody walks slower than you.’\\*  \n\n‘I do my best,’ the Messenger said in a sullen tone. ‘I’m sure nobody walks much faster than I do!’  \n\n‘He ca’n’t do that,’ said the King, ‘or else he’d have been here first. However, now you’ve got your breath, you may tell us what’s happened in the town.’  \n\n‘I’ll whisper it,’ said the Messenger, putting his hands to his mouth in the shape of a trumpet and stooping so as to get close to the King’s ear. Alice was sorry for this, as she wanted to hear the news too. However, instead of whispering, he simply  shouted,  at  the  top  of  his  voice,  ‘They’re  at  it again!’  \n\n‘Do you call that a whisper?’ cried the poor King, jumping up and shaking himself. ‘If you do such a thing again, I’ll have you buttered! It went through and through my head like an earthquake!’  \n\n‘It would have to be a very tiny earthquake!’ thought Alice. ‘Who are at it again?’ she ventured to ask. ‘Why, the Lion and the Unicorn, of course,’ said the King. ‘Fighting for the crown?’ ‘Yes, to be sure,’ said the King: ‘and the best of the joke is, that it’s my crown all the while! Let’s run and see them.’ And they trotted off, Alice repeating to herself, as she ran, the words of the old song:––  \n\n‘The Lion and the Unicorn were fighting for the crown.\\* The Lion beat the Unicorn all round the town. Some gave them white bread, some gave them brown: Some gave them plum-cake and drummed them out of town.’  \n\n‘Does— the one—— that wins— get the crown?’ she asked, as well as she could, for the run was putting her quite out of breath.  \n\n‘Dear me, no!’ said the King. ‘What an idea!’  \n\n‘Would",
    "chunk_order_index": 12,
    "full_doc_id": "doc-0ea2c1c44f0856dc4b4c6159d8d0107f"
  },
  "chunk-b1f8a7638b6026887d2a45a300e90a2b": {
    "tokens": 1200,
    "content": "The Lion and the Unicorn were fighting for the crown.\\* The Lion beat the Unicorn all round the town. Some gave them white bread, some gave them brown: Some gave them plum-cake and drummed them out of town.’  \n\n‘Does— the one—— that wins— get the crown?’ she asked, as well as she could, for the run was putting her quite out of breath.  \n\n‘Dear me, no!’ said the King. ‘What an idea!’  \n\n‘Would you––be good enough— ’ Alice panted out, after running a little further, ‘to stop a minute––just to get––one’s breath again?’  \n\n‘I’m good enough,’ the King said, ‘only I’m not strong enough. You see, a minute goes by so fearfully quick. You might as well try to stop a Bandersnatch!’  \n\nAlice had no more breath for talking; so they trotted on in silence, till they came into sight of a great crowd, in the middle of which the Lion and Unicorn were fighting. They were in such a cloud of dust, that at first Alice could not make out which was which; but she soon managed to distinguish the Unicorn by his horn.  \n\nThey placed themselves close to where Hatta, the other Messenger, was standing watching the fight, with a cup of tea in one hand and a piece of bread-and-butter in the other.  \n\n‘He’s only just out of prison, and he hadn’t finished his tea when he was sent in,’ Haigha whispered to Alice: ‘and they only give them oyster-shells\\* in there––so you see he’s very hungry and thirsty. How are you, dear child?’ he went on, putting his arm affectionately round Hatta’s neck.  \n\nHatta looked round and nodded, and went on with his bread-and-butter.  \n\n‘Were you happy in prison, dear child?’ said Haigha. Hatta looked round once more, and this time a tear or two trickled down his cheek; but not a word would he say. ‘Speak, ca’n’t you!’ Haigha cried impatiently. But Hatta only munched away, and drank some more tea.  \n\n![](images/image_19.jpg)  \n\n‘Speak, wo’n’t you!’ cried the King. ‘How are they getting on with the fight?’  \n\nHatta made a desperate effort, and swallowed a large piece of bread-and-butter. ‘They’re getting on very well,’ he said in a choking voice: ‘each of them has been down about eightyseven times.’\\*  \n\n‘Then I suppose they’ll soon bring the white bread and the brown?’ Alice ventured to remark.  \n\n‘It’s waiting for ’em now,’ said Hatta; ‘this is a bit of it as I’m eating.’  \n\nThere was a pause in the fight just then, and the Lion and the Unicorn sat down, panting, while the King called out ‘Ten minutes allowed for refreshments!’ Haigha and Hatta set to work at once, carrying round trays of white and brown bread. Alice took a piece to taste, but it was very dry.  \n\n‘I don’t think they’ll fight any more today,’ the King said to Hatta: ‘go and order the drums to begin.’ And Hatta went bounding away like a grasshopper.  \n\nFor a minute or two Alice stood silent, watching him. Suddenly she brightened up. ‘Look, look!’ she cried, pointing eagerly. ‘There’s the White Queen running across the country! She came flying out of the wood over yonder How fast those Queens can run!’\\*  \n\n‘There’s  some  enemy  after  her,  no  doubt,’  the  King said,  without  even  looking  round.  ‘That  wood’s  full  of them.’  \n\n‘But aren’t you going to run and help her?’ Alice asked, very much surprised at his taking it so quietly.  \n\n‘No use, no use!’ said the King. ‘She runs so fearfully quick. You might as well try to catch a Bandersnatch! But I’ll make a memorandum about her, if you like——She’s a dear good creature,’ he repeated softly to himself, as he opened his memorandum-book. ‘Do you spell “creature” with a double “e”?’  \n\nAt this moment the Unicorn sauntered by them, with his hands in his pockets. ‘I had the best of it this time?’ he said to the King, just glancing at him as he passed.  \n\n‘A  little––a  little,’  the  King  replied,  rather  nervously. ‘You shouldn’t have run him through with your horn, you know.’  \n\n‘It didn’t hurt him,’ the Unicorn said carelessly, and he was going on, when his eye happened to fall upon Alice: he turned round instantly, and stood for some time looking at her with an air of the deepest disgust.  \n\n‘What––is––this?’ he said at last.  \n\n‘This is a child!’ Haigha replied eagerly, coming in front of Alice to introduce her, and spreading out both his hands towards her in an Anglo-Saxon attitude. ‘We only found it to-day. It’s as large as life, and twice as natural!’\\*  \n\n‘I always thought they were fabulous monsters!’ said the Unicorn. ‘Is it alive?’  \n\n‘It can talk,’ said Haigha solemnly.  \n\nThe Unicorn looked dreamily at Alice, and said ‘Talk, child.’  \n\nAlice could not help her lips curling up into a smile as she began: ‘Do you know, I always thought Unicorns were fabulous monsters, too? I never saw one alive before!’  \n\n‘Well, now that we",
    "chunk_order_index": 13,
    "full_doc_id": "doc-0ea2c1c44f0856dc4b4c6159d8d0107f"
  },
  "chunk-a13ec2ac9ad9365599f95029e5b2582f": {
    "tokens": 1200,
    "content": "and twice as natural!’\\*  \n\n‘I always thought they were fabulous monsters!’ said the Unicorn. ‘Is it alive?’  \n\n‘It can talk,’ said Haigha solemnly.  \n\nThe Unicorn looked dreamily at Alice, and said ‘Talk, child.’  \n\nAlice could not help her lips curling up into a smile as she began: ‘Do you know, I always thought Unicorns were fabulous monsters, too? I never saw one alive before!’  \n\n‘Well, now that we have seen each other,’ said the Unicorn, ‘if you’ll believe in me, I’ll believe in you. Is that a bargain?’  \n\n‘Yes, if you like,’ said Alice.  \n\n‘Come, fetch out the plum-cake, old man!’ the Unicorn went on, turning from her to the King. ‘None of your brown bread for me!’  \n\n‘Certainly––certainly!’ the King muttered, and beckoned to Haigha. ‘Open the bag!’ he whispered. ‘Quick! Not that one––that’s full of hay!’  \n\nHaigha took a large cake out of the bag, and gave it to Alice to hold, while he got out a dish and carving-knife. How they all came out of it Alice couldn’t guess. It was just like a conjuring-trick, she thought.  \n\nThe Lion had joined them while this was going on: he looked very tired and sleepy, and his eyes were half shut. ‘What’s this!’ he said, blinking lazily at Alice, and speaking in a deep hollow tone that sounded like the tolling of a great bell.  \n\n![](images/image_20.jpg)  \n\n‘Ah, what is it, now?’ the Unicorn cried eagerly. ‘You’ll never guess! $I$ couldn’t.’  \n\nThe Lion looked at Alice wearily. ‘Are you animal––or vegetable––or mineral?’\\* he said, yawning at every other word.  \n\n‘It’s a fabulous monster!’ the Unicorn cried out, before Alice could reply.  \n\n‘Then hand round the plum-cake, Monster,’ the Lion said, lying down and putting his chin on his paws. ‘And sit down, both of you,’ (to the King and the Unicorn): ‘fair play with the cake, you know!’  \n\nThe King was evidently very uncomfortable at having to sit down between the two great creatures; but there was no other place for him.  \n\n‘What a fight we might have for the crown, now!’ the Unicorn said, looking slyly up at the crown, which the poor King was nearly shaking off his head, he trembled so much.  \n\n‘I should win easy,’ said the Lion.  \n\n‘I’m not so sure of that,’ said the Unicorn.  \n\n‘Why, I beat you all round the town, you chicken!’ the Lion replied angrily, half getting up as he spoke.  \n\nHere the King interrupted, to prevent the quarrel going on: he was very nervous, and his voice quite quivered. ‘All round the town?’ he said. ‘That’s a good long way. Did you go by the old bridge, or the market-place? You get the best view by the old bridge.’  \n\n‘I’m sure I don’t know,’ the Lion growled out as he lay down again. ‘There was too much dust to see anything. What a time the Monster is, cutting up that cake!’  \n\nAlice had seated herself on the bank of a little brook, with the great dish on her knees, and was sawing away diligently with the knife. ‘It’s very provoking!’ she said, in reply to the Lion  (she  was  getting  quite  used  to  being  called  ‘the Monster’). ‘I’ve cut several slices already, but they always join on again!’  \n\n‘You don’t know how to manage Looking-glass cakes,’ the Unicorn remarked. ‘Hand it round first, and cut it afterwards.’  \n\nThis sounded nonsense, but Alice very obediently got up, and carried the dish round, and the cake divided itself into three pieces as she did so. ‘Now cut it up,’ said the Lion, as she returned to her place with the empty dish.  \n\n‘I say, this isn’t fair!’ cried the Unicorn, as Alice sat with the knife in her hand, very much puzzled how to begin. ‘The Monster has given the Lion twice as much as me!’  \n\n‘She’s kept none for herself, anyhow,’ said the Lion. ‘Do you like plum-cake, Monster?’  \n\nBut before Alice could answer him, the drums began.  \n\nWhere the noise came from, she couldn’t make out: the air seemed full of it, and it rang through and through her head till she felt quite deafened. She started to her feet and sprang across the little brook\\* in her terror,  \n\n![](images/image_21.jpg)  \n\nand had just time to see the Lion and the Unicorn rise to their feet, with angry looks at being interrupted in their feast, before she dropped to her knees, and put her hands over her ears, vainly trying to shut out the dreadful uproar.  \n\n‘If that doesn’t “drum them out of town,”’ she thought to herself, ‘nothing ever will!’  \n\n![](images/image_22.jpg)  \n\n# CHAPTER VIII  \n\n‘it’s my own invention’  \n\nAfter a while the noise seemed gradually to die away, till all was dead silence, and Alice lifted up her head in some alarm. There was no one to be seen, and her first thought was that she must have been dreaming about the Lion and the Unicorn and those queer Anglo-Saxon Messengers. However, there was the great dish still lying at her feet, on which she had tried to cut the plum-cake, ‘So I wasn’t dreaming, after all",
    "chunk_order_index": 14,
    "full_doc_id": "doc-0ea2c1c44f0856dc4b4c6159d8d0107f"
  },
  "chunk-2adf172dea4c3ec6f34eca88a6b6b035": {
    "tokens": 1200,
    "content": "my own invention’  \n\nAfter a while the noise seemed gradually to die away, till all was dead silence, and Alice lifted up her head in some alarm. There was no one to be seen, and her first thought was that she must have been dreaming about the Lion and the Unicorn and those queer Anglo-Saxon Messengers. However, there was the great dish still lying at her feet, on which she had tried to cut the plum-cake, ‘So I wasn’t dreaming, after all,’ she said to herself, ‘unless––unless we’re all part of the same dream. Only I do hope it’s my dream, and not the Red King’s! I don’t like belonging to another person’s dream,’ she went on in a rather complaining tone: ‘I’ve a great mind to go and wake him, and see what happens!’  \n\nAt this moment her thoughts were interrupted by a loud shouting of ‘Ahoy! Ahoy! Check!’ and a Knight, dressed in crimson armour, came galloping down upon her,\\* brandishing a great club. Just as he reached her, the horse stopped suddenly: ‘You’re my prisoner!’ the Knight cried, as he tumbled off his horse.  \n\nStartled as she was, Alice was more frightened for him than for herself at the moment, and watched him with some anxiety as he mounted again. As soon as he was comfortably in the saddle, he began once more ‘You’re my— ’ but here another voice broke in ‘Ahoy! Ahoy! Check!’ and Alice looked round in some surprise for the new enemy.  \n\nThis time it was a White Knight.\\* He drew up at Alice’s side, and tumbled off his horse just as the Red Knight had done: then he got on again, and the two Knights sat and looked at each other for some time without speaking. Alice looked from one to the other in some bewilderment.  \n\n‘She’s my prisoner, you know!’ the Red Knight said at last.  \n\n‘Yes, but then $I$ came and rescued her!’ the White Knight replied.  \n\n‘Well, we must fight for her, then,’ said the Red Knight, as he took up his helmet (which hung from the saddle, and was something the shape of a horse’s head) and put it on.  \n\n‘You will observe the Rules of Battle, of course?’ the White Knight remarked, putting on his helmet too.  \n\n‘I always do,’ said the Red Knight, and they began banging away at each other with such fury that Alice got behind a tree to be out of the way of the blows.  \n\n‘I wonder, now, what the Rules of Battle are,’ she said to herself, as she watched the fight, timidly peeping out from her hiding-place. ‘One Rule seems to be, that if one Knight hits the other, he knocks him off his horse; and, if he misses, he tumbles off himself––and another Rule seems to be that they hold their clubs with their arms, as if they were Punch and Judy What a noise they make when they tumble! Just like a whole set of fire-irons falling into the fender! And how quiet the horses are! They let them get on and off them just as if they were tables!’  \n\n![](images/image_23.jpg)  \n\nAnother Rule of Battle, that Alice had not noticed, seemed to be that they always fell on their heads; and the battle ended with their both falling off in this way, side by side. When they got up again, they shook hands, and then the Red Knight mounted and galloped off.\\*  \n\n‘It was a glorious victory,\\* wasn’t it?’ said the White Knight, as he came up panting.  \n\n‘I don’t know,’ Alice said doubtfully. ‘I don’t want to be anybody’s prisoner. I want to be a Queen.’  \n\n‘So you will, when you’ve crossed the next brook,’ said the White Knight. ‘I’ll see you safe to the end of the wood––and then I must go back, you know. That’s the end of my move.’\\*  \n\n‘Thank you very much,’ said Alice. ‘May I help you off with your helmet?’ It was evidently more than he could manage by himself: however she managed to shake him out of it at last.  \n\n‘Now  one  can  breathe  more  easily,’  said  the  Knight, putting back his shaggy hair with both hands, and turning his gentle face and large mild eyes to Alice. She thought she had never seen such a strange-looking soldier in all her life.  \n\nHe was dressed in tin armour, which seemed to fit him very badly, and he had a queer-shaped little deal box fastened across his shoulders, upside-down, and with the lid hanging open. Alice looked at it with great curiosity.  \n\n‘I see you’re admiring my little box,’ the Knight said in a friendly tone. ‘It’s my own invention––to keep clothes and sandwiches in. You see I carry it upside-down, so that the rain ca’n’t get in.’  \n\n‘But the things can get out,’ Alice gently remarked. ‘Do you know the lid’s open?’  \n\n‘I didn’t know it,’ the Knight said, a shade of vexation passing over his face. ‘Then all the things must have fallen out! And the box is no use without them.’ He unfastened it as he spoke, and was just going to throw it into the bushes, when a sudden thought seemed to strike him, and he hung it carefully on a tree. ‘Can you guess why I did that?’ he said to Alice.  \n\nAlice shook her head.  \n\n‘In hopes some bees may make a nest in it––then I should get the honey.’  \n\n‘But you’ve got a bee-hive––or",
    "chunk_order_index": 15,
    "full_doc_id": "doc-0ea2c1c44f0856dc4b4c6159d8d0107f"
  },
  "chunk-724136f1a294c8fd1af5a2c5011d9f50": {
    "tokens": 1200,
    "content": "! And the box is no use without them.’ He unfastened it as he spoke, and was just going to throw it into the bushes, when a sudden thought seemed to strike him, and he hung it carefully on a tree. ‘Can you guess why I did that?’ he said to Alice.  \n\nAlice shook her head.  \n\n‘In hopes some bees may make a nest in it––then I should get the honey.’  \n\n‘But you’ve got a bee-hive––or something like one–– fastened to the saddle,’ said Alice.  \n\n‘Yes, it’s a very good bee-hive,’ the Knight said in a discontented tone, ‘one of the best kind. But not a single bee has come near it yet. And the other thing is a mouse-trap. I suppose the mice keep the bees out––or the bees keep the mice out, I don’t know which.’  \n\n‘I was wondering what the mouse-trap was for,’ said Alice. ‘It isn’t very likely there would be any mice on the horse’s back.’  \n\n‘Not very likely, perhaps,’ said the Knight; ‘but, if they do come, I don’t choose to have them running all about.  \n\n‘You see,’ he went on after a pause, ‘it’s as well to be provided for everything. That’s the reason the horse has all those anklets round his feet.’  \n\n‘But what are they for?’ Alice asked in a tone of great curiosity.  \n\n‘To guard against the bites of sharks,’ the Knight replied. ‘It’s an invention of my own. And now help me on. I’ll go with you to the end of the wood——What’s that dish for?’  \n\n‘It’s meant for plum-cake,’ said Alice.  \n\n‘We’d better take it with us,’ the Knight said. ‘It’ll come in handy if we find any plum-cake. Help me to get it into this bag.  \n\nThis took a long time to manage, though Alice held the bag open very carefully, because the Knight was so very awkward in putting in the dish: the first two or three times that he tried he fell in himself instead. ‘It’s rather a tight fit, you see,’ he said, as they got it in at last; ‘there are so many candlesticks in the bag.’ And he hung it to the saddle, which was already loaded with bunches of carrots, and fire-irons, and many other things.  \n\n‘I hope you’ve got your hair well fastened on?’ he continued, as they set off.  \n\n‘Only in the usual way,’ Alice said, smiling.  \n\n‘That’s hardly enough,’ he said, anxiously. ‘You see the wind is so very strong here. It’s as strong as soup.  \n\n‘Have you invented a plan for keeping the hair from being blown off?’ Alice enquired.  \n\n‘Not yet,’ said the Knight. ‘But I’ve got a plan for keeping it from falling off.’  \n\n‘I should like to hear it, very much.’  \n\n‘First you take an upright stick,’ said the Knight. ‘Then you make your hair creep up it, like a fruit-tree. Now the reason hair falls off is because it hangs down––things never fall upwards, you know. It’s a plan of my own invention. You may try it if you like.’ It didn’t sound a comfortable plan, Alice thought, and for a few minutes she walked on in silence, puzzling over the idea, and every now and then stopping to help the poor Knight, who certainly was not a good rider.  \n\nWhenever the horse stopped (which it did very often), he  fell off in front; and, whenever it went on again (which it generally did rather suddenly), he fell off behind. Otherwise he kept on pretty well, except that he had a habit of now and then falling off sideways; and, as he generally did this on the side on which Alice was walking, she soon found that it was the best plan not to walk quite close to the horse.  \n\n![](images/image_24.jpg)  \n\n‘I’m afraid you’ve not had much practice in riding,’ she ventured to say, as she was helping him up from his fifth tumble.  \n\nThe Knight looked very much surprised, and a little offended at the remark. ‘What makes you say that?’ he asked, as he scrambled back into the saddle, keeping hold of Alice’s hair with one hand, to save himself from falling over on the other side.  \n\n‘Because people don’t fall off quite so often, when they’ve had much practice.’  \n\n‘I’ve had plenty of practice,’ the Knight said very gravely: ‘plenty of practice!’  \n\nAlice could think of nothing better to say than ‘Indeed?’ but she said it as heartily as she could. They went on a little way in silence after this, the Knight with his eyes shut, muttering to himself, and Alice watching anxiously for the next tumble.  \n\n‘The great art of riding,’ the Knight suddenly began in a loud voice, waving his right arm as he spoke, ‘is to keep— Here the sentence ended as suddenly as it had begun, as the Knight fell heavily on the top of his head exactly in the path where Alice was walking. She was quite frightened this time, and said in an anxious tone, as she picked him up, ‘I hope no bones are broken?’  \n\n‘None to speak of,’ the Knight said, as if he didn’t mind breaking two or three of them. ‘The great art of riding, as I was saying, is––to keep your balance properly. Like this, you know——  \n\nHe let go the bridle, and stretched out both his arms to show Alice what he meant, and this time he fell flat on his back, right under the horse",
    "chunk_order_index": 16,
    "full_doc_id": "doc-0ea2c1c44f0856dc4b4c6159d8d0107f"
  },
  "chunk-01e44b3e69b04f6d4f4c4d87b5ecd71a": {
    "tokens": 1200,
    "content": ", as she picked him up, ‘I hope no bones are broken?’  \n\n‘None to speak of,’ the Knight said, as if he didn’t mind breaking two or three of them. ‘The great art of riding, as I was saying, is––to keep your balance properly. Like this, you know——  \n\nHe let go the bridle, and stretched out both his arms to show Alice what he meant, and this time he fell flat on his back, right under the horse’s feet.  \n\n‘Plenty of practice!’ he went on repeating, all the time that Alice was getting him on his feet again. ‘Plenty of practice!’  \n\n‘It’s too ridiculous!’ cried Alice, losing all her patience this time. ‘You ought to have a wooden horse on wheels, that you ought!’  \n\n‘Does that kind go smoothly?’ the Knight asked in a tone of great interest, clasping his arms round the horse’s neck as he spoke, just in time to save himself from tumbling off again.  \n\n‘Much more smoothly than a live horse,’ Alice said, with a little scream of laughter, in spite of all she could do to prevent it.  \n\n‘I’ll get one,’ the Knight said thoughtfully to himself. ‘One or two––several.’  \n\nThere was a short silence after this, and then the Knight went on again. ‘I’m a great hand at inventing things. Now, I daresay you noticed, the last time you picked me up, that I was looking rather thoughtful?’  \n\n‘You were a little grave,’ said Alice.  \n\n‘Well, just then I was inventing a new way of getting over a gate––would you like to hear it?’  \n\n‘Very much indeed,’ Alice said politely.  \n\n‘I’ll tell you how I came to think of it,’ said the Knight. ‘You see, I said to myself “The only difficulty is with the feet: the head is high enough already.” Now, first I put my head on the top of the gate––then the head’s high enough––then I stand on my head––then the feet are high enough, you see–– then I’m over, you see.’  \n\n‘Yes, I suppose you’d be over when that was done,’ Alice said thoughtfully: ‘but don’t you think it would be rather hard?’  \n\n‘I haven’t tried it yet,’ the Knight said, gravely; ‘so I ca’n’t tell for certain––but I’m afraid it would be a little hard.’  \n\nHe looked so vexed at the idea, that Alice changed the subject hastily. ‘What a curious helmet you’ve got!’ she said cheerfully. ‘Is that your invention too?’  \n\nThe Knight looked down proudly at his helmet, which hung from the saddle. ‘Yes,’ he said; ‘but I’ve invented a better one than that––like a sugar-loaf.\\* When I used to wear it, if I fell off the horse, it always touched the ground directly. So I had a very little way to fall, you see––But there was the danger of falling into it, to be sure. That happened to me once ––and the worst of it was, before I could get out again, the other White Knight came and put it on. He thought it was his own helmet.’  \n\nThe Knight looked so solemn about it that Alice did not dare to laugh. ‘I’m afraid you must have hurt him,’ she said in a trembling voice, ‘being on the top of his head.’  \n\n‘I had to kick him, of course,’ the Knight said, very seriously. ‘And then he took the helmet off again––but it took hours and hours to get me out. I was as fast as––as lightning, you know.’  \n\n‘But that’s a different kind of fastness,’ Alice objected.  \n\nThe Knight shook his head. ‘It was all kinds of fastness with me, I can assure you!’ he said. He raised his hands in some excitement as he said this, and instantly rolled out of the saddle, and fell headlong into a deep ditch.  \n\nAlice ran to the side of the ditch to look for him. She was rather startled by the fall, as for some time he had kept on very well, and she was afraid that he really was hurt this time. However, though she could see nothing but the soles of his feet, she was much relieved to hear that he was talking on in his usual tone. ‘All kinds of fastness,’ he repeated: ‘but it was careless of him to put another man’s helmet on––with the man in it, too.’  \n\n‘How can you go on talking so quietly, head downwards?’ Alice asked, as she dragged him out by the feet, and laid him in a heap on the bank.  \n\nThe Knight looked surprised at the question. ‘What does it matter where my body happens to be?’ he said. ‘My mind goes on working all the same. In fact, the more head-downwards I am, the more I keep inventing new things.’  \n\n‘Now the cleverest thing of the sort that I ever did,’ he went on after a pause, ‘was inventing a new pudding during the meat-course.’  \n\n![](images/image_25.jpg)  \n\n‘In time to have it cooked for the next course?’ said Alice. ‘Well, that was quick work, certainly!’  \n\n‘Well, not the next course,’ the Knight said in a slow thoughtful tone: ‘no, certainly not the next course.’  \n\n‘Then it would have to be the next day. I suppose you wouldn’t have two pudding-courses in one dinner?’  \n\n‘Well, not the next day,’ the Knight repeated as before: ‘not the next day. In fact,’ he went on, holding his head down, and his voice",
    "chunk_order_index": 17,
    "full_doc_id": "doc-0ea2c1c44f0856dc4b4c6159d8d0107f"
  },
  "chunk-8c16c629437bd13d18b29c28c1dae37b": {
    "tokens": 1200,
    "content": ". ‘Well, that was quick work, certainly!’  \n\n‘Well, not the next course,’ the Knight said in a slow thoughtful tone: ‘no, certainly not the next course.’  \n\n‘Then it would have to be the next day. I suppose you wouldn’t have two pudding-courses in one dinner?’  \n\n‘Well, not the next day,’ the Knight repeated as before: ‘not the next day. In fact,’ he went on, holding his head down, and his voice getting lower and lower, ‘I don’t believe that pudding ever was cooked! In fact, I don’t believe that pudding ever will be cooked! And yet it was a very clever pudding to invent.’  \n\n‘What did you mean it to be made of?’ Alice asked, hoping to cheer him up, for the poor Knight seemed quite lowspirited about it.  \n\n‘It began with blotting-paper,’ the Knight answered with a groan.  \n\n‘That wouldn’t be very nice, I’m afraid  \n\n‘Not very nice alone,’ he interrupted, quite eagerly: ‘but you’ve no idea what a difference it makes, mixing it with other things––such as gunpowder and sealing-wax. And here I must  \n\nleave you.’ They had just come to the end of the wood. Alice could only look puzzled: she was thinking of the   \npudding. ‘You are sad,’ the Knight said in an anxious tone: ‘let me   \nsing you a song to comfort you.’ ‘Is it very long?’ Alice asked, for she had heard a good deal   \nof poetry that day. ‘It’s long,’ said the Knight, ‘but it’s very, very beautiful.   \nEverybody that hears me sing it––either it brings the tears   \ninto their eyes, or else——’ ‘Or else what?’ said Alice, for the Knight had made a   \nsudden pause. ‘Or else it doesn’t, you know. The name of the song is   \ncalled\\* “Haddocks’ Eyes.”’ ‘Oh, that’s the name of the song, is it?’ Alice said, trying to   \nfeel interested. ‘No, you don’t understand,’ the Knight said, looking a little   \nvexed. ‘That’s what the name is called. The name really is   \n“The Aged Aged Man.”’ ‘Then I ought to have said “That’s what the song is called”?’   \nAlice corrected herself. ‘No, you oughtn’t: that’s quite another thing! The song   \nis called “Ways And Means”: but that’s only what it’s called,   \nyou know!’ ‘Well, what is the song, then?’ said Alice, who was by this   \ntime completely bewildered. ‘I was coming to that,’ the Knight said. ‘The song really   \nis “ $\\spadesuit$ -sitting On $A$ Gate”: and the tune’s my own inven  \ntion.’ So saying, he stopped his horse and let the reins fall on its   \nneck: then, slowly beating time with one hand, and with   \na faint smile lighting up his gentle foolish face, as if he   \nenjoyed the music of his song, he began. Of all the strange things that Alice saw in her journey  \n\nThrough The Looking-Glass, this was the one that she always remembered most clearly. Years afterwards she could bring the whole scene back again, as if it had been only yesterday––the mild blue eyes\\* and kindly smile of the Knight ––the setting sun gleaming through his hair, and shining on his armour in a blaze of light that quite dazzled her––the horse quietly moving about, with the reins hanging loose on his neck, cropping the grass at her feet––and the black shadows of the forest behind––all this she took in like a picture, as, with one hand shading her eyes, she leant against a tree, watching the strange pair, and listening, in a halfdream, to the melancholy music of the song.  \n\n‘But the tune isn $\\ '_{t}$ his own invention,’ she said to herself: ‘it’s $^{\\epsilon}I$ give thee all, $I$ can no more.”’\\* She stood and listened very attentively, but no tears came into her eyes.  \n\n‘I’ll tell thee everything I can:\\* There’s little to relate.   \nI saw an aged aged man, $\\mathcal{A}$ -sitting on a gate.   \n“Who are you, aged man?” I said. “And how is it you live?”   \nAnd his answer trickled through my head, Like water through a sieve.  \n\nHe said “I look for butterflies That sleep among the wheat: I make them into mutton-pies, And sell them in the street. I sell them unto men,” he said, “Who sail on stormy seas; And that’s the way I get my bread–– $\\mathcal{A}$ trifle, if you please.”  \n\nBut I was thinking of a plan To dye one’s whiskers green, And always use so large a fan That they could not be seen.  \n\nSo, having no reply to give To what the old man said, I cried “Come, tell me how you live!” And thumped him on the head.  \n\nHis accents mild took up the tale: He said “I go my ways, And when I find a mountain-rill, I set it in a blaze; And thence they make a stuff they call Rowland’s Macassar-Oil\\*–– Yet twopence-halfpenny is all They give me for my toil.”  \n\nBut I was thinking of a way To feed oneself on batter, And so go on from day to day Getting a little fatter. I shook him well from side to side, Until his face was blue: “",
    "chunk_order_index": 18,
    "full_doc_id": "doc-0ea2c1c44f0856dc4b4c6159d8d0107f"
  },
  "chunk-15cd8f78b8f408e6f0bb575dd105ac50": {
    "tokens": 1200,
    "content": "I go my ways, And when I find a mountain-rill, I set it in a blaze; And thence they make a stuff they call Rowland’s Macassar-Oil\\*–– Yet twopence-halfpenny is all They give me for my toil.”  \n\nBut I was thinking of a way To feed oneself on batter, And so go on from day to day Getting a little fatter. I shook him well from side to side, Until his face was blue: “Come, tell me how you live,” I cried, “And what it is you do!”  \n\n![](images/image_26.jpg)  \n\nHe said “I hunt for haddocks’ eyes Among the heather bright, And work them into waistcoat-buttons In the silent night. And these I do not sell for gold Or coin of silvery shine, But for a copper halfpenny, And that will purchase nine.  \n\n“I sometimes dig for buttered rolls, Or set limed twigs\\* for crabs: I sometimes search the grassy knolls For wheels of Hansom-cabs.\\* And that’s the way” (he gave a wink) “By which I get my wealth–– And very gladly will I drink Your Honour’s noble health.”  \n\nI heard him then, for I had just Completed my design To keep the Menai bridge\\* from rust By boiling it in wine. I thanked him much for telling me The way he got his wealth, But chiefly for his wish that he Might drink my noble health.  \n\nAnd now, if e’er by chance I put My fingers into glue,   \nOr madly squeeze a right-hand foot Into a left-hand shoe,   \nOr if I drop upon my toe A very heavy weight,   \nI weep, for it reminds me so   \nOf that old man I used to know––   \nWhose look was mild, whose speech was slow,   \nWhose hair was whiter than the snow,  \n\nWhose face was very like a crow, With eyes, like cinders, all aglow, Who seemed distracted with his woe, Who rocked his body to and fro, And muttered mumblingly and low, As if his mouth were full of dough, Who snorted like a buffalo That summer evening long ago, $A$ -sitting on a gate.’  \n\nAs the Knight sang the last words of the ballad, he gathered up the reins, and turned his horse’s head along the road by which they had come. ‘You’ve only a few yards to go,’ he said, ‘down the hill and over that little brook, and then you’ll be a Queen\\*——But you’ll stay and see me offfirst?’ he added as Alice turned with an eager look in the direction to which he pointed. ‘I sha’n’t be long. You’ll wait and wave your handkerchief when I get to that turn in the road! I think it’ll encourage me, you see.’  \n\n‘Of course I’ll wait,’ said Alice: ‘and thank you very much for coming so far––and for the song––I liked it very much.’  \n\n‘I hope so,’ the Knight said doubtfully: ‘but you didn’t cry so much as I thought you would.  \n\nSo they shook hands, and then the Knight rode slowly away into the forest. ‘It wo’n’t take long to see him off, I expect,’ Alice said to herself, as she stood watching him. ‘There he goes! Right on his head as usual! However, he gets on again pretty easily––that comes of having so many things hung round the horse——’ So she went on talking to herself, as she watched the horse walking leisurely along the road, and the Knight tumbling off, first on one side and then on the other. After the fourth or fifth tumble he reached the turn,\\* and then she waved her handkerchief to him, and waited till he was out of sight.  \n\n‘I hope it encouraged him,’ she said, as she turned to run down the hill: ‘and now for the last brook, and to be a Queen! How grand it sounds!’ A very few steps brought her to the edge of the brook.\\* ‘The Eighth Square at last!’ she cried as she bounded across,\\*  \n\n![](images/image_27.jpg)  \n\nand threw herself down to rest on a lawn as soft as moss, with little flower-beds dotted about it here and there. ‘Oh, how glad I am to get here! And what is this on my head?’ she exclaimed in a tone of dismay, as she put her hands up to something very heavy, that fitted tight all round her head.  \n\n‘But how can it have got there without my knowing it?’ she said to herself, as she lifted it off, and set it on her lap to make out what it could possibly be.  \n\nIt was a golden crown.  \n\n![](images/image_28.jpg)  \n\n# CHAPTER IX  \n\nqueen alice  \n\n‘Well, this is grand!’ said Alice. ‘I never expected I should be a Queen so soon––and I’ll tell you what it is, your Majesty,’ she went on, in a severe tone (she was always rather fond of scolding herself), ‘it’ll never do for you to be lolling about on the grass like that! Queens have to be dignified, you know!’  \n\nSo she got up and walked about––rather stiffly just at first, as she was afraid that the crown might come off: but she comforted herself with the thought that there was nobody to see her, ‘and if I really am a Queen,’ she said as she sat down again, ‘I shall be able to manage it quite well in time.’  \n\nEverything was happening so oddly that she didn’t feel a bit surprised at finding the Red Queen",
    "chunk_order_index": 19,
    "full_doc_id": "doc-0ea2c1c44f0856dc4b4c6159d8d0107f"
  },
  "chunk-8bc797ee5f0bdbf691817640d60d286f": {
    "tokens": 1200,
    "content": "to be dignified, you know!’  \n\nSo she got up and walked about––rather stiffly just at first, as she was afraid that the crown might come off: but she comforted herself with the thought that there was nobody to see her, ‘and if I really am a Queen,’ she said as she sat down again, ‘I shall be able to manage it quite well in time.’  \n\nEverything was happening so oddly that she didn’t feel a bit surprised at finding the Red Queen and the White Queen sitting close to her, one on each side:\\* she would have liked very much to ask them how they came there, but she feared it would not be quite civil. However, there would be no harm, she thought, in asking if the game was over. ‘Please, would you tell me——’ she began, looking timidly at the Red Queen.  \n\n‘Speak when you’re spoken to!’ the Queen sharply interrupted her.  \n\n‘But if everybody obeyed that rule,’ said Alice, who was always ready for a little argument, ‘and if you only spoke when you were spoken to, and the other person always waited for you to begin, you see nobody would ever say anything, so that—  \n\n‘Ridiculous!’  cried  the  Queen.  ‘Why,  don’t  you  see, child— ’ here she broke off with a frown, and, after thinking for a minute, suddenly changed the subject of the conversation. ‘What do you mean by “If you really are a Queen”? What right have you to call yourself so? You ca’n’t be a Queen, you know, till you’ve passed the proper examination. And the sooner we begin it, the better.’  \n\n‘I only said “if”!’ poor Alice pleaded in a piteous tone.  \n\nThe two Queens looked at each other, and the Red Queen remarked, with a little shudder, ‘She says she only said “if”  \n\n‘But she said a great deal more than that!’ the White Queen moaned, wringing her hands. ‘Oh, ever so much more than that!’ ‘So you did, you know,’ the Red Queen said to Alice. ‘Always speak the truth––think before you speak––and write it down afterwards.’  \n\n‘I’m sure I didn’t mean—— ’ Alice was beginning, but the Red Queen interrupted her impatiently.  \n\n‘That’s just what I complain of! You should have meant! What do you suppose is the use of a child without any meaning? Even a joke should have some meaning––and a child’s more important than a joke, I hope. You couldn’t deny that, even if you tried with both hands.’  \n\n‘I don’t deny things with my hands,’ Alice objected.  \n\n‘Nobody said you did,’ said the Red Queen. ‘I said you couldn’t if you tried.’  \n\n‘She’s in that state of mind,’ said the White Queen, ‘that she wants to deny something––only she doesn’t know what to deny!’ ‘A nasty, vicious temper,’ the Red Queen remarked; and then there was an uncomfortable silence for a minute or two. The  Red  Queen  broke  the  silence  by  saying,  to  the White Queen, ‘I invite you to Alice’s dinner-party this afternoon.’  \n\nThe White Queen smiled feebly, and said ‘And I invite you.’  \n\n‘I didn’t know I was to have a party at all,’ said Alice; ‘but, if there is to be one, I think $I$ ought to invite the guests.’  \n\n‘We gave you the opportunity of doing it,’ the Red Queen remarked: ‘but I daresay you’ve not had many lessons in manners yet?’  \n\n‘Manners are not taught in lessons,’ said Alice. ‘Lessons teach you to do sums, and things of that sort.’  \n\n‘Can you do Addition?’ the White Queen asked. ‘What’s one and one and one and one and one and one and one and one and one and one?’  \n\n‘I don’t know,’ said Alice. ‘I lost count.’ ‘She ca’n’t do Addition,’ the Red Queen interrupted. ‘Can you do Subtraction? Take nine from eight.’  \n\n‘Nine from eight I ca’n’t, you know,’ Alice replied very readily: ‘but—  \n\n![](images/image_29.jpg)  \n\n‘She ca’n’t do Substraction,’ said the White Queen. ‘Can you do Division? Divide a loaf by a knife––what’s the answer to that?’  \n\n‘I suppose——’ Alice was beginning, but the Red Queen answered for her. ‘Bread-and-butter, of course. Try another Subtraction sum. Take a bone from a dog: what remains?’  \n\nAlice considered. ‘The bone wouldn’t remain, of course, if I took it––and the dog wouldn’t remain: it would come to bite me––and I’m sure $I$ shouldn’t remain!’  \n\n‘Then you think nothing would remain?’ said the Red Queen.  \n\n‘I think that’s the answer.’  \n\n‘Wrong, as usual,’ said the Red Queen: ‘the dog’s temper would remain.’  \n\n‘But I don’t see how  \n\n‘Why, look here!’ the Red Queen cried. ‘The dog would lose its temper, wouldn’t it?’  \n\n‘Perhaps it would,’ Alice replied cautiously.  \n\n‘Then if the dog went away, its temper would remain!’ the Queen exclaimed triumphantly.  \n\nAlice said, as gravely as she could, ‘They might go different ways.’ But she couldn’t help thinking to herself ‘What dreadful nonsense we are talking!’  \n\n‘She ca’n’t do sums a bit!’ the Queens said together, with great emphasis.  \n\n‘Can you do sums?’ Alice said, turning suddenly on the White Queen, for she didn’t like being",
    "chunk_order_index": 20,
    "full_doc_id": "doc-0ea2c1c44f0856dc4b4c6159d8d0107f"
  },
  "chunk-814ad311ca6901e97305b88e1186db84": {
    "tokens": 1200,
    "content": "replied cautiously.  \n\n‘Then if the dog went away, its temper would remain!’ the Queen exclaimed triumphantly.  \n\nAlice said, as gravely as she could, ‘They might go different ways.’ But she couldn’t help thinking to herself ‘What dreadful nonsense we are talking!’  \n\n‘She ca’n’t do sums a bit!’ the Queens said together, with great emphasis.  \n\n‘Can you do sums?’ Alice said, turning suddenly on the White Queen, for she didn’t like being found fault with so much.  \n\nThe Queen gasped and shut her eyes. ‘I can do Addition,’ she said, ‘if you give me time––but I ca’n’t do Substraction under any circumstances!’  \n\n‘Of course you know your ABC?’ said the Red Queen.  \n\n‘To be sure I do,’ said Alice.  \n\n‘So do I,’ the White Queen whispered: ‘we’ll often say it over together, dear. And I’ll tell you a secret––I can read words of one letter! Isn’t that grand? However, don’t be discouraged. You’ll come to it in time.’  \n\nHere the Red Queen began again. ‘Can you answer useful questions?’\\* she said. ‘How is bread made?’  \n\n‘I  know  that!’  Alice  cried  eagerly.  ‘You  take  some flour—  \n\n‘Where do you pick the flower?’ the White Queen asked. ‘In a garden or in the hedges?’  \n\n‘Well, it isn’t picked at all,’ Alice explained: ‘it’s ground—  \n\n‘How many acres of ground?’ said the White Queen. ‘You mustn’t leave out so many things.  \n\n‘Fan her head!’ the Red Queen anxiously interrupted. ‘She’ll be feverish after so much thinking.’ So they set to work and fanned her with bunches of leaves, till she had to beg them to leave off, it blew her hair about so.  \n\n‘She’s all right again now,’ said the Red Queen. ‘Do you know Languages? What’s the French for fiddle-de-dee?’\\*  \n\n‘Fiddle-de-dee’s not English,’ Alice replied gravely.  \n\n‘Who ever said it was?’ said the Red Queen.  \n\nAlice thought she saw a way out of the difficulty, this time. ‘If you’ll tell me what language “fiddle-de-dee” is, I’ll tell you the French for it!’ she exclaimed triumphantly.  \n\nBut the Red Queen drew herself up rather stiffly, and said ‘Queens never make bargains.’  \n\n‘I wish Queens never asked questions,’ Alice thought to herself.  \n\n‘Don’t let us quarrel,’ the White Queen said in an anxious tone. ‘What is the cause of lightning?  \n\n‘The cause of lightning,’ Alice said very decidedly, for she felt quite certain about this, ‘is the thunder––no, no!’ she hastily corrected herself. ‘I meant the other way.’  \n\n‘It’s too late to correct it,’ said the Red Queen: ‘when you’ve once said a thing, that fixes it, and you must take the consequences.’  \n\n‘Which reminds me——’ the White Queen said, looking down and nervously clasping and unclasping her hands, ‘we had such a thunderstorm last Tuesday––I mean one of the last set of Tuesdays, you know.’  \n\nAlice was puzzled. ‘In our country,’ she remarked, ‘there’s only one day at a time.’  \n\nThe Red Queen said ‘That’s a poor thin way of doing things. Now here, we mostly have days and nights two or three at a time, and sometimes in the winter we take as many as five nights together––for warmth, you know.’  \n\n‘Are five nights warmer than one night, then?’ Alice ventured to ask.  \n\n‘Five times as warm, of course.’  \n\n‘But  they  should  be  five  times  as  cold,  by  the  same rule—  \n\n‘Just so!’ cried the Red Queen. ‘Five times as warm, and five times as cold––just as I’m five times as rich as you are, and five times as clever!’  \n\nAlice sighed and gave it up. ‘It’s exactly like a riddle with no answer!’ she thought.  \n\n‘Humpty Dumpty saw it too,’ the White Queen went on in a low voice, more as if she were talking to herself. ‘He came to the door with a corkscrew in his hand——  \n\n‘What did he want?’ said the Red Queen.  \n\n‘He said he would come in,’ the White Queen went on, ‘because he was looking for a hippopotamus. Now, as it happened, there wasn’t such a thing in the house, that morning.  \n\n‘Is there generally?’ Alice asked in an astonished tone.  \n\n‘Well, only on Thursdays,’ said the Queen.  \n\n‘I know what he came for,’ said Alice: ‘he wanted to punish the fish, because—  \n\nHere the White Queen began again. ‘It was such a thunderstorm, you ca’n’t think!’ (‘She never could, you know,’ said the Red Queen.) ‘And part of the roof came off, and ever so much thunder got in––and it went rolling round the room in great lumps––and knocking over the tables and things ––till I was so frightened, I couldn’t remember my own name!’  \n\nAlice thought to herself ‘I never should try to remember my name in the middle of an accident! Where would be the use of it?’ but she did not say this aloud, for fear of hurting the poor Queen’s feelings.  \n\n‘Your Majesty must excuse her,’ the Red Queen said to Alice, taking one of the White Queen’s hands in her own, and gently stroking it: ‘she means",
    "chunk_order_index": 21,
    "full_doc_id": "doc-0ea2c1c44f0856dc4b4c6159d8d0107f"
  },
  "chunk-76bd30aee63784d5d37c063e6ef9bc4b": {
    "tokens": 200,
    "content": "––till I was so frightened, I couldn’t remember my own name!’  \n\nAlice thought to herself ‘I never should try to remember my name in the middle of an accident! Where would be the use of it?’ but she did not say this aloud, for fear of hurting the poor Queen’s feelings.  \n\n‘Your Majesty must excuse her,’ the Red Queen said to Alice, taking one of the White Queen’s hands in her own, and gently stroking it: ‘she means well, but she ca’n’t help saying foolish things, as a general rule.’  \n\nThe White Queen looked timidly at Alice, who felt she ought to say something kind, but really couldn’t think of anything at the moment.  \n\n‘She never was really well brought up,’ the Red Queen went on: ‘but it’s amazing how good-tempered she is! Pat her on the head, and see how pleased she’ll be!’ But this was more than Alice had courage to do.",
    "chunk_order_index": 22,
    "full_doc_id": "doc-0ea2c1c44f0856dc4b4c6159d8d0107f"
  }
}