{
  "chunk-4023cee8b87a8c75b9c81b6158337c08": {
    "tokens": 1200,
    "content": "VOL. CLXXII . . . No. 59,661 © 2023  The New York Times Company NEW YORK, SATURDAY, JANUARY 7, 2023  \n\n![](images/image_1.jpg)  \n\nDefenders of Democracy Observing the Jan. 6, 2021, anniversary on Friday at the Capitol, above. President Biden also held a White House ceremony. Page A15.  \n\n# More Lanes, Meant to Cut Traffic, Made It Worse  \n\n# By EDEN WEINGART  \n\nInterstate 710 in Los Angeles is, like the city itself, famous for its traffic. Freight trucks traveling between the city and the port of Long Beach, along with commuters, clog the highway. The trucks idle in the congestion, contributing to poor air quality in surround  \n\nThe proposed solution was the same one transportation officials across  the  country  have  used since the 1960s: Widen the highway. But while adding lanes can ease congestion initially, it can also encourage people to drive more. A few years after a highway is widened, research shows, traffic — and the greenhouse gas  \n\n# Transportation Boards Can’t Quit a Strategy Used Since the ’60s  \n\nemissions that come along with it — often returns.  \n\nCalifornia’s  Department  of Transportation  was,  like  many state transportation departments, established to build highways. Every year, states spend billions of dollars expanding highways while other solutions to congestion, like public  transit  and  pedestrian projects, are usually handled by city transit authorities and receive less funding.   \nOver the next five years, states  \n\nmoney for highways through the infrastructure law enacted last year. While some have signaled a change in their approach to transportation spending — including following federal guidelines that encourage a “fix it first” approach before adding new highway miles — many still are pursuing multibillion dollar widening projects, including  in  Democratic-led states  with  ambitious  climate goals  \n\nThe Biden administration has suggested that states should be more thoughtful in their solutions to  congestion.  Sometimes  widening is necessary, Transportation Secretary Pete Buttigieg said, but other options for addressing traffic, like fixing existing roads or providing transit options, should Continued on Page A10  \n\n![](images/image_2.jpg)  \nHouston’s Katy Freeway spans 26 lanes in spots, making it one of the world’s widest highways.  \n\n# NEWS ANALYSIS  \n\n# Reaching Out For the Gavel In Handcuffs  \n\n# By LUKE BROADWATER  \n\nWASHINGTON — In yet another day of Representative Kevin McCarthy of California trying to become speaker of the House, this much was clear: The United States should brace for the likelihood of a Congress in perpetual disarray for the next two years.  \n\nThe recipe for the chaos already existed: A toxic combination of the Republicans’ slim governing majority, an unyielding hard-right flank that disdains the normal operations of government and a candidate for speaker who has repeatedly bowed to that flank in his quest for power.  \n\nBut to see it play out repeatedly on the House floor this week has left little doubt that Congress as an entity would struggle to carry out even its most basic duties in the coming two years, such as funding the government, including the military, or avoiding a catastrophic federal debt default.  \n\nAlready, the functioning of the House had ground to a halt before it even began, rendering the body essentially useless. Without a speaker, lawmakers were unable to pass bills, form committees or even get sworn in. And Mr. McCarthy had promised still more concessions to the hardright group that would substantially weaken the speakership in exchange for their votes, effectively giving them new tools for disrupting business in the House Continued on Page A13  \n\n# Lunar New Year Means Travel, and China Fears a Covid Surge  \n\nThis article is by David Pierson, Joy Dong, Claire Fu and Olivia Wang.  \n\nThe infections in Dadi Village, a corn farming community tucked between verdant hills in China’s remote southwest, started in early December  when  a  handful  of young people returned from jobs in big cities. The nearest hospital was an hour away, and few could afford the $\\mathbb{S}7$ bus fare there. The village clinic is not equipped with oxygen tanks or even an oximeter to detect if someone’s blood is dangerously  deprived  of  oxygen.  It quickly ran out of its stockpile of five boxes of fever medicine, so officials told sick residents to stay home and drink lots of water. For three years, the villagers had avoided the worst of the co  \n\n# Strain for Rural Areas With Few Resources  \n\nronavirus pandemic. But late last year,  Covid  infections  surged across China, forcing the government to abandon its stringent, yet ultimately futile, policy of mass lockdowns. It was only a matter of time before the virus wound its way out of the cities and arrived in poorer rural areas like Dadi, in Guizhou Province, with the barest of medical care.  \n\nChina  is  bracing  for  an  onslaught of infections in its fragile countryside as millions of migrant workers crowd onto trains and buses to leave factory towns, construction sites and cities, to return Continued on Page A8  \n\n# Chaotic Scene As the G.O.P. Stays Locked  \n\nMcCarthy Is Stunned Again in a 14th Vote  \n\n# HIRING IS HEALTHY BUT PACE RECEDED DURING DECEMBER  \n\n223,000 JOBS CREATED  \n\n# By ANNIE KARNI  \n\nWASHINGTON — Representative Kevin McCarthy of California suffered a stunning setback on Friday in his quest for the speakership, failing on a 14th ballot even after winning over a sizable bloc of hard-right lawmakers in a latenight vote that he and his allies had said they expected to win. Having swallowed a slew of demands from an ultraconservative band of",
    "chunk_order_index": 0,
    "full_doc_id": "doc-85ec0cdc93aa13bc6c1c30b931110692"
  },
  "chunk-06a7e74025d44363b4b683d6489ee976": {
    "tokens": 1200,
    "content": "IRING IS HEALTHY BUT PACE RECEDED DURING DECEMBER  \n\n223,000 JOBS CREATED  \n\n# By ANNIE KARNI  \n\nWASHINGTON — Representative Kevin McCarthy of California suffered a stunning setback on Friday in his quest for the speakership, failing on a 14th ballot even after winning over a sizable bloc of hard-right lawmakers in a latenight vote that he and his allies had said they expected to win. Having swallowed a slew of demands from an ultraconservative band of rebels who insisted on changes  that  would  dilute  the power of the speakership and hand them outsize influence, Mr. McCarthy had appeared to be on the brink of cementing the job earlier in the day, as he chiseled away at the bloc of holdouts and seemed within reach of clinching the post after a historic floor fight and 13 failed attempts.  \n\nIt  was  not  to  be.  The  vote dragged on in a tense scene on the House floor as he remained just short of a majority.  \n\nThe protracted fight reflected deep divisions and foreshadowed how difficult it would be to govern with  an  exceedingly  narrow G.O.P. majority and an unruly faction bent on slashing spending and disrupting business in Washington.  The  speakership  battle that has paralyzed the House before it has even started suggested that basic tasks such as passing government funding bills or financing the federal debt would prompt epic struggles over the next two years.  \n\nYet Mr. McCarthy, who has been willing to endure vote after humiliating failed vote and give in to an escalating list of demands from his opponents to secure the post, denied that the process foretold any dysfunction.  \n\nFed’s Moves to Cool the Economy Seem to Be Having an Effect  \n\n# By LYDIA DePILLIS  \n\nThe  U.S.  economy  produced jobs at a slower but still comfortable rate at the end of 2022, as higher interest rates and changing consumer habits downshifted the labor market without bringing it to a halt.  \n\nEmployers added 223,000 jobs in December on a seasonally adjusted basis, the Labor Department reported on Friday, in line with economists’ expectations although the smallest gain since President Biden took office.  \n\nThe gradual cooling indicates that the economy may be coming back into balance after years of pandemic-era disruptions — so far with limited pain for workers. The unemployment rate ticked down to 3.5 percent, back to its level  from  early  2020,  which matched a low last seen in 1969.  \n\n![](images/image_3.jpg)  \nMONTHLY CHANGE IN JOBS   \nSource: Bureau of Labor Statistics Note: Data is seasonally adjusted.  \n\n’21 ’22  \n\n“This is the great part,” he told reporters ahead of the 14th failed vote. “Because it took this long, now we learned how to govern.” On Friday, Mr. McCarthy had won over 15 of the 21 Republicans who had defected, and was pressing for more converts, a remarkable turnabout for a man who only days ago appeared to be headed for defeat. With no votes to spare, Mr. McCarthy called two supporters back to Washington to cast critical votes in his favor: Representatives Ken Buck of Colorado and Wesley Hunt of Texas, who had returned home to be with his wife after her hospitalization for complications in the premature  \n\nRepresentative Lauren Boebert of Colorado, a stalwart holdout who had said she would never back him, cleared an obstacle to Mr. McCarthy’s election by voting “present,” as did Representative Matt Gaetz of Florida, another of his prime detractors. But chaos broke out in the chamber as Mr. Continued on Page A12  \n\n“If the U.S. economy is slipping into recession, nobody told the labor market,” said Chris Varvares, co-head of U.S. economics for S&P Global Market Intelligence, noting that the December number is still nearly double the approximately 100,000 jobs needed to keep up with population growth. Stocks jumped on the news. The S&P 500 gained 2.3 percent, reflecting expectations that a slowdown in job growth and wage gains could reduce the pressure on prices and make the Federal Reserve less aggressive in raising interest rates.  \n\nThe report brought job creation for the year to 4.5 million, pending revisions, as the economy continued to recover from its plunge in 2020. Still, total employment is still millions short of where it was headed before the pandemic, with job losses predicted in the year ahead.  \n\nThe Biden administration trumpeted the report, calling it eviContinued on Page A14  \n\n# Bike-Path Killings Is Rare Case Of U.S. Seeking Death Penalty  \n\n# By BENJAMIN WEISER  \n\nOn  Halloween  2017,  Sayfullo Saipov plowed a rented pickup truck down Manhattan’s crowded West Side bicycle path, smashing into  pedestrians  and  cyclists, killing eight people and injuring more than a dozen, the authorities said.  \n\nSoon  after  Mr.  Saipov  was charged,  President  Donald  J. Trump tweeted, “SHOULD GET DEATH PENALTY!” And his attorney  general  later  directed prosecutors to seek execution if Mr. Saipov was convicted. Last year, Mr. Saipov’s lawyers asked President Biden’s Justice Department to withdraw that order. Mr. Biden, after all, had campaigned against capital punishment. But his attorney general, Merrick B. Garland, denied the request,  and  on  Monday,  Mr. Saipov’s trial is scheduled to begin in Federal District Court in Manhattan — the first federal death penalty trial under the Biden administration.  \n\nMr. Garland’s decision to continue pursuing the death penalty for Mr. Saipov,",
    "chunk_order_index": 1,
    "full_doc_id": "doc-85ec0cdc93aa13bc6c1c30b931110692"
  },
  "chunk-33c9c0d6ae3e3e3e11e3d513c88d12fb": {
    "tokens": 595,
    "content": "ov’s lawyers asked President Biden’s Justice Department to withdraw that order. Mr. Biden, after all, had campaigned against capital punishment. But his attorney general, Merrick B. Garland, denied the request,  and  on  Monday,  Mr. Saipov’s trial is scheduled to begin in Federal District Court in Manhattan — the first federal death penalty trial under the Biden administration.  \n\nMr. Garland’s decision to continue pursuing the death penalty for Mr. Saipov, an Uzbek immigrant, suggests a nuanced approach, one in which he has been reluctant to withdraw the threat of capital punishment in one type of case in particular: terrorism-related offenses.  \n\n![](images/image_4.jpg)  \n\n# NATIONAL A9-18  \n\nHeavy Rain and Broken Trees Wild swings in severe weather — drought, then a deluge — are taking a toll on California’s trees. PAGE A9  \n\n# INTERNATIONAL A4-8  \n\nMeet Africa’s First Heat Officer Eugenia Kargbo recalls when Sierra Leone’s capital was greener and cooler. She’s working on ways to make it so again. The Saturday Profile. PAGE A4  \n\n# On Death Row in Iran  \n\nAfter two men were executed by hanging, 11 others are facing death sentences as the government attempts to curb a monthslong uprising. PAGE A6  \n\n# BUSINESS B1-6  \n\n# Stranded by Southwest  \n\nThe airline’s customers incurred thousands in unexpected expenses as they scrambled to find alternate ways to get home. PAGE B1 A.I. Booms Amid Tech Gloom An investment frenzy over “generative artificial intelligence” has gripped Silicon Valley, as tools that generate text, images and sounds arise.  PAGE B1  \n\n![](images/image_5.jpg)  \n\n# ARTS C1-6  \n\nCreative Rebirth at City Ballet Alexei Ratmansky can let his imagination run wild when he joins the company as artist in residence. PAGE C1  \n\n# SPORTS B8-11  \n\nHamlin’s Condition Improves The Bills’ Damar Hamlin had his breathing tube removed less than a week after collapsing on the field. PAGE B9 In N.B.A., 50 Is the New 40 Eager offense and indifferent defense have made high-scoring individual performances commonplace.  PAGE B8 Police Say Boy, 6, Shot Teacher A Virginia schoolteacher has life-threatening injuries after being shot by a student, the authorities said.  PAGE A14 Prince Harry’s Military Tours Afghan officials and some in the British military expressed criticism as the royal said he killed 25 Taliban fighters while serving in Afghanistan.  PAGE A7 The Price of Deregulation California and the 34 other states that deregulated all or parts of their electricity systems tend to have higher rates than the rest of the country. PAGE B1 A Business School’s New Angles Two buildings on Columbia’s Manhattanville campus create connection within and perspective without. PAGE C1  \n\n354613",
    "chunk_order_index": 2,
    "full_doc_id": "doc-85ec0cdc93aa13bc6c1c30b931110692"
  }
}