{
  "chunk-a9dc43ea6b1238b8b0c004ff82447a9d": {
    "tokens": 1200,
    "content": "\"All the News That's Fit to Print\"  \n\n# Che New HJork Cimes  \n\nVOL. CLXXI . . . . No. 59,409  \n\n© 2022  The New York Times Company  \n\nNEW YORK, SATURDAY, APRIL 30, 2022  \n\n# Market Plunge Reflects Alarm Of Pain Ahead  \n\nDecline in April Was Worst in Two Years  \n\n# By CORAL MURPHY MARCOS  \n\nApril wound up being the worst month for Wall Street since the March 2020 panic over the coronavirus, capped by a plunge in stocks on Friday.  \n\nThe S&P 500 fell 8.8 percent for the month, and is down more than 13 percent in 2022, a drop that shows many investors are coming to the same conclusion: The economy is about to take a hit, and everywhere they look, they see trouble ahead.  \n\nRunaway inflation, and the interest rate increases meant to contain it, will make life harder for consumers. A severe Covid lockdown in China and the invasion of Ukraine are worsening disruptions in the flow of goods across borders,  contributing  to  rising food  and  energy  prices,  and threatening corporate profits. On Friday alone, the S&P 500 slid 3.6 percent after the tech giants Amazon and Apple reported their results for the start of the year, crystallizing fears of rising costs and supply constraints. Analysts say Wall Street’s pessimism is not likely to end until the major concerns are resolved, and when that will happen seems impossible to know.  \n\nWhat matters most is the effect that all of this will have on consumers, who account for the largest share of economic activity in the  United  States.  While  consumer spending has held up for now, several measures show that their  confidence  is  eroding quickly, and economists expect demand to slow as people face high prices and rising borrowing costs at the same time.  \n\n“The  consumer  is  the  main driver of the U.S. economy,” said Kathy Bostjancic, chief U.S. financial economist at Oxford Economics. “So how the consumer goes, so goes the economy.” Ms. Bostjancic said that as the Fed continued to raise rates this year and into next year, “we see more vulnerability for the consumer and risks of a consumer pullback rise.”  \n\nMs. Bostjancic’s firm has reduced its expectations for gross domestic  product  growth  this year to 3.1 percent, compared with 5.7 percent reported for 2021. But the outlook for 2023 is where concerns  are  particularly  evident. Continued on Page A18  \n\nIn Ohio G.O.P., Bombast Prods Gentility Aside  \n\n# By JONATHAN WEISMAN and TRIP GABRIEL  \n\nCOLUMBUS, Ohio — Republicans running for the seat of Ohio’s retiring senator, Rob Portman, appear determined to bury the softspoken  country-club  bonhomie that was once a hallmark of the party in this state and replace it with the pugilistic brand of conservatism owned by Donald J. Trump and now amplified by the new  band  of  Buckeye  bomb throwers.  \n\nThe race descended into a brutal slugfest as the leading candidates, the author-turned-venture capitalist J.D. Vance, the former state treasurer Josh Mandel and a self-funded  businessman,  Mike Gibbons, entered the final weekend before Tuesday’s primaries accusing one another of being insufficiently right-wing or disloyal to the man in Mar-a-Lago.  \n\nOhio used to be known for the   \nquiet conservatism of the state’s   \nformer senator George Voinovich   \nand its current governor, Mike   \nDeWine; for the Merlot-swilling Continued on Page A13  \n\n![](images/image_1.jpg)  \nKYIV Missiles from an overnight strike mangled an apartment building in the capital.  \n\n![](images/image_2.jpg)  \nSHESTOVYTSIA Ukrainian soldiers on patrol after Russian vehicles were cleared from the village.  \n\n![](images/image_3.jpg)  \nKHARKIV Refugees fled to Ukraine’s second-largest city, escaping fighting in Ruska Lozova.  \n\n# Is Four-Footed Fish to Blame for World’s Woes?  \n\n# By SABRINA IMBLER  \n\nIt may not be the worst of times, but it is certainly not the best of times. The pandemic has no end in sight. The world is warming, the seas are rising and polar bears are barreling toward extinction. Also: taxes, the 9-to-5 workweek, the renewed threat of nuclear war. As people looked for someone to blame besides themselves and all of humanity, a culprit emerged in the form of a fish, specifically the 375-million-year-old Tiktaalik (pronounced  tic-TAH-lick).  Our modern woes would never have existed if our ancestors had never  \n\n# When Trouble Ambled  \n\n# Out of the Ooze  \n\nleft the water, the reasoning went. Tiktaalik’s four whispers of feet made the fish an easy target. In  2006,  the  artist  Zina Deretsky made a scientific illustration of Tiktaalik for the National Science Foundation. More recently her depiction of Tiktaalik as a pensive-looking fish poised to leave the water has become the foundation for a flood of memes. In one, the fish is met with medieval polearms and premonitions: “If you see a Horrid Beast evolving, PUSH IT BACK IN.” The memes yearn to thwack Tiktaalik with a rolled-up newspaper or poke it with a stick — anything to shoo it back into the water and avoid our having to go to work and pay rent.  \n\nWhen Ms.",
    "chunk_order_index": 0,
    "full_doc_id": "doc-f5051298e7e491809135c7be0e4cfce2"
  },
  "chunk-c807d5acfcafbecb916d47b86b7e06a8": {
    "tokens": 1200,
    "content": "as a pensive-looking fish poised to leave the water has become the foundation for a flood of memes. In one, the fish is met with medieval polearms and premonitions: “If you see a Horrid Beast evolving, PUSH IT BACK IN.” The memes yearn to thwack Tiktaalik with a rolled-up newspaper or poke it with a stick — anything to shoo it back into the water and avoid our having to go to work and pay rent.  \n\nWhen Ms. Deretsky first saw one of the memes riffing on her Tiktaalik illustration, she felt she could commiserate. “Our world is a little bit difficult right now,” she said.  \n\nScientists may never know exactly why fish like Tiktaalik and early  tetrapods  —  vertebrates Continued on Page A17  \n\n# E.U. NEAR OIL DEAL AS RUSSIA APPEARS TO FALTER IN EAST  \n\nBattling Resistance as Well as Logistics  \n\nBy MATINA STEVIS-GRIDNEF Western  support  of  Ukraine hardened Friday as the European Union was poised to approve an embargo on Russian oil, amid fresh assessments that the Russian military’s eastern offensive was faltering, hampered by logistical issues and stiff Ukrainian resistance.  \n\nThe oil embargo, which would be phased in over a period of some months, is expected to be approved by E.U. ambassadors next week, in a step that should avoid the time-consuming process of gathering heads of state. Word of the European oil embargo came during a surge of activity to provide Ukraine with more weapons and support, while shoring up NATO’s defenses, as the Kremlin and Western allies seemed to gird for a drawn-out struggle that risked spilling over Ukraine’s borders.  \n\nPresident  Biden’s  request Thursday for Congress to approve \\$33 billion to bolster Ukraine’s arsenal and economy was followed by more commitments by allies. Britain’s military said on Friday that it would deploy 8,000 soldiers to Europe, who were to join tens of thousands of troops from NATO countries in exercises meant to deter further Russian aggression. While the NATO allies’ commitments to Ukraine grew, the Russian offensive in the Donbas region of eastern Ukraine showed signs of stalling amid heavy battlefield losses and was now “several days behind” schedule, a senior Pentagon official said on Fri  \n\nday. Britain’s Defense Intelligence   \nagency largely concurred, saying   \non Friday that “Russian territorial   \ngains  have  been  limited  and   \nachieved  at  significant  cost  to   \nRussian forces.” In a video released on Friday, an   \naide to the Ukrainian president,   \nVolodymyr Zelensky, called the   \nRussian losses “colossal.” The Russian military is trying   \nto encircle Ukrainian troops in the   \nDonbas region by attacking from   \nthe north, east and south, but has   \nmade little progress, experts and   \nPentagon officials say. Victory in the Donbas cam  \npaign is vital to Moscow’s plans of   \ncarving out a large chunk of southContinued on Page A6  \n\n![](images/image_4.jpg)  \nA Taneco oil refinery in Russia.  \n\n# As Food Exports Are Blocked, Ripples Are Felt Around Globe  \n\n# By ANA SWANSON  \n\nWASHINGTON — Ukraine has limited exports of sunflower oil, wheat, oats and cattle in an attempt to protect its war-torn economy. Russia has banned sales of fertilizer,  sugar  and  grains  to other nations.  \n\nIndonesia,  which  produces more than half the world’s palm oil,  has  halted  outgoing  shipments. Turkey has stopped exports of butter, beef, lamb, goats, maize and vegetable oils. Russia’s  invasion  of  Ukraine has unleashed a new wave of protectionism as governments, desperate to secure food and other commodities  for  their  citizens amid shortages and rising prices, erect new barriers to stop exports at their borders.  \n\nThe measures are often well intended. But like the panic-buying that  stripped  grocery  store shelves at various moments of the pandemic, the current wave of protectionism will only compound the problems that governments are trying to mitigate, trade exWar Prompts Dozens of Countries to Protect  \n\n# Scarce Supplies  \n\nExport restrictions are making grains, oils, meat and fertilizer — already at record prices — more expensive and even harder to come by. That is placing an even greater burden on the world’s poor, who are paying an everlarger share of their income for food, increasing the risk of social unrest in poorer countries struggling with food insecurity.  \n\nSince the beginning of the year, countries have imposed a total of 47 export curbs on food and fertilizers — with 43 of those put in place  since  the  invasion  of Ukraine in late February, according to tracking by Simon Evenett, a professor of international trade and economic development at the University of St. Gallen. Continued on Page A9  \n\n# Abbott Could Declare ‘Invasion’ As His Border Effort Is Stymied  \n\n# By J. DAVID GOODMAN and EDGAR SANDOVAL  \n\nEAGLE PASS, Texas — From acamouflage Humvee at the edge of the Rio Grande, a Texas National Guard soldier on the front lines of Gov. Greg Abbott’s campaign to secure America’s southern border was watching a man with a crutch crossing the river from Mexico.  \n\n“Señor! Are you there?” the soldier called out as the man disappeared into a thicket of towering reeds. No one answered. Downriver, four other soldiers stood by as a U.S. Border Patrol team detained dozens of newly arrived migrants in a pecan orchard. An agent with a crowd counter recorded 135 people, mostly men but also families from Cuba, Peru and Venezuela who were seeking asylum in the United States.  \n\n“This is it, every day,” said Hal Bowles",
    "chunk_order_index": 1,
    "full_doc_id": "doc-f5051298e7e491809135c7be0e4cfce2"
  },
  "chunk-a71f91eb0b5b517646baa00edce82821": {
    "tokens": 547,
    "content": "“Señor! Are you there?” the soldier called out as the man disappeared into a thicket of towering reeds. No one answered. Downriver, four other soldiers stood by as a U.S. Border Patrol team detained dozens of newly arrived migrants in a pecan orchard. An agent with a crowd counter recorded 135 people, mostly men but also families from Cuba, Peru and Venezuela who were seeking asylum in the United States.  \n\n“This is it, every day,” said Hal Bowles, a Maverick County deputy constable who has been hired with new state funding to work on border security. “The governor is Continued on Page A16  \n\n![](images/image_5.jpg)  \n\n# NATIONAL A12-19  \n\nScandal Dims Cawthorn’s Star Representative Madison Cawthorn of North Carolina, once a far-right darling, is now being pressed from both sides to end his career in Congress. PAGE A14  \n\n![](images/image_6.jpg)  \n\n# SPORTS B6-8  \n\nShocker at N.F.L. Draft The Jets and the Giants, two of the league’s worst teams in recent years, atypically won praise, as each made first-round selections to fill needs on both defense and offense. PAGE B6 INTERNATIONAL A4-11 Palestinian Muslims barred from crossing to Jerusalem find ways to get there to pray at Al Aqsa Mosque. PAGE A11 Time Capsules in a Census Ireland’s survey included a space for people to leave messages that will be revealed in 100 years. PAGE A10 Census Delays Detailed Data Statistics on age, gender, race, housing type and more won’t be released until next year because of the pandemic and complications over privacy. PAGE A12 Trump Grand Jury Expiring Charges in Manhattan against the former president over his business practices are now said to be unlikely in the foreseeable future. PAGE A19 BUSINESS B1-5 The Toll of Faraway Battles The war in Ukraine has raised energy costs in Britain, putting more stress on the older and the vulnerable.  PAGE B1 Possible Headache for Twitter Elon Musk has invested heavily in China, which is willing to punish companies that cross political lines. PAGE B1 Pitcher Gets Long Suspension Major League Baseball suspended the Dodgers’ Trevor Bauer for two seasons under its policy on domestic violence and sexual assault. If an appeal fails, he could lose tens of millions. PAGE B7  \n\n![](images/image_7.jpg)  \n\n# OPINION A20-21  \n\n# Michelle Goldberg  \n\nARTS C1-7 The Pieces Inside a Masterpiece The objects featured in Matisse’s “Red Studio” painting have been brought together in a spectacular show at the Museum of Modern Art. PAGE C1",
    "chunk_order_index": 2,
    "full_doc_id": "doc-f5051298e7e491809135c7be0e4cfce2"
  }
}