{
  "chunk-28037bf173637ec0ec59c3237f570304": {
    "tokens": 1200,
    "content": "# Che New ork Cimes  \n\nVOL. CLXXII . . . . No. 59,876 © 2023  The New York Times Company NEW YORK, THURSDAY, AUGUST 10, 2023  \n\nLimits Could Escalate Conflict With Beijing  \n\nPINECREST, Fla. — The prevailing theory about why the peacocks  flocked  to  suburban Pinecrest is that, like many a Floridian, they went hunting for better real estate.  \n\nWASHINGTON — President Biden escalated his confrontation with China on Wednesday by signing an executive order banning new American investment in key technology industries that could be used to enhance Beijing’s military capabilities, the latest in a series of moves putting more distance between the world’s two largest economies.  \n\n![](images/image_1.jpg)  \nOfficials in Pinecrest, Fla., announced a mitigation plan to help rein in the peafowl and keep them from breeding and running amok.  \n\n# Overrun Miami Suburb to Clip Its Peacocks (Not the Feathers)  \n\nThe order will prohibit venture capital and private equity firms from pumping more money into Chinese efforts to develop semiconductors and other microelectronics, quantum computers and certain artificial intelligence applications.  Administration  officials stressed that the move was tailored to guard national security, but China is likely to see it as part of a wider campaign to contain its ris  \n\nECONOMIC THREAT Spending slowdown deepens concerns for heavily indebted China. PAGE B1  \n\nLong a mainstay in bohemian Coconut Grove, a Miami neighborhood up the road, the nonna  \n\n# Biden’s Order Bans Investing In Chinese Tech  \n\n“The Biden administration is committed to keeping America safe and defending America’s national security through appropriately protecting technologies that are critical to the next generation of military innovation,” the Treasury Department said in a statement. The statement emphasized that the executive order was a “narrowly targeted action” complementing existing export controls and that the administration maintained  its  “longstanding commitment to open investment.” Narrow or not, the new order comes  at  perhaps  the  most fraught moment in the U.S.-China relationship since President Richard M. Nixon and Secretary of State Henry A. Kissinger opened a dialogue with Beijing in the early 1970s. A series of expanding export controls on key technologies to China has already triggered retaliation from Beijing, which recently announced the cutoff of metals like gallium that are critiContinued on Page A9  \n\n# By PETER BAKER and DAVID E. SANGER  \n\n# By PATRICIA MAZZEI  \n\ntive birds began making their way south in recent years, local officials suspect, because old Grove cottages were being turned into immense  modern  houses  that chipped away at the area’s lush tree canopy. In the affluent village of Pinecrest, the peafowl found larger lots with plenty of greenery that were far more to their liking. The birds, however, were not so much to their new human neigh  \n\nIf you find that the blistering, unrelenting heat is making you anxious and irritable, even depressed, it’s not all in your head. Soaring temperatures can damage not just the body but also the mind.  \n\nAs heat waves become more intense, more frequent and longer, it has become increasingly important to address the impact on mental health, scientists say. “It’s really only been over the past five years that there’s been a real recognition of the impact,” said Dr. Joshua Wortzel, chair of the American Psychiatric Association’s  committee  on  climate change and mental health, which was set up just two years ago. “Our understanding of the basic biology of why this association ex  \n\n![](images/image_2.jpg)  \nA charred boat sat on the scorched waterfront Wednesday as wildfires fanned by Hurricane Dora swept the island of Maui in Hawaii.  \n\n# The Extreme Heat May Be Getting to Your Head  \n\n# By APOORVA MANDAVILLI  \n\nHigh temperatures are strongly associated with an increase in suicides,  researchers  have  found. Heat has been linked to a rise in violent  crime  and  aggression, emergency room visits and hospitalizations for mental disorders, and deaths — especially among people  with  schizophrenia,  dementia, psychosis and substance use.  \n\nbors’  liking.  The  peacocks scratched  the  roofs  of  stately homes, pecked the paint off fancy cars and defecated on manicured driveways. Their piercing  \n\n# Uncovering the Effects  \n\n# Turning to Vasectomies to Curb Population  \n\nFor every increase in temperature of 1 degree Celsius, or 1.8 degrees Fahrenheit, scientists have estimated that there is a nearly 5 percent increase in the risk of death among patients with psyof Climate Change on Mental Health chosis,  dementia  or  substance use.  \n\nResearchers have reported a 0.7 percent  increase  in  suicides linked to rising temperatures, and about a 4 percent to 6 percent increase in interpersonal violence, including homicides.  \n\nHeat not only fuels feelings like irritability  and  anger,  but  also seems to exacerbate mental illnesses, such as  anxiety, schizophrenia  and  depression. Older adults, adolescents and people with pre-existing mental illnesses are particularly vulnerable, as are people who do not have housing or are of lower socioeconomic status.  \n\nA landmark study last year analyzed data on more than two million people with private insurance and found that emergency department visits for mental illnesses Continued on Page A16  \n\nSo Pinecrest devised a novel plan: peacock vasectomies. Snip  one  male  peacock,  the thinking goes, and it will no longer be able to fertilize the eggs of the female peahens in its harem. “Peacocks are bona fide polygamists",
    "chunk_order_index": 0,
    "full_doc_id": "doc-9bfba4de21566f9ec2dd09a5e8345665"
  },
  "chunk-99fe7081ab1f67984e266b24222375d4": {
    "tokens": 1200,
    "content": "lower socioeconomic status.  \n\nA landmark study last year analyzed data on more than two million people with private insurance and found that emergency department visits for mental illnesses Continued on Page A16  \n\nSo Pinecrest devised a novel plan: peacock vasectomies. Snip  one  male  peacock,  the thinking goes, and it will no longer be able to fertilize the eggs of the female peahens in its harem. “Peacocks are bona fide polygamists,” said Dr. Don J. Harris, the Continued on Page A12  \n\nsquawks — “aa-AAH! aa-AAH!” — often woke residents before dawn.  \n\nIt was a scene familiar to residents  of  California  and  other states in the American West that have suffered a spate of hot-burning  and  fast-moving  wildfires. This week they were ravaging a part of the United States that many consider paradise. “This is not a safe place to be,” Lt. Gov. Sylvia Luke said at a news Continued on Page A16  \n\nThe firestorm that tore through the western shores of Hawaii’s Maui island on Tuesday and continued on Wednesday has killed at least six people and forced the evacuation of more than 2,000, the authorities said. It was the deadliest wildfire in the state’s history, according to Clay Trauernicht, a tropical fire specialist at the University of Hawaii at Manoa.  \n\nFrom the air, the town of Lahaina looks incinerated. Charred palm trees are reduced to slender matchsticks protruding into the smoky  sky.  Homes  are  ash. Streets are deserted. “Oh, my Gosh! Unbelievable,” said Richard Olsten as he piloted a helicopter along the Maui coast on Wednesday.  “This  looks  like Baghdad or something.”  \n\nHis manager, Jared Levine, said he died after a long illness. The songs that Mr. Robertson, a Canadian,  wrote  for  the  Band used enigmatic lyrics to evoke a hard and colorful America of yore, an especially amazing feat coming from someone not born in the United States. With uncommon conviction, they conjured a wild place, often centered in the South, peopled by rough-hewed characters, from the defeated Confeder  \n\n# The Lyrical Soul of Americana  \n\nRobbie  Robertson,  the  chief composer and lead guitarist for the Band, whose work offered a rustic  vision  of  America  that seemed at once mythic and authentic, in the process helping to inspire the genre that came to be known as Americana, died on Wednesday in Los Angeles. He was 80.  \n\n# Fleeing Into Sea As Deadly Fires Overtake Maui  \n\n# By THOMAS FULLER  \n\n# By JIM FARBER  \n\n# ROBBIE ROBERTSON, 1943-2023  \n\nWARRANT WAS SECRET  \n\n“Just found out that Crooked Joe Biden’s DOJ secretly attacked my Twitter account, making it a point not to let me know about this major ‘hit’ on my civil rights,” he wrote. “My Political Opponent is going CRAZY trying to infringe on my Campaign for President.”  \n\nThe music he matched to his passionate yarns mined the roots of  every  essential  American genre,  including  folk,  country, blues and gospel. Yet when his hisContinued on Page A20  \n\nThe existence of the warrant was earlier reported by Politico. The fact that prosecutors quietly obtained a judge’s permission more than seven months ago to peer into Mr. Trump’s Twitter account underscores how much of the special counsel’s work may have taken place out of public view. Much of the investigation Continued on Page A15  \n\nate soldier in “The Night They Drove Old Dixie Down” to the tough union worker of “King Harvest Has Surely Come” to the shady creatures in “Life Is a Carnival.”  \n\nProsecutors working for Jack Smith, the special counsel who has  twice  brought  indictments against former President Donald J. Trump, obtained a search warrant  early  this  year  for  Mr. Trump’s long-dormant Twitter account as part of their inquiry into his attempt to overturn the 2020 election, according to court papers unsealed on Wednesday. The warrant, which was signed by a federal judge in Washington in January after Elon Musk took over Twitter, now called X, is the first known example of prosecutors  directly  searching  Mr. Trump’s  communications  and adds a new dimension to the scope of the special counsel’s efforts to investigate the former president. The  court  papers,  which emerged from an appeal by Twitter  challenging  a  part  of  the judge’s decision to issue the warrant, did not reveal what prosecutors  were  looking  for  in  Mr. Trump’s Twitter account, which the tech company shut down for nearly two years soon after the attack on the Capitol on Jan. 6, 2021. But the papers indicate that prosecutors received permission from the judge not to tell Mr. Trump for months that they had obtained the warrant for his account.  The  prosecutors  feared that if Mr. Trump learned about the warrant, it “would seriously jeopardize the ongoing investigation” by giving him “an opportunity to destroy evidence, change patterns of behavior [or] notify confederates,” the papers said. Mr. Trump quickly responded to the news about the warrant on his own social media site, Truth Social.  \n\nFirst Known Effort to Dig Directly Into Trump’s Communications  \n\n# TWITTER ACCOUNT OF EX-PRESIDENT SEARCHED BY U.S.  \n\n![](images/image_3.jpg)  \n\n# By ALAN FEUER  \n\n![](images/image_4.jpg)  \n\n# INTERNATIONAL A4-10  \n\n# Frozen Peas, Please  \n\nBritain’s vegetable producers are hoping that a time",
    "chunk_order_index": 1,
    "full_doc_id": "doc-9bfba4de21566f9ec2dd09a5e8345665"
  },
  "chunk-3e7d3be70e49737c0caddd881b5e8620": {
    "tokens": 489,
    "content": "Mr. Trump quickly responded to the news about the warrant on his own social media site, Truth Social.  \n\nFirst Known Effort to Dig Directly Into Trump’s Communications  \n\n# TWITTER ACCOUNT OF EX-PRESIDENT SEARCHED BY U.S.  \n\n![](images/image_3.jpg)  \n\n# By ALAN FEUER  \n\n![](images/image_4.jpg)  \n\n# INTERNATIONAL A4-10  \n\n# Frozen Peas, Please  \n\nBritain’s vegetable producers are hoping that a time of rising food prices could produce a revival of their humble but cost-effective staple. PAGE A8  \n\n![](images/image_5.jpg)  \n\n# ARTS C1-6  \n\nThe Path Not Taken For a while, the actor Justin H. Min believed that he should try a career in journalism. Now he has a starring role in the comedy “Shortcomings.” PAGE C1  \n\n![](images/image_6.jpg)  \n\n# NATIONAL A11-17  \n\nA Needed Harvest Is in Peril Extreme weather has Kansas facing a shrinking wheat crop, an added worry in a hurting global grain market. PAGE A11 DeSantis Suspends Prosecutor Florida’s governor said the elected state attorney in Orlando, a Democrat, was too lenient, a claim she denied. PAGE A14 A Concert Shakes Up Rome A rap show set off vibrations at the Circus Maximus, raising concerns about using ancient venues.  PAGE A10 OBITUARIES B10 Folk Singer Found Fame Late Rodriguez, who performed using only his surname and was the subject of a 2012 documentary, was 81.  \n\nBUSINESS B1-5 An Identity Forged in Food Chefs in Taiwan are using an abundance of local ingredients to reflect the island’s roots. PAGE B1 Who’s in the Driver’s Seat? Officials in San Francisco are hesitant to expand a plan to offer round-theclock driverless taxi service. PAGE B1 THURSDAY STYLES D1-6 New Looks for a New Era From the World Cup to Wimbledon, female athletes are increasingly rebelling against uniform conventions handed down over decades. PAGE D5 OPINION A18-19 Charles M. Blow  \n\n# SPORTS B6-9  \n\nA Pregame Pilgrimage When visiting Mexico City, many baseball players go to the Basílica de Santa María de Guadalupe. “It’s an indescribable sensation,” a pitcher said.  PAGE B6",
    "chunk_order_index": 2,
    "full_doc_id": "doc-9bfba4de21566f9ec2dd09a5e8345665"
  }
}