{
  "chunk-542071c9889c3d427f5f9a3f3841fab4": {
    "tokens": 1200,
    "content": "NEW YORK, MONDAY, JUNE 6, 2022  \n\n![](images/image_1.jpg)  \nSENDING A REMINDER Struggling in Ukraine’s east, Russia struck Kyiv on Sunday for the first time in more than a month. Page A9.  \n\n# Taking Guns From Those in Crisis: A County’s ‘Red Flag’ Lessons  \n\nThis article is by Andy Newman, Benjamin  Weiser and  Ashley Southall.  \n\nThe boy made his threat aboard a school bus.  \n\nIn late March, a 16-year-old in Suffolk County, $\\mathrm{N.Y.,60}$ miles east of New York City, told fellow students that he wanted to shoot their heads off, according to court records. He told the police that he wanted to hurt himself with a shotgun at his house.  \n\nWhat followed happens more often in Suffolk County than any other county in the state: A judge issued a “red $\\mathrm{{flag^{\\prime\\prime}}}$ order that would allow authorities to take weapons from the home. The police filed an application to remove the boy’s access to guns. The judge acted after finding that he posed a danger. Two shotguns were taken. The judge later wrote that the boy “admitted that not having the shotguns in the home is helpful to him.”  \n\nIn the wake of horrific mass shootings at a Buffalo supermarket, a Texas school and an Oklahoma hospital, many policymakers are grasping for ways to keep guns out of hands of people in crisis.  \n\nOn Thursday, President Biden implored Congress to pass a federal red flag law, though such measures  face  stiff  resistance  \n\n# 160 Weapons Seized on Long Island Since August 2019  \n\nfrom Republicans who contend the red flag process can be abused to take away an innocent person’s fundamental right to own guns. There are also negotiations in Washington  on  offering  incentives for more states to pass red flag laws — New York is one of 19 that has one, along with the District of Columbia. An examination by The New York Times of more than 100 red flag cases filed in Suffolk County since the law took effect in August 2019 shows how New York’s law has defused dozens of dangerous situations in the sprawl of Long Island’s suburbs and beach towns, according to current and former officials.  \n\nThe red flag law is hardly a panacea. It does not mandate treatment for the troubling behavior that led to the order, and its effect on gun-death statistics is difficult to discern. But those who have put it into action said it is a crucial tool.  \n\n“This is something that we can use in that gray area where we don’t have anything and we’re just Continued on Page A13  \n\n# Putin Peddles Stolen Grain To Needy World, U.S. Says  \n\nAfrican Nations Face Hunger and Dilemma as Ukraine’s Bounty Is Shipped Out  \n\n# By DECLAN WALSH and VALERIE HOPKINS  \n\nNAIROBI, Kenya — Russia has bombed,  blockaded  and  plundered the grain production capacity of Ukraine, which accounts for one-tenth of global wheat exports, resulting in dire forecasts of increased hunger and of spiking food prices around the world. Now,  the  United  States  has warned that the Kremlin is trying to profit from that plunder by selling  stolen  wheat  to  droughtstricken countries in Africa, some facing possible famine.  \n\nIn mid-May, the United States sent  an  alert  to  14  countries, mostly in Africa, that Russian cargo vessels were leaving ports near Ukraine laden with what a State Department cable described as “stolen Ukrainian grain.” The cable identified by name three Russian cargo vessels it said were suspected of transporting it. The American alert about the grain has only sharpened the dilemma  for  African  countries, many already feeling trapped between East and West, as they potentially face a hard choice between, on one hand, benefiting from possible war crimes and displeasing a powerful Western ally, and on the other, refusing cheap food at a time when wheat prices are soaring and hundreds of thousands of people are starving. The alarm sounded by Wash  \n\nCritics  said  the  trip,  during which Mr. Sall referred to his “dear  friend  Vladimir,”  played straight into Mr. Putin’s hands by offering him yet another tool to leverage divisions in the international response to his brutal assault on Ukraine.  \n\nBut many African nations are already  ambivalent  about  the punishing Western campaign of sanctions against Russia for reasons that include their dependence on Russian arms sales, lingering Cold War-era sympathies and perceptions of Western double standards.  \n\n![](images/image_2.jpg)  \nFertilizing a wheat field near Kharkiv, Ukraine, in April.  \n\nernment accusations that Russia has stolen up to 500,000 tons of Ukrainian wheat, worth \\$100 million, since Russia’s invasion in February. Much of it has been trucked to ports in Russia-controlled Crimea, then transferred to ships, including some under Western sanctions, Ukrainian officials say.  \n\nOn Friday, the head of the African Union, President Macky Sall of Senegal, met in Russia with President Vladimir V. Putin, in an  \n\nOn top of that, the continent is suffering badly.  \n\nRussia and Ukraine normally supply about 40 percent of wheat needs in Africa, where prices for the grain have risen 23 percent in the past year, the United Nations says. In the Horn of Africa region, a devastating drought has left 17 million people hungry, mostly in parts of Somalia, Ethiopia and Kenya, according to the United Continued on Page A8  \n\n# Mass Shootings  \n\n# Over Weekend Unnerve Cities  \n\nThis article is by Luke Vander Ploeg, Christine Chung and Livia Albeck-Ripka.  \n\nA brawl between at least two men turned",
    "chunk_order_index": 0,
    "full_doc_id": "doc-0cc837802b04697d58cf5f7f018b0c6a"
  },
  "chunk-cf5431dd9af9ac03f6eaa2126bd1c679": {
    "tokens": 1200,
    "content": "for the grain have risen 23 percent in the past year, the United Nations says. In the Horn of Africa region, a devastating drought has left 17 million people hungry, mostly in parts of Somalia, Ethiopia and Kenya, according to the United Continued on Page A8  \n\n# Mass Shootings  \n\n# Over Weekend Unnerve Cities  \n\nThis article is by Luke Vander Ploeg, Christine Chung and Livia Albeck-Ripka.  \n\nA brawl between at least two men turned a packed Philadelphia street into a scene of terror Saturday night after they pulled out guns and began firing wildly at each other. By the time the gunfire ended, three people were dead and 12 more were hurt.  \n\nJust a few hours later, in Chattanooga, Tenn., a mass shooting outside a bar sent people fleeing in panic. Three people were killed there, too, including one who was struck by a vehicle, and 14 were hurt, most of them by gunshots. And  at  parties  in  Phoenix, Chester,  Va.,  and  Summerton, S.C., celebrations turned tragic in mass shootings that resulted in a total of at least three deaths and 22 injuries, many of them children. Although shootings across the country traditionally begin to rise with the approach of summer, the scenes of carnage over the weekend after massacres in Buffalo, Uvalde, Texas, and Tulsa, Okla., left cities shaken though, tellingly, not shocked.  \n\n“People are afraid to let their kids out of the house,” Mayor Jim Kenney of Philadelphia said in an interview. But he added that there was little he could say to reassure frightened or grieving residents. “Words are hard,” Mr. Kenney said. “Words these days have become somewhat meaningless.” As of Sunday evening, the po  \n\n![](images/image_3.jpg)  \n\n# A Jubilee, and a Cup of Tea  \n\nRevelers in Windsor toasted Queen Elizabeth II’s 70-year reign at the Big Jubilee Lunch. Page A9.  \n\n# Debate on Crime Splits San Francisco Democrats  \n\n# By TIM ARANGO and THOMAS FULLER  \n\nSAN FRANCISCO — As the former chair of the San Francisco Democratic Party, Mary Jung has a long list of liberal bona fides, including her early days in politics volunteering in Ohio for the presidential campaign of George McGovern and her service on the board of the local Planned Parenthood branch. “In Cleveland, I was considered  a  communist,”  she  \n\n# Progressive  Prosecutor Faces a Recall Effort  \n\nsaid in her San Francisco office. But the squalor and petty crime that she sees as crescendoing on some city streets — her office has been broken into four times during the coronavirus pandemic — have tested her liberal outlook. Last year, on the day her granddaughter was born, she watched a video of a mentally ill man punching an older Chinese woman in broad daylight on Market Street. Ms. Jung, director of government affairs for the San Francisco Association of Realtors and head of a Realtors foundation that assists homeless people, wondered what kind of city her granddaughter would grow up in. “I thought, ‘Am I going to be able to take her out in the stroller?’” Continued on Page A11  \n\n# 2020 Deniers Gain in Races To Run Voting  \n\n# By ALEXANDRA BERZON  \n\nKey figures in the effort to subvert the 2020 presidential election have thrown their weight behind a slate of Republican candidates for secretary of state across the country,  injecting  specious  theories about voting machines, foreign hacking and voter fraud into campaigns that will determine who controls elections in several battleground states.  \n\nThe America First slate comprises more than a dozen candidates who falsely claim the 2020 election was stolen from Donald J. Trump. It grew out of meetings held by a conspiracy-mongering QAnon leader and a Nevada politician, and has quietly gained support from influential people in the election denier movement — including Mike Lindell, the MyPillow founder, and Patrick Byrne, the former Overstock.com executive who has financed public forums that promote the candidates and theories about election vulnerabilities.  \n\nMembers of the slate have won party endorsements or are competitive candidates for the Republican nomination in several states, including three — Michigan, Arizona and Nevada — where a relatively small number of ballots have  decided  presidential  victories.  And  in  Pennsylvania, where the governor appoints the secretary of state, State Senator Doug Mastriano, who is aligned with the group, easily won his primary for governor last month. Continued on Page A14  \n\n# Biden Boxed In As Price of Oil Refuses to Cool  \n\n# By CLIFFORD KRAUSS  \n\nHOUSTON — When President Biden meets Crown Prince Mohammed bin Salman in Saudi Arabia, he will be following in the footsteps of presidents like Jimmy Carter, who flew to Tehran in 1977 to exchange toasts with the shah of Iran on New Year’s Eve. Like the prince, the shah was an unelected monarch with a tarnished human rights record. But Mr. Carter was obliged to celebrate with him for a cause that was of great concern to people back home: cheaper gasoline and secure oil supplies.  \n\nAs Mr. Carter and other presidents learned, Mr. Biden has precious few tools to bring down costs at the pump, especially when Russia, one of the world’s largest energy producers, has started an unprovoked war against a smaller neighbor. In Mr. Carter’s time, oil supplies that Western countries needed were threatened by revolutions in the Middle East.  \n\nDuring the 2020 campaign, Mr. Biden pledged to turn Saudi Arabia into a “pariah” for the assassination of a prominent dissident, Jamal  Khashoggi.  But  officials said last week that he planned to visit the kingdom this summer. It was just the latest sign that oil has again regained its central",
    "chunk_order_index": 1,
    "full_doc_id": "doc-0cc837802b04697d58cf5f7f018b0c6a"
  },
  "chunk-9adafa3eb78fb6b6330ff3d01620a512": {
    "tokens": 573,
    "content": "unprovoked war against a smaller neighbor. In Mr. Carter’s time, oil supplies that Western countries needed were threatened by revolutions in the Middle East.  \n\nDuring the 2020 campaign, Mr. Biden pledged to turn Saudi Arabia into a “pariah” for the assassination of a prominent dissident, Jamal  Khashoggi.  But  officials said last week that he planned to visit the kingdom this summer. It was just the latest sign that oil has again regained its centrality in geopolitics.  \n\nJust a few years ago, many lawmakers in Washington and oil and gas executives in Texas were patting themselves on the back for an energy boom that had turned the Continued on Page A14  \n\n![](images/image_4.jpg)  \n\n# INTERNATIONAL A4-9  \n\nResistance by Assassination A democracy movement in Myanmar has evolved into deadly warfare between a ruthless military and resisters making targeted killings. PAGE A4  \n\n![](images/image_5.jpg)  \n\n# BUSINESS B1-6  \n\nA Rom-Com Musk Empire Tosca Musk, Elon’s younger sister, is the founder of Passionflix, a streaming service dedicated to movie and series adaptations of romance novels. PAGE B1  \n\n![](images/image_6.jpg)  \n\n# SPORTS D1-7  \n\nOn Bad Foot, Nadal’s Too Good Despite numbness, Rafael Nadal won his 14th French Open championship and 22nd major title. On Tennis. PAGE D1 Stephen Curry made five 3-pointers and scored 29 points, fueling a 107-88 rout of Boston in Game 2 of the finals. PAGE D2 Bangladesh Depot Disaster A fire set off explosions, killing at least 49 people in a country where such fires are a recurring problem. PAGE A7 NATIONAL A10-14 Biker Club Seeks New Trial The Mongols group claims that its ex-president cooperated with officials in a racketeering case. PAGE A10 ARTS C1-6 The Story Behind ‘Fire Island’ Joel Kim Booster, the film’s star, reflects on making a rom-com that puts Asian American gay men at its center. PAGE C1 An Inimitable ‘Wire’ Fans praise the show as an inspiration, but after 20 years, it stands alone. James Poniewozik explains why. PAGE C1 OBITUARIES A15, A18 She Gave Black Art a Spotlight The painter Samella Lewis was also a historian who pushed for an inclusive definition of art, in part by founding her own museum. She was 99. PAGE A18 OPINION A16-17 Charles M. Blow  \n\n# TRAVEL B7  \n\nIceland’s Otherworldly North Less crowded than the Golden Circle, the Diamond Circle includes volcanic landscapes, waterfalls, misty vistas, sulfurous pools and whale watching.",
    "chunk_order_index": 2,
    "full_doc_id": "doc-0cc837802b04697d58cf5f7f018b0c6a"
  }
}