{
    "chunk-c3c181b5c58c434b47cfecd1f212ca3e": [
        {
            "entity_name": "Rosatom (Russia’s state-owned nuclear agency, ROSATOM SUBSIDIARIES)",
            "entity_type": "ORGANIZATION",
            "description": "Rosatom is Russia's state-owned nuclear agency, which receives payments from the United States for enriched uranium. It is closely intertwined with Russia's military apparatus and has subsidiaries that also handle enriched uranium payments.",
            "source_entities": [
                "ROSATOM",
                "RUSSIA’S STATE-OWNED NUCLEAR AGENCY",
                "ROSATOM SUBSIDIARIES"
            ]
        },
        {
            "entity_name": "Piketon Uranium Enrichment Facility (EUROPEAN-OWNED PLANT, APPALACHIAN VALLEY, PIKETON, OHIO)",
            "entity_type": "ORGANIZATION",
            "description": "The Piketon Uranium Enrichment Facility is a European-owned plant located in the Appalachian Valley, Piketon, Ohio. It is involved in uranium enrichment but currently yields much less than the U.S. nuclear industry requires.",
            "source_entities": [
                "EUROPEAN-OWNED PLANT",
                "APPALACHIAN VALLEY",
                "PIKETON",
                "OHIO"
            ]
        },
        {
            "entity_name": "Trump's Inner Circle (TRUMP’S ALLIES, SECRET SERVICE, MAR-A-LAGO, BEDMINSTER, N.J.)",
            "entity_type": "ORGANIZATION",
            "description": "Trump's inner circle includes his allies and members of his Secret Service detail, who are central to the inquiry into former President Donald J. Trump's handling of classified material. This group is under increased pressure, especially at Mar-a-Lago in Florida and Bedminster, N.J., his summer residence.",
            "source_entities": [
                "TRUMP’S ALLIES",
                "SECRET SERVICE",
                "MAR-A-LAGO",
                "BEDMINSTER, N.J."
            ]
        },
        {
            "entity_name": "Robert Gottlieb (ROBERT D. MCFADDEN, MARIA)",
            "entity_type": "PERSON",
            "description": "Robert Gottlieb was an illustrious editor at Simon & Schuster, Alfred A. Knopf, and The New Yorker, shaping the works of many acclaimed writers. His death was confirmed by his wife, Maria, and detailed in an obituary written by Robert D. McFadden.",
            "source_entities": [
                "ROBERT GOTTLIEB",
                "ROBERT D. MCFADDEN",
                "MARIA"
            ]
        }
    ],
    "chunk-7ee79e0e87eb2dbb3ee85b4d72874a6b": [
        {
            "entity_name": "The New Yorker",
            "entity_type": "ORGANIZATION",
            "description": "A high-profile magazine in American journalism where Mr. Gottlieb was named the third editor, succeeding William Shawn who was the legendary editor for 35 years, and Harold Ross, the founding editor. S.I. Newhouse Jr., whose family owned the magazine, appointed Mr. Gottlieb to this position.",
            "source_entities": [
                "THE NEW YORKER",
                "WILLIAM SHAWN",
                "HAROLD ROSS",
                "S.I. NEWHOUSE JR."
            ]
        },
        {
            "entity_name": "Iran (Islamic Republic)",
            "entity_type": "GEO",
            "description": "Iran, also known as the Islamic Republic, is a country that has been in negotiations with the U.S., aiming to limit its nuclear program, release imprisoned Americans, and ease nuclear tensions. These negotiations are part of a larger U.S. effort to reduce the risk of a military confrontation.",
            "source_entities": [
                "IRAN",
                "ISLAMIC REPUBLIC",
                "U.S.",
                "BIDEN ADMINISTRATION"
            ]
        },
        {
            "entity_name": "Donald J. Trump's classified documents case",
            "entity_type": "EVENT",
            "description": "The case involving former President Donald J. Trump's classified documents, presided over by Judge Aileen M. Cannon. The case has raised concerns due to Judge Cannon's limited experience in criminal trials and perceived bias towards the former president. It includes the F.B.I.'s court-approved search of Trump's Florida home and club, Mar-a-Lago.",
            "source_entities": [
                "AILEEN M. CANNON",
                "DONALD J. TRUMP",
                "FEDERAL DISTRICT COURT",
                "F.B.I.",
                "JULIE O’SULLIVAN",
                "MAR-A-LAGO"
            ]
        },
        {
            "entity_name": "U.S.-Iran negotiations",
            "entity_type": "EVENT",
            "description": "The indirect talks between the U.S. and Iran, some occurring in the Gulf Arab state of Oman, aim to reach an informal, unwritten agreement known as a 'political cease-fire'. The goal is to limit Tehran's nuclear program and ease tensions, reducing the risk of further escalation and military confrontation.",
            "source_entities": [
                "U.S.",
                "IRAN",
                "BIDEN ADMINISTRATION",
                "OMAN",
                "POLITICAL CEASE-FIRE"
            ]
        }
    ],
    "chunk-6b02ccb5b162ba5966ff1a00ecf2952e": [
        {
            "entity_name": "Iranian Official (IRAN)",
            "entity_type": "PERSON",
            "description": "An Iranian official involved in the talks, confirming the broad outlines of the discussions, and representing Iran in its diplomatic relations with the United States.",
            "source_entities": [
                "IRANIAN OFFICIAL",
                "IRAN"
            ]
        },
        {
            "entity_name": "U.S. Official (UNITED STATES)",
            "entity_type": "PERSON",
            "description": "A U.S. official involved in the talks, confirming the broad outlines of the discussions, and representing the United States in its diplomatic relations with Iran. Also involved in discussions about the release of prisoners, calling it an urgent U.S. priority.",
            "source_entities": [
                "U.S. OFFICIAL",
                "UNITED STATES",
                "AMERICAN OFFICIALS"
            ]
        },
        {
            "entity_name": "Israeli Officials (ISRAEL)",
            "entity_type": "ORGANIZATION",
            "description": "Three senior Israeli officials confirmed the broad outlines of the talks, indicating their involvement in diplomatic discussions related to Israel.",
            "source_entities": [
                "ISRAELI OFFICIALS"
            ]
        },
        {
            "entity_name": "Gulf Arab State (OMAN)",
            "entity_type": "GEO",
            "description": "The Gulf Arab state, specifically Oman, is a region where indirect talks between the United States and Iran have occurred this spring.",
            "source_entities": [
                "GULF ARAB STATE",
                "OMAN"
            ]
        },
        {
            "entity_name": "Kyiv (UKRAINE)",
            "entity_type": "GEO",
            "description": "Kyiv, the capital of Ukraine, is where future U.S. assistance is being questioned due to spending caps set by the debt limit bill.",
            "source_entities": [
                "KYIV",
                "UKRAINE"
            ]
        },
        {
            "entity_name": "Golden Knights (LAS VEGAS)",
            "entity_type": "ORGANIZATION",
            "description": "The Golden Knights, a Las Vegas-based hockey team, became popular and won the Stanley Cup, making them the toast of the town.",
            "source_entities": [
                "GOLDEN KNIGHTS",
                "LAS VEGAS"
            ]
        },
        {
            "entity_name": "Southern Baptist Convention Annual Meeting",
            "entity_type": "EVENT",
            "description": "The annual meeting of the Southern Baptist Convention where delegates voted that only men can be pastors or elders in its churches.",
            "source_entities": [
                "SOUTHERN BAPTIST CONVENTION",
                "SOUTHERN BAPTIST CONVENTION ANNUAL MEETING"
            ]
        },
        {
            "entity_name": "Amazon Union Bid (COVENTRY)",
            "entity_type": "EVENT",
            "description": "The event of over 700 workers in Coventry, England, attempting to start the first recognized Amazon union, which was pulled back amid accusations of 'dirty tricks'.",
            "source_entities": [
                "AMAZON UNION BID",
                "COVENTRY",
                "AMAZON"
            ]
        }
    ]
}