{
  "chunk-b9f6d0598a02e762124c9ef925dacb45": {
    "tokens": 1200,
    "content": "NEW YORK, FRIDAY, JUNE 16, 2023  \n\n![](images/image_1.jpg)  \nBATTLEFRONT BREATHER Troops in a village retaken in Ukraine’s counteroffensive. Every step forward brings more danger. Page A8.  \n\n# Crude Scrawls Reveal Minds  \n\nBy THOMAS GIBBONS-NEFF VELYKA KOMYSHUVAKHA,  \nUkraine — Sweeping out the   \ndiscarded Russian rations, shat  \ntered glass and broken furniture   \nwas a daunting task. In the four and a half months  \n\nUKRAINE that Russian forces DISPATCH had occupied a village in eastern Ukraine, the troops had used the local bar as a small outpost, gutting it in the process.  \n\nThe physical destruction of the village watering hole in Velyka Komyshuvakha was only part of what the Russians left behind. In the bar’s back room was a twisted blueprint of the minds of some of the rank and file who make up the backbone of the Russian military. The soldiers had turned every wall into a handwritten message board of phrases, rhymes and expletives. “It doesn’t count as a war crime if you had fun,” one line  \n\nsaid, a smiley face drawn beneath. And in a rhyme on the same wall: “With a happy smile I will burn foreign villages.”  \n\nThe practice of defacing military positions and occupied homes with graffiti is not uncommon. During two decades of the United States’ muddled counterinsurgency wars in Iraq and Afghanistan, portable toilets strewn across the constellation of bases were a focal point of wartime musings. Many scribbles focused on genitalia, specific military units, bad officers and the desire to go home. Much of the writing in the bar in Velyka Komyshuvakha struck a decidedly different tone. The  \n\n# A Pack-Rat President Prized His Boxes of Papers  \n\nThis article is by Maggie Haberman, Alan Feuer and Michael S. Schmidt.  \n\nDuring  President  Donald  J. Trump’s years in the White House, his aides began to refer to the boxes full of papers and odds and ends he carted around with him almost everywhere as the “beautiful mind” material.  \n\nIt was a reference to the title of a book and movie depicting the life of John F. Nash Jr., the mathematician with schizophrenia played in the film by Russell Crowe, who covered his office with newspaper clippings, believing they held a Russian code he needed to crack.  \n\n# Longtime Habit Is Now  \n\n# Key to Federal Case on Documents  \n\nThe phrase had a specific connotation. The aides employed it to capture a type of organized chaos that Mr. Trump insisted on, the collection and transportation of a blizzard of newspapers and official documents that he kept close and that seemed to give him a sense of security. One former White House officialwbowas grantedane ymity while the materials were disorganized, Mr. Trump would notice if somebody  had  riffled  through them or they were not arranged in a particular way. It was, the person said, how “his mind worked.” The contents of those boxes — and Mr. Trump’s insistence on hanging onto them — are now at the heart of a 38-count indictment against the former president and his personal aide, Walt Nauta. Prosecutors  have  accused  Mr. Trump of obstructing their investigation into his possession of classified material after leaving office and putting national security seContinued on Page A14  \n\n![](images/image_2.jpg)  \n\nPutting the Gloves On At the New York Botanical Garden, works by the artist Ebony G. Patterson are on display. Page C10.  \n\n# Trump Allies Plan to Stifle Justice Dept.  \n\nLegal Rationale to End Its Independence  \n\n# SUPREME COURT RULES FOR TRIBES ON ADOPTION LAW  \n\nUPHOLDS SOVEREIGNTY  \n\nThis article is by Jonathan Swan, Charlie Savage and Maggie Haberman.  \n\nWhen  Donald  J.  Trump  responded to his latest indictment by promising to appoint a special prosecutor if he’s re-elected to “go after” President Biden and his family, he signaled that a second Trump term would fully jettison the post-Watergate norm of Justice Department independence. “I will appoint a real special prosecutor to go after the most corrupt president in the history of the United States of America, Joe Biden, and the entire Biden crime family,” Mr. Trump said at his golf club in Bedminster, N.J., on Tuesday night after his arraignment earlier that day in Miami. “I will totally obliterate the Deep State.” Mr. Trump’s message was that the Justice Department charged him only because he is Mr. Biden’s political opponent, so he would invert that supposed politicization. In reality, under Attorney General Merrick Garland, two Trump-appointed prosecutors are already investigating  Mr.  Biden’s  handling of classified documents and the financial dealings of his son, Hunter.  \n\nBut by suggesting the current prosecutors investigating the Bidens were not “real,” Mr. Trump appeared to be promising his supporters that he would appoint an ally who would bring charges against his political enemies regardless of the facts.  \n\nThe naked politics infusing Mr. Trump’s headline-generating threat  underscored  something significant. In his first term, Mr. Trump gradually ramped up pressure on the Justice Department, eroding its traditional independence from White House political control. He is now unabashedly saying he will throw that effort into overdrive if he returns to power.  \n\nMr. Trump’s promise fits into a larger movement on the right to gut the F.B.I., overhaul a Justice Department  that  conservatives claim  has  been  “weaponized” against them and abandon the norm — which many Republicans view as a facade — that the department",
    "chunk_order_index": 0,
    "full_doc_id": "doc-a90bb6da8b0cc308645ba4a4f91a4bcf"
  },
  "chunk-cd435d836780a2d3cdee29bbe6129dd5": {
    "tokens": 1200,
    "content": "Trump gradually ramped up pressure on the Justice Department, eroding its traditional independence from White House political control. He is now unabashedly saying he will throw that effort into overdrive if he returns to power.  \n\nMr. Trump’s promise fits into a larger movement on the right to gut the F.B.I., overhaul a Justice Department  that  conservatives claim  has  been  “weaponized” against them and abandon the norm — which many Republicans view as a facade — that the department  should  operate  independently from the president. Two of the most important figures in this effort work at the same Washington-based organization, the Center for Renewing America: Jeffrey B. Clark and Russell  T.  Vought.  During  the Trump presidency, Mr. Vought served as the director of the Office of Management and Budget. Mr. Clark, who oversaw the Justice Department’s  civil  and  environmental divisions, was the only senior official at the department who tried to help Mr. Trump overturn the 2020 election. Mr. Trump wanted to make Mr.  \n\nDecision Doesn’t Address Discrimination Claim by White Parents  \n\n# By ABBIE VANSICKLE  \n\nWASHINGTON  —  The  Supreme Court on Thursday upheld a 1978 law aimed at keeping Native American adoptees with their tribes and traditions, handing a victory to tribes that had argued that a blow to the law would upend the basic principles that have allowed them to govern themselves for years.  \n\nJustice  Amy  Coney  Barrett, writing for the majority, affirmed the power of Congress to make laws  about  Native  American tribes and child welfare. But the ruling did not resolve the question of whether the law, the Indian Child Welfare Act, discriminated against non-Native families based on race.  \n\nThe vote was 7 to 2, with Justices Clarence Thomas and Samuel A. Alito Jr. dissenting.  \n\nThe case pitted a white foster couple from Texas against five tribes and the Interior DepartBackers of the Native Americans’ case. The ruling was 7-2.  \n\n![](images/image_3.jpg)  \n\nment as they battled over the adoption of a Native American child.  \n\nUnder the act, preference is given to Native families, a policy that the couple said violated equal protection  principles  because  it hinges on placement based on race.  \n\nThe tribes have said that they are political entities, not racial groups. Doing away with that distinction, which underpins tribal rights, they argued, could imperil nearly every aspect of Indian law and policy, including measures that govern access to land, water and gambling.  \n\nThe  majority  dismissed  the equal protection argument, saying that no party in the case had Continued on Page A13  \n\nALLY ON BENCH Justice Neil M. Gorsuch has shown he is a fierce defender of tribal rights. PAGE A13 ELATED Indigenous leaders were thrilled that the Supreme Court upheld a 1978 law. PAGE A13  \n\n# New Drugs Can Treat Obesity, But Stigma Is a Different Story  \n\n# By GINA KOLATA  \n\n# As U.S.-China Ties Sour, Chinese Brands Seek Space From Beijing  \n\n# By ANA SWANSON  \n\nWASHINGTON — As it expanded internationally, Shein, the rapidly growing fast fashion app, progressively cut ties to its home country, China. It moved its headquarters to Singapore and de-registered its original company in Nanjing. It set up operations in Ireland and Indiana, and hired Washington lobbyists to highlight its U.S. expansion plans as it preoffering this year. Yet the clothing retailer can’t shake the focus on its ties with China. Along with other brands like the viral social app TikTok and shopping app Temu, Shein has become a target of American lawmakers in both parties. Politicians are accusing the company of making its clothes with fabric made with forced labor and calling it a tool of the Chinese Communist Party — claims that Shein denies.  \n\n# Going Offshore to Serve Foreign Markets  \n\n“No one should be fooled by Shein’s efforts to cover its tracks,” Senator Marco Rubio, Republican of Florida, wrote in a letter to other lawmakers this month. As relations between the United States and China turn increasingly rocky, some of China’s most entrepreneurial brands have taken steps to distance themselves from their home country. They have set up new factories and headquarters  outside  China  to serve the United States and other foreign  markets,  emphasized their foreign ties and scrubbed any mention of “China” from their corporate websites.  \n\nTikTok has set up headquarters Continued on Page A7  \n\nANN ARBOR, Mich. — Eileen Isotalo was always able to lose weight, but always gained it back. Now 66, her first diet was with Weight Watchers at age 14. She went on to try one diet after another and bought so many books on weight loss that she thinks she has more than the public library. In desperation, she finally went to a weight management clinic at the University of Michigan. She had  sleep  apnea  and  aching knees, but could not curb her appetite.  \n\n“It’s just this drive to eat,” said Ms. Isotalo, a retired interior design coordinator. “It’s almost like this panic feeling when you start craving food.”  \n\n“My mental shame was profound,” she said.  \n\nNow, though, since she started taking Wegovy, one of a new class of drugs for obesity that was prescribed by her doctor at the clinic, those cravings are gone. She has lost 50 pounds and jettisoned the dark clothes she wore to hide her body. Her obesity-related medical problems have vanished along with much of the stigma that caused her to retreat from family Continued on Page A19  \n\n![](images/image_4.jpg)  \n\nAn Exodus From Urban Malls Retailers have been fleeing San Francisco’s downtown, a problem occurring in",
    "chunk_order_index": 1,
    "full_doc_id": "doc-a90bb6da8b0cc308645ba4a4f91a4bcf"
  },
  "chunk-d4a463288c61eec11351e19c00ee0b57": {
    "tokens": 490,
    "content": "one of a new class of drugs for obesity that was prescribed by her doctor at the clinic, those cravings are gone. She has lost 50 pounds and jettisoned the dark clothes she wore to hide her body. Her obesity-related medical problems have vanished along with much of the stigma that caused her to retreat from family Continued on Page A19  \n\n![](images/image_4.jpg)  \n\nAn Exodus From Urban Malls Retailers have been fleeing San Francisco’s downtown, a problem occurring in cities across the country. PAGE B1 Rates Head Higher in Europe The central bank, signaling it wasn’t done, projected that inflation would remain too high for too long.  PAGE B  \n\n# INTERNATIONAL A4-11  \n\n# North Korea’s Nuclear Progress  \n\nThe country claims it has miniaturized its nuclear warheads and made its missiles harder to intercept. PAGE A6 U.K. Report Faults Ex-Leader Boris Johnson deliberately misled lawmakers about parties he held midpandemic, a committee said.  PAGE A10  \n\n# WEEKEND ARTS C1-16  \n\nExploring ‘Asteroid City’ The latest film from Wes Anderson is comic and often wry, but, like some of his other movies, has the soul of a tragedy, Manohla Dargis writes. PAGE C1 Where Par Goes to Die When playing the U.S. Open at the Los Angeles Country Club, navigating the gully-like barranca is crucial.  PAGE B8 Ugly, but With a Capital W The Mets were plagued by sloppy play on Wednesday, but a win over the Yankees was the perfect tonic. PAGE B9  \n\n![](images/image_5.jpg)  \n\n# NATIONAL A12-19  \n\n#  \n\nDivided into a patchwork of operators with competing interests, the power infrastructure makes it hard to build the long-distance lines needed to transport wind and solar nationwide. PAGE A12 Airman in Files Leak Indicted Jack Teixeira, who posted secret intelligence reports on a social media server, was charged with six counts of retaining and transmitting classified national defense information. PAGE A14  \n\nOPINION A22-23 David Brooks  \n\n![](images/image_6.jpg)  \n\n# OBITUARIES A20-21  \n\nActor Turned Politician A two-time Oscar winner, Glenda Jackson left acting to enter the British Parliament. Decades later, she returned to Broadway. She was 87. PAGE A20",
    "chunk_order_index": 2,
    "full_doc_id": "doc-a90bb6da8b0cc308645ba4a4f91a4bcf"
  }
}