{
    "chunk-6975851757c6446b3d125faf6e138fff": [
        {
            "entity_name": "Ukraine",
            "entity_type": "GEO",
            "description": "Ukraine is the country under attack by Russian forces and is receiving support from Western countries such as the United States, Germany, the Netherlands, and France. It is also mentioned as the location of a military funeral in Bucha and where Ukrainian forces are on the offensive against Russian troops.",
            "source_entities": [
                "UKRAINE",
                "KYIV",
                "BUCHA",
                "UKRAINIAN FORCES"
            ]
        },
        {
            "entity_name": "Russian Forces",
            "entity_type": "ORGANIZATION",
            "description": "Russian forces are the military units conducting attacks on Ukraine, as described in the article, and are considered an immediate threat by the United States.",
            "source_entities": [
                "RUSSIAN FORCES",
                "RUSSIA"
            ]
        },
        {
            "entity_name": "President Biden",
            "entity_type": "PERSON",
            "description": "President Biden is the President of the United States who declared the challenges for the country in the coming years, including outcompeting China and restraining Russia, and is working on speeding up delivery of missile systems to Ukraine.",
            "source_entities": [
                "PRESIDENT BIDEN",
                "BIDEN ADMINISTRATION"
            ]
        },
        {
            "entity_name": "People's Republic of China",
            "entity_type": "GEO",
            "description": "The People’s Republic of China is referred to as a country that poses a long-term challenge to the United States, with intentions to reshape the international order.",
            "source_entities": [
                "CHINA",
                "PEOPLE’S REPUBLIC OF CHINA"
            ]
        }
    ],
    "chunk-482a673ea465bed4ba268da1d3fef2fa": [
        {
            "entity_name": "Alex Jones (Infowars)",
            "entity_type": "PERSON",
            "description": "Alex Jones is the Infowars fabulist who claimed the Sandy Hook shooting was a government hoax and was ordered to pay nearly $1 billion in damages. He runs the platform Infowars, where he spread conspiracy theories and earns significant revenue.",
            "source_entities": [
                "ALEX JONES",
                "INFOWARS"
            ]
        },
        {
            "entity_name": "Robbie Parker (Emilie)",
            "entity_type": "PERSON",
            "description": "Robbie Parker is a plaintiff in the case against Alex Jones, who lost his daughter Emilie in the Sandy Hook shooting and was targeted by Jones. Emilie was a victim of the Sandy Hook shooting.",
            "source_entities": [
                "ROBBIE PARKER",
                "EMILIE"
            ]
        },
        {
            "entity_name": "Free Speech Systems",
            "entity_type": "ORGANIZATION",
            "description": "Free Speech Systems is the parent company of Infowars, which filed for bankruptcy, claimed by Alex Jones to be due to a debt of $54 million. It is associated with the operations of Alex Jones and Infowars.",
            "source_entities": [
                "FREE SPEECH SYSTEMS"
            ]
        },
        {
            "entity_name": "Eric Adams (Mayor Adams)",
            "entity_type": "PERSON",
            "description": "Eric Adams is the Mayor of New York City, whose Education Department reported to the state that the yeshiva was complying with a law requiring private schools. He is also referred to as Mayor Adams.",
            "source_entities": [
                "ERIC ADAMS",
                "MAYOR ADAMS"
            ]
        },
        {
            "entity_name": "Fat Daddy’s Pizzeria (Bistro Provenance)",
            "entity_type": "ORGANIZATION",
            "description": "Fat Daddy’s Pizzeria and Bistro Provenance are businesses owned by Chad Pritchard, facing staffing challenges in Provo, Utah. They are dealing with the effects of low unemployment in the area.",
            "source_entities": [
                "FAT DADDY’S PIZZERIA",
                "BISTRO PROVENANCE"
            ]
        },
        {
            "entity_name": "Hasidic Jewish boys’ school (Yeshiva)",
            "entity_type": "ORGANIZATION",
            "description": "The Hasidic Jewish boys’ school in Brooklyn is a private institution that has been found to be violating the law by failing to provide a basic education. It provides robust religious instruction in Yiddish but few lessons in other subjects. It is also referred to as a Yeshiva.",
            "source_entities": [
                "HASIDIC JEWISH BOYS’ SCHOOL",
                "YIDDISH"
            ]
        }
    ],
    "chunk-0b097e6b27b26671e36d5035451e7f67": [
        {
            "entity_name": "Hasidic Yeshivas",
            "entity_type": "ORGANIZATION",
            "description": "Private Hasidic yeshivas are schools across New York that provide religious instruction primarily in Yiddish with limited English, math, and no significant science, history, or social studies. This includes Yeshiva Mesivta Arugath Habosem, which was involved in a lawsuit concerning its compliance with education laws.",
            "source_entities": [
                "HASIDIC YESHIVAS",
                "YESHIVA MESIVTA ARUGATH HABOSEM"
            ]
        }
    ]
}