{
    "image_1": {
        "image_id": 1,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (3)/images/image_1.jpg",
        "caption": [],
        "footnote": [],
        "context": "They are waiting on the shingle––will you come and join the dance? Will you, wo’n’t you, ‘Will you walk a little faster?’\\* said a whiting to a snail, ‘There’s a porpoise close behind us, and he’s treading on my tail. See how eagerly the lobsters and the turtles all advance! ‘Oh, you sing,’ said the Gryphon. ‘I’ve forgotten the words.’ So they began solemnly dancing round and round Alice, every now and then treading on her toes when they passed too close, and waving their fore-paws to mark the time, while the Mock Turtle sang this, very slowly and sadly:––\\* the top of its voice. ‘Back to land again, and––that’s all the first figure,’ said the Mock Turtle, suddenly dropping his voice; and the two creatures, who had been jumping about like mad things all this time, sat down again very sadly and quietly, and looked at Alice. ‘It must be a very pretty dance,’ said Alice timidly. ‘Would you like to see a little of it?’ said the Mock Turtle. ‘Very much indeed,’ said Alice. ‘Come, let’s try the first figure!’ said the Mock Turtle to the Gryphon. ‘We can do it without lobsters, you know. Which shall sing?’ ",
        "chunk_order_index": 0,
        "chunk_id": "chunk-a62fbaeda9b389b7dce9810eed50a0f4",
        "description": "The image is a black-and-white illustration depicting a scene from 'Alice's Adventures in Wonderland.' It features Alice standing between two fantastical creatures: the Gryphon on her left and the Mock Turtle on her right. The Gryphon, a mythical beast with the body of a lion and the head and wings of an eagle, stands on its hind legs with its front paws raised, appearing to be in mid-conversation or dance. The Mock Turtle, a creature with the body of a turtle and the head of a calf, stands upright on its hind legs, also seemingly engaged in conversation or dance. Alice is dressed in a typical Victorian-era dress, with a calm and curious expression on her face. She appears to be interacting with the creatures, possibly participating in their dance. The background shows a rocky landscape with sparse vegetation, suggesting an outdoor setting. The overall atmosphere is whimsical and surreal, capturing the fantastical nature of the story.",
        "segmentation": true
    },
    "image_2": {
        "image_id": 2,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (3)/images/image_2.jpg",
        "caption": [],
        "footnote": [],
        "context": "‘Well, $I$ ‘That’s different from what $I$ used to say when I was a child,’ said the Gryphon. ‘ ’Tis the voice of the Lobster:\\* I heard him declare “You have baked me too brown, I must sugar my hair.” As a duck with its eyelids, so he with his nose Trims his belt and his buttons, and turns out his toes. When the sands are all dry, he is gay as a lark, And will talk in contemptuous tones of the Shark: But, when the tide rises and sharks are around, His voice has a timid and tremulous sound.’ like to hear her try and repeat something now. Tell her to begin.’ He looked at the Gryphon as if he thought it had some kind of authority over Alice. ‘Stand up and repeat “ ’Tis the voice of the sluggard,”’ said the Gryphon. ‘How the creatures order one about, and make one repeat lessons!’ thought Alice. ‘I might just as well be at school at once.’ However, she got up, and began to repeat it, but her head was so full of the LobsterQuadrille, that she hardly knew what she was saying; and the words came very queer indeed:–– ",
        "chunk_order_index": 2,
        "chunk_id": "chunk-b1a53b2e73d07b40e3863d2703647b31",
        "description": "The image is a black-and-white illustration of an anthropomorphic lobster standing upright. The lobster has a detailed, segmented body with a textured shell and long antennae. It appears to be dressed in human clothing, wearing a skirt and shoes, giving it a whimsical and surreal appearance. The background is minimalistic, featuring a simple chair and a framed picture on the wall, which adds to the surreal atmosphere of the scene. The lobster's posture is upright, and its claws are positioned as if it is holding something or gesturing. The overall mood of the image is whimsical and fantastical, reminiscent of illustrations from classic children's literature.",
        "segmentation": true
    },
    "image_3": {
        "image_id": 3,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (3)/images/image_3.jpg",
        "caption": [],
        "footnote": [],
        "context": "The first witness was the Hatter. He came in with a teacup in one hand and a piece ‘Call the first witness,’ said the King; and the White Rabbit blew three blasts on the trumpet, and called out ‘First witness!’ ‘Not yet, not yet!’ the Rabbit hastily interrupted. ‘There’s a great deal to come before that!’ ‘Consider your verdict,’ the King said to the jury. ‘The Queen of Hearts, she made some tarts,\\* All on a summer day: The Knave of Hearts, he stole those tarts And took them quite away!’ and then unrolled the parchment-scroll, and read as follows:–– and she went round the court and got behind him, and very soon found an opportunity of taking it away. She did it so quickly that the poor little juror (it was Bill, the Lizard) could not make out at all what had become of it; so, after hunting all about for it, he was obliged to write with one finger for the rest of the day; and this was of very little use, as it left no mark on the slate. ‘Herald, read the accusation!’ said the King. On this the White Rabbit blew three blasts on the trumpet, ",
        "chunk_order_index": 3,
        "chunk_id": "chunk-54c92c1dca7c692b79181a9d0cf7ceaf",
        "description": "The image is a black-and-white illustration of the White Rabbit from Lewis Carroll's 'Alice in Wonderland.' The rabbit is depicted standing upright, dressed in a formal outfit that includes a coat adorned with heart patterns. The coat has large buttons and a prominent bow tie. The rabbit holds a trumpet in one hand and a parchment-scroll in the other. The rabbit's expression appears hurried or anxious, as indicated by its wide eyes and slightly open mouth. The background is minimalistic, with no additional details, focusing attention on the rabbit's actions and attire. The overall atmosphere conveyed is one of urgency and formality, fitting the character's role in the story.",
        "segmentation": true
    },
    "image_4": {
        "image_id": 4,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (3)/images/image_4.jpg",
        "caption": [],
        "footnote": [],
        "context": "‘I didn’t!’ the March Hare interrupted in a great hurry. ‘I’m a poor man,’ the Hatter went on, ‘and most things twinkled after that––only the March Hare said— ‘Of course twinkling begins with a T!’ said the King sharply. ‘Do you take me for a dunce? Go on!’ ‘It began with the tea,’ the Hatter replied. ‘The twinkling of what?’ said the King. ‘I’m a poor man, your Majesty,’ the Hatter began, in a trembling voice, ‘and I hadn’t begun my tea––not above a week or so––and what with the bread-and-butter getting so thin–– and the twinkling of the tea—— $I$ grow at a reasonable pace,’ said the Dormouse: ‘not in that ridiculous fashion.’ And he got up very sulkily and crossed over to the other All this time the Queen had never left off staring at the Hatter, and, just as the Dormouse crossed the court, she said, to one of the offi- cers of the court, ‘Bring me the list of the singers in the last concert!’ on which the wretched Hatter trembled so, that he shook off both his shoes. ‘Give your evidence,’ the King repeated angrily, ‘or I’ll have you executed, whether you’re nervous or not.’ ",
        "chunk_order_index": 4,
        "chunk_id": "chunk-a8f4bc5db1ef379fc90dee1f77805543",
        "description": "The image is a black-and-white illustration of the Mad Hatter from Lewis Carroll's 'Alice in Wonderland.' The Mad Hatter is depicted wearing a large, tall top hat with the label 'In this style 10/6' written on it. He is dressed in a checkered outfit consisting of a jacket, vest, and pants, all featuring a pattern of squares. The Mad Hatter has a peculiar posture, with his body slightly bent forward and his head turned to the side, giving him a whimsical and eccentric appearance. His face is partially obscured by the brim of his hat, adding to his mysterious and chaotic demeanor. He is holding a piece of bread in one hand, which he appears to be examining closely. The background is minimalistic, with simple lines suggesting a ground or floor, and there are no other objects or characters present. The overall atmosphere conveyed by the image is one of absurdity and madness, fitting the character's reputation in the story.",
        "segmentation": true
    },
    "image_5": {
        "image_id": 5,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (3)/images/image_5.jpg",
        "caption": [],
        "footnote": [],
        "context": "The King looked anxiously at the White Rabbit, who said, in a low ‘Give your evidence,’ said the King. ‘Sha’n’t,’ said the cook. The next witness was the Duchess’s cook. She carried the pepper-box in her hand, and Alice guessed who it was, even before she got into the court, by the way the people near the door began sneezing all at once. ‘Call the next witness!’ said the King. and just take his head off outside,’ the Queen added to one of the officers; but the Hatter was out of sight before the officer could get to the door. all you know about it, you may stand down,’ con tinued the King. ‘I ca’n’t go no lower,’ said the Hatter: ‘I’m on the floor, as it is.’ ‘Then you may sit down,’ the King replied. Here the other guinea-pig cheered, and was suppressed. ‘Come, that finishes the guinea-pigs!’ thought Alice. ‘Now we shall get on better.’ ‘I’d rather finish my tea,’ said the Hatter, with an anxious look at the Queen, who was reading the list of singers. ‘You may go,’ said the King, and the Hatter hurriedly left the court, without even waiting to put his shoes on. ",
        "chunk_order_index": 5,
        "chunk_id": "chunk-1e359f07b748866a0ebb9748d42990b6",
        "description": "The image is a black-and-white illustration depicting a whimsical character, likely the Mad Hatter from 'Alice in Wonderland.' The character is wearing a large, oversized top hat that dominates the upper portion of the image. He is dressed in a coat with puffed sleeves and checkered pants, giving him a distinctive and eccentric appearance. In his left hand, he holds a teapot, and in his right hand, he carries a cup and saucer. His posture is dynamic, as if he is running or moving quickly, which adds to the chaotic and hurried atmosphere of the scene. The background is minimalistic, with only a few lines suggesting a path or ground, keeping the focus on the character. The overall mood conveyed by the image is one of absurdity and urgency, fitting the whimsical and nonsensical nature of the Mad Hatter.",
        "segmentation": true
    },
    "image_6": {
        "image_id": 6,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (3)/images/image_6.jpg",
        "caption": [
            "CHAPTER XII "
        ],
        "footnote": [],
        "context": "‘Oh, I beg your pardon!’ she exclaimed in a tone of great dismay, and began picking them up again as quickly as she ‘Here!’ cried Alice, quite forgetting in the flurry of the moment how large she had grown in the last few minutes, and she jumped up in such a hurry that she tipped over the jurybox with the edge of her skirt,\\* upsetting all the jurymen on to the heads of the crowd below, and there they lay sprawling about, reminding her very much of a globe of gold-fish she had accidentally upset the week before. alice’s evidence\\* settled down again, the cook had disappeared. ‘Never mind!’ said the King, with an air of great relief. ‘Call the next witness.’ And, he added, in an under-tone to the Queen, ‘Really, my dear, you must cross-examine the next witness. It quite makes my forehead ache!’ Alice watched the White Rabbit as he fumbled over the list, feeling very curious to see what the next witness would be like, ‘––for they haven’t got much evidence yet,’ she said to herself. Imagine her surprise, when the White Rabbit read out, at the top of his shrill little voice, the name ‘Alice!’ ",
        "chunk_order_index": 5,
        "chunk_id": "chunk-1e359f07b748866a0ebb9748d42990b6",
        "description": "The image is a black-and-white illustration depicting a scene from the story of Alice in Wonderland. Alice, a young girl with long hair, is shown sitting on a ledge or platform. She appears to be in a state of distress or surprise, as indicated by her posture and expression. Surrounding her are various small animals, including mice, birds, and possibly other creatures, that seem to be scattered and disoriented. The animals appear to be falling or tumbling around Alice, suggesting a chaotic and unexpected event. The background includes architectural elements such as columns and a railing, indicating an indoor setting, possibly a courtroom or a similar formal environment. The overall atmosphere conveys a sense of confusion and disorder, as if Alice has accidentally caused a commotion among the animals.",
        "segmentation": true
    },
    "image_7": {
        "image_id": 7,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (3)/images/image_7.jpg",
        "caption": [],
        "footnote": [],
        "context": "‘Then the words don’t fit you,’  ‘Never!’ said the Queen, furiously, throwing an inkstand at the Lizard as she spoke. (The unfortunate little Bill had left off writing on his slate with one finger, as he found it made no mark; but he now hastily began again, using the ink, that was trickling down his face, as long as it lasted.) ‘Why, there they are?’ said the King triumphantly, pointing to the tarts on the table. ‘Nothing can be clearer than that. Then again––“before she had this fit”––you never had fits, my dear, I think?’ he said to the Queen. The Knave shook his head sadly. ‘Do I look like it?’ he said. (Which he certainly did not, being made entirely of cardboard.) ‘All right, so far,’ said the King; and he went on muttering over the verses to himself: ‘“We know it to be true”–– that’s the jury, of course––“If she should push the matter on” ––that must be the Queen––“What would become of you?”–– What, indeed!–– $^{\\epsilon}I$ gave her one, they gave him two”––why, that must be what he did with the tarts, you know—— ‘But it goes on “they all returned from him to you,”’ said Alice. ",
        "chunk_order_index": 7,
        "chunk_id": "chunk-b632a3481be76105afd423a436691ace",
        "description": "The image is a black-and-white illustration depicting a scene from 'Alice in Wonderland.' It features the King of Hearts, who is seated on a throne and reading from a scroll. The King is dressed in regal attire with a crown adorned with hearts and a long beard. He has a surprised or confused expression on his face. In front of him, there is a table with a plate of tarts, which are heart-shaped. To the left of the King, there is a small figure, possibly the Knave of Hearts, who is standing and looking up at the King. The Knave appears to be made entirely of cardboard, as indicated by the context. The background includes various heart motifs, adding to the whimsical and fantastical atmosphere of the scene. The overall mood conveyed is one of confusion and absurdity, typical of the narrative style of 'Alice in Wonderland.'",
        "segmentation": true
    },
    "image_8": {
        "image_id": 8,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (3)/images/image_8.jpg",
        "caption": [],
        "footnote": [],
        "context": "‘Who cares ‘Off with her head!’ the Queen shouted at the top of her voice. Nobody moved. ‘Hold your tongue!’ said the Queen, turning purple. ‘I wo’n’t!’ said Alice. ‘Stuff and nonsense!’ said Alice loudly. ‘The idea of having the sentence first!’ ‘No, no!’ said the Queen. ‘Sentence first––verdict afterwards.’ ‘It’s a pun!’ the King added in an angry tone, and everybody laughed. ‘Let the jury consider their verdict,’ the King said, for about the twentieth time that day. ‘Then the words don’t fit you,’ said the King, looking round the court with a smile. There was a dead silence. from him to you,”’ said Alice.  ‘Why, there they are?’ said the King triumphantly, pointing to the tarts on the table. ‘Nothing can be clearer than that. Then again––“before she had this fit”––you never had fits, my dear, I think?’ he said to the Queen. ‘Never!’ said the Queen, furiously, throwing an inkstand at the Lizard as she spoke. (The unfortunate little Bill had left off writing on his slate with one finger, as he found it made no mark; but he now hastily began again, using the ink, that was trickling down his face, as long as it lasted.) ",
        "chunk_order_index": 7,
        "chunk_id": "chunk-b632a3481be76105afd423a436691ace",
        "description": "The image is a black-and-white illustration from the classic children's literature 'Alice in Wonderland'. It depicts a scene where Alice, a young girl with long hair tied back, is standing on the right side of the image. She is wearing a dress and appears to be speaking or arguing. On the left side, there is a large ornate urn or vase with intricate designs, possibly representing the Queen's throne. In front of the urn, there is a large plate filled with what appear to be tarts or pastries. The background is minimalistic, focusing on the characters and the objects on the table. The overall atmosphere conveys a sense of tension and absurdity, typical of the whimsical and nonsensical world of Wonderland.",
        "segmentation": true
    },
    "image_9": {
        "image_id": 9,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (3)/images/image_9.jpg",
        "caption": [],
        "footnote": [],
        "context": "But her ‘Oh, I’ve had such a curious dream!’\\* said Alice. And she told her sister, as well as she could remember them, all these strange Adventures of hers that you have just been reading about; and, when she had finished, her sister kissed her, and said ‘It was a curious dream, dear, certainly; but now run in to your tea: it’s getting late.’ So Alice got up and ran off, thinking while she ran, as well she might, what a wonderful dream it had been. ‘Wake up, Alice dear!’ said her sister. ‘Why, what a long sleep you’ve had!’  shouted at the top of her voice. Nobody moved. ‘Who cares for you?’ said Alice (she had grown to her full size by this time). ‘You’re nothing but a pack of cards!’ At this the whole pack rose up into the air, and came flying down upon her; she gave a little scream, half of fright and half of anger, and tried to beat them off, and found herself lying on the bank, with her head in the lap of her sister, who was gently brushing away some dead leaves that had fluttered down from the trees upon her face. ",
        "chunk_order_index": 7,
        "chunk_id": "chunk-b632a3481be76105afd423a436691ace",
        "description": "The image is a black-and-white illustration depicting a scene from the story of Alice in Wonderland. The main character, Alice, is shown running away from a cascade of playing cards that are falling on her. She is dressed in a long, flowing dress and has long hair. Her posture suggests she is in motion, possibly fleeing or trying to avoid the cards. The cards are depicted in various orientations, some upright and others tilted, creating a sense of chaos and urgency. At the bottom of the image, there are several animals, including a rabbit and a frog, which appear to be scattered and disoriented. The overall atmosphere of the image conveys a sense of panic and confusion, as if Alice is being chased by the flying cards. The detailed line work and shading give the illustration a classic, timeless feel.",
        "segmentation": true
    },
    "image_10": {
        "image_id": 10,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (3)/images/image_10.jpg",
        "caption": [],
        "footnote": [],
        "context": "(leaves 3.W. $\\mathrm{{^Q}}.$ to $\\mathrm{{^Q}}.$ B’s 5th (becomes sheep) . . . 178 6. Alice to Q’s 7th (forest) . 207 7. W. Kt. takes R. Kt . . . 211 8. Alice to Q’s 8th (coron 4. Alice to Q’s 5th (shop, river, shop) . . 178 5. Alice to Q’s 6th (Humpty Dumpty) . . . $\\mathrm{{\\bfI}}84\\$ 3. Alice meets W. Q. (with shawl) . . . 173 149 2.W. Q. to Q. B’s 4th (after shawl) . . page White Pawn (Alice) to play, and win in eleven moves  THROUGH THE LOOKING-GLASS and what alice found there sobs. Lastly, she pictured to herself how this same little sister of hers would, in the after-time, be herself a grown woman; and how she would keep, through all her riper years, the simple and loving heart of her childhood; and how she would gather about her other little children, and make their eyes bright and eager with many a strange tale, perhaps even with the dream of Wonderland of long ago; and how she would feel with all their simple sorrows, and find a pleasure in all their simple joys, remembering her own child-life, and the happy summer days. ",
        "chunk_order_index": 8,
        "chunk_id": "chunk-bf199d79f5f3d928e941082863da79f6",
        "description": "The image is a black-and-white illustration depicting a scene from the story 'Through the Looking-Glass and What Alice Found There.' The main characters are Alice and the White Knight. Alice, with her long hair and dress, stands on the right side of the image, looking up at the White Knight. The White Knight is mounted on a horse and is dressed in full armor, complete with a helmet and shield. He appears to be in mid-conversation with Alice, holding a sword and a lance. The background features a dense forest with tall trees and a cave-like entrance. The overall atmosphere is whimsical and fantastical, capturing the surreal and dreamlike quality of the story. The detailed line work and shading give depth to the scene, highlighting the intricate details of the characters' clothing and the surrounding environment.",
        "segmentation": true
    },
    "image_11": {
        "image_id": 11,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (3)/images/image_11.jpg",
        "caption": [
            "WHITE. "
        ],
        "footnote": [],
        "context": "(leaves egg on shelf ). . 183 5.W. $\\mathrm{{^Q}}.$ 3.W. $\\mathrm{{^Q}}.$ to $\\mathrm{{^Q}}.$ B’s 5th (becomes sheep) . . . 178 6. Alice to Q’s 7th (forest) . 207 7. W. Kt. takes R. Kt . . . 211 8. Alice to Q’s 8th (coron 4. Alice to Q’s 5th (shop, river, shop) . . 178 5. Alice to Q’s 6th (Humpty Dumpty) . . . $\\mathrm{{\\bfI}}84\\$ 3. Alice meets W. Q. (with shawl) . . . 173 149 2.W. Q. to Q. B’s 4th (after shawl) . . page White Pawn (Alice) to play, and win in eleven moves same little sister of hers would, in the after-time, be herself a grown woman; and how she would keep, through all her riper years, the simple and loving heart of her childhood; and how she would gather about her other little children, and make their eyes bright and eager with many a strange tale, perhaps even with the dream of Wonderland of long ago; and how she would feel with all their simple sorrows, and find a pleasure in all their simple joys, remembering her own child-life, and the happy summer days.  THROUGH THE LOOKING-GLASS and what alice found there ",
        "chunk_order_index": 8,
        "chunk_id": "chunk-bf199d79f5f3d928e941082863da79f6",
        "description": "The image is a chessboard diagram with pieces positioned on it. The board is labeled 'WHITE' at the bottom and 'RED.' at the top, indicating the sides of the players. On the white side, there is a king located on the square d1, a queen on e1, a rook on f1, and a knight on g1. On the red side, there is a king on e5, a queen on c7, and a knight on h8. The positions suggest a strategic game setup where both sides have key pieces in play, ready for potential moves.",
        "segmentation": false
    },
    "image_12": {
        "image_id": 12,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (3)/images/image_12.jpg",
        "caption": [],
        "footnote": [],
        "context": "The way Dinah washed her children’s faces was this: first she held the poor thing down by its ear with one paw, and then with the other paw she rubbed its face all One thing was certain, that the white kitten had had nothing to do with it\\*––it was the black kitten’s fault entirely. For the white kitten had been having its face washed by the old cat for the last quarter of an hour (and bearing it pretty well, considering): so you see that it couldn $\\ '_{t}$ have had any hand in the mischief. looking-glass house CHAPTER I little ones, for whom it was written, go without it, I am selling it at a price which is, to me, much the same thing as giving it away.  Christmas, 1896 This page intentionally left blank CONTENTS i. looking-glass house page 123 ii. the garden of live flowers 137 iii. looking-glass insects 148 iv. tweedledum and tweedledee 159 v. wool and water 173 vi. humpty dumpty 185 vii. the lion and the unicorn 198 viii. ‘it’s my own invention’ 209 ix. queen alice 224 x. shaking 240 xi. waking 241 xii. which dreamed it? 242 This page intentionally left blank ",
        "chunk_order_index": 9,
        "chunk_id": "chunk-12208cd318aeec0b56eae5f97fe224ed",
        "description": "The image is a black-and-white illustration depicting a black kitten playing with a ball of yarn. The kitten appears to be in the midst of an energetic activity, with its paws entangled in the yarn. The yarn is unraveled and spread out around the kitten, creating a sense of movement and playfulness. The kitten's posture suggests it is actively engaged with the yarn, possibly pulling or pawing at it. The background is simple and uncluttered, focusing attention on the kitten and the yarn. The overall atmosphere conveyed by the image is one of playful mischief and curiosity, typical of a kitten exploring its surroundings.",
        "segmentation": true
    },
    "image_13": {
        "image_id": 13,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (3)/images/image_13.jpg",
        "caption": [],
        "footnote": [],
        "context": "‘Do you know what to-morrow is,\\* Kitty?’ Alice began. ‘You’d have guessed if you’d been up in the window with me ––only Dinah was making you tidy, so you couldn’t. I was watching the boys getting in sticks for the bonfire––and it wants plenty of sticks, Kitty! Only it got so cold, and it snowed so, they had to leave off. Never mind, Kitty, we’ll go and see the bonfire to-morrow.’ Here Alice wound two or three turns of the worsted round the kitten’s neck, just to see how it would look: this led to a scramble, in which the  looking reproachfully at the old cat, and speaking in as cross a voice as she could manage––and then she scrambled back into the arm-chair, taking the kitten and the worsted with her, and began winding up the ball again. But she didn’t get on very fast, as she was talking all the time, sometimes to the kitten, and sometimes to herself. Kitty sat very demurely on her knee, pretending to watch the progress of the winding, and now and then putting out one paw and gently touching the ball, as if it would be glad to help if it might. ",
        "chunk_order_index": 10,
        "chunk_id": "chunk-ff9cc3f540b74d8ef05e69933e89a08f",
        "description": "The image is a black-and-white illustration depicting a young girl sitting in an ornate armchair. The girl has long, curly hair and is dressed in a light-colored dress with puffed sleeves. She is holding a ball of yarn in her left hand and appears to be winding it around her right hand. A small kitten is perched on her lap, looking up at her with a curious expression. The girl's posture is relaxed, and she seems to be engaged in the activity of winding the yarn. The armchair is detailed with intricate carvings and tufted upholstery, adding to the overall vintage feel of the illustration. The background is filled with cross-hatching, giving the image a textured appearance. The scene conveys a sense of calm and domesticity, with the girl and kitten sharing a quiet moment together.",
        "segmentation": true
    },
    "image_14": {
        "image_id": 14,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (3)/images/image_14.jpg",
        "caption": [
            "through——’ She was up on the chimney-piece while she said this, though she hardly knew how she had got there. And certainly the glass was beginning to melt away, just like a bright silvery mist. "
        ],
        "footnote": [],
        "context": "Then she began looking about, and noticed that what could be seen from the old room was quite  In another moment Alice was through the glass, and had jumped lightly down into the Looking-glass room. The very first thing she did was to look whether there was a fire in the fireplace, and she was quite pleased to find that there was a real one, blazing away as brightly as the one she had left behind. ‘So I shall be as warm here as I was in the old room,’ thought Alice: ‘warmer, in fact, because there’ll be no one the door of our drawingroom wide open: and it’s very like our passage as far as you can see, only you know it may be quite different on beyond. Oh, Kitty, how nice it would be if we could only get through into Looking-glass House! I’m sure it’s got, oh! such beautiful things in it! Let’s pretend there’s a way of getting through into it, somehow, Kitty. Let’s pretend the glass has got all soft like gauze, so that we can get through. Why, it’s turning into a sort of mist now, I declare! It’ll be easy enough to get ",
        "chunk_order_index": 11,
        "chunk_id": "chunk-e387d10fe02ad02b67142fd4aa36f77c",
        "description": "The image is a black-and-white illustration depicting a scene from 'Alice in Wonderland.' Alice, with long hair and dressed in a dress with puffed sleeves, is perched on a mantelpiece. She appears to be reaching out towards a glass pane that seems to be melting away, creating a bright silvery mist. To her left, there is a vase with flowers inside it, and to her right, there is an ornate clock. The mantelpiece is decorated with intricate designs, and below it, there is a fireplace. The overall atmosphere of the image conveys a sense of wonder and magic as Alice transitions from one world to another.",
        "segmentation": true
    },
    "image_15": {
        "image_id": 15,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (3)/images/image_15.jpg",
        "caption": [
            "here to scold me away from the fire. Oh, what fun it’ll be, when they see me through the glass in here, and ca’n’t get at me!’ "
        ],
        "footnote": [],
        "context": "‘They don’t keep this room so tidy as the other,’ Alice thought to herself, as she noticed several of the chessmen Then she began looking about, and noticed that what could be seen from the old room was quite common and uninteresting, but that all the rest was as different as possible. For instance, the pictures on the wall next the fire seemed to be all alive, and the very clock on the chimney-piece (you know you can only see the back of it in the Lookingglass) had got the face of a little old man, and grinned at her. through. Why, it’s turning into a sort of mist now, I declare! It’ll be easy enough to get  In another moment Alice was through the glass, and had jumped lightly down into the Looking-glass room. The very first thing she did was to look whether there was a fire in the fireplace, and she was quite pleased to find that there was a real one, blazing away as brightly as the one she had left behind. ‘So I shall be as warm here as I was in the old room,’ thought Alice: ‘warmer, in fact, because there’ll be no one ",
        "chunk_order_index": 11,
        "chunk_id": "chunk-e387d10fe02ad02b67142fd4aa36f77c",
        "description": "The image is a black-and-white illustration depicting a scene from 'Alice in Wonderland.' Alice, a young girl with long hair tied back, is standing on a mantelpiece. She appears to be observing something with curiosity and perhaps a touch of apprehension. To her left, there is a clock under a glass dome; the clock face has been anthropomorphized with the features of an old man, giving it a whimsical and somewhat eerie appearance. To her right, there is another object under a glass dome, which looks like a vase or urn with floral designs. The background includes a mirror reflecting part of the room, adding to the surreal atmosphere. The overall mood of the image conveys a sense of wonder and mystery, as Alice seems to be exploring a strange and fantastical world.",
        "segmentation": true
    },
    "image_16": {
        "image_id": 16,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (3)/images/image_16.jpg",
        "caption": [],
        "footnote": [],
        "context": "Here something began squeaking on the table behind Alice, and made her turn her head just in time to see one of the ‘Here are the Red King and the Red Queen,’ Alice said (in a whisper, for fear of frightening them), ‘and there are the White King and the White Queen\\* sitting on the edge of the shovel––and here are two Castles walking arm in arm––I don’t think they can hear me,’ she went on, as she put her head closer down, ‘and I’m nearly sure they ca’n’t see me. I feel somehow as if I was getting invisible— on the wall next the fire seemed to be all alive, and the very clock on the chimney-piece (you know you can only see the back of it in the Lookingglass) had got the face of a little old man, and grinned at her. ‘They don’t keep this room so tidy as the other,’ Alice thought to herself, as she noticed several of the chessmen down in the hearth among the cinders; but in another moment, with a little ‘Oh!’ of surprise, she was down on her hands and knees watching them. The chessmen were walking about, two and two! ",
        "chunk_order_index": 12,
        "chunk_id": "chunk-33643551de411c3afb7ba73361f6e32e",
        "description": "The image is a black-and-white illustration depicting a whimsical scene from Lewis Carroll's 'Through the Looking-Glass'. The central figure is Alice, who stands in the middle of the scene, observing various chess pieces that are anthropomorphized and appear to be walking about. On the left side, there is a large White King with a crown, holding a scepter, and next to him is a White Queen, both dressed in elaborate robes. To the right, there is a Red King and a Red Queen, also dressed in regal attire. In front of them, two castle pieces are depicted as human figures, walking arm in arm. The background shows a room with a fireplace, where some of the chess pieces have fallen into the hearth among the cinders. The overall atmosphere is one of fantasy and surrealism, capturing the imaginative and dreamlike quality of the story. The illustration is detailed and intricate, with each character and object clearly defined.",
        "segmentation": true
    },
    "image_17": {
        "image_id": 17,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (3)/images/image_17.jpg",
        "caption": [],
        "footnote": [],
        "context": "The King immediately fell flat on his back, and lay perfectly still; and Alice was a little alarmed at what she had done, and went round the room to see if she could ‘Oh! please don’t make such faces, my dear!’ she cried out, quite forgetting that the King couldn’t hear her. ‘You make me laugh so that I can hardly hold you! And don’t keep your mouth so wide open! All the ashes will get into it––there, now I think you’re tidy enough!’ she added, as she smoothed his hair, and set him upon the table near the Queen.  away; but, before she put him on the table, she thought she might as well dust him a little, he was so covered with ashes. She said afterwards that she had never seen in all her life such a face as the King made, when he found himself held in the air by an invisible hand, and being dusted: he was far too much astonished to cry out, but his eyes and his mouth went on getting larger and larger, and rounder and rounder, till her hand shook so with laughing that she nearly let him drop upon the floor. ",
        "chunk_order_index": 12,
        "chunk_id": "chunk-33643551de411c3afb7ba73361f6e32e",
        "description": "The image is a black-and-white illustration depicting a scene from a story. It shows a small, plump king wearing a crown and holding a scepter. The king appears to be in distress or surprise, with his mouth wide open and eyes bulging. He is being held up by a large hand that seems to belong to an unseen person. The king's body is wrapped in bandages, suggesting he has been injured or is being treated. The background is minimalistic, with no additional details, focusing the viewer's attention on the interaction between the hand and the king. The overall atmosphere conveyed is one of surprise and perhaps a touch of humor, as the king's exaggerated expression adds a comedic element to the scene.",
        "segmentation": true
    },
    "image_18": {
        "image_id": 18,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (3)/images/image_18.jpg",
        "caption": [],
        "footnote": [],
        "context": "She puzzled over this sevot yhtils eht dna ,gillirb sawT‘ :ebaw eht ni elbmig dna eryg diD ,sevogorob eht erew ysmim llA .ebargtuo shtar emom eht dnA .YKCOWREBBAJ\\* It was like this. There was a book lying near Alice on the table, and while she sat watching the White King (for she was still a little anxious about him, and had the ink all ready to throw over him, in case he fainted again), she turned over the leaves, to find some part that she could read, ‘––for it’s all in some language I don’t know,’ she said to herself. over his shoulder, and began writing for him. The poor King looked puzzled and unhappy, and struggled with the pencil for some time without saying anything; but Alice was too strong for him, and at last he panted out ‘My dear! I really must get a thinner pencil. I ca’n’t manage this one a bit: it writes all manner of things that I don’t intend— ‘What manner of things?’ said the Queen, looking over the book (in which Alice had put ‘The White Knight is sliding down the poker. He balances very badly’). ‘That’s not a memorandum of your feelings!’ ",
        "chunk_order_index": 13,
        "chunk_id": "chunk-7ec381863a9fa4f6635c9b9344a84c84",
        "description": "The image is a black-and-white cartoon illustration of a character that appears to be a stylized, exaggerated figure. The character has a large, round head with a prominent nose and a small mouth, giving it a somewhat comical appearance. It has short, spiky hair and is dressed in a suit with a bow tie. The character is depicted in a dynamic pose, as if it is walking or moving forward with one leg raised and the other pushing off the ground. The character's arms are bent at the elbows, with one hand holding what looks like a cane or stick. The overall style is sketchy and expressive, with heavy use of cross-hatching to create shading and depth. The background is minimal, consisting of simple lines that suggest a surface or ground on which the character is walking. The artist's signature, 'YORUBELLEZ,' is visible at the bottom right of the image.",
        "segmentation": false
    },
    "image_19": {
        "image_id": 19,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (3)/images/image_19.jpg",
        "caption": [],
        "footnote": [],
        "context": "‘It seems very pretty,’ she said when she had finished it, ‘but it’s rather hard to understand!’ (You see she didn’t like to confess, even to herself, that she One, two! One, two! And through and through The vorpal blade went snicker-snack! He left it dead, and with its head He went galumphing back. ‘And, hast thou slain the Jabberwock? Come to my arms, my beamish boy! O frabjous day! Callooh! Callay!’ He chortled in his joy. ’Twas brillig, and the slithy toves Did gyre and gimble in the wabe: All mimsy were the borogoves, And the mome raths outgrabe. poem that Alice read.’ JABBERWOCKY. ’Twas brillig, and the slithy toves Did gyre and gimble in the wabe: All mimsy were the borogoves, And the mome raths outgrabe. ‘Beware the Jabberwock, my son! The jaws that bite, the claws that catch! Beware the Jubjub bird, and shun The frumious Bandersnatch!’ He took his vorpal sword in hand: Long time the manxome foe he sought–– So rested he by the Tumtum tree, And stood awhile in thought. And, as in uffish thought he stood, The Jabberwock, with eyes of flame, Came whiffling through the tulgey wood, And burbled as it came! ",
        "chunk_order_index": 13,
        "chunk_id": "chunk-7ec381863a9fa4f6635c9b9344a84c84",
        "description": "The image is a black-and-white illustration depicting a fantastical scene from the poem 'Jabberwocky'. The central figure is a monstrous creature resembling a dragon, with large bat-like wings, a long neck, and a gaping mouth filled with sharp teeth. The creature has a scaly body, clawed hands, and a tail. It appears to be in motion, possibly attacking or lunging forward. In front of the creature, there is a small, human-like figure dressed in armor, holding a sword and seemingly ready to fight. The background shows a dense forest with tall trees, adding to the sense of danger and fantasy. The overall atmosphere is tense and dramatic, capturing the intensity of the battle described in the poem.",
        "segmentation": true
    },
    "image_20": {
        "image_id": 20,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (3)/images/image_20.jpg",
        "caption": [],
        "footnote": [],
        "context": "‘It isn’t manners for us to begin, you know,’ ‘As well as you can,’ said the Tiger-lily. ‘And a great deal louder.’  Alice was so astonished that she couldn’t speak for a minute: it quite seemed to take her breath away. At length, as the Tiger-lily only went on waving about, she spoke again, in a timid voice––almost in a whisper. ‘And can all the flowers talk?’ ‘We can talk,’ said the Tiger-lily, ‘when there’s anybody worth talking to.’ ‘O Tiger-lily!’\\* said Alice, addressing herself to one that was waving gracefully about in the wind, ‘I wish you could talk!’  all went on well, and she was just saying ‘I really shall do it this time——’ when the path gave a sudden twist and shook itself (as she described it afterwards), and the next moment she found herself actually walking in at the door. ‘Oh, it’s too bad!’ she cried. ‘I never saw such a house for getting in the way! Never!’ However, there was the hill full in sight, so there was nothing to be done but start again. This time she came upon a large flower-bed, with a border of daisies, and a willow-tree growing in the middle. ",
        "chunk_order_index": 14,
        "chunk_id": "chunk-9dcda13e09fc0f67a6b113f8020884a6",
        "description": "The image is a black and white illustration depicting a scene from the story of Alice in Wonderland. Alice, a young girl with long hair tied back, is standing in a garden filled with various flowers. She is dressed in a dress with a pinafore and appears to be engaged in conversation with the flowers. To her left, there is a large Tiger-lily with its petals spread out, and it seems to be speaking to Alice. The Tiger-lily has a human-like expression, adding to the whimsical nature of the scene. Other flowers, including roses and daisies, are also present in the garden, some of which appear to have faces and are participating in the conversation. The background shows more foliage and plants, creating a dense and lush garden setting. The overall atmosphere is one of fantasy and wonder, as Alice interacts with the talking flowers in this surreal environment.",
        "segmentation": true
    },
    "image_21": {
        "image_id": 21,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (3)/images/image_21.jpg",
        "caption": [],
        "footnote": [],
        "context": "Alice wondered a little at this, but she was too much ‘I don’t know what you mean by your way,’ said the Queen: ‘all the ways about here belong to me––but why did you come out here at all?’ she added in a kinder tone. ‘Curtsey while you’re thinking what to say. It saves time.’ Alice attended to all these directions, and explained, as well as she could, that she had lost her way. ‘Where do you come from?’ said the Red Queen. ‘And where are you going? Look up, speak nicely, and don’t twiddle your fingers all the time.’  off at once towards the Red Queen. To her surprise she lost sight of her in a moment, and found herself walking in at the front-door again. A little provoked, she drew back, and, after looking everywhere for the Queen (whom she spied out at last, a long way off), she thought she would try the plan, this time, of walking in the opposite direction. It succeeded beautifully. She had not been walking a minute before she found herself face to face with the Red Queen,\\* and full in sight of the hill she had been so long aiming at. ",
        "chunk_order_index": 15,
        "chunk_id": "chunk-475071ce8872bf0ddc0aebb7957275c3",
        "description": "The image is a black-and-white illustration depicting a scene from the story of Alice in Wonderland. On the left side, there is a young girl with long hair, dressed in a dress with a pinafore, standing and facing a peculiar character on the right. The character appears to be a queen, as indicated by her crown and regal attire. She is pointing at Alice with one hand while holding a scepter in the other. The queen's posture is commanding, and she seems to be speaking or giving instructions to Alice. Alice looks up at the queen with a slightly puzzled expression, as if trying to understand what the queen is saying. The background shows a forest setting with tall, bare trees, adding to the whimsical and surreal atmosphere of the scene. The overall mood conveyed is one of curiosity and slight tension, as Alice interacts with the eccentric queen.",
        "segmentation": true
    },
    "image_22": {
        "image_id": 22,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (3)/images/image_22.jpg",
        "caption": [],
        "footnote": [],
        "context": "‘I declare it’s marked out just like a large chess-board!’ Alice said at last. ‘There ought to be some men moving about somewhere––and so there are!’ she added in a tone of delight, and her heart began to beat quick with excitement as she went on. ‘It’s a great huge game of chess that’s being played––all over the world––if this is the world at all, you know. Oh, what fun it is! How I wish I was one of them! I wouldn’t mind being a Pawn, if only I might join––though of course I should like to be a Queen,  that would be as sensible as a dictionary!’ Alice curtseyed again, as she was afraid from the Queen’s tone that she was a little offended: and they walked on in silence till they got to the top of the little hill.\\* For some minutes Alice stood without speaking, looking out in all directions over the country––and a most curious country it was. There were a number of tiny little brooks running straight across it from side to side, and the ground between was divided up into squares by a number of little green hedges, that reached from brook to brook. ",
        "chunk_order_index": 16,
        "chunk_id": "chunk-55e42f3334ca67ba934b0c1174b0f69b",
        "description": "The image is a black-and-white illustration depicting a whimsical and surreal landscape that resembles a large chessboard. The foreground features a large, gnarled tree with intricate branches and leaves, which appear to be part of the chessboard pattern. The trunk of the tree has a circular design on it, possibly representing a chess piece. The background shows a vast expanse divided into squares by green hedges and brooks, creating a grid-like pattern reminiscent of a chessboard. The scene is set in an open field with distant hills visible on the horizon. The overall atmosphere is one of fantasy and wonder, aligning with the narrative of Alice's adventures in Wonderland. The detailed drawing captures the imaginative and dreamlike quality of the story, with the chessboard motif symbolizing the game-like nature of Alice's journey.",
        "segmentation": false
    },
    "image_23": {
        "image_id": 23,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (3)/images/image_23.jpg",
        "caption": [],
        "footnote": [],
        "context": "Not that Alice had any idea of doing that. She felt as if she would never be able to talk again, she was getting so much out of breath: and still the Queen cried ‘Faster! Faster!’, and The most curious part of the thing was, that the trees and the other things round them never changed their places at all: however fast they went, they never seemed to pass anything. ‘I wonder if all the things move along with us?’ thought poor puzzled Alice. And the Queen seemed to guess her thoughts, for she cried ‘Faster! Don’t try to talk!’ in the Second Square to begin with: when you get to the Eighth Square you’ll be a Queen——’ Just at this moment, somehow or other, they began to run. Alice never could quite make out, in thinking it over afterwards, how it was that they began: all she remembers is, that they were running hand in hand, and the Queen went so fast that it was all she could do to keep up with her: and still the Queen kept crying ‘Faster! Faster!’, but Alice felt she could not go faster, though she had no breath left to say so. ",
        "chunk_order_index": 16,
        "chunk_id": "chunk-55e42f3334ca67ba934b0c1174b0f69b",
        "description": "The image is a black and white illustration depicting a scene from the story of Alice in Wonderland. It shows Alice, a young girl with long hair, running hand in hand with the Queen of Hearts, who is dressed in a crown and a dress with a distinctive pattern. The Queen's face is exaggerated with large eyes and a prominent nose, giving her a caricature-like appearance. Alice appears to be exerting great effort to keep up with the Queen, who is urging her to run faster. The background is filled with tall grass and trees, suggesting they are running through a field or forest. The overall atmosphere conveys a sense of urgency and frantic movement, as both characters are depicted in mid-stride with their limbs extended. The illustration captures the whimsical and surreal nature of the story, with the exaggerated features of the Queen and the dynamic poses of the characters.",
        "segmentation": true
    },
    "image_24": {
        "image_id": 24,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (3)/images/image_24.jpg",
        "caption": [],
        "footnote": [],
        "context": "‘I’m afraid I haven’t got one,’ Alice said in a frightened tone: ‘there wasn’t a ticket-office where I ‘Now then! Show your ticket, child!’ the Guard went on, looking angrily at Alice. And a great many voices all said together (‘like the chorus of a song,’ thought Alice) ‘Don’t keep him waiting, child! Why, his time is worth a thousand pounds a minute!’\\* ‘Tickets, please!’ said the Guard, putting his head in at the window. In a moment everybody was holding out a ticket: they were about the same size as the people, and quite seemed to fill the carriage. brush them away––and what fun it’ll be when they ask me how I liked my walk. I shall say “Oh, I liked it well enough— —” (here came the favourite little toss of the head), “only it was so dusty and hot, and the elephants did tease so!” ‘I think I’ll go down the other way,’ she said after a pause; ‘and perhaps I may visit the elephants later on. Besides, I do so want to get into the Third Square!’ So, with this excuse, she ran down the hill, and jumped over the first of the six little brooks.\\* ",
        "chunk_order_index": 17,
        "chunk_id": "chunk-e9bc2ab6300512f0ad6f28230a9da192",
        "description": "The image consists of a pattern of black asterisks (*) arranged in a grid-like formation against a white background. The asterisks are evenly spaced and form a series of horizontal rows. Each row contains a varying number of asterisks, creating a staggered or offset pattern. The overall appearance is abstract and does not depict any specific scene, object, or activity. The image lacks emotional or atmospheric cues.",
        "segmentation": false
    },
    "image_25": {
        "image_id": 25,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (3)/images/image_25.jpg",
        "caption": [],
        "footnote": [],
        "context": "There was a Beetle sitting next the Goat (it was a very queer carriage-full of passengers altogether), and, as the rule seemed to be that they should all speak in turn, he A Goat, that was sitting next to the gentleman in white, shut his eyes and said in a loud voice, ‘She ought to know her way to the ticket-office, even if she doesn’t know her alphabet! ‘So young a child,’ said the gentleman sitting opposite to her,\\* (he was dressed in white paper,) ‘ought to know which way she’s going, even if she doesn’t know her own name!’  didn’t join in, this time, as she hadn’t spoken, but, to her great surprise, they all thought in chorus (I hope you understand what thinking in chorus means––for I must confess that $I$ don’t), ‘Better say nothing at all. Language is worth a thousand pounds a word!’ ‘I shall dream about a thousand pounds to-night, I know I shall!’ thought Alice. All this time the Guard was looking at her, first through a telescope, then through a microscope, and then through an opera-glass. At last he said ‘You’re traveling the wrong way, and shut up the window, and went away. ",
        "chunk_order_index": 18,
        "chunk_id": "chunk-16d711cf80b060126b10dca6e068731c",
        "description": "The image is a black-and-white illustration depicting a scene inside a train carriage. On the left, there is a man wearing a conical hat and a white outfit, who appears to be reading a newspaper. Next to him, there is a goat sitting upright on the seat. Opposite them, on the right side of the carriage, sits a young girl with long hair, dressed in a Victorian-style dress and hat, looking out of the window with a curious expression. Outside the window, a guard is seen through a telescope, binoculars, and an opera glass, peering into the carriage. The guard is wearing a tall hat and a coat. The background shows the interior of the train carriage with windows and curtains. The overall atmosphere is whimsical and surreal, capturing a moment of curiosity and observation among the characters.",
        "segmentation": true
    },
    "image_26": {
        "image_id": 26,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (3)/images/image_26.jpg",
        "caption": [],
        "footnote": [],
        "context": "‘I like them when they ‘––then you don’t like all insects?’ the Gnat went on, as quietly as if nothing had happened. It certainly was a very large Gnat: ‘about the size of a chicken,’ Alice thought. Still, she couldn’t feel nervous with it, after they had been talking together so long. But the beard seemed to melt away as she touched it, and she found herself sitting quietly under a tree\\*––while the Gnat\\* (for that was the insect she had been talking to) was balancing itself on a twig just over her head, and fanning her with its wings. up in alarm, Alice among the rest. The Horse, who had put his head out of the window, quietly drew it in and said ‘It’s only a brook we have to jump over.’ Everybody seemed satisfied with this, though Alice felt a little nervous at the idea of trains jumping at all. ‘However, it’ll take us into the Fourth Square, that’s some comfort!’ she said to herself. In another moment she felt the carriage rise straight up into the air, and in her fright she caught at the thing nearest to her hand, which happened to be the Goat’s beard.\\*  ",
        "chunk_order_index": 18,
        "chunk_id": "chunk-16d711cf80b060126b10dca6e068731c",
        "description": "The image consists of a pattern of asterisks arranged in a grid-like structure. The asterisks are evenly spaced and aligned in rows and columns, creating a repetitive and symmetrical design. Each asterisk is identical in size and shape, appearing as a simple star symbol. The background is plain white, which contrasts with the black color of the asterisks, making them stand out clearly. There are no other objects, people, or scenes depicted in the image. The overall appearance is abstract and lacks any emotional or atmospheric cues.",
        "segmentation": false
    },
    "image_27": {
        "image_id": 27,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (3)/images/image_27.jpg",
        "caption": [],
        "footnote": [],
        "context": "‘And what does it live on?’ Alice asked, as  ‘Look on the branch above your head,’ said the Gnat, ‘and there you’ll find a Snap-dragon-fly. Its body is made of plumpudding, its wings of holly-leaves, and its head is a raisin burning in brandy.’\\* ‘And there’s the Dragon-fly.’ Alice looked at the Rocking-horse-fly with great interest, and made up her mind that it must have been just repainted, it looked so bright and sticky; and then she went on. ‘What does it live on?’ Alice asked, with great curiosity. ‘Sap and sawdust,’ said the Gnat. ‘Go on with the list.  to them?’ ‘No use to them,’ said Alice; ‘but it’s useful to the people that name them, I suppose. If not, why do things have names at all? ‘I ca’n’t say,’ the Gnat replied. ‘Further on, in the wood down there, they’ve got no names––however, go on with your list of insects: you’re wasting time.’ ‘Well, there’s the Horse-fly,’ Alice began, counting off the names on her fingers. ‘All right,’ said the Gnat. ‘Half way up that bush, you’ll see a Rocking-horse-fly, if you look. It’s made entirely of wood, and gets about by swinging itself from branch to branch.’ ",
        "chunk_order_index": 19,
        "chunk_id": "chunk-44196d5dd53f608446742e60dd3fa222",
        "description": "The image is a black-and-white illustration depicting a whimsical insect with exaggerated features. The insect has a large, bulbous head adorned with polka dots and a small, curved proboscis. Its body is segmented into three parts: a thorax, abdomen, and a pair of wings that resemble holly leaves. The insect's legs are long and thin, extending outward in a dynamic pose. The background consists of a dense cluster of ivy leaves, which appear to be drawn with fine, intricate lines, creating a sense of depth and texture. The overall style of the illustration is reminiscent of classic children's book illustrations, with a playful and imaginative quality. The insect seems to be perched on or near the ivy leaves, adding to the fantastical atmosphere of the scene.",
        "segmentation": false
    },
    "image_28": {
        "image_id": 28,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (3)/images/image_28.jpg",
        "caption": [],
        "footnote": [],
        "context": "‘Crawling at your feet,’ said the Gnat (Alice drew her feet back in some alarm), ‘you may observe a Bread-and-butterfly. Its wings are thin slices of bread-and-butter, its ‘And then there’s the Butterfly,’ Alice went on, after she had taken a good look at the insect with its head on fire, and had thought to herself, ‘I wonder if that’s the reason insects are so fond of flying into candles––because they want to turn into Snap-dragon-flies!’ ‘Frumenty\\* and mince-pie,’ the Gnat replied; ‘and it makes its nest in a Christmas-box.’ ‘And what does it live on?’ Alice asked, as before. gets about by swinging itself from branch to branch.’   ‘What does it live on?’ Alice asked, with great curiosity. ‘Sap and sawdust,’ said the Gnat. ‘Go on with the list. Alice looked at the Rocking-horse-fly with great interest, and made up her mind that it must have been just repainted, it looked so bright and sticky; and then she went on. ‘And there’s the Dragon-fly.’ ‘Look on the branch above your head,’ said the Gnat, ‘and there you’ll find a Snap-dragon-fly. Its body is made of plumpudding, its wings of holly-leaves, and its head is a raisin burning in brandy.’\\* ",
        "chunk_order_index": 19,
        "chunk_id": "chunk-44196d5dd53f608446742e60dd3fa222",
        "description": "The image is a black and white illustration depicting a whimsical creature that resembles a combination of a bat and a plant. The creature has large, leaf-like wings with serrated edges, resembling the leaves of a maple or oak tree. Its body appears to be a bulbous, textured form, possibly representing a seed pod or fruit, with a pattern that suggests a rough surface. The creature's head is not distinctly visible, but it seems to have a small, round shape with some texture, possibly indicating a seed or a similar object. The background consists of various abstract shapes and lines, giving the impression of a chaotic environment with swirling patterns and irregular forms. The overall style of the illustration is detailed and intricate, with a focus on the textures and shapes of the creature and its surroundings. The atmosphere conveyed is one of fantasy and surrealism, as the creature does not conform to naturalistic proportions or forms.",
        "segmentation": false
    },
    "image_29": {
        "image_id": 29,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (3)/images/image_29.jpg",
        "caption": [],
        "footnote": [],
        "context": "‘And yet I don’t know,’ the Gnat ‘No, indeed,’ Alice said, a little anxiously. After this, Alice was silent for a minute or two, pondering. The Gnat amused itself meanwhile by humming round and round her head: at last it settled again and remarked ‘I suppose you don’t want to lose your name?’ ‘It always happens,’ said the Gnat. ‘But that must happen very often,’ Alice remarked thoughtfully. ‘Then it would die, of course.’ A new difficulty came into Alice’s head. ‘Supposing it couldn’t find any?’ she suggested.  ‘And what does it live on?’ ‘Weak tea with cream in it.’ mince-pie,’ the Gnat replied; ‘and it makes its nest in a Christmas-box.’ ‘And then there’s the Butterfly,’ Alice went on, after she had taken a good look at the insect with its head on fire, and had thought to herself, ‘I wonder if that’s the reason insects are so fond of flying into candles––because they want to turn into Snap-dragon-flies!’ ‘Crawling at your feet,’ said the Gnat (Alice drew her feet back in some alarm), ‘you may observe a Bread-and-butterfly. Its wings are thin slices of bread-and-butter, its body is a crust, and its head is a lump of sugar.’ ",
        "chunk_order_index": 19,
        "chunk_id": "chunk-44196d5dd53f608446742e60dd3fa222",
        "description": "The image is a black and white illustration depicting a whimsical scene. It shows a small, insect-like creature with wings that resemble thin slices of bread and butter, a body shaped like a crust, and a head that appears to be a lump of sugar. The creature is crawling on the ground, which is depicted with a textured surface suggesting rough terrain or perhaps a close-up view of a leaf. The background includes a few scattered rocks or pebbles, adding to the natural setting. The overall style of the illustration is reminiscent of classic children's book art, with exaggerated features and a playful, imaginative quality.",
        "segmentation": false
    },
    "image_30": {
        "image_id": 30,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (3)/images/image_30.jpg",
        "caption": [],
        "footnote": [],
        "context": "But this did not seem likely to happen. She went It was not a very difficult question to answer, as there was only one road through the wood, and the two finger-posts both pointed along it. ‘I’ll settle it,’ Alice said to herself, ‘when the road divides and they point different ways.’ Alice stood looking after it, almost ready to cry with vexation at having lost her dear little fellow-traveler so suddenly. ‘However, I know my name now,’ she said: ‘that’s some comfort. Alice––Alice––I wo’n’t forget it again. And now, which of these finger-posts ought I to follow, I wonder?’  you’ll come a little further on,’ the Fawn said. ‘I ca’n’t remember here.’ So they walked on together through the wood, Alice with her arms clasped lovingly round the soft neck of the Fawn, till they came out into another open field, and here the Fawn gave a sudden bound into the air, and shook itself free from Alice’s arm. ‘I’m a Fawn!’ it cried out in a voice of delight. ‘And, dear me! you’re a human child!’ A sudden look of alarm came into its beautiful brown eyes, and in another moment it had darted away at full speed.  ",
        "chunk_order_index": 20,
        "chunk_id": "chunk-9633a89b4b5172229d200a520c3703b9",
        "description": "The image is a black-and-white illustration depicting a scene from the story of Alice in Wonderland. It shows Alice, a young girl with long hair, standing in a forested area. She is wearing a dress and has her arms around the neck of a fawn, which is standing close to her. The fawn has spots on its body and appears to be looking away from Alice. The background consists of trees and foliage, creating a dense woodland setting. The overall atmosphere of the image conveys a sense of wonder and curiosity, as Alice interacts with the fawn in this fantastical environment.",
        "segmentation": true
    }
}