{
  "chunk-c6f1d317132f49bc0a20ea543199282b": {
    "tokens": 1200,
    "content": "# \"All the News The Neu ork Cimes That's Fit to Print'\"  \n\nOL. CLXXI . . . No. 59,342 © 2022  The New York Times Company NEW YORK, TUESDAY, FEBRUARY 22, 2022  \n\n# PUTIN ORDERS FORCES INTO EASTERN UKRAINE  \n\n![](images/image_1.jpg)  \nTaking shelter in a basement in eastern Ukraine. The nation’s president, Volodymyr Zelensky, spoke to President Biden on Monday.  \n\n# Inside the White House’s Race to Prevent an Invasion by Russia  \n\nThis  article  is  by  Michael  D. Shear, Julian E. Barnes and Eric Schmitt.  \n\nWASHINGTON — In a series of top-secret meetings last October, President Biden’s national security team presented grim intelligence that would soon trigger a fierce effort to prevent what could become the largest armed conflict in Europe since World War II. Vladimir V. Putin, the Russian president, was preparing to invade Ukraine, top intelligence and military officials told Mr. Biden.  \n\nGathering each morning in the Oval Office for the global threat assessment known as the President’s Daily Brief, they described satellite images of Russian forces methodically advancing toward Ukraine’s border. Not only did the United States have images of troops moving into position, it also had the Russian military’s plans for a campaign against Ukraine — elements of which had already begun. At one of the morning meetings, Mr. Biden dispatched William J. Burns, the C.I.A. director, to Moscow with a message for Mr. Putin:  \n\n# Blunting  Provocations While Seeking to Unite Allies  \n\nWe know what you’re planning to do. Stopping him would be a challenge. Many of America’s closest allies  were  skeptical  that  Mr. Putin — a master of disinformation — would actually invade. The use of U.S. military force against Russia was off the table, so the allies would have to threaten Mr. Putin with economic pain so severe it would also have consequences in Europe and the United States. And it was far from certain that  Republicans  in  Congress would back whatever the administration did.  \n\nOn Monday, after delivering a grievance-filled speech attacking Ukraine’s sovereignty, Mr. Putin ordered troops into two Russiabacked separatist regions in the country. But it remains unclear Continued on Page A10  \n\n# After Booster, Body’s Defense Is Long-Lived  \n\n# By APOORVA MANDAVILLI  \n\nAs  people  across  the  world grapple with the prospect of living with the coronavirus for the foreseeable  future,  one  question looms large: How soon before they need yet another shot? Not for many months, and perhaps not for years, according to a flurry of new studies.  \n\nThree doses of a Covid vaccine — or even just two — are enough to protect most people from serious illness and death for a long time, the studies suggest.  \n\n“We’re starting to see now diminishing returns on the number of additional doses,” said John Wherry, director of the Institute for Immunology at the University of Pennsylvania. Although people over 65 or at high risk of illness may benefit from a fourth vaccine dose, it may be unnecessary for most people, he added. Federal  health  officials  have said they are not planning to recommend fourth doses anytime soon.  \n\nThe Omicron variant can dodge antibodies — immune molecules that prevent the virus from infecting cells — produced after two doses of a Covid vaccine. But a third shot of the mRNA vaccines made by Pfizer-BioNTech or by Moderna prompts the body to make a much wider variety of antibodies, which would be diffi  \n\n![](images/image_2.jpg)  \n\nBrandon Smith, a rancher, applied for debt relief. Instead, he received a foreclosure warning.  \n\n# Debt Relief Blocked, Black Farmers Fear Ruin  \n\n# By ALAN RAPPEPORT  \n\nWASHINGTON — For Brandon Smith, a fourth-generation cattle rancher from Texas, the \\$1.9 trillion  stimulus  package  that President Biden signed into law nearly  a  year  ago  was  longawaited relief.  \n\nLittle did he know how much longer he would have to wait. The legislation included \\$4 billion of debt forgiveness for Black and  other  “socially  disadvantaged” farmers, a group that has endured decades of discrimination from banks and the federal government. Mr. Smith, a Black father of four who owes about \\$200,000 in outstanding loans on his ranch, quickly signed and returned documents to the Agriculture Department last year, formally accepting the debt relief. He then purchased more equipment for his ranch, believing that he had been given a financial lifeline.  \n\nInstead, he has fallen deeper into debt. Months after signing the paperwork he received a notice informing him that the federal government intended to “accelerate” foreclosure on his 46-acre property and cattle if he did not start making payments on loans he believed had been forgiven. “I trusted the government that we had a deal, and down here at the end of the day, the rug gets pulled out from under me,” Mr. Continued on Page A16  \n\n# Fiery Speech Claims Nation as Part of Russia and Hints at Wider Aims  \n\nThis  article  is  by  Anton Troianovski, Valerie Hopkins and Steven Erlanger.  \n\nMOSCOW — President Vladimir V. Putin on Monday ordered troops into separatist-held eastern Ukraine and hinted at the possibility of a wider military campaign,  delivering  an  emotional and aggrieved address to his nation  that  laid  claim  to  all  of Ukraine as a country “created by Russia.”  \n\nAfter the speech, state television  showed  Mr.  Putin  at  the Kremlin signing decrees recognizing the so-called Donetsk and Luhansk  People’s  Republics, which were formed after",
    "chunk_order_index": 0,
    "full_doc_id": "doc-d0e0ce44fa3bfaa422091f310e862c3c"
  },
  "chunk-552bc216eee6c4415f1a0e3f8c77abbf": {
    "tokens": 1200,
    "content": "Putin on Monday ordered troops into separatist-held eastern Ukraine and hinted at the possibility of a wider military campaign,  delivering  an  emotional and aggrieved address to his nation  that  laid  claim  to  all  of Ukraine as a country “created by Russia.”  \n\nAfter the speech, state television  showed  Mr.  Putin  at  the Kremlin signing decrees recognizing the so-called Donetsk and Luhansk  People’s  Republics, which were formed after Russia fomented a separatist war in eastern Ukraine in 2014. The decrees, published  by  the  Kremlin,  directed the Russian Defense Ministry to deploy troops in those regions to carry out “peacekeeping functions.”  \n\nThe action by Mr. Putin, who has commandeered the world’s attention with an enormous deployment of troops along Ukraine’s border in recent weeks, was the most blatant yet in a confrontation that Western officials warn could escalate into the biggest armed conflict in Europe since World War II.  \n\nIt was a momentous decision for Mr. Putin, a reversal of his eight-year-old strategy to use the separatist enclaves the Kremlin backed with arms and money as a means of pressuring Ukraine’s government without recognizing them  outright  as  independent from Ukraine itself. But he continued to keep the world guessing about his next steps, signaling in his hourlong speech that his goals extended beyond the enclaves. He laid out such a broad case against Ukraine — describing its pro-Western government as a dire threat to Russia and to Russians — that he appeared to lay the groundwork for action against the rest of the country.  \n\nHe even went so far as to describe  Ukraine’s  elected  proWestern leaders as stooges and cast them as the aggressors — even though Russia has $^{190,000}$ troops, including allied separatist fighters, surrounding Ukraine. “As for those who captured and are holding onto power in Kyiv, we demand that they immediately cease military action,” Mr. Putin said at the end of his speech, referring to Ukraine’s capital. “If not, the complete responsibility for the possibility of a continuation of bloodshed will be fully and wholly on the conscience of the regime ruling the territory of Ukraine.” It was a thinly veiled threat against the government of PresiContinued on Page A10  \n\n![](images/image_3.jpg)  \n\nPresident Vladimir V. Putin recognized separatist regions.  \n\n# U.S. and Its Allies Considering Timing and Scope of Response  \n\n# By MICHAEL D. SHEAR and DAVID E. SANGER  \n\nWASHINGTON — Russia’s decision to order troops into Ukraine on Monday presented the United States and Europe with the challenge of deciding how quickly to move in imposing stiff sanctions on Moscow, seeking to balance punishment,  deterrence  and maintaining unity among the allies.  \n\nPresident Biden’s initial reaction was cautious, limited to issuing a narrow set of sanctions aimed at two regions in eastern Ukraine that are partly controlled by  Russian-backed  separatists and that President Vladimir V. Putin of Russia recognized as independent on Monday.  \n\nThe targeted nature of the penalties appeared intended to allow the United States and its European allies to hold in reserve the most aggressive sanctions they have threatened to impose on Moscow if Mr. Putin carries out a full-scale assault to bring down Ukraine’s democratically elected government.  \n\nIn private, administration offi  \ncials have conceded that Mr. Putin   \ndid not seem interested in further   \nnegotiations that did not address   \nhis core demands that NATO stop   \nexpanding to the east, and specu  \nlated that he had tolerated diplo  \nmatic overtures mostly to gain Continued on Page A8  \n\n# SOARING ENERGY PRICES While some Europeans are installing solar panels, others are stoking their wood-burning stoves. PAGE A13  \n\nBENDING HISTORY In his speech, President Vladimir V. Putin argued that the very idea of Ukrainian statehood was a fiction. PAGE A12  \n\n# Jury to Decide Whether Racism Motivated 3 Men to Kill Arbery  \n\n# By TARIRO MZEZEWA and RICHARD FAUSSET  \n\nBRUNSWICK, Ga. — A federal prosecutor in the hate crimes trial for the three white men who murdered Ahmaud Arbery told the jury in closing arguments on Monday that the defendants had targeted Mr. Arbery because of his race and did not help him after he was shot because they considered him to be “subhuman.”  \n\nDefense attorneys argued that their clients had chased Mr. Arbery because they thought he might have committed a crime. And despite copious evidence that the men harbored bigoted beliefs  —  including  referring  to Black people as animals — and that two of them repeatedly used racist slurs, defense lawyers said there was not enough evidence to prove that racism was the reason they had pursued Mr. Arbery, a 25- year-old Black man, through their neighborhood on a Sunday afternoon in February 2020.  \n\nOn Monday afternoon, a jury began deliberating on whether the  five-minute  pursuit,  which ended in the fatal shooting of Mr. Arbery, amounted to a crime of inContinued on Page A17  \n\n![](images/image_4.jpg)  \n\n# NATIONAL A15-18  \n\nAn Uproar Over ‘Crack Pipes’ “Harm reduction” is a key pillar of President Biden’s drug policy agenda, but the effort is threatened by a conservative backlash. PAGE A15  \n\n![](images/image_5.jpg)  \n\n# ARTS C1-6  \n\nPaths to New Social Visions MoMA explores an era of sweeping change, when South Asian architects — pioneering women among them — redefined the postcolonial era.  PAGE C1 INTERNATIONAL A4-14 Japan’s Past With South Korea A bid for a UNESCO World Heritage designation is the latest flash point over World War II colonial abuses.",
    "chunk_order_index": 1,
    "full_doc_id": "doc-d0e0ce44fa3bfaa422091f310e862c3c"
  },
  "chunk-19b7755aea4c3b300733a4475422c4e5": {
    "tokens": 369,
    "content": "but the effort is threatened by a conservative backlash. PAGE A15  \n\n![](images/image_5.jpg)  \n\n# ARTS C1-6  \n\nPaths to New Social Visions MoMA explores an era of sweeping change, when South Asian architects — pioneering women among them — redefined the postcolonial era.  PAGE C1 INTERNATIONAL A4-14 Japan’s Past With South Korea A bid for a UNESCO World Heritage designation is the latest flash point over World War II colonial abuses.  PAGE A4 Colombia to Allow Abortion A court’s decision to decriminalize the procedure follows significant shifts in the region’s legal landscape.  PAGE A14 BUSINESS B1-7 Fallout for the Global Economy Countries dependent on Ukraine’s rich supply of energy, wheat and nickel could face spikes in prices. PAGE B1 Crypto Scams via Romance Women lured into cryptocurrency investing by suitors on a dating app have lost life savings. PAGE B1 A Winning Horse No Longer Medina Spirit, who failed a postrace drug test, was stripped of last year’s Kentucky Derby victory. PAGE B10 Taking On the Cold and Dark In a Northwest Territories town above the Arctic Circle, women find mental health relief in curling. PAGES B8-9 OBITUARIES A19, 22 Giant of Global Public Health Dr. Paul Farmer, who cared for some of the world’s poorest people, influenced strategies for combating tuberculosis, H.I.V. and Ebola. He was 62.  PAGE A19  \n\n![](images/image_6.jpg)  \n\n# OPINION A20-21  \n\nThomas L. Friedman PAGE A21  \n\n# SCIENCE TIMES D1-8  \n\nProtecting Gorillas From Covid A preliminary report suggests that mask wearing and social distancing may curb the spread of disease from humans to great apes. PAGE D4",
    "chunk_order_index": 2,
    "full_doc_id": "doc-d0e0ce44fa3bfaa422091f310e862c3c"
  }
}