{
    "image_1": {
        "image_id": 1,
        "image_path": "./fusion_research/fusion_dataset/news/20221122/images/image_1.jpg",
        "caption": [
            "Members of Ukraine’s Bratstvo battalion returning after a mission. Russian troops have retreated to the Dnipro’s eastern bank. "
        ],
        "footnote": [],
        "context": "Having been drawn in by an offer of a “risk-free” bet — the gambling company FanDuel promised to refund his money if he lost — Mr. Hummel kept betting. In little more than a year, he had lost more than \\$30,000,  This article is by Rebecca R. Ruiz, Kenneth P. Vogel and Joe Drape. David Hummel placed his first sports bet in January 2021, wagering \\$250 on the underdog in a mixed-martial-arts fight. He won \\$662.50, he said, “and it was probably the worst thing that could A RISKY WAGER Addiction as an Afterthought States Failed To Anticipate Betting Perils VOL. CLXXII . . . . No. 59,615 © 2022 The New York Times Company NEW YORK, TUESDAY, NOVEMBER 22, 2022 ",
        "chunk_order_index": 0,
        "chunk_id": "chunk-8de81d42144b7b3a6be1e0259b3d40e8",
        "description": "The image depicts a serene and tranquil scene at dusk or dawn, with the sky painted in hues of pink and blue. The foreground shows a wooden dock extending into a calm body of water, likely a lake or river. On the dock, there are two individuals engaged in an activity that appears to be related to boating or fishing. One person is wearing a bright red outfit, possibly for visibility or safety, and is standing near a boat. The other individual is partially visible and seems to be handling equipment or gear. The boats on the dock are small and appear to be inflatable or rubber rafts. The background features a line of trees silhouetted against the sky, creating a picturesque and peaceful atmosphere. The overall mood of the image conveys a sense of quietude and reflection, with the natural beauty of the setting providing a backdrop for the human activity.",
        "segmentation": true
    },
    "image_2": {
        "image_id": 2,
        "image_path": "./fusion_research/fusion_dataset/news/20221122/images/image_2.jpg",
        "caption": [],
        "footnote": [],
        "context": "COLORADO SPRINGS — Richard M. Fierro was at a table in Club Q with his wife, daughter and friends on Saturday, watching a drag show, when the sudden flash of gunfire ripped across the nightclub. His instincts from four combat deployments This article is by Dave Philipps, Jack Healy, Shawn Hubler and Patricia Mazzei. Lives Saved at Colorado Club as Ex-Major Charged Through Spreading Chaos Veteran in ‘Combat Mode’ Brought Down a Gunman Gareth Bale of Wales (No. 11 in red) was given a penalty kick and scored for a 1-1 final. Page B6. Mixed World Cup Return for U.S. “It’s a very dangerous mission,” said Oleksiy Serediuk, the battalion commander. “They need to land where there is a swarm of Russians. They need to go around them and plant mines.” From the beginning of a conflict defined by heavy aerial and artillery bombardment and grinding trench warfare, the Bratstvo battalion has undertaken some of the conflict’s most difficult missions, conducting forward spotting and sabotage along the front lines, including in the early battles around the cities of Kyiv and Kharkiv. Now, in the battle for Ukraine’s south, they’ve learned to use boats and infiltrate the RussianContinued on Page A8 ",
        "chunk_order_index": 0,
        "chunk_id": "chunk-8de81d42144b7b3a6be1e0259b3d40e8",
        "description": "The image captures a dynamic moment in a soccer match. The scene is set on a well-maintained green field with clearly marked white lines indicating the boundaries and center circle of the pitch. There are eight players visible, four wearing white jerseys and four wearing red jerseys. The player in the white jersey with the number 3 is lying on the ground near the center of the image, seemingly having just fallen or been tackled. Another player in a white jersey with the number 13 is standing close to him, possibly checking on his condition or appealing to the referee. A player in a red jersey with the number 11 is also nearby, with his arms raised, possibly signaling for a foul or expressing frustration. The referee, dressed in black, is positioned towards the top left of the image, gesturing with his right arm extended, which could indicate a decision has been made or a foul has been called. The other players are scattered around the field, some with their arms raised, suggesting a moment of high tension and action. The overall atmosphere conveys a sense of urgency and intensity typical of a competitive soccer match.",
        "segmentation": true
    },
    "image_3": {
        "image_id": 3,
        "image_path": "./fusion_research/fusion_dataset/news/20221122/images/image_3.jpg",
        "caption": [
            "Richard M. Fierro was watching a drag show with his family. "
        ],
        "footnote": [],
        "context": "For decades, Black families By ANDY NEWMAN Child Welfare Agency Is Accused Of Racial Bias, Even by Its Staff THOSE WHO WERE LOST The victims, whose names were confirmed on Monday, included two bartenders and three patrons. PAGE A17 move through the bar toward a door leading to a patio where doz ens of nightclub patrons had fled. Mr. Fierro said he raced across the room, grabbed the gunman by a handle on the back of his body ar mor, pulled him to the floor and jumped on top of him. The gunman, who Mr. Fierro esContinued on Page A17 the shooting. Chief Adrian Vasquez of the Colorado Springs Police Department identified the victims as Daniel Aston, Kelly Loving, Ashley Paugh, Derrick Rump and Raymond Green Vance.  The number of wounded victims was revised downward to 18 from 25. Of those people, 17 were shot and one was injured without being shot, officials said. At least 13 injured victims remained hospitalized, spokesmen for two hospital systems said. Mr. Fierro said his wife and daughter were recovering from injuries at home. Mr. Green Vance was his daughter’s longtime boyfriend. The rampage lasted only a few minutes, and the death toll could ",
        "chunk_order_index": 1,
        "chunk_id": "chunk-c45dfe4719bdcc8adbaa88476e1507a5",
        "description": "The image is a portrait of a man with a serious expression. He has short, graying hair and a beard that is predominantly white. His skin tone is medium, and he appears to be middle-aged. He is wearing a black hoodie. The background is blurred but seems to be an indoor setting, possibly a workshop or garage, as there are various objects and tools visible. The overall mood conveyed by the image is one of solemnity and intensity.",
        "segmentation": true
    },
    "image_4": {
        "image_id": 4,
        "image_path": "./fusion_research/fusion_dataset/news/20221122/images/image_4.jpg",
        "caption": [],
        "footnote": [],
        "context": "Catastrophe looms as the worst drought in 40 years pairs with havoc from the militant group Al Shabab. PAGE A6 Scores Die in Indonesia Quake Buildings crumbled INTERNATIONAL A4-10  Increased Risk of a Rail Strike A tentative deal, brokered in September with help from the Biden administration, was voted down by members of a union that primarily represents freight rail conductors. PAGE B1 BUSINESS B1-5  From Yale Law to Oath Keepers Stewart Rhodes stood out during law school, but few of his classmates would have guessed that he would go on to start a far-right militia. PAGE A16 NATIONAL A11-21 The company’s board had unan Senior Executives Had Threatened to Quit til at least July 2025. In August, Disney reported stellar quarterly earnings, including a 50 percent jump in profit, passing Netflix for the first time in streaming subscriptions. At a Disney fan convention in September, Mr. Chapek pitched a rosy future for the company that included coming blockbusters like “Avatar: The Way of Water” and new theme park rides. “I’m very, very bullish,” Jim Cramer, the CNBC host, said on air about the company in October. Then, in November, came Disney’s disastrous quarterly earnings report. Continued on Page A21  ",
        "chunk_order_index": 1,
        "chunk_id": "chunk-c45dfe4719bdcc8adbaa88476e1507a5",
        "description": "The image depicts a scene of people in what appears to be a humanitarian aid situation. Several individuals are gathered around, with a focus on two children and an adult woman. The children have dark skin and are dressed in simple clothing; one child is wearing a patterned dress, while the other has a plain outfit. The adult woman is also dressed in modest clothing, with a headscarf covering her hair. They are standing near yellow jerry cans, which are commonly used for storing water or fuel. The background shows other people, some of whom are reaching out with their hands, possibly indicating a need for assistance. The overall atmosphere suggests a setting of scarcity and urgency, likely related to a crisis such as drought or conflict. The colors in the image are muted, with earthy tones dominating the scene, emphasizing the harsh conditions. The expressions on the faces of the individuals convey a sense of desperation and hope.",
        "segmentation": true
    },
    "image_5": {
        "image_id": 5,
        "image_path": "./fusion_research/fusion_dataset/news/20221122/images/image_5.jpg",
        "caption": [],
        "footnote": [],
        "context": "Catastrophe looms as the worst drought in 40 years pairs with havoc from the militant group Al Shabab. PAGE A6 Scores Die in Indonesia Quake Buildings crumbled and at least 162 people were killed on Java, where many people may still be trapped. PAGE A5 Prosecutors Move on Trump The Manhattan district attorney’s office has jump-started the investigation into the former president’s INTERNATIONAL A4-10  Increased Risk of a Rail Strike A tentative deal, brokered in September with help from the Biden administration, was voted down by members of a union that primarily represents freight rail conductors. PAGE B1 BUSINESS B1-5 time in streaming subscriptions. At a Disney fan convention in September, Mr. Chapek pitched a rosy future for the company that included coming blockbusters like “Avatar: The Way of Water” and new theme park rides. “I’m very, very bullish,” Jim Cramer, the CNBC host, said on air about the company in October. Then, in November, came Disney’s disastrous quarterly earnings report. Continued on Page A21   NATIONAL A11-21 From Yale Law to Oath Keepers Stewart Rhodes stood out during law school, but few of his classmates would have guessed that he would go on to start a far-right militia. PAGE A16 ",
        "chunk_order_index": 1,
        "chunk_id": "chunk-c45dfe4719bdcc8adbaa88476e1507a5",
        "description": "The image is a portrait of a person with short, curly black hair. The individual is wearing a light-colored shirt with a pattern that appears to be abstract or text-based. The background is a plain, light blue color, which provides a neutral backdrop that contrasts with the subject's dark hair and patterned shirt. The person's posture is relaxed, with their head slightly tilted and resting on their hand, suggesting a contemplative or introspective mood. The lighting is soft, casting gentle shadows that highlight the contours of the face and hair. The overall atmosphere conveyed by the image is one of calmness and introspection.",
        "segmentation": true
    },
    "image_6": {
        "image_id": 6,
        "image_path": "./fusion_research/fusion_dataset/news/20221122/images/image_6.jpg",
        "caption": [],
        "footnote": [],
        "context": "Catastrophe looms as the worst drought in 40 years pairs with havoc from the militant group Al Shabab. PAGE A6 Scores Die in Indonesia Quake Buildings crumbled and at least 162 people were killed on Java, where many people may still be trapped. PAGE A5 Prosecutors Move on Trump The Manhattan district attorney’s office has jump-started the investigation into the former president’s role in a hushmoney payment to a porn star. PAGE A15 Whose Bones Are These? Christie’s pulled the sale of a T. rex named Shen after a fossil company questioned how much of it was merely INTERNATIONAL A4-10 very, very bullish,” Jim Cramer, the CNBC host, said on air about the company in October. Then, in November, came Disney’s disastrous quarterly earnings report. Continued on Page A21   NATIONAL A11-21 From Yale Law to Oath Keepers Stewart Rhodes stood out during law school, but few of his classmates would have guessed that he would go on to start a far-right militia. PAGE A16  BUSINESS B1-5 Increased Risk of a Rail Strike A tentative deal, brokered in September with help from the Biden administration, was voted down by members of a union that primarily represents freight rail conductors. PAGE B1 ",
        "chunk_order_index": 2,
        "chunk_id": "chunk-9688cd4dc7b1c931e2dee1d16a10a8ad",
        "description": "The image depicts a young woman with long dark hair and glasses, wearing a black sweater over a light blue shirt. She is interacting affectionately with a large cow that has a white and brown coat. The cow's head is turned towards the woman, and she appears to be petting or scratching its neck. The background shows a grassy field with some trees in the distance, suggesting an outdoor rural setting. The overall atmosphere is warm and friendly, conveying a sense of connection between the woman and the cow.",
        "segmentation": true
    }
}