{
  "chunk-8de81d42144b7b3a6be1e0259b3d40e8": {
    "tokens": 1200,
    "content": "VOL. CLXXII . . . . No. 59,615 © 2022  The New York Times Company NEW YORK, TUESDAY, NOVEMBER 22, 2022  \n\n![](images/image_1.jpg)  \nMembers of Ukraine’s Bratstvo battalion returning after a mission. Russian troops have retreated to the Dnipro’s eastern bank.  \n\n# States Failed To Anticipate Betting Perils  \n\nThis article is by Rebecca R. Ruiz, Kenneth P. Vogel and Joe Drape. David Hummel placed his first sports bet in January 2021, wagering \\$250 on the underdog in a mixed-martial-arts fight. He won \\$662.50, he said, “and it was probably the worst thing that could A RISKY WAGER Addiction as an Afterthought  \n\nHaving been drawn in by an offer of a “risk-free” bet — the gambling company FanDuel promised to refund his money if he lost — Mr. Hummel kept betting. In little more than a year, he had lost more than \\$30,000, draining his checking account to \\$327.  \n\nSince 2018, when the Supreme Court opened the door to widespread sports betting, the gambling industry has mastered ways to attract customers like Mr. Hummel. Oversight of this young, fastgrowing market has been left to states.  \n\nThe states are not disinterested parties.  They  collect  taxes  on gambling, and the more people bet, the more governments get. One result is that states have, in many ways, given gambling companies free rein.  \n\nThey have required few protections for consumers, dedicated minimal funds to fighting addiction and often turned to the gambling industry to help shape regulations and police its own compliance  with  them,  a  New  York Times investigation found. Unlike some countries that have endured waves of gambling addiction, few states have imposed restrictions on the kinds of promotions that helped hook Mr. Hummel.  \n\nContinued on Page A12  \n\n# Ambushing Russian Forces on the Dnipro River  \n\n# By CARLOTTA GALL  \n\nON THE BANKS OF THE DNIPRO RIVER, Ukraine — Under cover of darkness, a group of soldiers heaved their dinghy off the sand into the water. Another group loaded equipment with a heavy clanking into their boat, while a third pushed off silently with oars. Engines humming quietly, the boats turned to the open water and disappeared into the blackness.  \n\nThe  fighters,  a  volunteer Ukrainian  special  forces  team called the Bratstvo battalion, were crossing the wide expanse of the Dnipro River, the strategic waterway that bisects Ukraine and has become the dividing line of the southern front. After recapturing  \n\n# In the Dark, an Elite Squad Plants Mines by Enemy Camps  \n\nthe city of Kherson a week ago, Ukrainian forces hold the western bank, while the Russians still hold the eastern bank.  \n\nTo exploit weaknesses on the Russian side, the Bratstvo fighters have been conducting secret raids and other special operations for months, as part of the Ukrainian counteroffensive against Russian occupying forces. On this night, their mission was to slip onto the eastern bank and lay mines on a road used by Russian soldiers and attack a mortar position.  \n\n“It’s a very dangerous mission,” said Oleksiy Serediuk, the battalion commander. “They need to land where there is a swarm of Russians. They need to go around them and plant mines.”  \n\nFrom the beginning of a conflict defined by heavy aerial and artillery bombardment and grinding trench warfare, the Bratstvo battalion has undertaken some of the conflict’s most difficult missions, conducting forward spotting and sabotage along the front lines, including in the early battles around the cities of Kyiv and Kharkiv. Now, in the battle for Ukraine’s south,  they’ve  learned  to  use boats and infiltrate the RussianContinued on Page A8  \n\n![](images/image_2.jpg)  \n\n# Mixed World Cup Return for U.S.  \n\nGareth Bale of Wales (No. 11 in red) was given a penalty kick and scored for a 1-1 final. Page B6.  \n\n# Veteran in ‘Combat Mode’ Brought Down a Gunman  \n\nLives Saved at Colorado Club as Ex-Major Charged Through Spreading Chaos  \n\n# This article is by Dave Philipps, Jack Healy, Shawn Hubler and Patricia Mazzei.  \n\nCOLORADO SPRINGS — Richard M. Fierro was at a table in Club Q with his wife, daughter and friends on Saturday, watching a drag show, when the sudden flash of gunfire ripped across the nightclub. His instincts from four combat deployments as an Army officer  in  Iraq  and  Afghanistan kicked in.  \n\nHe charged through the chaos, tackled the gunman and beat him bloody with his own gun.  \n\nhave been much higher, officials said, if patrons of the nightclub had  not  stopped  the  gunman. Chief  Vasquez  identified  Mr. Fierro and another man as the people who knocked down the gunman.  \n\n“He saved a lot of lives,” Mayor John Suthers of Colorado Springs said of Mr. Fierro. The mayor said he had spoken to Mr. Fierro and was struck by his humility. “I have never encountered a person who engaged in such heroic actions and was so humble about it.” When the shooting started, Mr. Fierro said he hit the floor, pulling a friend down with him. As bullets sprayed,  he  saw  the  gunman this guy before he kills us.” On Monday, the authorities said they were holding the gunman, Anderson Lee Aldrich, 22, on suspicion of five counts of murder and five  counts  of  bias-motivated crime causing bodily injury,",
    "chunk_order_index": 0,
    "full_doc_id": "doc-292fa3b91f0337ce53f5918a8b92b321"
  },
  "chunk-c45dfe4719bdcc8adbaa88476e1507a5": {
    "tokens": 1200,
    "content": "person who engaged in such heroic actions and was so humble about it.” When the shooting started, Mr. Fierro said he hit the floor, pulling a friend down with him. As bullets sprayed,  he  saw  the  gunman this guy before he kills us.” On Monday, the authorities said they were holding the gunman, Anderson Lee Aldrich, 22, on suspicion of five counts of murder and five  counts  of  bias-motivated crime causing bodily injury, Colorado’s equivalent of a hate crime, for the five people killed in the shooting. Chief Adrian Vasquez of the Colorado Springs Police Department identified the victims as Daniel Aston, Kelly Loving, Ashley Paugh, Derrick Rump and Raymond Green Vance.  \n\nThe number of wounded victims was revised downward to 18 from 25. Of those people, 17 were shot and one was injured without being shot, officials said. At least 13 injured victims remained hospitalized, spokesmen for two hospital systems said. Mr. Fierro said his wife and daughter were recovering from injuries at home. Mr. Green Vance was his daughter’s longtime boyfriend. The rampage lasted only a few minutes, and the death toll could  \n\n![](images/image_3.jpg)  \nRichard M. Fierro was watching a drag show with his family.  \n\nmove through the bar toward a   \ndoor leading to a patio where doz  \nens of nightclub patrons had fled.   \nMr. Fierro said he raced across the   \nroom, grabbed the gunman by a   \nhandle on the back of his body ar  \nmor, pulled him to the floor and   \njumped on top of him. The gunman, who Mr. Fierro esContinued on Page A17  \n\nTHOSE WHO WERE LOST The victims, whose names were confirmed on Monday, included two bartenders and three patrons. PAGE A17  \n\n# Child Welfare Agency Is Accused Of Racial Bias, Even by Its Staff  \n\n# By ANDY NEWMAN  \n\nFor  decades,  Black  families have complained that New York City’s welfare agency, the Administration for Children’s Services, is biased against them. It turns out that many of the agency’s own employees agree, according to a racial equity audit the  agency  commissioned  but never publicly released. A draft report, based on a 2020 survey of more than 50 Black and Hispanic  frontline  caseworkers and agency managers in Brooklyn and the Bronx, along with many parents and advocates, described a “predatory system that specifically targets Black and brown parents” and subjects them to “a different level of scrutiny.” In New York’s child welfare system, where Black families are seven times as likely as white families to be accused of child maltreatment and 13 times as likely to have their children removed, “race operates as an indicator of risk,” the report concluded.  \n\nme But families find child welfare   \ninvestigations profoundly disrup  \ntive, humiliating and even trau  \nmatic. Caseworkers making un  \nannounced  visits  strip-search   \nchildren looking for bruises and   \npeer into refrigerators and around   \nhomes looking for signs of bad   \nparenting. One A.C.S. worker in Continued on Page A20  \n\n# A Philharmonic First: Women Are the Majority Disney Chief L  \n\n# By JAVIER C. HERNÁNDEZ  \n\nWhen the New York Philharmonic moved to Lincoln Center in 1962, its new hall had no women’s dressing rooms. That’s because there were no women in the orchestra.  \n\nBut this fall, as the Philharmonic opens its newly renovated home, David Geffen Hall, its players have returned not only to more  \n\n# Shift at a 180-Year-Old New York Institution  \n\nequitable facilities backstage, but to a milestone onstage: For the first time in its 180-year history, the women in the Philharmonic outnumber the men, 45 to 44. “It’s a sea change,” said Cynthia Phelps, the principal viola, who joined the orchestra in 1992. “This has been a hard-won, long battle, and it continues to be.” The orchestra’s new female majority could prove fleeting — it currently has 16 player vacancies to fill, in part because auditions were put on hold during the pandemic — but it still represents a profound shift for an ensemble Continued on Page A21  \n\nThis article is by Brooks Barnes, Benjamin Mullin and James B. Stewart.  \n\nAfter a transition marked by numerous setbacks, some self-inflicted, Bob Chapek seemed by early fall to have finally found his footing after two years as Disney’s chief executive. The company’s board had unan  \n\n# Senior Executives Had Threatened to Quit  \n\ntil at least July 2025. In August, Disney reported stellar quarterly earnings, including a 50 percent jump in profit, passing Netflix for the first time in streaming subscriptions. At a Disney fan convention in September, Mr. Chapek pitched a rosy future for the company that included coming blockbusters like “Avatar: The Way of Water” and new theme park rides. “I’m  very,  very  bullish,”  Jim Cramer, the CNBC host, said on air about the company in October. Then, in November, came Disney’s disastrous quarterly earnings report. Continued on Page A21  \n\n![](images/image_4.jpg)  \n\n# NATIONAL A11-21  \n\nFrom Yale Law to Oath Keepers Stewart Rhodes stood out during law school, but few of his classmates would have guessed that he would go on to start a far-right militia. PAGE A16  \n\n![](images/image_5.jpg)  \n\n# BUSINESS B1-5  \n\nIncreased Risk of a Rail Strike A tentative deal, brokered in September with help from the Biden administration, was voted down by members of a union that primarily represents freight rail conductors. PAGE B1  \n\n![](",
    "chunk_order_index": 1,
    "full_doc_id": "doc-292fa3b91f0337ce53f5918a8b92b321"
  },
  "chunk-9688cd4dc7b1c931e2dee1d16a10a8ad": {
    "tokens": 414,
    "content": "From Yale Law to Oath Keepers Stewart Rhodes stood out during law school, but few of his classmates would have guessed that he would go on to start a far-right militia. PAGE A16  \n\n![](images/image_5.jpg)  \n\n# BUSINESS B1-5  \n\nIncreased Risk of a Rail Strike A tentative deal, brokered in September with help from the Biden administration, was voted down by members of a union that primarily represents freight rail conductors. PAGE B1  \n\n![](images/image_6.jpg)  \n\n# INTERNATIONAL A4-10  \n\nCatastrophe looms as the worst drought in 40 years pairs with havoc from the militant group Al Shabab. PAGE A6 Scores Die in Indonesia Quake Buildings crumbled and at least 162 people were killed on Java, where many people may still be trapped. PAGE A5 Prosecutors Move on Trump The Manhattan district attorney’s office has jump-started the investigation into the former president’s role in a hushmoney payment to a porn star. PAGE A15 Whose Bones Are These? Christie’s pulled the sale of a T. rex named Shen after a fossil company questioned how much of it was merely a replica of another specimen.  PAGE A11  \n\n# ARTS C1-8  \n\nTelling Himself ‘Yes’ Jeremy Pope, star of the gay military film “The Inspection,” discusses shame and learning to accept himself.  PAGE C1 A Walk Through History An architectural tour of Greenwich Village stops at gay landmarks like the Stonewall Inn, and Julius’ bar.  PAGE C1 Taiwan’s Engineers Flee China The lure of money and new opportunities enticed talent to China’s semiconductor plants. But harsh pandemic protocols and a looming tech cold war have changed the calculus. PAGE B1  \n\nOPINION A22-23 David French  \n\nSCIENCE TIMES D1-8 Putting Their Heads Together A farm sanctuary in New York is trying to learn about the inner lives of various animals. Above, Sasha Prasad-Shreckengast with Hayes the steer.  PAGE D1",
    "chunk_order_index": 2,
    "full_doc_id": "doc-292fa3b91f0337ce53f5918a8b92b321"
  }
}