{
  "chunk-7e6a7f644e5d720ac56a38b2c2ba4d9b": {
    "tokens": 1200,
    "content": "# ROCKET ASSAULTS KILL CIVILIANS IN UKRAINE AS TIGHTENING SANCTIONS ISOLATE MOSCOW  \n\nAnxious Russians   \nFeel Sting of   \nPenalties  \n\nThis article  is  by Anton Troianovski,  Ivan  Nechepurenko and Sergey Ponomarev.  \n\nMOSCOW — For two decades under  President  Vladimir  V. Putin, Russians reaped the bounties of capitalism and globalization:  cheap  flights,  affordable mortgages, a plethora of imported gadgets and cars.  \n\nOn Monday, those perks of modern life were abruptly disappearing, replaced by a crush of anxiety as sanctions imposed by the West in retaliation for Moscow’s invasion of Ukraine rattled the foundations of Russia’s financial system. The ruble cratered, losing a quarter of its value, and the central bank shuttered stock trading in Moscow through Tuesday. The public rushed to withdraw cash from A.T.M.s, and Aeroflot, the national  airline,  canceled  all  its flights to Europe after countries banned Russian planes from using their airspace.  \n\nConcern about travel was so great that some people rushed to book seats on the few international flights still operating. “I’ve become one concentrated ball of fear,” said the owner of a small advertising agency in Moscow, Azaliya Idrisova, 33. She said she planned to depart for Argentina in the coming days and was not sure whether her clients would still pay her.  \n\nCompounding the pain was the decision by Western countries to restrict the Russian central bank’s access to much of its \\$643 billion in foreign currency reserves, undoing some of the Kremlin’s careful efforts to soften the impact of potential sanctions and making it difficult for the bank to prop up the ruble.  \n\nOther moves struck at the heart of  critical  Russian  industries. Shell, a company that for years helped Russia profit from its energy riches, said it was exiting all its joint ventures with Gazprom, RusContinued on Page A13  \n\nCENTRAL BANK IS FROZEN OUT Taking aim at a key weakness for Russia: its currency. PAGE B1  \n\n![](images/image_1.jpg)  \n\nA shelter at a children’s hospital in Kyiv on Monday. Russians bombarded a residential area of Kharkiv, Ukraine’s second-largest city.  \n\n# sing Commerce and Culture, As War Grinds Into 5th Day, World Turns Its Back on Russia Kremlin Starts Hitting Harder  \n\n# By MARK LANDLER  \n\nLONDON — In Switzerland, the Lucerne music festival canceled two symphony concerts featuring a Russian maestro. In Australia, the national swim team said it would boycott a world championship meet in Russia. At the Magic Mountain Ski Area in Vermont, a bartender poured bottles of Stolichnaya vodka down the drain.  \n\nFrom  culture  to  commerce, sports to travel, the world is shunning Russia in myriad ways to protest  President  Vladimir  V. Putin’s invasion of Ukraine. Not since the frigid days of the Cold War have so many doors closed on Russia and its people — a worldwide repudiation driven as much by the impulse to show solidarity with besieged Ukrainians as by any hope that it will force Mr. Putin to pull back his troops. The boycotts and cancellations are piling up in parallel with the sanctions imposed by the United States, Europe, and other powers. Although these grass-roots gestures inflict less harm on Russia’s economy than sweeping restrictions on Russian banks or the mothballing of a natural gas pipeline, they carry a potent symbolic punch, leaving millions of ordinary Russians isolated in an interconnected world. Among the most visible targets of this opprobrium are cultural icons like Valery Gergiev, the conductor and a longtime backer of Continued on Page A10  \n\n# By STEVEN ERLANGER  \n\nBRUSSELS — When Russia launched its invasion of Ukraine with nearly 200,000 troops, many observers — and seemingly President Vladimir V. Putin  \n\nhimself — expected NEWS ANALYSIS that the force would  \n\nroll right in and the fighting would be over quickly. Instead, after five days of war, what appears to be unfolding is a Russian miscalculation about tactics and about how hard the Ukrainians would fight. No major cities have been taken after an initial Russian push toward Kyiv, the capital, stalled. While Russia appeared to pull its punches, Ukraine marshaled and armed civilians to cover more ground, and its military has attacked Russian convoys and supply lines, leaving video evidence of scorched Russian vehicles and dead soldiers. But the war was already  \n\nchanging quickly on Monday, and ultimately, it is likely to turn on just how far Russia is willing to go to subjugate Ukraine. The Russian track record in the Syrian civil war, and in its own ruthless efforts to crush separatism in the Russian region of Chechnya, suggest an increasingly brutal campaign ahead. Signs of that appeared on Monday in Ukraine’s secondlargest city, Kharkiv, when Russia accelerated its bombardment of a residential district where Continued on Page A10  \n\nAlarm in Kharkiv — Talks Yield No Progress  \n\nThis article is by Valerie Hopkins, Steven  Erlanger and  Michael Schwirtz.  \n\nKYIV, Ukraine — The first talks between  Ukraine  and  Russia aimed at halting the Russian invasion were eclipsed Monday by a deadly Russian rocket assault on Kharkiv, Ukraine’s second-largest city, that raised new alarms about how far the Kremlin was willing to go to subjugate its smaller neighbor.  \n\nThe bombardment of a residential area of Kharkiv, which may have included internationally  banned  cluster  munitions, killed at least nine civilians and wounded dozens.  \n\nWith  the  Ukrainian-Russian talks ending with little more than an agreement to meet again, the bombardment signaled a potential turn in the biggest military mobilization",
    "chunk_order_index": 0,
    "full_doc_id": "doc-b90d9bf5e9f4eca17a63b308ebd4a46f"
  },
  "chunk-8aaaa277c22ade6a67aea7fe19bcadea": {
    "tokens": 1094,
    "content": "iv, Ukraine’s second-largest city, that raised new alarms about how far the Kremlin was willing to go to subjugate its smaller neighbor.  \n\nThe bombardment of a residential area of Kharkiv, which may have included internationally  banned  cluster  munitions, killed at least nine civilians and wounded dozens.  \n\nWith  the  Ukrainian-Russian talks ending with little more than an agreement to meet again, the bombardment signaled a potential turn in the biggest military mobilization  in  Europe  since World War II, in which Russia has met unexpectedly stiff resistance by Ukrainians and strong condemnation  from  much  of  the world.  \n\n“Today showed that this is not only a war, it is the murder of us, the Ukrainian people,” Kharkiv’s mayor, Igor Terekhov, said in a video posted on Facebook. “This is the first time in its many-year history that the city of Kharkiv has been through something like this:  shells  that  hit  residential homes, killing and maiming innocent citizens.”  \n\nRussian  forces  have  been shelling the outskirts of Kharkiv, an eastern Ukrainian city with 1.5 million people, since launching an invasion last week. But they appeared to be avoiding heavily populated areas.  \n\nOn Monday, the fifth day of the Russian  assault,  that  changed when Kharkiv was hit by a barrage of rockets.  \n\nMr. Terekhov said four people had  been  killed  when  they emerged from bomb shelters to find water. And he said a family of five — two adults and three children — was burned alive when a shell hit their car. Another 37 peoContinued on Page A12  \n\n![](images/image_2.jpg)  \n\n# What Afghans Couldn’t Leave Behind  \n\nMore than 120,000 people were airlifted out of Afghanistan last August, most with just a few hours to gather their belongings. Here are some of the keepsakes they chose. Pages A6-7.  \n\n# Time Is Running Out to Fix Climate, Report Says  \n\nThis article is by Brad Plumer, Raymond Zhong and Lisa Friedman.  \n\nThe dangers of climate change are mounting so rapidly that they could soon overwhelm the ability of nature and humanity to adapt, creating a harrowing future in which floods, fires and famine displace millions, species disappear and the planet is irreversibly damaged, a major new scientific report concluded. The report, released on Monday  \n\n# Warming May Outstrip  \n\n# the Ability to Adapt  \n\nby the Intergovernmental Panel on Climate Change, a body of experts convened by the United Nations, is the most detailed look yet at the threats posed by global warming. It concludes that nations are not doing nearly enough to protect cities, farms and coastlines from the hazards that climate  change  has  already  unleashed, such as record droughts and rising seas, let alone from the even greater disasters in store as the planet keeps heating up. Written  by  270  researchers from 67 countries, the report is “an atlas of human suffering and a damning indictment of failed climate leadership,” said António Guterres, the United Nations secretary general. “With fact upon fact, this report reveals how people and the planet are getting clobbered by climate change.” In  the  coming  decades,  as Continued on Page A8  \n\n# Justices Dispute E.P.A. Power to Curb Emissions  \n\nBy ADAM LIPTA WASHINGTON — Members of   \nthe Supreme Court’s conservative   \nmajority on Monday questioned   \nthe scope of the Environmental   \nProtection Agency’s ability to reg  \nulate  carbon  emissions  from   \npower plants, suggesting that the  \n\njustices could deal a sharp blow to the Biden administration’s efforts to address climate change. The questioning during the twohour argument was mostly technical, and several conservative justices did not tip their hands. But those who did sounded skeptical that Congress had meant to give the agency what they said was vast power to set national economic policy. Climate change was mentioned in passing and only to buttress the point that an executive agency should not be allowed to tackle so large an issue without express congressional authorization. A  ruling  against  the  E.P.A. Continued on Page A16  \n\nBiden Speech Gets a Rewrite The Ukraine crisis has supplanted the president’s domestic agenda as the primary focus of his State of the Union address on Tuesday. PAGE A18 SPORTS B7-9 Jeter and Marlins Part Ways A Hall of Famer used to excellence with the Yankees was an odd fit as chief executive of a franchise reluctant to spend, our columnist writes. PAGE B9 ARTS C1-6 Delving Into Dark Topics The Belgian musician Stromae marries serious subjects with dancey beats. His first album in years, “Multitude,” expands his spectrum of sounds.  PAGE C1  \n\n# SCIENCE TIMES D1-8  \n\nT. Rex, Relatively Speaking A new paper argues that Tyrannosaurus rex is not one but three species. Many experts disagree, saying the assertion requires more proof.  PAGE D1  \n\n# OPINION A22-23  \n\n# Michelle Goldberg  \n\n0 1354613  \n\n![](images/image_3.jpg)  \n\nsantafeopera.org 505-986-5900",
    "chunk_order_index": 1,
    "full_doc_id": "doc-b90d9bf5e9f4eca17a63b308ebd4a46f"
  }
}