{
    "image_1": {
        "image_id": 1,
        "image_path": "./fusion_research/fusion_dataset/news/20220301/images/image_1.jpg",
        "caption": [],
        "footnote": [],
        "context": "From culture to commerce, sports to travel, LONDON — In Switzerland, the Lucerne music festival canceled two symphony concerts featuring a Russian maestro. In Australia, the national swim team said it would boycott a world championship meet in Russia. At the Magic Mountain Ski Area in Vermont, a bartender poured bottles of Stolichnaya vodka down the drain. By MARK LANDLER sing Commerce and Culture, As War Grinds Into 5th Day, World Turns Its Back on Russia Kremlin Starts Hitting Harder A shelter at a children’s hospital in Kyiv on Monday. Russians bombarded a residential area of Kharkiv, Ukraine’s second-largest city. by Western countries to restrict the Russian central bank’s access to much of its \\$643 billion in foreign currency reserves, undoing some of the Kremlin’s careful efforts to soften the impact of potential sanctions and making it difficult for the bank to prop up the ruble. Other moves struck at the heart of critical Russian industries. Shell, a company that for years helped Russia profit from its energy riches, said it was exiting all its joint ventures with Gazprom, RusContinued on Page A13 CENTRAL BANK IS FROZEN OUT Taking aim at a key weakness for Russia: its currency. PAGE B1 ",
        "chunk_order_index": 0,
        "chunk_id": "chunk-7e6a7f644e5d720ac56a38b2c2ba4d9b",
        "description": "The image depicts a scene inside what appears to be a makeshift shelter or temporary living space. There are four people in the image: two adults and two children. One adult is sitting on the floor, holding a baby, with a concerned expression on her face. Another adult is seated nearby, engaged in conversation with the first adult. A young girl stands in the foreground, looking towards the camera, while another child sits at a table with food items such as bananas and bread. The background is cluttered with various objects, including bags, boxes, and other personal belongings. The overall atmosphere suggests a sense of urgency and discomfort, possibly indicating a situation of displacement or emergency. The lighting is dim, and the setting appears to be indoors, possibly in a basement or an unfinished room.",
        "segmentation": true
    },
    "image_2": {
        "image_id": 2,
        "image_path": "./fusion_research/fusion_dataset/news/20220301/images/image_2.jpg",
        "caption": [],
        "footnote": [],
        "context": "The dangers of climate change are mounting so rapidly that they could soon overwhelm the ability of nature and humanity to adapt, creating a harrowing future in which floods, fires and famine displace millions, species disappear and the planet is irreversibly damaged, a major This article is by Brad Plumer, Raymond Zhong and Lisa Friedman. Time Is Running Out to Fix Climate, Report Says More than 120,000 people were airlifted out of Afghanistan last August, most with just a few hours to gather their belongings. Here are some of the keepsakes they chose. Pages A6-7. What Afghans Couldn’t Leave Behind innocent citizens.” Russian forces have been shelling the outskirts of Kharkiv, an eastern Ukrainian city with 1.5 million people, since launching an invasion last week. But they appeared to be avoiding heavily populated areas. On Monday, the fifth day of the Russian assault, that changed when Kharkiv was hit by a barrage of rockets. Mr. Terekhov said four people had been killed when they emerged from bomb shelters to find water. And he said a family of five — two adults and three children — was burned alive when a shell hit their car. Another 37 peoContinued on Page A12 ",
        "chunk_order_index": 1,
        "chunk_id": "chunk-8aaaa277c22ade6a67aea7fe19bcadea",
        "description": "The image is a collage of six distinct photographs. The first photo shows a close-up of a person's face with a focus on their hand, which has a tattoo that reads '12/4'. The person is wearing a silver necklace and has a beard. The second photo depicts a person carrying a backpack with the number '1354' written on it. The third photo features a person holding a smartphone to their ear, with a focus on their hand and part of their face. The fourth photo is a close-up of a woman's hand with a ring, holding a wooden object. The fifth photo shows a butterfly with blue and purple wings resting on a textured surface. The sixth photo captures a person holding a book with an ornate cover, possibly a religious text.",
        "segmentation": true
    },
    "image_3": {
        "image_id": 3,
        "image_path": "./fusion_research/fusion_dataset/news/20220301/images/image_3.jpg",
        "caption": [],
        "footnote": [],
        "context": "santafeopera.org 505-986-5900 B7-9 Jeter and Marlins Part Ways A Hall of Famer used to excellence with the Yankees was an odd fit as chief executive of a franchise reluctant to spend, our columnist writes. PAGE B9 ARTS C1-6 Delving Into Dark Topics The Belgian musician Stromae marries serious subjects with dancey beats. His first album in years, “Multitude,” expands his spectrum of sounds. PAGE C1   SCIENCE TIMES D1-8 T. Rex, Relatively Speaking A new paper argues that Tyrannosaurus rex is not one but three species. Many experts disagree, saying the assertion requires more proof. PAGE D1 OPINION A22-23 Michelle Goldberg 0 1354613 ",
        "chunk_order_index": 1,
        "chunk_id": "chunk-8aaaa277c22ade6a67aea7fe19bcadea",
        "description": "The image is a promotional poster for five opera performances, each with its own distinct illustration and details. The first panel on the left features 'Carmen' by Georges Bizet, depicted with a vibrant scene of a red building with balconies, surrounded by scattered musical instruments and a roller coaster in the background, set against a twilight sky. The second panel shows 'The Barber of Seville' by Gioachino Rossini, illustrated with two large green mustaches forming an arch over a sandy ground with a small figure standing beneath them, under a cloudy sky. The third panel represents 'Falstaff' by Giuseppe Verdi, featuring a red building with a balcony where a figure appears to be singing, with a crescent moon and clouds in the night sky. The fourth panel is for 'Tristan und Isolde' by Richard Wagner, showing a pink structure with arched windows and a red sun setting behind it, under a dark sky. The fifth and final panel promotes 'M. Butterfly' with a world premiere, illustrated with a silhouette of a person looking out of a window at a butterfly flying outside, set against a dark blue background with Chinese characters. Each opera's performance dates are listed below their respective illustrations: Carmen (July 1-Aug 27), The Barber of Seville (July 2-Aug 26), Falstaff (July 16-Aug 25), Tristan und Isolde (July 23-Aug 23), and M. Butterfly (July 30-Aug 24).",
        "segmentation": true
    }
}