{
    "image_1": {
        "image_id": 1,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (4)/images/image_1.jpg",
        "caption": [],
        "footnote": [],
        "context": "They stood so still that she quite forgot they were alive, and she was just going round to see if the word ‘TWEEDLE’ was written at the back of each collar, when she was startled by a voice coming from the  tweedledum and tweedledee\\* They were standing under a tree, each with an arm round the other’s neck, and Alice knew which was which in a moment, because one of them had ‘DUM’ embroidered on his collar, and the other ‘DEE.’ ‘I suppose they’ve each got “TWEEDLE” round at the back of the collar,’ she said to herself. CHAPTER IV ",
        "chunk_order_index": 0,
        "chunk_id": "chunk-fc8cd8056074dc0bf9f555f4d74b9ff9",
        "description": "The image is a black-and-white illustration depicting a scene from the story of Alice in Wonderland. On the left side, there is a young girl with long hair, dressed in a dress and stockings, standing and facing two identical-looking men who are standing under a tree. The men are stout and have round faces, wearing uniforms with hats that resemble those of soldiers or guards. One of the men has 'DUM' embroidered on his collar, and the other has 'DEE.' They are standing close to each other, each with an arm around the other's neck. The background shows a forest setting with trees and foliage. The girl appears curious and is gesturing towards the men, possibly trying to see if the word 'TWEEDLE' is written at the back of their collars. The overall atmosphere is whimsical and fantastical, characteristic of the Alice in Wonderland narrative.",
        "segmentation": true
    },
    "image_2": {
        "image_id": 2,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (4)/images/image_2.jpg",
        "caption": [],
        "footnote": [],
        "context": "But four young Oysters hurried up, All eager for the treat: Their coats were brushed, their faces washed, Their shoes were The eldest Oyster looked at him, But never a word he said: The eldest Oyster winked his eye, And shook his heavy head–– Meaning to say he did not choose To leave the oyster-bed. “O Oysters, come and walk with us!” The Walrus did beseech. “A pleasant walk, a pleasant talk, Along the briny beach: We cannot do with more than four, To give a hand to each.” “I doubt it,” said the Carpenter, And shed a bitter tear. “To come and spoil the fun!” The sea was wet as wet could be, The sands were dry as dry. You could not see a cloud, because No cloud was in the sky: No birds were flying overhead–– There were no birds to fly. The Walrus and the Carpenter Were walking close at hand:\\* They wept like anything to see Such quantities of sand: “If this were only cleared away,” They said, “it would be grand!” “If seven maids with seven mops Swept it for half a year, Do you suppose,” the Walrus said, “That they could get it clear?” ",
        "chunk_order_index": 1,
        "chunk_id": "chunk-a9c7c0e77b59631f5144953245b536d2",
        "description": "The image is a black-and-white illustration featuring two anthropomorphic characters, a walrus and a carpenter, standing on a sandy beach. The walrus, on the left, is depicted with a long, curved tusks and a heavy, ponderous posture. It wears a coat and shoes, giving it a human-like appearance. The carpenter, on the right, has a more slender build and is dressed in a suit with a hat, also resembling a human. Both characters are engaged in conversation, as indicated by their postures and expressions. The background shows a calm sea with gentle waves and a clear sky, devoid of clouds or birds. The overall atmosphere is whimsical and surreal, capturing a moment from a narrative where animals are personified and interact with each other in a human-like manner.",
        "segmentation": true
    },
    "image_3": {
        "image_id": 3,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (4)/images/image_3.jpg",
        "caption": [],
        "footnote": [],
        "context": "“It seems a shame,” the Walrus said, “To play them such a trick. After we’ve brought them out so far, And made them trot so quick!” The Carpenter said nothing “It was so kind of you to come! And you are very nice!” The Carpenter said nothing but “Cut us another slice. I wish you were not quite so deaf–– I’ve had to ask you twice!” “But not on us!” the Oysters cried, Turning a little blue. “After such kindness, that would be A dismal thing to do!” “The night is fine,” the Walrus said. “Do you admire the view? row. “The time has come,” the Walrus said, “To talk of many things: Of shoes––and ships––and sealing-wax–– Of cabbages––and kings–– And why the sea is boiling hot–– And whether pigs have wings.” “But wait a bit,” the Oysters cried, “Before we have our chat; For some of us are out of breath, And all of us are fat!” “No hurry!” said the Carpenter. They thanked him much for that. “A loaf of bread,” the Walrus said, “Is what we chiefly need: Pepper and vinegar besides Are very good indeed–– Now, if you’re ready, Oysters dear, We can begin to feed.” ",
        "chunk_order_index": 1,
        "chunk_id": "chunk-a9c7c0e77b59631f5144953245b536d2",
        "description": "The image is a black and white illustration depicting a scene from Lewis Carroll's poem 'The Walrus and the Carpenter'. On the left side of the image, there is a walrus dressed in a suit with a bow tie, sitting on a rock. The walrus has a long mustache and tusks, and it appears to be speaking or gesturing. To the right, there is a carpenter wearing a hat and a coat, also sitting on a rock. The carpenter has a large nose and a serious expression. In front of them, there are several oysters, depicted as small, rounded figures with arms and legs, standing on the ground. The background shows a beach with waves and distant mountains. The overall atmosphere of the image conveys a sense of conversation and interaction between the characters, with the walrus and the carpenter seemingly discussing something with the oysters.",
        "segmentation": true
    },
    "image_4": {
        "image_id": 4,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (4)/images/image_4.jpg",
        "caption": [],
        "footnote": [],
        "context": "‘He ate more than the Carpenter, though,’ said Tweedledee. ‘You see he held his handkerchief in front, so that the Carpenter couldn’t count ‘I like the Walrus best,’ said Alice: ‘because he was a little sorry for the poor oysters.’ “O Oysters,” said the Carpenter, “You’ve had a pleasant run! Shall we be trotting home again?” But answer came there none–– And this was scarcely odd, because They’d eaten every one.’\\* “I weep for you,” the Walrus said: “I deeply sympathize.” With sobs and tears he sorted out Those of the largest size, Holding his pocket-handkerchief Before his streaming eyes. cried, Turning a little blue. “After such kindness, that would be A dismal thing to do!” “The night is fine,” the Walrus said. “Do you admire the view? “It was so kind of you to come! And you are very nice!” The Carpenter said nothing but “Cut us another slice. I wish you were not quite so deaf–– I’ve had to ask you twice!” “It seems a shame,” the Walrus said, “To play them such a trick. After we’ve brought them out so far, And made them trot so quick!” The Carpenter said nothing but “The butter’s spread too thick!” ",
        "chunk_order_index": 1,
        "chunk_id": "chunk-a9c7c0e77b59631f5144953245b536d2",
        "description": "The image is a black-and-white illustration depicting two characters from Lewis Carroll's 'Through the Looking-Glass.' On the left, there is a walrus dressed in human clothing, including a jacket and trousers, with a handkerchief held up to its face. The walrus appears to be speaking or gesturing. To the right, there is a man with a long nose and wild hair, wearing a hat and holding a spoon and a piece of bread. He is sitting on a rock and appears to be eating. The background shows a rocky shore with waves crashing against it, and the sky is filled with clouds. The overall atmosphere is whimsical and surreal, capturing the fantastical nature of the scene described in the text. The characters are engaged in an interaction that seems to involve eating and conversation, reflecting the narrative context provided.",
        "segmentation": true
    },
    "image_5": {
        "image_id": 5,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (4)/images/image_5.jpg",
        "caption": [],
        "footnote": [],
        "context": "‘Why, about you!’ Tweedledee exclaimed, clapping his hands triumphantly. ‘And if he left off Alice said ‘Nobody can guess that.’ ‘He’s dreaming now,’ said Tweedledee: ‘and what do you think he’s dreaming about?’ ‘I’m afraid he’ll catch cold with lying on the damp grass,’ said Alice, who was a very thoughtful little girl. Alice couldn’t say honestly that he was. He had a tall red night-cap on, with a tassel, and he was lying crumpled up into a sort of untidy heap, and snoring loud——‘fit to snore his head off!’ as Tweedledum remarked. ‘Isn’t he a lovely sight?’ said Tweedledum. Tweedledum. This was a puzzler. After a pause, Alice began, ‘Well! They were both very unpleasant characters——’ Here she checked herself in some alarm, at hearing something that sounded to her like the puffing of a large steam-engine in the wood near them, though she feared it was more likely to be a wild beast. ‘Are there any lions or tigers about here?’ she asked timidly. ‘It’s only the Red King snoring,’ said Tweedledee. ‘Come and look at him!’ the brothers cried, and they each took one of Alice’s hands, and led her up to where the King was sleeping. ",
        "chunk_order_index": 2,
        "chunk_id": "chunk-54d4ffd5ce4e1f0b5fa0dcbae8c91a17",
        "description": "The image is a black-and-white illustration depicting a whimsical scene from 'Alice in Wonderland.' It shows Tweedledum, one of the Tweedle brothers, lying on the ground in a crumpled heap. He is wearing a tall red night-cap with a tassel, which is a prominent feature of his attire. His posture is hunched and untidy, suggesting he is either sleeping or resting. The background consists of grass and trees, indicating an outdoor setting. The overall atmosphere is surreal and dreamlike, fitting the fantastical nature of the story. The illustration captures the essence of the characters and the peculiar situation described in the context, where Alice encounters the sleeping Tweedledum.",
        "segmentation": true
    },
    "image_6": {
        "image_id": 6,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (4)/images/image_6.jpg",
        "caption": [],
        "footnote": [],
        "context": "All this time Tweedledee was trying his best to fold up the umbrella, with himself in it: which was such an extraordinary thing to do, that it quite took off Alice’s attention from the angry brother. But he couldn’t quite succeed, and it ended in his rolling ‘But it isn’t old!’ Tweedledum cried, in a greater fury than ever. ‘It’s new, I tell you––I bought it yesterday––my nice new RATTLE!’ and his voice rose to a perfect scream. Alice laid her hand upon his arm, and said, in a soothing tone, ‘You needn’t be so angry about an old rattle.’  eyes grew large and yellow all in a moment, as he pointed with a trembling finger at a small white thing lying under the tree. ‘It’s only a rattle,’\\* Alice said, after a careful examination of the little white thing. ‘Not a rattle-snake, you know,’ she added hastily, thinking that he was frightened: ‘only an old rattle–– quite old and broken.’ ‘I knew it was!’ cried Tweedledum, beginning to stamp about wildly and tear his hair. ‘It’s spoilt, of course!’ Here he looked at Tweedledee, who immediately sat down on the ground, and tried to hide himself under the umbrella. ",
        "chunk_order_index": 2,
        "chunk_id": "chunk-54d4ffd5ce4e1f0b5fa0dcbae8c91a17",
        "description": "The image is a black-and-white illustration depicting a scene from the story of Alice in Wonderland. On the left side, there is a character who appears to be Tweedledum, characterized by his round face, large eyes, and exaggerated expression of anger and frustration. He is wearing a hat and a coat, and his posture suggests he is in the middle of a tantrum, with one arm raised and the other clutching an object that resembles a rattle. His eyes are wide open, and his mouth is agape, indicating a state of intense emotion. To his right stands Alice, a young girl with long, curly hair, dressed in a dress with a frilly collar and striped stockings. She has a calm and composed demeanor, extending her hand towards Tweedledum in a gesture of soothing or calming him down. The background is filled with swirling lines and shapes, suggesting movement and chaos, which adds to the overall atmosphere of tension and confusion. The illustration captures a moment of conflict and misunderstanding between Alice and Tweedledum, highlighting the absurdity and whimsical nature of the scene.",
        "segmentation": true
    },
    "image_7": {
        "image_id": 7,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (4)/images/image_7.jpg",
        "caption": [],
        "footnote": [],
        "context": "Alice laughed. ‘You must hit the trees pretty often, I should ‘And $I$ hit every thing within reach,’ cried Tweedledum, ‘whether I can see it or not!’ ‘Very well,’ the other said, rather sadly: ‘and she can watch us––only you’d better not come very close,’ he added: ‘I generally hit every thing I can see––when I get really excited.’  Tweedledee looked at his watch, and said ‘Half-past four.’ ‘Let’s fight till six, and then have dinner,’ said Tweedledum. ‘We must have a bit of a fight, but I don’t care about going on long,’ said Tweedledum. ‘What’s the time now?’ she managed to turn it into a cough, for fear of hurting his feelings. ‘Do I look very pale?’ said Tweedledum, coming up to have his helmet tied on. (He called it a helmet, though it certainly looked much more like a saucepan.) ‘Well––yes––a little,’ Alice replied gently. ‘I’m very brave, generally,’ he went on in a low voice: ‘only to-day I happen to have a headache.’ ‘And I’ve got a toothache!’ said Tweedledee, who had overheard the remark. ‘I’m far worse than you!’ ‘Then you’d better not fight to-day,’ said Alice, thinking it a good opportunity to make peace. ",
        "chunk_order_index": 3,
        "chunk_id": "chunk-e88bbdcba879d85263d57e4dbfd1f008",
        "description": "The image is a black-and-white illustration depicting a scene from the story of Alice in Wonderland. It shows Alice, a young girl with long hair, standing between two large, round characters who appear to be Tweedledum and Tweedledee. Alice is dressed in a dress with a white apron and is holding a small object in her hand. The character on the left, Tweedledum, is wearing a tall hat and a coat with a belt around his waist. He has a serious expression and is pointing at something with his right hand. The character on the right, Tweedledee, is also wearing a tall hat and a coat, but his hat is tilted to the side. He has a more relaxed posture and is looking towards Alice. Both characters have exaggerated features and are drawn in a whimsical, cartoonish style. The background is filled with trees and leaves, suggesting an outdoor setting. The overall atmosphere is one of whimsy and fantasy, capturing the surreal and humorous interactions between Alice and the Tweedle brothers.",
        "segmentation": true
    },
    "image_8": {
        "image_id": 8,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (4)/images/image_8.jpg",
        "caption": [],
        "footnote": [],
        "context": "‘I’m sure I’ll take you with pleasure!’ the Queen said. ‘Twopence Alice carefully released the brush, and did her best to get the hair into order. ‘Come, you look rather better now!’ she said, after altering most of the pins. ‘But really you should have a lady’s-maid!’ ‘The brush has got entangled in it!’ the Queen said with a sigh. ‘And I lost the comb yesterday.’ ‘It ca’n’t go straight, you know, if you pin it all on one side,’ Alice said, as she gently put it right for her; ‘and, dear me, what a state your hair is in!’ at all!’ groaned the poor Queen. ‘I’ve been a-dressing myself for the last two hours.’ It would have been all the better, as it seemed to Alice, if she had got some one else to dress her, she was so dreadfully untidy. ‘Every single thing’s crooked,’ Alice thought to herself, ‘and she’s all over pins!——May I put your shawl straight for you?’ she added aloud. ‘I don’t know what’s the matter with it!’ the Queen said, in a melancholy voice. ‘It’s out of temper, I think. I’ve pinned it here, and I’ve pinned it there, but there’s no pleasing it!’ ",
        "chunk_order_index": 4,
        "chunk_id": "chunk-e0508a0320d927bcbf7f1e59996d97a0",
        "description": "The image is a black-and-white illustration depicting a scene from the story of Alice in Wonderland. It shows Alice, a young girl with long hair tied back, standing to the right side of the image. She is wearing a dress with puffed sleeves and a full skirt. Alice is engaged in the act of grooming the Red Queen, who is seated on the left side of the image. The Queen is depicted as an older woman with a round face, wearing a crown and a robe that appears to be wrapped around her body. Her expression is one of discomfort or frustration, and she is holding a scepter in her left hand. Alice is carefully adjusting the Queen's hair, which is disheveled and tangled. The background is dark and shadowy, adding to the dramatic effect of the scene. The overall atmosphere conveys a sense of tension and awkwardness, as Alice tries to help the Queen with her appearance.",
        "segmentation": true
    },
    "image_9": {
        "image_id": 9,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (4)/images/image_9.jpg",
        "caption": [],
        "footnote": [],
        "context": "‘But if you hadn’t done them,’ the Queen said, ‘that would have been better still; better, and better, and better!’ Her voice went higher with each ‘better,’ till it got quite to ‘Yes, but then I had done the things I was punished for,’ said Alice: ‘that makes all the difference.’ ‘And you were all the better for it, I know!’ the Queen said triumphantly. ‘Only for faults,’ said Alice. ‘You’re wrong there, at any rate,’ said the Queen. ‘Were you ever punished?’ would be all the better,’ she said: ‘but it wouldn’t be all the better his being punished.’ happened the week after next,’ the Queen replied in a careless tone. ‘For instance, now,’ she went on, sticking a large piece of plaster on her finger as she spoke, ‘there’s the King’s Messenger. He’s in prison now, being punished: and the trial doesn’t even begin till next Wednesday: and of course the crime comes last of all.’ ‘Suppose he never commits the crime?’ said Alice. ‘That would be all the better, wouldn’t it?’ the Queen said, as she bound the plaster round her finger with a bit of ribbon. Alice felt there was no denying that. ‘Of course it ",
        "chunk_order_index": 4,
        "chunk_id": "chunk-e0508a0320d927bcbf7f1e59996d97a0",
        "description": "The image is a black-and-white illustration depicting a character in a state of distress. The character appears to be an elderly man with disheveled hair and a sorrowful expression, sitting on the ground with his knees drawn up to his chest. He is wearing a long coat and trousers, and his posture suggests he is in a confined space, possibly a cell. His hands are shackled together with a heavy chain that is attached to a large stone pillar beside him. Above his head, there is a bucket hanging from a hook on the wall. The floor is covered with straw, and there is a small jug lying on the ground near his feet. The overall atmosphere conveyed by the image is one of despair and confinement, with the character appearing to be in a state of deep contemplation or resignation. The illustration style is detailed and expressive, capturing the emotional weight of the scene.",
        "segmentation": true
    },
    "image_10": {
        "image_id": 10,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (4)/images/image_10.jpg",
        "caption": [],
        "footnote": [],
        "context": "She looked at the Queen, who seemed to have suddenly wrapped herself up in wool.\\* Alice rubbed her eyes, and looked again. She couldn’t make out what had happened at all. Was she in a shop?\\* And was that really––was it really a sheep that was sitting on the other side of the counter? Rub as she would, she could make nothing more ‘Oh, much better!’ cried the Queen, her voice rising into a squeak as she went on. ‘Much be-etter! Be-etter! Be-e-e-etter! Be-e-ehh!’ The last word ended in a long bleat, so like a sheep that Alice quite started. believed as many as six impossible things before breakfast. There goes the shawl again!’ The brooch had come undone as she spoke, and a sudden gust of wind blew the Queen’s shawl across a little brook. The Queen spread out her arms again, and went flying after it, and this time she succeeded in catching it for herself. ‘I’ve got it!’ she cried in a triumphant tone. ‘Now you shall see me pin it on again, all by myself!’  ‘Then I hope your finger is better now?’ Alice said very politely, as she crossed the little brook\\* after the Queen. ",
        "chunk_order_index": 5,
        "chunk_id": "chunk-9015acbd1380cca16515a5b99e6a1ffc",
        "description": "The image consists of a pattern of black asterisks (*) arranged in a grid-like formation against a white background. The asterisks are evenly spaced and form a series of horizontal rows. Each row contains a consistent number of asterisks, creating a uniform and repetitive visual effect. The overall appearance is simple and abstract, with no additional objects, scenes, or emotions conveyed.",
        "segmentation": false
    },
    "image_11": {
        "image_id": 11,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (4)/images/image_11.jpg",
        "caption": [],
        "footnote": [],
        "context": "But even this plan ‘Things flow about so here!’ she said at last in a plaintive tone, after she had spent a minute or so in vainly pursuing a large bright thing, that looked sometimes like a doll and sometimes like a work-box, and was always in the shelf next above the one she was looking at. ‘And this one is the most provoking of all––but I’ll tell you what—— ’ she added, as a sudden thought struck her. ‘I’ll follow it up to the very top shelf of all. It’ll puzzle it to go through the ceiling, I expect!’  Sheep; ‘but you ca’n’t look all round you–– unless you’ve got eyes at the back of your head.’ But these, as it happened, Alice had not got: so she contented herself with turning round, looking at the shelves as she came to them. The shop seemed to be full of all manner of curious things ––but the oddest part of it all was that, whenever she looked hard at any shelf, to make out exactly what it had on it, that particular shelf was always quite empty, though the others round it were crowded as full as they could hold. ",
        "chunk_order_index": 6,
        "chunk_id": "chunk-a9fd49b94f78e09a46e9721f797cd992",
        "description": "The image is a black-and-white illustration depicting a scene from 'Alice in Wonderland.' Alice, a young girl with long hair tied back, stands on the right side of the image, facing a sheep-like creature that appears to be a shopkeeper. The shopkeeper is seated behind a counter, which is filled with various items including baskets and jars. Alice is leaning on the counter, seemingly engaged in conversation with the shopkeeper. The background shows shelves filled with an assortment of objects, giving the impression of a cluttered and whimsical shop. The overall atmosphere is one of curiosity and wonder, as Alice interacts with the peculiar characters in this fantastical setting.",
        "segmentation": true
    },
    "image_12": {
        "image_id": 12,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (4)/images/image_12.jpg",
        "caption": [],
        "footnote": [],
        "context": "‘Was it? I didn’t see it,’ said Alice, peeping cautiously over the side of the boat into the dark water. ‘I wish it hadn’t let go––I should so like a little crab to take home with me!’ But the Sheep only laughed scornfully, and went on with However, she wasn’t a bit hurt, and was soon up again: the Sheep went on with her knitting all the while, just as if nothing had happened. ‘That was a nice crab you caught!’ she remarked, as Alice got back into her place, very much relieved to find herself still in the boat. dreamrushes, melted away almost like snow, as they lay in heaps at her feet––but Alice hardly noticed this, there were so many other curious things to think about.  They hadn’t gone much farther before the blade of one of the oars got fast in the water and wouldn’t come out again (so Alice explained it afterwards), and the consequence was that the handle of it caught her under the chin, and, in spite of a series of little shrieks of ‘Oh, oh, oh!’ from poor Alice, it swept her straight off the seat, and down among the heap of rushes. ",
        "chunk_order_index": 7,
        "chunk_id": "chunk-655e59e5d6e63fafc3aba38f4b0967fa",
        "description": "The image is a black-and-white illustration depicting a scene from 'Alice in Wonderland.' Alice, a young girl with long hair, is seated in a boat, holding an oar. She appears to be engaged in a conversation with a sheep, who is knitting and sitting on the bank of a river or stream. The sheep is dressed in a bonnet and apron, and her wool is depicted as if it is melting away like snow. The background shows a window with various objects, including a teapot, cups, and other kitchenware. The scene is set in a whimsical, dreamlike atmosphere, with the sheep's wool appearing to dissolve into the air. Alice seems curious and slightly cautious, as indicated by her posture and expression. The sheep, on the other hand, appears indifferent and continues knitting despite the unusual events unfolding around her. The overall mood of the image conveys a sense of wonder and surrealism.",
        "segmentation": true
    },
    "image_13": {
        "image_id": 13,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (4)/images/image_13.jpg",
        "caption": [],
        "footnote": [],
        "context": "However, the egg only got larger and larger, and more and more human: when she had come within a few yards of it, she saw that it had eyes and a nose and mouth; and, when she had come close to it, she saw clearly that it was HUMPTY DUMPTY himself. ‘It ca’n’t be anybody else!’ she said to herself. ‘I’m as humpty dumpty\\* CHAPTER VI So she went on, wondering more and more at every step, as everything turned into a tree the moment she came up to it, and she quite expected the egg to do the same. for yourself.’ And so saying, she went off to the other end of the shop,\\* and set the egg upright on a shelf. ‘I wonder why it wouldn’t do?’ thought Alice, as she groped her way among the tables and chairs, for the shop was very dark towards the end. ‘The egg seems to get further away the more I walk towards it. Let me see, is this a chair? Why, it’s got branches, I declare! How very odd to find trees growing here! And actually here’s a little brook!\\* Well, this is the very queerest shop I ever saw!’  ",
        "chunk_order_index": 7,
        "chunk_id": "chunk-655e59e5d6e63fafc3aba38f4b0967fa",
        "description": "The image consists of a pattern of black asterisks (*) arranged in a grid-like formation against a white background. The asterisks are evenly spaced and form three distinct rows. Each row contains a series of asterisks, with the middle row having fewer asterisks than the top and bottom rows. The overall appearance is simple and repetitive, with no additional objects, scenes, or emotions conveyed.",
        "segmentation": false
    },
    "image_14": {
        "image_id": 14,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (4)/images/image_14.jpg",
        "caption": [],
        "footnote": [],
        "context": "Alice made a short calculation, and ‘In that case we start afresh,’ said Humpty Dumpty, ‘and it’s my turn to choose a subject——’ (‘He talks about it justas if it was a game!’ thought Alice.) ‘So here’s a question for you. How old did you say you were?’ ‘I’m afraid I ca’n’t quite remember it,’ Alice said, very politely. ‘Yes, all his horses and all his men,’ Humpty Dumpty went on. ‘They’d pick me up again in a minute, they would! However, this conversation is going on a little too fast: let’s go back to the last remark but one.’  too bad!’ Humpty Dumpty cried, breaking into a sudden passion. ‘You’ve been listening at doors––and behind trees––and down chimneys––or you couldn’t have known it!’ ‘I haven’t, indeed!’ Alice said very gently. ‘It’s in a book.’ ‘Ah, well! They may write such things in a book,’ Humpty Dumpty said in a calmer tone. ‘That’s what you call a History of England, that is. Now, take a good look at me! I’m one that has spoken to a King, $I$ am: mayhap you’ll never see such then I don’t know what would happen to his head! I’m afraid it would come off!’ ",
        "chunk_order_index": 8,
        "chunk_id": "chunk-de621d6da18e8cc5591d09e8fc127d25",
        "description": "The image is an illustration from the classic children's book 'Alice in Wonderland.' It depicts a scene where Alice, a young girl with long hair tied back, is standing on the ground and reaching up to shake hands with Humpty Dumpty, who is perched precariously on a wall. Humpty Dumpty is drawn as an egg-shaped character with a large head and small limbs, wearing a striped outfit. He is leaning forward with a wide grin, extending his hand towards Alice. The background shows a stone wall with some plants growing on it, and the ground appears to be grassy. The overall atmosphere of the image is whimsical and fantastical, capturing the surreal and dreamlike quality of the story. The text accompanying the image is a dialogue between Alice and Humpty Dumpty, discussing various topics such as age and history.",
        "segmentation": true
    },
    "image_15": {
        "image_id": 15,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (4)/images/image_15.jpg",
        "caption": [],
        "footnote": [],
        "context": "‘They are that,’ said Humpty Dumpty: ‘also they make their nests under sun-dials––also they live on cheese.’ ‘And what’s to “gyre” and to “gimble”?’ ‘To “gyre” is to go round and round like a gyroscope. To “gimble” is to make holes like a gimblet.’ ‘And “the wabe” is the grass-plot round a sun-dial, I suppose?’ said Alice, surprised at her own ingenuity. ‘Of course it is. It’s called “wabe,” you know, because it goes a long way before it, and a long way behind it——‘And a long way beyond it on each side,’ Alice added. ‘Exactly so. Well then, “mimsy” so Alice repeated the first verse:–– ‘That’s enough to begin with,’ Humpty Dumpty interrupted: ‘there are plenty of hard words there. “Brillig” means four o’clock in the afternoon––the time when you begin broiling things for dinner.’ ‘That’ll do very well,’ said Alice: ‘and “slithy”?’ ‘Well, “slithy” means “lithe and slimy.” “Lithe” is the same as “active.” You see it’s like a portmanteau\\*––there are two meanings packed up into one word.’ ‘I see it now,’ Alice remarked thoughtfully: ‘and what are “toves”?’ ‘Well, “toves” are something like badgers––they’re something like lizards––and they’re something like corkscrews.’ ‘They must be very curious-looking creatures. ",
        "chunk_order_index": 10,
        "chunk_id": "chunk-4147c294af03ca342f69aec02d7c8742",
        "description": "The image is a black-and-white illustration featuring a whimsical and fantastical scene. At the center, there are several creatures that resemble a mix of badgers, lizards, and corkscrews, as described in the context. These creatures, known as 'toves,' have long, curved tails and spiky fur. They appear to be engaged in various activities, possibly related to their nesting behavior under sun-dials, as mentioned in the text. In the background, there is a large sundial with a column-like structure, which serves as a focal point in the scene. The ground around the sundial is depicted as a grassy area, referred to as the 'wabe' in the context. There are also three pig-like animals in the background, which seem to be grazing or moving around. The overall atmosphere of the image is surreal and imaginative, capturing the essence of the fantastical world described in the text.",
        "segmentation": true
    },
    "image_16": {
        "image_id": 16,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (4)/images/image_16.jpg",
        "caption": [],
        "footnote": [],
        "context": "‘But he was very stiff and proud: He said “You needn’t shout so loud!” And he was very proud and stiff: He said “I’d go and wake them, if——” I took a corkscrew from the shelf: I went to wake them up myself. And when I found the door was locked, I pulled and pushed and kicked and knocked. And when I found the door was shut, I tried to turn the Humpty Dumpty raised his voice almost to a scream as he repeated this verse, and Alice thought, with a shudder, ‘I wouldn’t have been the messenger for anything!’ The fishes answered, with a grin, “Why, what a temper you are in!” I told them once, I told them twice: They would not listen to advice. I took a kettle large and new, Fit for the deed I had to do. My heart went hop, my heart went thump: I filled the kettle at the pump. Then some one came to me and said “The little fishes are in bed.” I said to him, I said it plain, “Then you must wake them up again.” I said it very loud and clear: I went and shouted in his ear.’ ",
        "chunk_order_index": 11,
        "chunk_id": "chunk-92dcf7f8c01b64223fb81fdf9cd1f473",
        "description": "The image is a black and white illustration depicting a whimsical scene from 'Alice in Wonderland.' It shows two characters engaged in an unusual interaction. On the left, there is a character with a round head and a large face, wearing a suit and standing on a stool. This character has a surprised or shocked expression, with wide eyes and an open mouth. The character's body is small compared to the head, giving it a comical appearance. On the right, there is another character with a tall, thin body and long legs, wearing a hat and a suit. This character appears to be speaking or shouting at the first character, with one hand raised as if emphasizing a point. The background is simple, with a teapot lying on the ground next to the stool. The overall atmosphere of the image is humorous and surreal, capturing the fantastical nature of the story.",
        "segmentation": true
    },
    "image_17": {
        "image_id": 17,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (4)/images/image_17.jpg",
        "caption": [
            "‘I only wish $I$ had such eyes,’ the King remarked in a fretful tone. ‘To be able to see Nobody! And at that distance too! Why, it’s as much as $I$ can do to see real people, by this light!’ "
        ],
        "footnote": [],
        "context": "‘Not at all,’ said the King. ‘He’s an Anglo-Saxon Messenger ––and those are Anglo-Saxon attitudes.\\* He only does them when he’s happy. His name is Haigha.’\\* (He pronounced it so as to All this was lost on Alice, who was still looking intently along the road, shading her eyes with one hand. ‘I see somebody now!’ she exclaimed at last. ‘But he’s coming very slowly ––and what curious attitudes he goes into!’ (For the Messenger kept skipping up and down, and wriggling like an eel, as he came along, with his great hands spread out like fans on each side.) delight, on seeing Alice. ‘Did you happen to meet any soldiers, my dear, as you came through the wood?’ ‘Yes, I did,’ said Alice: ‘several thousand, I should think.’ ‘Four thousand two hundred and seven, that’s the exact number,’ the King said, referring to his book. ‘I couldn’t send all the horses, you know, because two of them are wanted in the game. And I haven’t sent the two Messengers, either. They’re both gone to the town. Just look along the road, and tell me if you can see either of them.’ ‘I see nobody on the road,’ said Alice. ",
        "chunk_order_index": 11,
        "chunk_id": "chunk-92dcf7f8c01b64223fb81fdf9cd1f473",
        "description": "The image is a detailed black-and-white illustration depicting a chaotic battle scene. The scene is crowded with numerous armored knights and soldiers engaged in combat. The knights are mounted on horses, which are also armored, and are wielding various weapons such as swords, lances, and shields. The soldiers are depicted in various postures of attack and defense, with some falling to the ground, suggesting intense fighting. The background shows a dense forest, adding to the sense of disorder and confusion. The overall atmosphere conveyed is one of tension and violence, characteristic of a medieval battle. The intricate details in the armor, weapons, and expressions of the figures add to the vividness of the scene.",
        "segmentation": true
    },
    "image_18": {
        "image_id": 18,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (4)/images/image_18.jpg",
        "caption": [],
        "footnote": [],
        "context": "‘Nobody,’ ‘Who did you pass on the road?’ the King went on, holding out his hand to the Messenger for some more hay. ‘I didn’t say there was nothing better,’ the King replied. ‘I said there was nothing like it.’ Which Alice did not venture to deny. ‘I should think throwing cold water over you would be better,’ Alice suggested: ‘––or some sal-volatile.’\\* Alice was glad to see that it revived him a good deal. ‘There’s nothing like eating hay when you’re faint,’ he remarked to her, as he munched away. ‘Hay, then,’ the King murmured in a faint whisper. an H,’ the King said, introducing Alice in the hope of turning off the Messenger’s attention from himself––but it was of no use––the AngloSaxon attitudes only got more extraordinary every moment, while the great eyes rolled wildly from side to side. ‘You alarm me!’ said the King. ‘I feel faint— Give me a ham sandwich!’ On which the Messenger, to Alice’s great amusement, opened a bag that hung round his neck, and handed a sandwich to the King, who devoured it greedily. ‘Another sandwich!’ said the King. ‘There’s nothing but hay left now,’ the Messenger said, peeping into the bag. ",
        "chunk_order_index": 12,
        "chunk_id": "chunk-89e32c9b67baf561f124619c34d8f9ab",
        "description": "The image is a black-and-white illustration depicting three characters from the story of Alice in Wonderland. On the left, there is a character resembling a king, characterized by a round body with horizontal stripes and a crown on his head. He holds a scepter in one hand and appears to be speaking or gesturing with the other. In the middle, there is a girl with long hair, dressed in a dress with a pinafore, who seems to be observing the scene. On the right, there is a character resembling a rabbit, wearing a coat and carrying a bag over its shoulder. The background shows a forest setting with trees and grass, suggesting an outdoor scene. The overall atmosphere is whimsical and fantastical, typical of the Alice in Wonderland narrative.",
        "segmentation": true
    },
    "image_19": {
        "image_id": 19,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (4)/images/image_19.jpg",
        "caption": [],
        "footnote": [],
        "context": "There was a pause in the fight just then, and the Lion and the Unicorn sat down, panting, while the King called ‘It’s waiting for ’em now,’ said Hatta; ‘this is a bit of it as I’m eating.’ ‘Then I suppose they’ll soon bring the white bread and the brown?’ Alice ventured to remark. Hatta made a desperate effort, and swallowed a large piece of bread-and-butter. ‘They’re getting on very well,’ he said in a choking voice: ‘each of them has been down about eightyseven times.’\\* ‘Speak, wo’n’t you!’ cried the King. ‘How are they getting on with the fight?’ his tea when he was sent in,’ Haigha whispered to Alice: ‘and they only give them oyster-shells\\* in there––so you see he’s very hungry and thirsty. How are you, dear child?’ he went on, putting his arm affectionately round Hatta’s neck. Hatta looked round and nodded, and went on with his bread-and-butter. ‘Were you happy in prison, dear child?’ said Haigha. Hatta looked round once more, and this time a tear or two trickled down his cheek; but not a word would he say. ‘Speak, ca’n’t you!’ Haigha cried impatiently. But Hatta only munched away, and drank some more tea. ",
        "chunk_order_index": 13,
        "chunk_id": "chunk-b1f8a7638b6026887d2a45a300e90a2b",
        "description": "The image is a black-and-white illustration depicting a whimsical scene from Lewis Carroll's 'Through the Looking-Glass'. The main characters include Alice, who stands on the left side of the image. She is dressed in a dress with long sleeves and appears to be observing the scene. To her right is the White Rabbit, who is holding a large piece of bread-and-butter. Next to the rabbit is the King, who is wearing a crown and a robe, and he seems to be speaking or shouting. In front of the King is another character, possibly Hatta, who is also eating bread-and-butter and appears to be in distress, as indicated by the tears trickling down his cheek. On the right side of the image, there are two fantastical creatures, a lion and a unicorn, who are sitting down and panting, suggesting they have been engaged in a fight. The background features a town with pointed rooftops and chimneys, adding to the surreal atmosphere of the scene. The overall mood of the image conveys a mix of whimsy, tension, and surrealism, characteristic of Carroll's work.",
        "segmentation": true
    },
    "image_20": {
        "image_id": 20,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (4)/images/image_20.jpg",
        "caption": [],
        "footnote": [],
        "context": "The King was evidently very uncomfortable at having to sit down between the two great creatures; but there was ‘Then hand round the plum-cake, Monster,’ the Lion said, lying down and putting his chin on his paws. ‘And sit down, both of you,’ (to the King and the Unicorn): ‘fair play with the cake, you know!’ ‘It’s a fabulous monster!’ the Unicorn cried out, before Alice could reply. The Lion looked at Alice wearily. ‘Are you animal––or vegetable––or mineral?’\\* he said, yawning at every other word. ‘Ah, what is it, now?’ the Unicorn cried eagerly. ‘You’ll never guess! $I$ couldn’t.’  ‘Open the bag!’ he whispered. ‘Quick! Not that one––that’s full of hay!’ Haigha took a large cake out of the bag, and gave it to Alice to hold, while he got out a dish and carving-knife. How they all came out of it Alice couldn’t guess. It was just like a conjuring-trick, she thought. The Lion had joined them while this was going on: he looked very tired and sleepy, and his eyes were half shut. ‘What’s this!’ he said, blinking lazily at Alice, and speaking in a deep hollow tone that sounded like the tolling of a great bell. ",
        "chunk_order_index": 14,
        "chunk_id": "chunk-a13ec2ac9ad9365599f95029e5b2582f",
        "description": "The image is a black-and-white illustration depicting a scene from the story of Alice in Wonderland. In the center, Alice, a young girl with long hair, is holding a large plum cake on a platter. To her left stands an unicorn, dressed in a striped garment and wearing a crown, appearing to be in a conversation with the lion on the right. The lion, with a mane and a somewhat tired expression, is lying down with his chin resting on his paws. Behind Alice, there is a figure with rabbit-like ears, possibly the White Rabbit, holding a staff and a ball. The background includes tall grass and a few plants, suggesting an outdoor setting. The overall atmosphere is whimsical and fantastical, capturing the surreal and dreamlike quality of the story.",
        "segmentation": true
    },
    "image_21": {
        "image_id": 21,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (4)/images/image_21.jpg",
        "caption": [],
        "footnote": [],
        "context": "After a while the noise seemed gradually to die away, till all was dead silence, and Alice lifted up her head in some alarm. There was no one to be seen, and her first ‘it’s my own invention’ CHAPTER VIII  ‘If that doesn’t “drum them out of town,”’ she thought to herself, ‘nothing ever will!’ and had just time to see the Lion and the Unicorn rise to their feet, with angry looks at being interrupted in their feast, before she dropped to her knees, and put her hands over her ears, vainly trying to shut out the dreadful uproar. dish. ‘I say, this isn’t fair!’ cried the Unicorn, as Alice sat with the knife in her hand, very much puzzled how to begin. ‘The Monster has given the Lion twice as much as me!’ ‘She’s kept none for herself, anyhow,’ said the Lion. ‘Do you like plum-cake, Monster?’ But before Alice could answer him, the drums began. Where the noise came from, she couldn’t make out: the air seemed full of it, and it rang through and through her head till she felt quite deafened. She started to her feet and sprang across the little brook\\* in her terror, ",
        "chunk_order_index": 14,
        "chunk_id": "chunk-a13ec2ac9ad9365599f95029e5b2582f",
        "description": "The image consists of a series of asterisks arranged in a pattern. There are three rows of asterisks, with the top and bottom rows containing seven asterisks each, and the middle row containing five asterisks. The asterisks are evenly spaced and aligned horizontally across the image. The background is plain white, and there are no other objects or elements present in the image.",
        "segmentation": false
    },
    "image_22": {
        "image_id": 22,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (4)/images/image_22.jpg",
        "caption": [],
        "footnote": [],
        "context": "After a while the noise seemed gradually to die away, till all was dead silence, and Alice lifted up her head in some alarm. There was no one to be seen, and her first thought was that she must have been dreaming about the Lion and the Unicorn and those queer Anglo-Saxon Messengers. However, there was the great dish still lying at her feet, on which she had tried to cut the plum-cake, ‘So I wasn’t dreaming, after all,’ she said to herself, ‘unless––unless we’re all part of the same dream. Only I do ‘it’s my own invention’ CHAPTER VIII noise came from, she couldn’t make out: the air seemed full of it, and it rang through and through her head till she felt quite deafened. She started to her feet and sprang across the little brook\\* in her terror,  and had just time to see the Lion and the Unicorn rise to their feet, with angry looks at being interrupted in their feast, before she dropped to her knees, and put her hands over her ears, vainly trying to shut out the dreadful uproar. ‘If that doesn’t “drum them out of town,”’ she thought to herself, ‘nothing ever will!’ ",
        "chunk_order_index": 14,
        "chunk_id": "chunk-a13ec2ac9ad9365599f95029e5b2582f",
        "description": "The image is a black-and-white illustration depicting a scene from the story of Alice in Wonderland. Alice, a young girl with long hair, is shown kneeling on the ground with her hands covering her ears. She appears to be in a state of distress or alarm, as indicated by her posture and expression. The background is filled with numerous drumsticks and drums, which are depicted as if they are floating or flying around Alice, creating a chaotic and noisy atmosphere. The drums and drumsticks are drawn in a whimsical and exaggerated style, contributing to the surreal and fantastical nature of the scene. The ground beneath Alice is grassy, and there is a small brook nearby. The overall mood of the image conveys a sense of chaos and confusion, as Alice tries to block out the overwhelming noise.",
        "segmentation": true
    },
    "image_23": {
        "image_id": 23,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (4)/images/image_23.jpg",
        "caption": [],
        "footnote": [],
        "context": "‘So you will, when you’ve crossed the next brook,’ said the White Knight. ‘I’ll ‘I don’t know,’ Alice said doubtfully. ‘I don’t want to be anybody’s prisoner. I want to be a Queen.’ ‘It was a glorious victory,\\* wasn’t it?’ said the White Knight, as he came up panting. Another Rule of Battle, that Alice had not noticed, seemed to be that they always fell on their heads; and the battle ended with their both falling off in this way, side by side. When they got up again, they shook hands, and then the Red Knight mounted and galloped off.\\*  she said to herself, as she watched the fight, timidly peeping out from her hiding-place. ‘One Rule seems to be, that if one Knight hits the other, he knocks him off his horse; and, if he misses, he tumbles off himself––and another Rule seems to be that they hold their clubs with their arms, as if they were Punch and Judy What a noise they make when they tumble! Just like a whole set of fire-irons falling into the fender! And how quiet the horses are! They let them get on and off them just as if they were tables!’ ",
        "chunk_order_index": 15,
        "chunk_id": "chunk-2adf172dea4c3ec6f34eca88a6b6b035",
        "description": "The image is a black-and-white illustration depicting a scene from 'Alice in Wonderland.' Alice, a young girl with long hair, is sitting on the ground, watching a battle between two knights. The White Knight, dressed in armor and riding a white horse, is engaged in combat with the Red Knight, who is also armored and mounted on a black horse. Both knights are holding clubs, which they use to hit each other. The White Knight's club has a star-shaped end, while the Red Knight's club is more traditional. The knights are depicted in a dynamic pose, with the White Knight appearing to have just hit the Red Knight, causing him to fall off his horse. Alice is positioned behind a tree, peeping out with a curious and slightly apprehensive expression. The background consists of trees and bushes, adding to the whimsical and fantastical atmosphere of the scene.",
        "segmentation": true
    },
    "image_24": {
        "image_id": 24,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (4)/images/image_24.jpg",
        "caption": [],
        "footnote": [],
        "context": "Alice could think of nothing better ‘I’ve had plenty of practice,’ the Knight said very gravely: ‘plenty of practice!’ ‘Because people don’t fall off quite so often, when they’ve had much practice.’ The Knight looked very much surprised, and a little offended at the remark. ‘What makes you say that?’ he asked, as he scrambled back into the saddle, keeping hold of Alice’s hair with one hand, to save himself from falling over on the other side. ‘I’m afraid you’ve not had much practice in riding,’ she ventured to say, as she was helping him up from his fifth tumble.  the idea, and every now and then stopping to help the poor Knight, who certainly was not a good rider. Whenever the horse stopped (which it did very often), he fell off in front; and, whenever it went on again (which it generally did rather suddenly), he fell off behind. Otherwise he kept on pretty well, except that he had a habit of now and then falling off sideways; and, as he generally did this on the side on which Alice was walking, she soon found that it was the best plan not to walk quite close to the horse. ",
        "chunk_order_index": 16,
        "chunk_id": "chunk-724136f1a294c8fd1af5a2c5011d9f50",
        "description": "The image is a black-and-white illustration depicting a scene from the story of Alice in Wonderland. It shows Alice, a young girl with long hair, standing next to a horse and a knight. The knight is mounted on the horse but appears to be struggling to stay on, as he is leaning forward with one hand holding onto Alice's hair for support. The knight is dressed in armor and has a large mustache and wild hair, giving him a somewhat comical appearance. The horse is heavily laden with various items tied to its back, including what appear to be sacks and possibly food or supplies. Alice is looking up at the knight with a curious and slightly concerned expression. The background is a simple sketch of trees and grass, suggesting an outdoor setting. The overall atmosphere is whimsical and humorous, capturing the quirky interactions between Alice and the knight.",
        "segmentation": true
    },
    "image_25": {
        "image_id": 25,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (4)/images/image_25.jpg",
        "caption": [],
        "footnote": [],
        "context": "‘Well, not the next day,’ the Knight repeated as before: ‘not the next day. In fact,’ he went on, holding his head down, and his voice getting lower and lower, ‘I don’t believe that pudding ever was cooked! In fact, I don’t believe that ‘Then it would have to be the next day. I suppose you wouldn’t have two pudding-courses in one dinner?’ ‘Well, not the next course,’ the Knight said in a slow thoughtful tone: ‘no, certainly not the next course.’ ‘In time to have it cooked for the next course?’ said Alice. ‘Well, that was quick work, certainly!’  the man in it, too.’ ‘How can you go on talking so quietly, head downwards?’ Alice asked, as she dragged him out by the feet, and laid him in a heap on the bank. The Knight looked surprised at the question. ‘What does it matter where my body happens to be?’ he said. ‘My mind goes on working all the same. In fact, the more head-downwards I am, the more I keep inventing new things.’ ‘Now the cleverest thing of the sort that I ever did,’ he went on after a pause, ‘was inventing a new pudding during the meat-course.’ ",
        "chunk_order_index": 17,
        "chunk_id": "chunk-01e44b3e69b04f6d4f4c4d87b5ecd71a",
        "description": "The image is a black-and-white illustration depicting a scene from the story of Alice in Wonderland. It shows Alice, a young girl with long hair, interacting with a knight who appears to be in distress. The knight is dressed in armor and is lying on the ground, seemingly unconscious or exhausted. Alice is holding a large spoon and appears to be trying to revive or help the knight. The background is filled with tall grass and plants, giving the impression of an outdoor setting. The knight's posture is awkward and ungainly, suggesting he has fallen or been knocked over. Alice's expression is one of concern and curiosity as she leans over the knight. The overall atmosphere of the image conveys a sense of whimsy and fantasy, typical of the Alice in Wonderland narrative.",
        "segmentation": true
    },
    "image_26": {
        "image_id": 26,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (4)/images/image_26.jpg",
        "caption": [],
        "footnote": [],
        "context": "I heard him then, for I had just Completed my design “I sometimes dig for buttered rolls, Or set limed twigs\\* for crabs: I sometimes search the grassy knolls For wheels of Hansom-cabs.\\* And that’s the way” (he gave a wink) “By which I get my wealth–– And very gladly will I drink Your Honour’s noble health.” He said “I hunt for haddocks’ eyes Among the heather bright, And work them into waistcoat-buttons In the silent night. And these I do not sell for gold Or coin of silvery shine, But for a copper halfpenny, And that will purchase nine. him on the head. His accents mild took up the tale: He said “I go my ways, And when I find a mountain-rill, I set it in a blaze; And thence they make a stuff they call Rowland’s Macassar-Oil\\*–– Yet twopence-halfpenny is all They give me for my toil.” But I was thinking of a way To feed oneself on batter, And so go on from day to day Getting a little fatter. I shook him well from side to side, Until his face was blue: “Come, tell me how you live,” I cried, “And what it is you do!” ",
        "chunk_order_index": 19,
        "chunk_id": "chunk-15cd8f78b8f408e6f0bb575dd105ac50",
        "description": "The image is a black and white illustration depicting two characters in a humorous and exaggerated manner. The character on the left appears to be an older man with wild hair, wearing a large hat and a long coat. He is sitting on a wooden fence, his legs dangling over one side, and he seems to be in a state of distress or discomfort. His posture is awkward, with one arm hanging down and the other bent at the elbow. The character on the right is a skeleton, standing upright and leaning against the fence with its arms crossed. The skeleton has a comical expression, with its head tilted slightly and its eyes wide open. The background shows a natural setting with trees and bushes, and the ground is covered with leaves and small plants. The overall atmosphere is whimsical and surreal, with a touch of absurdity and humor. The illustration style is detailed and expressive, capturing the exaggerated features and emotions of the characters.",
        "segmentation": true
    },
    "image_27": {
        "image_id": 27,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (4)/images/image_27.jpg",
        "caption": [],
        "footnote": [],
        "context": "It was a golden crown. ‘But how can it have got there without my knowing it?’ she said to herself, as she lifted it off, and set it on her lap to make out what it could possibly be. and threw herself down to rest on a lawn as soft as moss, with little flower-beds dotted about it here and there. ‘Oh, how glad I am to get here! And what is this on my head?’ she exclaimed in a tone of dismay, as she put her hands up to something very heavy, that fitted tight all round her head. the horse walking leisurely along the road, and the Knight tumbling off, first on one side and then on the other. After the fourth or fifth tumble he reached the turn,\\* and then she waved her handkerchief to him, and waited till he was out of sight. ‘I hope it encouraged him,’ she said, as she turned to run down the hill: ‘and now for the last brook, and to be a Queen! How grand it sounds!’ A very few steps brought her to the edge of the brook.\\* ‘The Eighth Square at last!’ she cried as she bounded across,\\*  ",
        "chunk_order_index": 19,
        "chunk_id": "chunk-15cd8f78b8f408e6f0bb575dd105ac50",
        "description": "The image consists of a pattern of asterisks arranged in rows and columns. There are three rows, each containing a different number of asterisks. The first row has nine asterisks, the second row has seven asterisks, and the third row has eleven asterisks. The asterisks are evenly spaced within each row, creating a uniform and symmetrical appearance. The background is plain white, which contrasts with the black color of the asterisks, making them stand out clearly.",
        "segmentation": false
    },
    "image_28": {
        "image_id": 28,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (4)/images/image_28.jpg",
        "caption": [],
        "footnote": [],
        "context": "So she got up and walked about––rather stiffly just at first, as she was afraid that the crown might come off: but she comforted herself with the thought that there was nobody to see her, ‘and ‘Well, this is grand!’ said Alice. ‘I never expected I should be a Queen so soon––and I’ll tell you what it is, your Majesty,’ she went on, in a severe tone (she was always rather fond of scolding herself), ‘it’ll never do for you to be lolling about on the grass like that! Queens have to be dignified, you know!’ queen alice CHAPTER IX and threw herself down to rest on a lawn as soft as moss, with little flower-beds dotted about it here and there. ‘Oh, how glad I am to get here! And what is this on my head?’ she exclaimed in a tone of dismay, as she put her hands up to something very heavy, that fitted tight all round her head. ‘But how can it have got there without my knowing it?’ she said to herself, as she lifted it off, and set it on her lap to make out what it could possibly be. It was a golden crown. ",
        "chunk_order_index": 19,
        "chunk_id": "chunk-15cd8f78b8f408e6f0bb575dd105ac50",
        "description": "The image is a black-and-white illustration depicting a young girl sitting on the ground. She has long, wavy hair and is wearing a dress with a puffed sleeve and a high collar. On her head, she is wearing a crown that appears to be made of metal or gold, with pointed tips and a spherical ornament at the top. The girl is holding the crown with both hands, as if adjusting it or ensuring it stays in place. Her expression seems contemplative or slightly puzzled, possibly indicating surprise or curiosity about the crown. The background is minimalistic, with vertical lines suggesting grass or a similar texture. The overall atmosphere of the image conveys a sense of wonder and whimsy, fitting the context of Alice's adventures.",
        "segmentation": true
    },
    "image_29": {
        "image_id": 29,
        "image_path": "./fusion_research/fusion_dataset/novel/Alices Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll) (4)/images/image_29.jpg",
        "caption": [],
        "footnote": [],
        "context": "‘Wrong, as usual,’ said the Red Queen: ‘the dog’s ‘I think that’s the answer.’ ‘Then you think nothing would remain?’ said the Red Queen. Alice considered. ‘The bone wouldn’t remain, of course, if I took it––and the dog wouldn’t remain: it would come to bite me––and I’m sure $I$ shouldn’t remain!’ ‘I suppose——’ Alice was beginning, but the Red Queen answered for her. ‘Bread-and-butter, of course. Try another Subtraction sum. Take a bone from a dog: what remains?’ ‘She ca’n’t do Substraction,’ said the White Queen. ‘Can you do Division? Divide a loaf by a knife––what’s the answer to that?’ doing it,’ the Red Queen remarked: ‘but I daresay you’ve not had many lessons in manners yet?’ ‘Manners are not taught in lessons,’ said Alice. ‘Lessons teach you to do sums, and things of that sort.’ ‘Can you do Addition?’ the White Queen asked. ‘What’s one and one and one and one and one and one and one and one and one and one?’ ‘I don’t know,’ said Alice. ‘I lost count.’ ‘She ca’n’t do Addition,’ the Red Queen interrupted. ‘Can you do Subtraction? Take nine from eight.’ ‘Nine from eight I ca’n’t, you know,’ Alice replied very readily: ‘but— ",
        "chunk_order_index": 20,
        "chunk_id": "chunk-8bc797ee5f0bdbf691817640d60d286f",
        "description": "The image is a black-and-white illustration featuring three characters, each adorned with crowns and scepters, suggesting they are royalty. The character on the left is an older man with a round face, wearing a crown with a large ball on top and a striped robe. He appears to be speaking or gesturing with his hand. The central figure is a young girl with long hair, also wearing a crown with a ball on top and holding a scepter in her right hand. She is dressed in a dress with a high collar and seems to be listening intently. The character on the right is another older man, similar in appearance to the first but with a different crown design and a dark robe. He is sitting with one leg crossed over the other and has a relaxed posture. The background consists of tall grasses, adding to the whimsical and fantastical atmosphere of the scene. The overall mood conveyed is one of a serious conversation or debate among these royal figures.",
        "segmentation": true
    }
}