{
  "chunk-67fe1d2659877b616b671685d43d7605": {
    "tokens": 1200,
    "content": "# \"All the News Che New ork Cimes That's Fit to Print'  \n\nVOL. CLXXI . . . No. 59,518 © 2022  The New York Times Company NEW YORK, WEDNESDAY, AUGUST 17, 2022  \n\n![](images/image_1.jpg)  \nNew water cuts aim to ease a crisis in the Colorado River and one of its reservoirs, Lake Powell, above, on the Arizona-Utah border.  \n\n# States Curbed From Draining A Frail Lifeline  \n\n# By HENRY FOUNTAIN  \n\nWith water levels in the Colorado  River  near  their  lowest point ever, Arizona and Nevada on Tuesday faced new restrictions on the amount of water they can pump out of the river, the most important in the Southwest. And the threat of more cuts looms. This week, those two states along with five others failed to meet a deadline for agreement on much steeper cuts in water use, raising the prospect that the federal government will step in and mandate further reductions.  \n\nThe Colorado, which supplies water to 40 million people in the United States and Mexico and supports billions of dollars of agricultural production across the region, is in the throes of two decades of drought made worse by climate change. At the river’s two immense reservoirs, Lake Mead and Lake Powell, water levels are at just 28 percent of total capacity because of the river’s diminished flow and increased demand.  \n\nAs the water crisis intensified last year, the federal government for the first time imposed restrictions on the amount of water that could be taken. Tuesday’s cuts are smaller than those put in place a year ago and also affect Mexico. And they would be dwarfed by much larger cuts that the federal government in June asked the states to negotiate among themselves and threatened to impose if the states do not reach agreement. Officials have said the large cuts — involving 20 to 40 times as much water as Tuesday's — would be needed next year to protect the reservoirs and the dams that created them and to stabilize the water supply. Engineers point out  \n\n# In Challenge to Putin, Ukraine Targets Crimea  \n\n# By MICHAEL SCHWIRTZ and ANTON TROIANOVSKI  \n\nODESA, Ukraine — Russian warships patrol Crimea’s coasts and Russian warplanes fly from its territory, transformed by eight years of occupation into a fortress. President Vladimir V. Putin has called Crimea a “sacred place,” Russia’s “holy land,” and one of his top advisers has warned that if the peninsula were attacked, Ukraine would face “Judgment Day.”  \n\nBut lately, Ukraine has been calling the Kremlin’s bluff. Huge explosions rocked a temporary Russian  ammunition  depot  in Crimea on Tuesday, in the latest in a series of clandestine Ukrainian assaults against the Black Sea peninsula that Mr. Putin illegally  \n\n# Annexed ‘Holy Land’ Is a Staging Ground  \n\nannexed in 2014, and that is now being  used  as  a  vital  staging ground for Russia’s invasion. A  senior  Ukrainian  official, speaking on the condition of anonymity to discuss the operation, said that an elite Ukrainian military unit operating behind enemy lines  was  responsible  for  the blasts. Russia’s Defense Ministry said  in  a  statement  that  the episode was an “act of sabotage,” a  significant  acknowledgment that the war is spreading to what the Kremlin considers Russian  \n\nThe attacks in Crimea underscore Ukraine’s increasingly aggressive military tactics, as the government in Kyiv leans on longrange Western weapons and special forces to strike deep behind the front, disrupt Russian supply lines and counter Russia’s advantages in matériel. They also represent a growing challenge to Mr. Putin, with Crimea’s security key to Russia’s military effort — and to Mr. Putin’s political standing at home.  \n\nNo single action that Mr. Putin has taken in his 22-year rule provoked as much pro-Kremlin euphoria among Russians as his largely bloodless annexation of Crimea, an action that cemented his image as a leader resurrecting Continued on Page A10  \n\n![](images/image_2.jpg)  \nRUBBLE RAVE There was a D.J., and decorations, but the people weren’t just there for the party. They were volunteers for a Kyiv group that organizes music-infused cleanup events. Page A10.  \n\n# F.D.A. Decides to Allow Over-the-Counter Sales of Hearing Aids  \n\n# By CHRISTINA JEWETT  \n\nThe Food and Drug Administration decided on Tuesday to allow hearing aids to be sold over the counter without a prescription to adults, a long-sought wish of consumers frustrated by expensive exams and devices.  \n\nThe high cost of hearing aids, which are not covered by basic Medicare, has discouraged millions of Americans from buying the devices. Health experts say that untreated hearing loss can contribute  to  cognitive  decline and depression in older people. Under the F.D.A.’s new rule, people  with  mild  to  moderate hearing loss should be able to buy hearing aids online and in retail stores as soon as October, without being required to see a doctor for  \n\n# Innovation and Lower Prices May Follow  \n\nan exam to get a prescription. The agency cited studies estimating  that  about  30  million Americans  experience  hearing loss, but only about one-fifth of them get help. The changes could upend the market, which is dominated by a relatively small number of manufacturers, and make it a broader field with less costly and, perhaps, more innovative designs.  Costs  for  hearing  aids, which tend to include visits with an audiologist, range from about \\$1,400 at Costco to \\$4,700 or more. Continued on Page A23  \n\n# NEWS ANALYSIS Biden Signs Bill on Taxes And Climate  \n\n# PANDEMIC FRAUD CLAIMED BILLIONS MEANT",
    "chunk_order_index": 0,
    "full_doc_id": "doc-c234a9a818376e68a901c0e3404730a2"
  },
  "chunk-1ffb4e2302caebd3fef76d6d2ad04cec": {
    "tokens": 1200,
    "content": "could upend the market, which is dominated by a relatively small number of manufacturers, and make it a broader field with less costly and, perhaps, more innovative designs.  Costs  for  hearing  aids, which tend to include visits with an audiologist, range from about \\$1,400 at Costco to \\$4,700 or more. Continued on Page A23  \n\n# NEWS ANALYSIS Biden Signs Bill on Taxes And Climate  \n\n# PANDEMIC FRAUD CLAIMED BILLIONS MEANT FOR RELIEF  \n\nNew Law Falls Short of Uplifting Workers  \n\n# By JIM TANKERSLEY  \n\nWASHINGTON — President Biden signed into law a landmark tax, health and energy bill on Tuesday that takes significant steps toward fulfilling his goal to modernize the American economy and reduce its dependence on fossil fuels.  \n\nThe vast legislation will lower prescription drug costs for seniors on Medicare, extend federal subsidies for health insurance and reduce the federal deficit. It will also help electric utilities switch to lower-emission sources of energy and encourage Americans to buy electric vehicles through tax credits.  \n\nWhat it does not do, however, is provide workers with many of the other sweeping economic changes that Mr. Biden pledged would help Americans earn more and enjoy the comforts of a middle-class life.  \n\nMr. Biden signed the bill, which Democrats call the Inflation Reduction Act, in the State Dining Room at the White House. He and his allies cast the success of the legislation as little short of a miracle, given it required more than a year of intense negotiations among congressional Democrats. In his remarks, Mr. Biden proclaimed victory as he signed a compromise bill that he called “the biggest step forward on climate ever” and “a godsend to many families” struggling with prescription drug costs. “The bill I’m about to sign is  \n\nican families,” Mr. Biden said. Administration officials say Mr. Biden has passed far more of his economic agenda than they could have possibly hoped for, given Republican opposition to much of his agenda on taxes and spending and razor-thin Democratic majorities in the House and Senate. His wins include a \\$1.9 trillion economic rescue plan last year designed to get workers and businesses through the pandemic and a pair of bipartisan bills aimed at American competitiveness: a \\$1 trillion infrastructure bill and \\$280 billion in spending to spur domestic Continued on Page A17  \n\nOVERSHADOWED A big day for the president did little to distract from the circus surrounding his predecessor. PAGE A18  \n\nAUTHORITIES SWAMPED A Rushed Honor System Left the Door Open to Illegal Schemes  \n\n# By DAVID A. FAHRENTHOLD  \n\nIn the midst of the pandemic, the government gave unemployment benefits to the incarcerated, the imaginary and the dead. It sent money to “farms” that turned out to be front yards. It paid people who were on the government’s “Do Not Pay List.” It gave loans to 342 people who said their name was “N/A.”  \n\nAs the coronavirus shuttered businesses and forced people out of work, the federal government sent a flood of relief money into programs aimed at helping the newly unemployed and bolstering the economy. That included \\$3.1 trillion  that  former  President Donald  J.  Trump  approved  in 2020, followed by a \\$1.9 trillion package signed into law in 2021 by President Biden.  \n\nBut those dollars came with few strings and minimal oversight. The result: one of the largest frauds in American history, with billions of dollars stolen by thousands of people, including at least Richard Ayvazyan, part of a ring that sought billions in loans, received 17 years.  \n\n![](images/image_3.jpg)  \n\none amateur who boasted of his criminal activity on YouTube. Now, prosecutors are trying to catch up. There are currently 500 people working on pandemic-fraud cases across the offices of 21 inspectors general, plus investigators from the F.B.I., the Secret Service, the Postal Inspection Service and the Internal Revenue Service. The federal government has already charged 1,500 people with defrauding  pandemic-aid  programs, and more than 450 people have been convicted so far. But those figures are dwarfed by the Continued on Page A15  \n\n# Cheney, a Vocal Critic of Trump, Loses to a Candidate He Backed  \n\n# By JONATHAN MARTIN  \n\nJACKSON, Wyo. — Representative Liz Cheney of Wyoming was decisively  defeated  by  Harriet Hageman in her Republican primary on Tuesday, handing Donald J. Trump his most prized trophy yet in his long campaign to purge the Republican Party of his critics. Ms.  Hageman,  a  lawyer  in Cheyenne,  was  lifted  by  Mr. Trump’s endorsement in her race against Ms. Cheney, the daughter of a former vice president and former member of the House Republican leadership.  \n\nMs. Cheney’s loss was as anticipated as it was consequential. The leading Republican voice against Mr. Trump, and vice chairwoman of the committee investigating the Jan. 6 Capitol attack, next year will no longer have her perch in Congress from which to battle a Vows to Continue Fight  \n\n# for Democracy  \n\nfigure she believes poses a grave threat to American democracy. Ms. Cheney conceded defeat just  as  The  Associated  Press called the race, suggesting she was setting a model for accepting the will of voters.  \n\n“Harriet  Hageman  has  received the most votes in this primary — she won,” Ms. Cheney told  supporters  gathered  outdoors on a ranch here. She went on to implore Americans to stand up to Mr. Trump and others who deny his loss in the 2020 presidential election. “No citizen of this republic is a bystander,” she said, Continued on Page A20  \n\n![](images/image_4.jpg)",
    "chunk_order_index": 1,
    "full_doc_id": "doc-c234a9a818376e68a901c0e3404730a2"
  },
  "chunk-f0754e4a10d4afb3328d0c2f3aa4c1d6": {
    "tokens": 529,
    "content": "accepting the will of voters.  \n\n“Harriet  Hageman  has  received the most votes in this primary — she won,” Ms. Cheney told  supporters  gathered  outdoors on a ranch here. She went on to implore Americans to stand up to Mr. Trump and others who deny his loss in the 2020 presidential election. “No citizen of this republic is a bystander,” she said, Continued on Page A20  \n\n![](images/image_4.jpg)  \n\n# NATIONAL A1-23  \n\nCuomo Wins Ethics Lawsuit A judge ruled that former Gov. Andrew M. Cuomo will not have to turn over the proceeds of his \\$5.1 million deal for a book about the pandemic. PAGE A19  \n\n![](images/image_5.jpg)  \n\n# BUSINESS B1-5  \n\nUkraine’s Factories Move West The government is working to save hundreds of businesses in the east from Russian bombs, creating a new industrial and economic heartland.  PAGE B1 INTERNATIONAL A4-12 A Clash Over Russian Gems Russia earns billions of dollars from the production of diamonds that other nations say help finance war.  PAGE A11 Kenya Vote May Land in Court Raila Odinga, who lost the nation’s presidential election, said he’d use all legal options to fight the result. PAGE A9 Jesuits’ Atonement Fund Lags Jesuits set a goal of raising \\$100 million to make amends for their order’s role in the slave trade. But donations have only trickled in. PAGE A22 Art or a Copyright Issue? The Supreme Court will have a chance to decide if Andy Warhol’s interpretation of a photograph of Prince is protected as a transformative work. PAGE A14 Easy-Peasy Taquiza For a no-sweat, end-of-summer party, lay out a spread of taco ingredients and let guests make their own. PAGE D2 Salvage Stores Catch On Dented cans, ignored sell-by dates, new-product flops? Frugal shoppers see only welcome bargains. PAGE D1 ARTS C1-6 Inside the ‘Saul’ Time Machine Right through its flashback-filled finale, “Better Call Saul” seamlessly looked back at how a man went wrong, and forward to where he wound up. PAGE C1  \n\n![](images/image_6.jpg)  \n\nOPINION A26-27 Hannah Sung  \n\nSPORTS B6-8 Fulfilling Her Potential With the W.N.B.A. playoffs about to begin, the Liberty are relying on Sabrina Ionescu, who has had a breakout season in her third year. PAGE B7",
    "chunk_order_index": 2,
    "full_doc_id": "doc-c234a9a818376e68a901c0e3404730a2"
  }
}