{
    "image_1": [
        {
            "entity_name": "IMAGE_1_MOTORCYCLE-22.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'object'. The entity features are as follows:Object Features:- Name: Scooter- Color: Primarily white with some black and orange details- Shape: Compact, two-wheeled vehicle with a step-through frame- Size: Appears to be a standard-sized scooter, suitable for one or two riders- Material: Metal and plastic components, with a visible front fairing and rear storage compartment- Possible function: Personal transportation, likely used for short-distance travel in urban environments- Other significant characteristics: Equipped with mirrors, headlights, and turn signals; the front wheel is partially visible, showing a disc brake system; the rear section includes a storage compartment and a license plate holderOverall, the scooter appears to be a practical and efficient mode of transportation, designed for ease of use and convenience in city settings."
        },
        {
            "entity_name": "IMAGE_1_PERSON-12.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'person'. The entity features are as follows:Person Features:- Gender: Male- Skin Color: Light- Hairstyle: Short, curly hair, light brown- Facial Expression: Not clearly visible due to the low resolution and blurriness of the image- Age: Appears to be an adult male- Clothing: Wearing a dark-colored jacket with a high collar; the jacket appears to have a textured pattern- Posture: Standing upright, but specific details about posture are not clear due to the image qualityOverall, the character gives off a formal appearance due to the high-collared jacket."
        },
        {
            "entity_name": "IMAGE_1_MOTORCYCLE-21.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'object'. The entity features are as follows:Object Features:- Name: Motorcycle- Color: Primarily black with yellow and red accents- Shape: Standard motorcycle shape with a visible front wheel, headlight, and part of the body frame- Size: Appears to be a full-sized motorcycle, not a miniature or toy version- Material: Metal and plastic components, typical of motorcycles- Possible function: Used for transportation, likely capable of high speeds given its design- Other significant characteristics: The motorcycle appears to be well-used, with signs of dirt and wear, particularly on the front wheel and lower parts of the body. The headlight is prominent, suggesting it is designed for use in various lighting conditions. The overall design suggests a sporty or performance-oriented model."
        },
        {
            "entity_name": "IMAGE_1_PERSON-11.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'person'. The entity features are as follows:Person Features:- Gender: Male- Skin Color: Light- Hairstyle: Short, light-colored hair- Clothing: Wearing a light-colored outfit that appears to be a robe or a draped garment- Posture: Standing with arms at sides, facing slightly to the sideOverall, the figure appears to be a classical statue or sculpture, characterized by its smooth, idealized form and traditional attire."
        },
        {
            "entity_name": "IMAGE_1_MOTORCYCLE-18.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'object'. The entity features are as follows:Object Features:- Name: Motorcycle- Color: Primarily white with some black and silver accents- Shape: Standard motorcycle shape with a front fairing, handlebars, and two wheels- Size: Appears to be a full-sized motorcycle, not a miniature or toy version- Material: Likely made of metal and plastic components, typical for motorcycles- Possible function: Designed for transportation, likely capable of high speeds given the aerodynamic design and presence of a large front fairing- Other significant characteristics: The motorcycle has a sporty appearance with a streamlined design, suggesting it is built for performance. The front fairing and the positioning of the handlebars indicate it is designed for both speed and comfort during long rides."
        },
        {
            "entity_name": "IMAGE_1_PERSON-17.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'person'. The entity features are as follows:Person Features:- Gender: Male- Skin Color: Light brown- Hairstyle: Short, dark hair- Facial Expression: Not visible due to the angle and cropping of the image- Age: Appears to be an adult male- Clothing: Wearing a white tank top that reveals his shoulders and upper chest; paired with light-colored cargo shorts that have multiple pockets- Posture: Standing in a relaxed pose with arms at his sidesOverall, the character appears to be dressed for casual or outdoor activities."
        },
        {
            "entity_name": "IMAGE_1_PERSON-16.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'person'. The entity features are as follows:Person Features:- Gender: Male- Skin Color: Light brown- Hairstyle: Short, curly hair- Clothing: Wearing a light-colored, possibly white, long-sleeved shirt and dark pants- Posture: Standing with arms at sides, facing forwardOverall, the person appears to be in a neutral stance with a simple outfit."
        },
        {
            "entity_name": "IMAGE_1_MOTORCYCLE-8.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'object'. The entity features are as follows:Object Features:- Name: Motorcycle- Color: Primarily white with some black and silver accents- Shape: Standard motorcycle shape with a front fairing, handlebars, seat, and two wheels- Size: Appears to be a full-sized motorcycle, not a miniature or toy version- Material: Likely made of metal (for the frame and engine), plastic (for the fairing and other body parts), and rubber (for the tires)- Possible function: Designed for transportation, likely capable of high speeds and suitable for both city commuting and longer trips- Other significant characteristics: The motorcycle has a sporty design with a prominent front fairing that includes a headlight and turn signals. The wheels have spokes, and the tires appear to be in good condition. The overall design suggests it is a modern model, possibly from a well-known manufacturer."
        },
        {
            "entity_name": "IMAGE_1_MOTORCYCLE-0.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'object'. The entity features are as follows:Object Features:- Name: Scooter- Color: Primarily silver with black accents- Shape: Compact and streamlined, typical of a scooter design- Size: Appears to be a standard-sized scooter, suitable for one or two riders- Material: Metal and plastic components- Possible function: Personal transportation, likely used for short-distance travel in urban environments- Other significant characteristics: Equipped with a front headlight, turn signals, and a visible front wheel with a disc brake system. The scooter has a modern aesthetic with a focus on functionality and ease of use."
        },
        {
            "entity_name": "IMAGE_1_MOTORCYCLE-4.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'object'. The entity features are as follows:Object Features:- Name: Scooter- Color: Primarily black with some yellow and red accents, showing signs of dirt and wear- Shape: Compact and rectangular body with a curved front fender and a rear section that includes a seat and storage compartment- Size: Appears to be a standard-sized scooter, suitable for one or two riders- Material: Made of metal and plastic components, with rubber tires- Possible function: Used for personal transportation, likely in urban environments due to its compact size and design- Other significant characteristics: Equipped with a headlight at the front, turn signals, and a visible license plate area. The scooter shows signs of frequent use, with dirt and grime accumulated on its surface, especially on the wheels and lower parts of the body."
        },
        {
            "entity_name": "IMAGE_1_PERSON-1.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'person'. The entity features are as follows:Person Features:- Gender: Male- Skin color: Dark- Hairstyle: Short, dark hair- Expression: Smiling, appears joyful and energetic- Age: Appears to be a young adult- Clothing: Wearing a sports jersey with red, blue, and yellow stripes; the jersey has a logo on the left chest and a sponsor name across the front; paired with beige shorts and brown sandals- Posture: Kneeling on one knee, with the other leg bent at the knee and foot off the ground; arms resting on the bent knee, hands clasped togetherOverall, the character gives off an athletic and cheerful vibe."
        },
        {
            "entity_name": "IMAGE_1_PERSON-3.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'person'. The entity features are as follows:Person Features:- Gender: Male- Skin Color: Dark- Hairstyle: Short hair, dark- Expression: Smiling, appears joyful and excited- Age: Appears to be a young man- Clothing: Wearing a black t-shirt with a white design on the front; paired with light-colored pants- Posture: One arm raised high in the air, the other arm bent at the elbow with the hand near the head, giving an impression of celebration or victoryOverall, the character gives off a sense of joy and excitement, possibly celebrating a moment of triumph."
        },
        {
            "entity_name": "IMAGE_1_PERSON-19.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'person'. The entity features are as follows:Person Features:- Gender: Male- Skin Color: Light- Hairstyle: Short, light brown hair- Clothing: Wearing a long, flowing orange robe that reaches the ankles; the robe has a simple design with no visible patterns or embellishments- Posture: Standing upright, facing forward- Accessories: No visible accessoriesOverall, the person appears to be dressed in traditional or ceremonial attire, possibly indicative of a specific cultural or religious context."
        },
        {
            "entity_name": "IMAGE_1_PERSON-2.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'person'. The entity features are as follows:Person Features:- Gender: Male- Hairstyle: Braided hair, styled in multiple braids that are pulled back- Expression: Smiling widely, eyes closed, appears to be laughing or celebrating- Age: Appears to be an adult male- Clothing: Wearing a white basketball jersey with the number 10 and some red and blue details; black shorts- Posture: Arms are bent at the elbows and held up near the chest, suggesting a gesture of excitement or celebrationOverall, the character gives off a joyful and energetic vibe, likely associated with a moment of triumph or enjoyment in a sports context."
        },
        {
            "entity_name": "IMAGE_1_PERSON-7.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'person'. The entity features are as follows:Person Features:- Gender: Male- Skin Color: Light tan, suggesting a possible outdoor lifestyle or recent sun exposure- Hairstyle: Short, dark hair, styled in a casual manner- Facial Expression: Not visible due to the angle and cropping of the image- Age: Appears to be an adult male, though exact age is indeterminate from this view- Clothing: Wearing a sleeveless top that reveals his shoulders and upper arms; paired with light-colored shorts that reach above the knee- Posture: Standing upright with one arm slightly bent at the elbow and hand resting on the hip, while the other arm hangs loosely by his sideOverall, the individual appears to be dressed for warm weather or an active outdoor activity."
        },
        {
            "entity_name": "IMAGE_1_PERSON-5.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'object'. The entity features are as follows:Object Features:- Name: Seashell- Color: Light beige with a gradient to white at the edges- Shape: Spiral, with a smooth and glossy surface- Size: Appears medium-sized relative to typical seashells- Material: Likely to be calcium carbonate, common in seashells- Possible function: Often used as a decorative item or collected by hobbyists; in nature, it serves as protection for marine organismsOverall, the seashell exhibits a classic spiral shape with a smooth texture, indicative of many species found in coastal areas."
        },
        {
            "entity_name": "IMAGE_1",
            "entity_type": "ORI_IMG",
            "description": "The image captures a lively scene on a beach in Senegal. In the foreground, two motorbikes are prominently featured, each carrying three individuals. The motorbike on the left has one person driving and two passengers, with the driver wearing a white sleeveless shirt and red flip-flops, and the passengers raising their hands in excitement. The motorbike on the right has one person driving and two passengers as well, with the driver wearing a colorful jersey. The background shows a bustling beach scene with numerous people enjoying the water and sand. The sky is clear, and the overall atmosphere is energetic and joyful, reflecting the vibrant youth culture and the popularity of French language in Africa."
        },
        {
            "entity_name": "MOTORCYCLE",
            "entity_type": "UNKNOWN",
            "description": "The image feature block image_1_motorcycle-22.jpg is a picture of a motorcycle."
        },
        {
            "entity_name": "PERSON",
            "entity_type": "UNKNOWN",
            "description": "The image feature block image_1_person-12.jpg is a picture of a person."
        },
        {
            "entity_name": "MOTORCYCLE 1",
            "entity_type": "UNKNOWN",
            "description": "Motorcycle 1是从image_1中提取的实体。"
        },
        {
            "entity_name": "MOTORCYCLE 2",
            "entity_type": "UNKNOWN",
            "description": "Motorcycle 2是从image_1中提取的实体。"
        },
        {
            "entity_name": "BEACH",
            "entity_type": "UNKNOWN",
            "description": "Beach是从image_1中提取的实体。"
        },
        {
            "entity_name": "PEOPLE ON MOTORCYCLE 1",
            "entity_type": "UNKNOWN",
            "description": "People on Motorcycle 1是从image_1中提取的实体。"
        },
        {
            "entity_name": "PEOPLE ON MOTORCYCLE 2",
            "entity_type": "UNKNOWN",
            "description": "People on Motorcycle 2是从image_1中提取的实体。"
        }
    ],
    "image_2": [
        {
            "entity_name": "IMAGE_2_PERSON-1.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'person'. The entity features are as follows:Person Features:- Gender: Female- Hairstyle: Short, platinum blonde hair styled in a sleek, modern cut- Expression: Neutral, focused expression with a slight frown, suggesting determination or concentration- Age: Appears to be an adult woman, possibly in her late 30s to early 40s- Clothing: Wearing a black blazer over a light-colored top; paired with a knee-length skirt that has a floral pattern in shades of white and gray; black tights and black ankle boots with a slight heel- Posture: Walking forward with one leg in mid-step, hands by her sides, and head turned slightly to the sideOverall, the character gives off a professional and confident vibe, dressed in a stylish yet formal outfit."
        },
        {
            "entity_name": "IMAGE_2_PERSON-0.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'person'. The entity features are as follows:Person Features:- Gender: Male- Skin Color: Dark skin- Hairstyle: Short hair, black- Clothing: Wearing a dark blue uniform with short sleeves and pants; a black belt around the waist; a black cap on the head- Posture: Standing with hands behind the back, facing away from the cameraOverall, the character appears to be a police officer or security guard based on the uniform and posture."
        },
        {
            "entity_name": "IMAGE_2_PERSON-2.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'person'. The entity features are as follows:Person Features:- Gender: Male- Skin Color: Light skin tone- Hairstyle: Short, dark hair- Facial Expression: Not visible due to the side profile and angle- Age: Appears to be an adult male- Clothing: Wearing a black long-sleeved shirt and blue jeans; shoes are not clearly visible but appear to be casual footwear- Posture: Walking with one leg in front of the other, arms by his sides, suggesting a relaxed or casual strideOverall, the individual appears to be dressed in casual attire suitable for everyday wear."
        },
        {
            "entity_name": "IMAGE_2_PERSON-3.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'person'. The entity features are as follows:Person Features:- Gender: Male- Hairstyle: Short hair, dark in color- Facial Hair: Beard and mustache, well-groomed- Expression: Neutral expression, not smiling- Age: Appears to be a middle-aged man- Clothing: Wearing a dark-colored jacket over a lighter shirt; paired with dark pants- Posture: Standing with one hand on the hip, the other arm hanging by the side- Accessories: No visible accessories- Footwear: Dark shoesOverall, the character gives off a casual yet somewhat serious vibe."
        },
        {
            "entity_name": "IMAGE_2_PERSON-7.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'person'. The entity features are as follows:Person Features:- Gender: Male- Facial Hair: Short, neatly trimmed beard and mustache, both appear to be grayish in color- Skin Tone: Fair skin- Clothing: Wearing a dark-colored garment that appears to be formal or official attire- Posture: The person is facing slightly to the side, giving a profile view of the faceOverall, the individual has a distinguished appearance with a formal demeanor."
        },
        {
            "entity_name": "IMAGE_2_PERSON-11.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'person'. The entity features are as follows:Person Features:- Gender: Male- Facial Hair: Dark, well-groomed mustache and goatee- Headwear: Wearing a black military-style cap with a shiny badge on the front- Clothing: Dressed in a dark-colored uniform that appears to be part of a formal or official attire; visible details include a high collar and what seems to be a shoulder insignia- Posture: Standing upright, facing slightly to the side, giving an impression of alertness or readinessOverall, the individual appears to be a male in a formal or military uniform, characterized by a neat appearance and authoritative stance."
        },
        {
            "entity_name": "IMAGE_2_PERSON-4.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'person'. The entity features are as follows:Person Features:- Gender: Male- Hairstyle: Short, neatly styled hair- Facial Expression: Not visible due to the angle and resolution- Age: Appears to be an adult male- Clothing: Wearing a formal black suit with a white shirt and a dark tie; the suit jacket has a notched lapel- Posture: Standing upright, facing slightly to the side, giving a profile viewOverall, the individual appears to be dressed for a formal occasion or professional setting."
        },
        {
            "entity_name": "IMAGE_2_UMBRELLA-9.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'object'. The entity features are as follows:Object Features:- Name: Paintbrush- Color: The bristles are black, and the handle appears to be a dark color, possibly brown or black.- Shape: The paintbrush has a typical form with a cylindrical handle that tapers towards the bristle end. The bristles are arranged in a rounded shape, suitable for applying paint.- Size: The image does not provide a scale, but based on common sizes, it could be a medium-sized paintbrush.- Material: The handle is likely made of wood or plastic, and the bristles appear to be synthetic.- Possible Function: Used for painting, likely for detailed work given the size and shape of the bristles.- Other Significant Characteristics: The bristles are dense and appear to be in good condition, suggesting it is a well-maintained tool."
        },
        {
            "entity_name": "IMAGE_2_PERSON-12.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'person'. The entity features are as follows:Person Features:- Gender: Male- Uniform: Wearing a formal uniform that includes a white shirt with epaulettes and a black jacket with gold trim; the uniform suggests a ceremonial or official role, possibly military or police- Posture: Standing upright, with hands resting by the sides, suggesting a formal or disciplined stance- Accessories: Visible part of a sword or similar ceremonial weapon at the side, indicating a formal or ceremonial contextOverall, the individual appears to be in a formal, possibly ceremonial setting, given the detailed and ornate uniform and the presence of a ceremonial weapon."
        },
        {
            "entity_name": "IMAGE_2_PERSON-13.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'person'. The entity features are as follows:Person Features:- Gender: Male- Skin Color: Appears to be light skin tone- Hairstyle: Short, dark hair- Facial Hair: Dark mustache and beard- Clothing: Wearing a black uniform with a high collar; the uniform includes a peaked cap with a badge on the front, suggesting a formal or official role- Posture: Standing upright, facing slightly to the sideOverall, the character appears to be a male figure in a formal or official uniform, possibly a police officer or military personnel, given the style of the uniform and cap."
        },
        {
            "entity_name": "IMAGE_2_PERSON-5.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'person'. The entity features are as follows:Person Features:- Gender: Male- Skin Color: Light skin tone- Hairstyle: Short, gray hair- Facial Expression: Not fully visible, but appears to be looking upwards or forward with a neutral expression- Age: Appears to be an older adult- Clothing: Wearing a white shirt with the sleeves rolled up, revealing the wrists; paired with dark trousers and a black jacket over the shoulders- Posture: Standing upright, with one arm slightly raised and the other hanging by his sideOverall, the character gives off a formal and professional appearance."
        },
        {
            "entity_name": "IMAGE_2_HANDBAG-10.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'person'. The entity features are as follows:Person Features:- Gender: Not discernible from the given image- Skin Color: Light skin tone- Hairstyle: Not visible in the image- Clothing: Wearing a dark-colored sleeve, possibly black or deep blue- Posture: Arm bent at the elbow, hand partially clenched into a fistThe image shows a close-up of a person's arm and hand, with the hand partially clenched into a fist. The sleeve of the clothing is dark, suggesting a casual or possibly work-related attire. The skin tone is light."
        },
        {
            "entity_name": "IMAGE_2_PERSON-8.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'person'. The entity features are as follows:Person Features:- Gender: Male- Skin Color: Fair- Hairstyle: Short, light brown hair- Facial Expression: Mouth open, possibly speaking or shouting- Age: Appears to be an adult male- Posture: Head turned to the side, with a dynamic expressionOverall, the character appears to be engaged in a conversation or expressing strong emotions."
        },
        {
            "entity_name": "IMAGE_2",
            "entity_type": "ORI_IMG",
            "description": "The image depicts a group of people in what appears to be a formal or official setting, possibly within a government building. The scene includes several individuals dressed in business attire, including suits and ties, suggesting a professional environment. There are also uniformed officers present, indicating a level of security or official protocol. The individuals appear to be walking or moving through a hallway, with some engaged in conversation. The background features architectural elements such as columns and ornate doors, adding to the formal atmosphere. The lighting is bright, and the overall mood conveys a sense of seriousness and importance."
        },
        {
            "entity_name": "SECURITY PERSONNEL",
            "entity_type": "PERSON",
            "description": "Individuals in uniform, likely responsible for maintaining order and safety."
        },
        {
            "entity_name": "MAN IN BLACK SWEATER",
            "entity_type": "PERSON",
            "description": "A man wearing a black sweater and grey pants, walking through the corridor."
        },
        {
            "entity_name": "MAN IN GREY COAT",
            "entity_type": "PERSON",
            "description": "A man wearing a grey coat, standing near the woman with blonde hair."
        },
        {
            "entity_name": "WOMAN WITH BLONDE HAIR",
            "entity_type": "PERSON",
            "description": "A woman with blonde hair, wearing a dark coat and patterned skirt, standing next to the man in the grey coat."
        },
        {
            "entity_name": "CORRIDOR",
            "entity_type": "GEO",
            "description": "The interior of a building with a tiled floor and wooden doors, where the group is gathered."
        }
    ],
    "image_3": [
        {
            "entity_name": "IMAGE_3_CAT-0.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'organism'. The entity features are as follows:Organism Features:- Species: Cat- Age: Adult- Color: Multi-colored fur with a mix of brown, black, and white- Shape: Round face with prominent whiskers- Size: Not fully visible, but appears to be a standard adult cat size- Posture: Holding a small green lizard in its mouth- Structural Characteristics: The cat has large, expressive yellow eyes and a fluffy coat. The lizard is small with a long tail and is being held by the cat's teeth near its head."
        },
        {
            "entity_name": "IMAGE_3",
            "entity_type": "ORI_IMG",
            "description": "The image features a close-up of a cat with a multicolored fur pattern, predominantly white with patches of brown and black. The cat has striking yellow eyes and a pink nose. It is holding a small green lizard in its mouth, which appears to be freshly caught. The cat's expression is intense and focused, suggesting it is in the act of hunting or has just captured its prey. The background is blurred, but it appears to be an outdoor setting, possibly a garden or a park, with some foliage visible. The overall mood of the image conveys a sense of natural predatory behavior and the instinctive hunting skills of cats."
        },
        {
            "entity_name": "CAT",
            "entity_type": "ANIMAL",
            "description": "A fluffy cat with a mix of brown, black, and white fur, holding a small green lizard in its mouth."
        },
        {
            "entity_name": "LIZARD",
            "entity_type": "ANIMAL",
            "description": "A small green lizard being held by the cat in its mouth."
        }
    ]
}