{
    "chunk-1f1fbc3421d8d9e01a59b98a5edbbd7e": [
        {
            "entity_name": "He-Who-Must-Not-Be-Named (Voldemort)",
            "entity_type": "PERSON",
            "description": "He-Who-Must-Not-Be-Named, also known as Voldemort, is a dark wizard whose wand has a connection to Harry's wand.",
            "source_entities": [
                "HE-WHO-MUST-NOT-BE-NAMED",
                "VOLTEMORT"
            ]
        },
        {
            "entity_name": "Unicorn",
            "entity_type": "GEO",
            "description": "Unicorn is mentioned as a source of wand core material, indicating its significance in the magical world.",
            "source_entities": [
                "UNICORN"
            ]
        },
        {
            "entity_name": "Phoenix",
            "entity_type": "GEO",
            "description": "Phoenix is mentioned as a source of wand core material, with a specific connection to Harry's wand and his scar.",
            "source_entities": [
                "PHOENIX"
            ]
        },
        {
            "entity_name": "Dragon",
            "entity_type": "GEO",
            "description": "Dragon is mentioned as a source of wand core material, contributing to the uniqueness of Ollivander wands.",
            "source_entities": [
                "DRAGON"
            ]
        },
        {
            "entity_name": "Beechwood",
            "entity_type": "GEO",
            "description": "Beechwood is a type of wood used for the wand that Harry eventually chooses.",
            "source_entities": [
                "BEECHWOOD"
            ]
        },
        {
            "entity_name": "Maple",
            "entity_type": "GEO",
            "description": "Maple is a type of wood used for one of the wands that Harry tries.",
            "source_entities": [
                "MAPLE"
            ]
        },
        {
            "entity_name": "Ebony",
            "entity_type": "GEO",
            "description": "Ebony is a type of wood used for another wand that Harry tries.",
            "source_entities": [
                "EBONY"
            ]
        },
        {
            "entity_name": "Holly",
            "entity_type": "GEO",
            "description": "Holly is a type of wood used for the wand with phoenix feather core that Harry tries.",
            "source_entities": [
                "HOLLY"
            ]
        },
        {
            "entity_name": "Yew",
            "entity_type": "GEO",
            "description": "Yew is a type of wood used for the wand that Harry eventually chooses, connected to He-Who-Must-Not-Be-Named.",
            "source_entities": [
                "YEW"
            ]
        },
        {
            "entity_name": "Galleons",
            "entity_type": "ORGANIZATION",
            "description": "Galleons are the currency used in the wizarding world, mentioned when Harry pays for his wand.",
            "source_entities": [
                "GALLEONS"
            ]
        },
        {
            "entity_name": "Paddington Station",
            "entity_type": "GEO",
            "description": "Paddington station is the train station where Hagrid and Harry have a meal before Harry's train ride, also referred to as Paddington.",
            "source_entities": [
                "PADDINGTON STATION",
                "PADDINGTON"
            ]
        }
    ],
    "chunk-f31ed3a2bf7f52f24e297e08ac939d60": null,
    "chunk-754476c5d5d37da1e0ea95f1371b3842": null,
    "chunk-099669d02932bf8ad3f3c0320aa597b0": [
        {
            "entity_name": "Scabbers",
            "entity_type": "PERSON",
            "description": "Scabbers, also known as 'Rat', is Ron's pet rat that bites Goyle, causing Malfoy and his friends to leave. It is feared by Malfoy and his friends, who think there might be more rats lurking among the sweets.",
            "source_entities": [
                "SCABBERS",
                "RAT"
            ]
        },
        {
            "entity_name": "Hermione Granger",
            "entity_type": "PERSON",
            "description": "Hermione Granger, also known as 'Hermione', is a student who enters the scene after the confrontation, inquiring about the situation and later joins Harry and Ron on the boat to Hogwarts.",
            "source_entities": [
                "HERMIONE GRANGER",
                "HERMIONE"
            ]
        },
        {
            "entity_name": "Chocolate Frogs",
            "entity_type": "GEO",
            "description": "Chocolate Frogs are a type of candy that Goyle reaches for, prompting Scabbers to bite him. They are also referred to as 'Sweets', which are scattered on the floor after the confrontation and are collected by Harry and Ron.",
            "source_entities": [
                "CHOCOLATE FROGS",
                "SWEETS"
            ]
        },
        {
            "entity_name": "Hogwarts",
            "entity_type": "ORGANIZATION",
            "description": "Hogwarts, also known as 'Vast Castle', is the school of witchcraft and wizardry that Harry, Ron, and Hermione are traveling to. It is located atop a high mountain on the other side of the Great Black Lake, as seen from the lake, and is accessed via boats across the lake, led by Hagrid.",
            "source_entities": [
                "HOGWARTS",
                "VAST CASTLE"
            ]
        },
        {
            "entity_name": "Great Black Lake",
            "entity_type": "GEO",
            "description": "The Great Black Lake is the body of water that the boats cross to reach Hogwarts. It is also referred to as 'High Mountain', where Hogwarts is located, and 'Ivy Curtain', the natural cover that hides the entrance to Hogwarts, which the boats pass through.",
            "source_entities": [
                "GREAT BLACK LAKE",
                "HIGH MOUNTAIN",
                "IVY CURTAIN"
            ]
        }
    ],
    "chunk-e3a21dc9b138543e69c2382e20b3663b": [
        {
            "entity_name": "Hogwarts Castle",
            "entity_type": "GEO",
            "description": "Hogwarts Castle is the main setting of the story, where students arrive and where the Sorting Ceremony takes place. It is also referred to as the great castle overhead and the shadow of which the first years stand upon arrival.",
            "source_entities": [
                "HOGWARTS CASTLE",
                "CLIFF",
                "UNDERGROUND HARBOR"
            ]
        },
        {
            "entity_name": "Hogwarts Houses",
            "entity_type": "ORGANIZATION",
            "description": "Hogwarts Houses refers to the collective group of Gryffindor, Hufflepuff, Ravenclaw, and Slytherin, which are the four Houses at Hogwarts known for their noble history and outstanding witches and wizards.",
            "source_entities": [
                "HOGWARTS HOUSES",
                "GRYFFINDOR",
                "HUFFLEPUFF",
                "RAVENCLAW",
                "SLYTHERIN"
            ]
        },
        {
            "entity_name": "Hogwarts School",
            "entity_type": "ORGANIZATION",
            "description": "Hogwarts School is the institution where the Sorting Ceremony occurs and where students are sorted into Houses. It is also known as Hogwarts, the school of witchcraft and wizardry.",
            "source_entities": [
                "HOGWARTS",
                "HOGWARTS SCHOOL"
            ]
        },
        {
            "entity_name": "Entrance Hall",
            "entity_type": "GEO",
            "description": "The Entrance Hall is the large hall at Hogwarts where Professor McGonagall greets the first years and where the stone walls are lit with flaming torches, similar to those at Gringotts.",
            "source_entities": [
                "ENTRANCE HALL",
                "GRINGOTTS"
            ]
        },
        {
            "entity_name": "Great Hall",
            "entity_type": "GEO",
            "description": "The Great Hall is a large hall at Hogwarts where the start-of-term banquet takes place and is the location for the Sorting Ceremony in front of the rest of the school.",
            "source_entities": [
                "GREAT HALL",
                "SORTING CEREMONY"
            ]
        }
    ],
    "chunk-457977cab82646e98ca0d1eb69fbd3d2": [
        {
            "entity_name": "Hogwarts Houses",
            "entity_type": "ORGANIZATION",
            "description": "Hogwarts Houses are the four groups into which students at Hogwarts School of Witchcraft and Wizardry are sorted: Gryffindor, known for bravery, nerve, and chivalry; Hufflepuff, known for being just, loyal, patient, and unafraid of toil; Ravenclaw, known for wit, learning, and wisdom; and Slytherin, known for cunning and using any means to achieve their ends.",
            "source_entities": [
                "GRYFFINDOR",
                "HUFFLEPUFF",
                "RAVENCLAW",
                "SLYTHERIN",
                "GRYFFINDOR HOUSE",
                "HUFFLEPUFF HOUSE",
                "RAVENCLAW HOUSE",
                "SLYTHERIN HOUSE"
            ]
        },
        {
            "entity_name": "Hogwarts",
            "entity_type": "ORGANIZATION",
            "description": "Hogwarts is the school where the Sorting Ceremony takes place and where the students are sorted into Houses. It is also the setting for various events and learning experiences as described in 'Hogwarts: A History', a book Hermione read.",
            "source_entities": [
                "HOGWARTS",
                "HOGWARTS: A HISTORY"
            ]
        },
        {
            "entity_name": "Great Hall",
            "entity_type": "GEO",
            "description": "The Great Hall is a significant location in Hogwarts where the Sorting Ceremony takes place and where students have their meals. It is lit by thousands of floating candles and has a bewitched ceiling that resembles the sky outside.",
            "source_entities": [
                "GREAT HALL"
            ]
        },
        {
            "entity_name": "Sorting Ceremony",
            "entity_type": "EVENT",
            "description": "The Sorting Ceremony is an event at Hogwarts where first-year students are sorted into their respective Houses. It involves the use of the Hogwarts Sorting Hat, a magical object that determines the student's House placement.",
            "source_entities": [
                "SORTING CEREMONY",
                "HOGWARTS SORTING HAT"
            ]
        },
        {
            "entity_name": "First Years",
            "entity_type": "PERSON",
            "description": "The first years are new students at Hogwarts who are about to participate in the Sorting Ceremony. They are led by Professor McGonagall to the Great Hall and are observed by the other students and ghosts during the event.",
            "source_entities": [
                "ŁRST YEARS",
                "HANNAH ABBOTT"
            ]
        }
    ]
}