{
    "image_1": {
        "entity_name": "Adversarial spelling mistakes inducing sentiment misclassification and word-recognition defenses",
        "entity_type": "EVENT",
        "description": "The table illustrates the impact of adversarial spelling mistakes on sentiment classification and evaluates the effectiveness of word-recognition defenses in mitigating these effects.",
        "reason": "The image is a table labeled 'Table 1: Adversarial spelling mistakes inducing sentiment misclassification and word-recognition defenses.' This matches the entity name extracted from the text, which describes the content and purpose of the table.",
        "matched_chunk_entity_name": "Adversarial spelling mistakes"
    },
    "image_2": {
        "entity_name": "Word Recognizer",
        "entity_type": "ORGANIZATION",
        "description": "Word Recognizer refers to the models discussed in the text that are designed to recognize words accurately, even in the presence of misspellings or adversarial perturbations.",
        "reason": "The image depicts a schematic sketch of a word recognition system consisting of a foreground and background model. The text discusses the role of these models in recognizing words, especially in the context of adversarial attacks and perturbations. The entity 'Word Recognizer' is the most appropriate match as it encapsulates the overall theme of the image and the content of the text.",
        "matched_chunk_entity_name": "Word Recognizer"
    },
    "image_3": {
        "entity_name": "Word Error Rates (WER)",
        "entity_type": "CONCEPT",
        "description": "Word Error Rates (WER) is a metric used to evaluate the performance of spell correctors in correcting misspellings.",
        "reason": "The image is a table labeled 'Word Recognition' that provides Word Error Rates (WER) of different spell-corrector models. The table structure and content align with the concept of Word Error Rates (WER) as described in the text.",
        "matched_chunk_entity_name": "Word Error Rates (WER)"
    },
    "image_4": {
        "entity_name": "Table 3",
        "entity_type": "EVENT",
        "description": "Table 3 presents the accuracy of various classification models, with and without defenses, under adversarial attacks.",
        "reason": "The image is a table labeled 'Sentiment Analysis (1-char attack/2-char attack)' that provides the accuracy of various classification models under adversarial attacks. This matches the description of Table 3 in the text information.",
        "matched_chunk_entity_name": "Table 3"
    },
    "image_5": {
        "entity_name": "Table 4",
        "entity_type": "EVENT",
        "description": "Table 4 shows the accuracy of BERT, with and without defenses, on MRPC when attacked under the 'all' attack setting.",
        "reason": "The image is a table labeled 'Table 4', which matches the description in the text. The table presents the accuracy of different models (BERT, BERT + ATD, BERT + Pass-through, and BERT + Neutral) under various attack settings ('No Attack', 'All attacks - 1-char', and 'All attacks - 2-char'). This aligns with the content described in the text.",
        "matched_chunk_entity_name": "Table 4"
    },
    "image_6": {
        "entity_name": "Table 5",
        "entity_type": "EVENT",
        "description": "Table 5 presents the sensitivity values for word recognizers.",
        "reason": "The image is a table labeled 'Sensitivity Analysis' that provides sensitivity values for word recognizers, which directly corresponds to Table 5 in the text information.",
        "matched_chunk_entity_name": "Table 5"
    },
    "image_7": {
        "entity_name": "Figure 2",
        "entity_type": "EVENT",
        "description": "Figure 2 depicts the effect of sensitivity and word error rate on robustness in word-only and char-only models.",
        "reason": "The image consists of two scatter plots that visualize the relationship between sensitivity and word error rate (WER) for different models, which aligns with the description of Figure 2 in the text. The left plot is labeled 'word-only models' and the right plot is labeled 'char-only models', matching the content of Figure 2.",
        "matched_chunk_entity_name": "Figure 2"
    }
}