{
    "image_1": [
    ],
    "image_2": [
    ],
    "image_3": [
        {
            "merged_entity_name": "MODERATION DISPUTES",
            "entity_type": "EVENT",
            "description": "Moderation Disputes are a type of conversation that occurs on Wikipedia, reflecting core elements of the platform, and involve rebukes or disputes concerning moderation decisions such as blocks and reversions.",
            "source_image_entities": [
                "MODERATION"
            ],
            "source_text_entities": [
                "MODERATION DISPUTES"
            ]
        },
        {
            "merged_entity_name": "COORDINATION",
            "entity_type": "EVENT",
            "description": "Coordination is an event that takes place on Wikipedia, involving efforts to foster constructive teamwork, and includes requests, questions, and statements of intent pertaining to collaboratively editing an article.",
            "source_image_entities": [
                "COORDINATION"
            ],
            "source_text_entities": [
                "COORDINATION"
            ]
        }
    ],
    "image_4": [
        {
            "entity_name": "DIRECT QUESTIONS",
            "entity_type": "CONCEPT",
            "description": "Direct Questions are a linguistic marker that tends to start awry-turning conversations significantly more often than on-track ones, indicating a potential for hostility or contention.",
            "source_image_entities": [
                "DIRECT QUESTION"
            ],
            "source_text_entities": [
                "DIRECT QUESTIONS"
            ]
        },
        {
            "entity_name": "GRATITUDE",
            "entity_type": "CONCEPT",
            "description": "Gratitude is a positive politeness strategy often found in on-track conversations, indicating a constructive tone and fostering cooperative dialogue.",
            "source_image_entities": [
                "GRATITUDE"
            ],
            "source_text_entities": [
                "GRATITUDE"
            ]
        },
        {
            "entity_name": "GREETINGS",
            "entity_type": "CONCEPT",
            "description": "Greetings are a positive politeness strategy that tends to initiate on-track conversations, fostering a cooperative atmosphere and signaling active efforts to foster constructive teamwork.",
            "source_image_entities": [
                "GREETINGS"
            ],
            "source_text_entities": [
                "GREETINGS"
            ]
        },
        {
            "entity_name": "HEDGE (LEXICON)",
            "entity_type": "EVENT",
            "description": "Hedge (Lexicon) involves the use of hedging words from the lexicon, a negative politeness strategy salient in on-track conversations, used to soften the force of a statement and indicate caution or uncertainty.",
            "source_image_entities": [
                "HEDGE (LEXICON)"
            ],
            "source_text_entities": [
                "HEDGES"
            ]
        },
        {
            "entity_name": "PROMPT: OPINION",
            "entity_type": "EVENT",
            "description": "Opinion Prompts are a linguistic marker that appears in on-track conversations, reflecting a desire for input and discussion, and indicating a more open and collaborative dialogue.",
            "source_image_entities": [
                "PROMPT: OPINION"
            ],
            "source_text_entities": [
                "OPINION PROMPTS"
            ]
        }
    ],
    "image_5": [
        {
            "merged_entity_name": "INTERLOCUTOR FEATURES",
            "entity_type": "FEATURE_SET",
            "description": "A feature set consisting of 5 characteristics of conversation partners used to predict their behavior, including participants' experience on Wikipedia and their anonymity status.",
            "source_image_entities": [
                "INTERLOCUTOR FEATURES"
            ],
            "source_text_entities": [
                "INTERLOCUTOR FEATURES"
            ]
        }
    ]
}