{
  "chunk-fbb76bbb58b8bdb0606f9a5e0db62651": {
    "tokens": 1200,
    "content": "rattled the windows in the classrooms. Worst of all were Professor Snape’s classes down in the dungeons, where their breath rose in a mist before them and they kept as close as possible to their hot cauldrons.  \n\n“I do feel so sorry,” said Draco Malfoy, one Potions class, “for all those people who have to stay at Hogwarts for Christmas because they’re not wanted at home.”  \n\nHe was looking over at Harry as he spoke. Crabbe and Goyle chuckled. Harry, who was measuring out powdered spine of lionŁsh,  ignored  them.  Malfoy  had  been  even  more unpleasant than usual since the Quidditch match. Disgusted that the Slytherins had lost, he had tried to get everyone laughing at how a wide-mouthed tree frog would be replacing Harry as Seeker next. Then he’d realized that nobody found this funny, because they were all so impressed at the way Harry had managed to stay on his bucking broomstick. So Malfoy, jealous and angry, had gone back to taunting Harry about having no proper family.  \n\nIt was true that Harry wasn’t going back to Privet Drive for Christmas. Professor McGonagall had come around the week before, making a list of students who would be staying for the holidays, and Harry had signed up at once. He didn’t feel sorry for himself at all; this would probably be the best Christmas he’d ever had. Ron and his brothers were staying, too, because Mr. and Mrs. Weasley were going to Romania to visit Charlie.  \n\nWhen they left the dungeons at the end of Potions, they found a large Łr tree blocking the corridor ahead. Two enormous feet sticking out at the bottom and a loud puŃng sound told them that Hagrid was behind it.  \n\n“Hi, Hagrid, want any help?” Ron asked, sticking his head through the branches.  \n\n“Nah, I’m all right, thanks, Ron.”  \n\n“Would you mind moving out of the way?” came Malfoy’s cold drawl from behind them. “Are you trying to earn some extra money, Weasley? Hoping to be gamekeeper yourself when you leave Hogwarts, I suppose—that hut of Hagrid’s must seem like a palace compared to what your family’s used to.”  \n\nRon dived at Malfoy just as Snape came up the stairs.  \n\n“WEASLEY!”  \n\nRon let go of the front of Malfoy’s robes.  \n\n“He was provoked, Professor Snape,” said Hagrid, sticking his huge hairy face out from behind the tree. “Malfoy was insultin’ his family.”  \n\n“Be that as it may, Łghting is against Hogwarts rules, Hagrid,” said Snape silkily. “Five points from GryŃndor, Weasley, and be grateful it isn’t more. Move along, all of you.”  \n\nMalfoy, Crabbe, and Goyle pushed roughly past the tree, scattering needles everywhere and smirking.  \n\n“I’ll get him,” said Ron, grinding his teeth at Malfoy’s back, “one of these days, I’ll get him—”  \n\n“I hate them both,” said Harry, “Malfoy and Snape.”  \n\n“Come on, cheer up, it’s nearly Christmas,” said Hagrid. “Tell yeh what, come with me an’ see the Great Hall, looks a treat.”  \n\nSo the three of them followed Hagrid and his tree oŀ to the Great  Hall,  where  Professor  McGonagall  and  Professor Flitwick were busy with the Christmas decorations.  \n\n“Ah, Hagrid, the last tree—put it in the far corner, would you?”  \n\nThe hall looked spectacular. Festoons of holly and mistletoe hung all around the walls, and no less than twelve towering Christmas trees stood around the room, some sparkling with tiny icicles, some glittering with hundreds of candles.  \n\n“How many days you got left until yer holidays?” Hagrid asked.  \n\n“Just one,” said Hermione. “And that reminds me—Harry, Ron, we’ve got half an hour before lunch, we should be in the library.”  \n\n“Oh yeah, you’re right,” said Ron, tearing his eyes away from Professor Flitwick, who had golden bubbles blossoming out of his wand and was trailing them over the branches of the new tree.  \n\n“The library?” said Hagrid, following them out of the hall. “Just before the holidays? Bit keen, aren’t yeh?”  \n\n“Oh, we’re not working,” Harry told him brightly. “Ever since you mentioned Nicolas Flamel we’ve been trying to Łnd out who he is.”  \n\n“You what?” Hagrid looked shocked. “Listen here—I’ve told yeh—drop it. It’s nothin’ to you what that dog’s guardin’.”  \n\n“We just want to know who Nicolas Flamel is, that’s all,” said Hermione.  \n\n“Unless you’d like to tell us and save us the trouble?” Harry added. “We must’ve been through hundreds of books already and we can’t Łnd him anywhere—just give us a hint—I know I’ve read his name somewhere.”  \n\n“I’m sayin’ nothin’,” said Hagrid łatly.  \n\n“Just have to Łnd out for ourselves, then,” said Ron, and they left Hagrid looking disgruntled and hurried oŀ to the library.  \n\nThey had indeed been searching books for Flamel’s name ever since Hagrid had let it slip, because how else were they going to Łnd out what Snape was trying to steal? The trouble was, it was very hard to know where to",
    "chunk_order_index": 0,
    "full_doc_id": "doc-fd27b74a49b59e27362e816c90bdaae2"
  },
  "chunk-81b1031ce0210f03b68e718a68c5e623": {
    "tokens": 1200,
    "content": "“I’m sayin’ nothin’,” said Hagrid łatly.  \n\n“Just have to Łnd out for ourselves, then,” said Ron, and they left Hagrid looking disgruntled and hurried oŀ to the library.  \n\nThey had indeed been searching books for Flamel’s name ever since Hagrid had let it slip, because how else were they going to Łnd out what Snape was trying to steal? The trouble was, it was very hard to know where to begin, not knowing what Flamel might have done to get himself into a book. He wasn’t in Great Wizards of the Twentieth Century, or Notable Magical Names of Our Time; he was missing, too, from Important Modern Magical Discoveries, and A Study of Recent Developments in Wizardry. And then, of course, there was the sheer  size  of  the  library;  tens  of  thousands  of  books; thousands of shelves; hundreds of narrow rows.  \n\nHermione took out a list of subjects and titles she had decided to search while Ron strode oŀ down a row of books and started pulling them oŀ the shelves at random. Harry wandered  over  to  the  Restricted  Section.  He  had  been wondering for a while if Flamel wasn’t somewhere in there. Unfortunately, you needed a specially signed note from one of the teachers to look in any of the restricted books, and he knew he’d never get one. These were the books containing powerful Dark Magic never taught at Hogwarts, and only read by older students studying advanced Defense Against the Dark Arts.  \n\n“What are you looking for, boy?”  \n\n“Nothing,” said Harry.  \n\nMadam Pince the librarian brandished a feather duster at him.  \n\n“You’d better get out, then. Go on—out!”  \n\nWishing he’d been a bit quicker at thinking up some story, Harry left the library. He, Ron, and Hermione had already agreed they’d better not ask Madam Pince where they could Łnd Flamel. They were sure she’d be able to tell them, but they couldn’t risk Snape hearing what they were up to.  \n\nHarry waited outside in the corridor to see if the other two had found anything, but he wasn’t very hopeful. They had been looking for two weeks, after all, but as they only had odd moments between lessons it wasn’t surprising they’d found nothing. What they really needed was a nice long search without Madam Pince breathing down their necks.  \n\nFive minutes later, Ron and Hermione joined him, shaking their heads. They went oŀ to lunch.  \n\n“You will keep looking while I’m away, won’t you?” said Hermione. “And send me an owl if you Łnd anything.”  \n\n“And you could ask your parents if they know who Flamel is,” said Ron. “It’d be safe to ask them.”  \n\n“Very safe, as they’re both dentists,” said Hermione.  \n\nOnce the holidays had started, Ron and Harry were having too good a time to think much about Flamel. They had the dormitory to themselves and the common room was far emptier  than  usual,  so  they  were  able  to  get  the  good armchairs by the Łre. They sat by the hour eating anything they could spear on a toasting fork—bread, English muŃns, marshmallows—and plotting ways of getting Malfoy expelled, which were fun to talk about even if they wouldn’t work.  \n\nRon also started teaching Harry wizard chess. This was exactly like Muggle chess except that the Łgures were alive, which made it a lot like directing troops in battle. Ron’s set was very old and battered. Like everything else he owned, it had once belonged to someone else in his family—in this case, his grandfather. However, old chessmen weren’t a drawback at all. Ron knew them so well he never had trouble getting them to do what he wanted.  \n\nHarry played with chessmen Seamus Finnigan had lent him, and they didn’t trust him at all. He wasn’t a very good player yet and they kept shouting diŀerent bits of advice at him, which was confusing. “Don’t send me there, can’t you see his knight? Send him, we can aŀord to lose him.”  \n\nOn Christmas Eve, Harry went to bed looking forward to the next day for the food and the fun, but not expecting any presents at all. When he woke early in the morning, however, the Łrst thing he saw was a small pile of packages at the foot of his bed.  \n\n“Merry Christmas,” said Ron sleepily as Harry scrambled out of bed and pulled on his bathrobe.  \n\n“You, too,” said Harry. “Will you look at this? I’ve got some presents!”  \n\n“What did you expect, turnips?” said Ron, turning to his own pile, which was a lot bigger than Harry’s.  \n\nHarry picked up the top parcel. It was wrapped in thick brown paper and scrawled across it was To Harry, from Hagrid. Inside was a roughly cut wooden łute. Hagrid had obviously whittled it himself. Harry blew it—it sounded a bit like an owl.  \n\nA second, very small parcel contained a note.  \n\nWe received your message and enclose your Christmas present. From Uncle Vernon and Aunt Petunia. Taped to the note was a Łfty-pence piece.  \n\n“That’s friendly,” said Harry.  \n\nRon was fascinated by the Łfty pence.  \n\n“Weird!” he said, “What a shape! This is money?”  \n\n“You can keep it,” said Harry, laughing at how pleased Ron was. “Hagrid and my aunt and uncle—so who sent these?”  \n\n“I",
    "chunk_order_index": 1,
    "full_doc_id": "doc-fd27b74a49b59e27362e816c90bdaae2"
  },
  "chunk-2696a0129eecc16ed5b0775471806e33": {
    "tokens": 1200,
    "content": "We received your message and enclose your Christmas present. From Uncle Vernon and Aunt Petunia. Taped to the note was a Łfty-pence piece.  \n\n“That’s friendly,” said Harry.  \n\nRon was fascinated by the Łfty pence.  \n\n“Weird!” he said, “What a shape! This is money?”  \n\n“You can keep it,” said Harry, laughing at how pleased Ron was. “Hagrid and my aunt and uncle—so who sent these?”  \n\n“I think I know who that one’s from,” said Ron, turning a bit pink and pointing to a very lumpy parcel. “My mum. I told her you didn’t expect any presents and—oh, no,” he groaned, “she’s made you a Weasley sweater.”  \n\nHarry had torn open the parcel to Łnd a thick, hand-knitted sweater in emerald green and a large box of homemade fudge.  \n\n“Every year she makes us a sweater,” said Ron, unwrapping his own, “and mine’s always maroon.”  \n\n“That’s really nice of her,” said Harry, trying the fudge, which was very tasty.  \n\nHis next present also contained candy—a large box of Chocolate Frogs from Hermione.  \n\nThis left only one parcel. Harry picked it up and felt it. It was very light. He unwrapped it.  \n\nSomething łuid and silvery gray went slithering to the łoor where it lay in gleaming folds. Ron gasped.  \n\n“I’ve heard of those,” he said in a hushed voice, dropping the box of Every Flavor Beans he’d gotten from Hermione. “If that’s  what  I  think  it  is—they’re  really  rare,  and  really valuable.”  \n\n“What is it?”  \n\nHarry picked the shining, silvery cloth oŀ the łoor. It was strange to the touch, like water woven into material.  \n\n“It’s an Invisibility Cloak,” said Ron, a look of awe on his face. “I’m sure it is—try it on.”  \n\nHarry threw the Cloak around his shoulders and Ron gave a yell.  \n\n“It is! Look down!”  \n\nHarry looked down at his feet, but they were gone. He dashed to the mirror. Sure enough, his rełection looked back at him, just his head suspended in midair, his body completely invisible. He pulled the Cloak over his head and his rełection vanished completely.  \n\n“There’s a note!” said Ron suddenly. “A note fell out of it!”  \n\nHarry pulled oŀ the Cloak and seized the letter. Written in narrow, loopy writing he had never seen before were the following words:  \n\nYour father left this in my possession before he died. It is time it was returned  \n\nto you.  \n\nUse it well.  \n\nA Very Merry Christmas to you  \n\nThere was no signature. Harry stared at the note. Ron was admiring the Cloak.  \n\n“I’d give anything for one of these,” he said. “Anything. What’s the matter?”  \n\n“Nothing,” said Harry. He felt very strange. Who had sent the Cloak? Had it really once belonged to his father?  \n\nBefore he could say or think anything else, the dormitory door was łung open and Fred and George Weasley bounded in. Harry stuŀed the Cloak quickly out of sight. He didn’t feel like sharing it with anyone else yet.  \n\n“Merry Christmas!”  \n\n“Hey, look—Harry’s got a Weasley sweater, too!”  \n\nFred and George were wearing blue sweaters, one with a large yellow F on it, the other a G.  \n\n“Harry’s is better than ours, though,” said Fred, holding up Harry’s sweater. “She obviously makes more of an eŀort if you’re not family.”  \n\n“Why aren’t you wearing yours, Ron?” George demanded. “Come on, get it on, they’re lovely and warm.”  \n\n“I hate maroon,” Ron moaned halfheartedly as he pulled it over his head.  \n\n“You haven’t got a letter on yours,” George observed. “I suppose she thinks you don’t forget your name. But we’re not stupid—we know we’re called Gred and Forge.”  \n\n“What’s all this noise?”  \n\nPercy Weasley stuck his head through the door, looking disapproving.  He  had  clearly  gotten  halfway  through unwrapping his presents as he, too, carried a lumpy sweater over his arm, which Fred seized.  \n\n“P for prefect! Get it on, Percy, come on, we’re all wearing ours, even Harry got one.”  \n\n“I—don’t—want—” said Percy thickly, as the twins forced the sweater over his head, knocking his glasses askew.  \n\n“And you’re not sitting with the prefects today, either,” said George. “Christmas is a time for family.”  \n\nThey frog-marched Percy from the room, his arms pinned to his side by his sweater.  \n\nHarry had never in all his life had such a Christmas dinner. A hundred fat, roast turkeys; mountains of roast and boiled potatoes; platters of chipolatas; tureens of buttered peas, silver boats of thick, rich gravy and cranberry sauce—and stacks of wizard crackers every few feet along the table. These fantastic party favors were nothing like the feeble Muggle ones the Dursleys usually bought, with their little plastic toys and their łimsy paper hats inside. Harry pulled a wizard cracker with Fred and it didn’t just bang, it went oŀ with a blast like a cannon and engulfed them all in a cloud of blue smoke, while from the inside exploded a rear admiral’s hat and several live, white mice. Up at the High Table, Dumbled",
    "chunk_order_index": 2,
    "full_doc_id": "doc-fd27b74a49b59e27362e816c90bdaae2"
  },
  "chunk-e871ed0890bd32f606ae424aa0509852": {
    "tokens": 1200,
    "content": "the table. These fantastic party favors were nothing like the feeble Muggle ones the Dursleys usually bought, with their little plastic toys and their łimsy paper hats inside. Harry pulled a wizard cracker with Fred and it didn’t just bang, it went oŀ with a blast like a cannon and engulfed them all in a cloud of blue smoke, while from the inside exploded a rear admiral’s hat and several live, white mice. Up at the High Table, Dumbledore had swapped his pointed wizard’s hat for a łowered bonnet, and was chuckling merrily at a joke Professor Flitwick had just read him.  \n\nFlaming Christmas puddings followed the turkey. Percy nearly broke his teeth on a silver Sickle embedded in his slice. Harry watched Hagrid getting redder and redder in the face as he called for more wine, Łnally kissing Professor McGonagall on  the  cheek,  who,  to  Harry’s  amazement,  giggled  and blushed, her top hat lopsided.  \n\nWhen Harry Łnally left the table, he was laden down with a stack of things out of the crackers, including a pack of nonexplodable, luminous balloons, a Grow-Your-Own-Warts kit, and his own new wizard chess set. The white mice had disappeared and Harry had a nasty feeling they were going to end up as Mrs. Norris’s Christmas dinner.  \n\nHarry and the Weasleys spent a happy afternoon having a furious snowball Łght on the grounds. Then, cold, wet, and gasping for breath, they returned to the Łre in the GryŃndor common room, where Harry broke in his new chess set by losing spectacularly to Ron. He suspected he wouldn’t have lost so badly if Percy hadn’t tried to help him so much.  \n\nAfter a meal of turkey sandwiches, English muŃns, triłe, and Christmas cake, everyone felt too full and sleepy to do much before bed except sit and watch Percy chase Fred and George all over GryŃndor Tower because they’d stolen his prefect badge.  \n\nIt had been Harry’s best Christmas day ever. Yet something had been nagging at the back of his mind all day. Not until he climbed into bed was he free to think about it: the Invisibility Cloak and whoever had sent it.  \n\nRon, full of turkey and cake and with nothing mysterious to bother him, fell asleep almost as soon as he’d drawn the curtains of his four-poster. Harry leaned over the side of his own bed and pulled the Cloak out from under it.  \n\nHis father’s...this had been his father’s. He let the material łow over his hands, smoother than silk, light as air. Use it well, the note had said.  \n\nHe had to try it, now. He slipped out of bed and wrapped the Cloak around himself. Looking down at his legs, he saw only moonlight and shadows. It was a very funny feeling.  \n\nUse it well.  \n\nSuddenly, Harry felt wide-awake. The whole of Hogwarts was open to him in this Cloak. Excitement łooded through him as he stood there in the dark and silence. He could go anywhere in this, anywhere, and Filch would never know.  \n\nRon  grunted  in  his  sleep.  Should  Harry  wake  him? Something held him back—his father’s Cloak—he felt that this time—the Łrst time—he wanted to use it alone.  \n\nHe crept out of the dormitory, down the stairs, across the common room, and climbed through the portrait hole.  \n\n“Who’s there?” squawked the Fat Lady. Harry said nothing. He walked quickly down the corridor.  \n\nWhere should he go? He stopped, his heart racing, and thought. And then it came to him. The Restricted Section in the library. He’d be able to read as long as he liked, as long as it took to Łnd out who Flamel was. He set oŀ, drawing the Invisibility Cloak tight around him as he walked.  \n\nThe library was pitch-black and very eerie. Harry lit a lamp to see his way along the rows of books. The lamp looked as if it was łoating along in midair, and even though Harry could feel his arm supporting it, the sight gave him the creeps.  \n\nThe Restricted Section was right at the back of the library. Stepping carefully over the rope that separated these books from the rest of the library, he held up his lamp to read the titles.  \n\nThey didn’t tell him much. Their peeling, faded gold letters spelled words in languages Harry couldn’t understand. Some had no title at all. One book had a dark stain on it that looked horribly like blood. The hairs on the back of Harry’s neck prickled. Maybe he was imagining it, maybe not, but he thought a faint whispering was coming from the books, as though they knew someone was there who shouldn’t be.  \n\nHe had to start somewhere. Setting the lamp down carefully on  the  łoor,  he  looked  along  the  bottom  shelf  for  an interesting-looking book. A large black and silver volume caught his eye. He pulled it out with diŃculty, because it was very heavy, and, balancing it on his knee, let it fall open.  \n\nA piercing, bloodcurdling shriek split the silence—the book was screaming! Harry snapped it shut, but the shriek went on and on, one high, unbroken, earsplitting note. He stumbled backward and knocked over his lamp, which went out at once. Panicking, he heard footsteps coming down the corridor outside—stuŃng the shrie",
    "chunk_order_index": 3,
    "full_doc_id": "doc-fd27b74a49b59e27362e816c90bdaae2"
  },
  "chunk-814744b87308492a0a0682437cce61bb": {
    "tokens": 1200,
    "content": "diŃculty, because it was very heavy, and, balancing it on his knee, let it fall open.  \n\nA piercing, bloodcurdling shriek split the silence—the book was screaming! Harry snapped it shut, but the shriek went on and on, one high, unbroken, earsplitting note. He stumbled backward and knocked over his lamp, which went out at once. Panicking, he heard footsteps coming down the corridor outside—stuŃng the shrieking book back on the shelf, he ran for it. He passed Filch in the doorway; Filch’s pale, wild eyes looked straight through him, and Harry slipped under Filch’s outstretched arm and streaked oŀ up the corridor, the book’s shrieks still ringing in his ears.  \n\nHe came to a sudden halt in front of a tall suit of armor. He had been so busy getting away from the library, he hadn’t paid attention to where he was going. Perhaps because it was dark, he didn’t recognize where he was at all. There was a suit of armor near the kitchens, he knew, but he must be Łve łoors above there.  \n\n“You asked me to come directly to you, Professor, if anyone was wandering around at night, and somebody’s been in the library—Restricted Section.”  \n\nHarry felt the blood drain out of his face. Wherever he was, Filch must know a shortcut, because his soft, greasy voice was getting nearer, and to his horror, it was Snape who replied, “The Restricted Section? Well, they can’t be far, we’ll catch them.”  \n\nHarry stood rooted to the spot as Filch and Snape came around the corner ahead. They couldn’t see him, of course, but it was a narrow corridor and if they came much nearer they’d knock right into him—the Cloak didn’t stop him from being solid.  \n\nHe backed away as quietly as he could. A door stood ajar to his left. It was his only hope. He squeezed through it, holding his breath, trying not to move it, and to his relief he managed to get inside the room without their noticing anything. They walked straight past, and Harry leaned against the wall, breathing deeply, listening to their footsteps dying away. That had been close, very close. It was a few seconds before he noticed anything about the room he had hidden in.  \n\nIt looked like an unused classroom. The dark shapes of desks and chairs were piled against the walls, and there was an upturned wastepaper basket—but propped against the wall facing him was something that didn’t look as if it belonged there, something that looked as if someone had just put it there to keep it out of the way.  \n\nIt was a magniŁcent mirror, as high as the ceiling, with an ornate gold frame, standing on two clawed feet. There was an inscription carved around the top: Erised stra ehru oyt ube cafru oyt on wohsi.  \n\nHis panic fading now that there was no sound of Filch and Snape, Harry moved nearer to the mirror, wanting to look at himself but see no rełection again. He stepped in front of it.  \n\nHe had to clap his hands to his mouth to stop himself from screaming. He whirled around. His heart was pounding far more furiously than when the book had screamed—for he had seen not only himself in the mirror, but a whole crowd of people standing right behind him.  \n\nBut the room was empty. Breathing very fast, he turned slowly back to the mirror.  \n\nThere he was, rełected in it, white and scared-looking, and there, rełected behind him, were at least ten others. Harry looked over his shoulder—but still, no one was there. Or were they all invisible, too? Was he in fact in a room full of invisible people and this mirror’s trick was that it rełected them, invisible or not?  \n\nHe looked in the mirror again. A woman standing right behind his rełection was smiling at him and waving. He reached out a hand and felt the air behind him. If she was really there, he’d touch her, their rełections were so close together, but he felt only air—she and the others existed only in the mirror.  \n\nShe was a very pretty woman. She had dark red hair and her eyes—her eyes are just like mine, Harry thought, edging a little closer to the glass. Bright green—exactly the same shape, but then he noticed that she was crying; smiling, but crying at the same time. The tall, thin, black-haired man standing next to her put his arm around her. He wore glasses, and his hair was very untidy. It stuck up at the back, just as Harry’s did.  \n\nHarry was so close to the mirror now that his nose was nearly touching that of his rełection.  \n\n“Mum?” he whispered. “Dad?”  \n\nThey just looked at him, smiling. And slowly, Harry looked into the faces of the other people in the mirror, and saw other pairs of green eyes like his, other noses like his, even a little old man who looked as though he had Harry’s knobbly knees— Harry was looking at his family, for the Łrst time in his life.  \n\nThe Potters smiled and waved at Harry and he stared hungrily back at them, his hands pressed łat against the glass as though he was hoping to fall right through it and reach them. He had a powerful kind of ache inside him, half joy, half terrible sadness.  \n\nHow long he stood there, he didn’t know. The rełections did not fade and he looked and looked until a distant noise brought him back to his senses. He couldn’t stay",
    "chunk_order_index": 4,
    "full_doc_id": "doc-fd27b74a49b59e27362e816c90bdaae2"
  },
  "chunk-eb7f19f6be315673f1966223bad40482": {
    "tokens": 1200,
    "content": "in his life.  \n\nThe Potters smiled and waved at Harry and he stared hungrily back at them, his hands pressed łat against the glass as though he was hoping to fall right through it and reach them. He had a powerful kind of ache inside him, half joy, half terrible sadness.  \n\nHow long he stood there, he didn’t know. The rełections did not fade and he looked and looked until a distant noise brought him back to his senses. He couldn’t stay here, he had to Łnd his way back to bed. He tore his eyes away from his mother’s face, whispered, “I’ll come back,” and hurried from the room.  \n\n“You could have woken me up,” said Ron, crossly.  \n\n“You can come tonight, I’m going back, I want to show you the mirror.”  \n\n“I’d like to see your mum and dad,” Ron said eagerly.  \n\n“And I want to see all your family, all the Weasleys, you’ll be able to show me your other brothers and everyone.”  \n\n“You can see them any old time,” said Ron. “Just come round my house this summer. Anyway, maybe it only shows dead people. Shame about not Łnding Flamel, though. Have some bacon or something, why aren’t you eating anything?”  \n\nHarry couldn’t eat. He had seen his parents and would be seeing them again tonight. He had almost forgotten about Flamel. It didn’t seem very important anymore. Who cared what the three-headed dog was guarding? What did it matter if Snape stole it, really?  \n\n“Are you all right?” said Ron. “You look odd.”  \n\nWhat Harry feared most was that he might not be able to Łnd the mirror room again. With Ron covered in the Cloak, too, they had to walk much more slowly the next night. They tried retracing Harry’s route from the library, wandering around the dark passageways for nearly an hour.  \n\n“I’m freezing,” said Ron. “Let’s forget it and go back.”  \n\n“No!” Harry hissed. “I know it’s here somewhere.”  \n\nThey passed the ghost of a tall witch gliding in the opposite direction, but saw no one else. Just as Ron started moaning that his feet were dead with cold, Harry spotted the suit of armor.  \n\n“It’s here—just here—yes!”  \n\nThey pushed the door open. Harry dropped the Cloak from around his shoulders and ran to the mirror.  \n\nThere they were. His mother and father beamed at the sight of him.  \n\n“See?” Harry whispered.  \n\n“I can’t see anything.”  \n\n“Look! Look at them all...there are loads of them....”  \n\n“I can only see you.”  \n\n“Look in it properly, go on, stand where I am.”  \n\nHarry stepped aside, but with Ron in front of the mirror, he couldn’t see his family anymore, just Ron in his paisley pajamas.  \n\nRon, though, was staring transŁxed at his image.  \n\n“Look at me!” he said.  \n\n“Can you see all your family standing around you?”  \n\n“No—I’m alone—but I’m diŀerent—I look older—and I’m Head Boy!”  \n\n“What?”  \n\n“I am—I’m wearing the badge like Bill used to—and I’m holding the House Cup and the Quidditch Cup—I’m Quidditch captain, too!”  \n\nRon tore his eyes away from this splendid sight to look excitedly at Harry.  \n\n“Do you think this mirror shows the future?”  \n\n“How can it? All my family are dead—let me have another look—”  \n\n“You had it to yourself all last night, give me a bit more time.”  \n\n“You’re only holding the Quidditch Cup, what’s interesting about that? I want to see my parents.”  \n\n“Don’t push me—”  \n\nA sudden noise outside in the corridor put an end to their discussion. They hadn’t realized how loudly they had been talking.  \n\n“Quick!”  \n\nRon threw the Cloak back over them as the luminous eyes of Mrs. Norris came round the door. Ron and Harry stood quite still, both thinking the same thing—did the Cloak work on cats? After what seemed an age, she turned and left.  \n\n“This isn’t safe—she might have gone for Filch, I bet she heard us. Come on.”  \n\nAnd Ron pulled Harry out of the room.  \n\nThe snow still hadn’t melted the next morning.  \n\n“Want to play chess, Harry?” said Ron.  \n\n“No.”  \n\n“Why don’t we go down and visit Hagrid?”  \n\n“No...you go...”  \n\n“I know what you’re thinking about, Harry, that mirror. Don’t go back tonight.”  \n\n“Why not?”  \n\n“I dunno, I’ve just got a bad feeling about it—and anyway, you’ve had too many close shaves already. Filch, Snape, and Mrs. Norris are wandering around. So what if they can’t see you?  What  if  they  walk  into  you?  What  if  you  knock something over?”  \n\n“You sound like Hermione.”  \n\n“I’m serious, Harry, don’t go.”  \n\nBut Harry only had one thought in his head, which was to get back in front of the mirror, and Ron wasn’t going to stop him.  \n\nThat third night he found his way more quickly than before. He was walking so fast he knew he was making more noise than was wise, but he didn’t meet anyone.  \n\nAnd there were his mother and father smiling at him again, and one of his grandfathers nodding happily. Harry sank down to sit on the łoor in front of the mirror. There was nothing to stop him from staying here all night with his family. Nothing",
    "chunk_order_index": 5,
    "full_doc_id": "doc-fd27b74a49b59e27362e816c90bdaae2"
  },
  "chunk-cb2b01616a0126d691317ffa99192e6d": {
    "tokens": 1200,
    "content": "and Ron wasn’t going to stop him.  \n\nThat third night he found his way more quickly than before. He was walking so fast he knew he was making more noise than was wise, but he didn’t meet anyone.  \n\nAnd there were his mother and father smiling at him again, and one of his grandfathers nodding happily. Harry sank down to sit on the łoor in front of the mirror. There was nothing to stop him from staying here all night with his family. Nothing at all.  \n\nExcept—  \n\n“So—back again, Harry?”  \n\nHarry felt as though his insides had turned to ice. He looked behind him. Sitting on one of the desks by the wall was none other than Albus Dumbledore. Harry must have walked straight past him, so desperate to get to the mirror he hadn’t noticed him.  \n\n“I—I didn’t see you, sir.”  \n\n“Strange how nearsighted being invisible can make you,” said Dumbledore, and Harry was relieved to see that he was smiling.  \n\n“So,” said Dumbledore, slipping oŀ the desk to sit on the łoor  with  Harry,  “you,  like  hundreds  before  you,  have discovered the delights of the Mirror of Erised.”  \n\n“I didn’t know it was called that, sir.”  \n\n“But I expect you’ve realized by now what it does?”  \n\n“It—well—it shows me my family—”  \n\n“And it showed your friend Ron himself as Head Boy.”  \n\n“How did you know—?”  \n\n“I don’t need a cloak to become invisible,” said Dumbledore gently. “Now, can you think what the Mirror of Erised shows us all?”  \n\nHarry shook his head.  \n\n“Let me explain. The happiest man on earth would be able to use the Mirror of Erised like a normal mirror, that is, he would look into it and see himself exactly as he is. Does that help?”  \n\nHarry thought. Then he said slowly, “It shows us what we want...whatever we want...”  \n\n“Yes and no,” said Dumbledore quietly. “It shows us nothing more or less than the deepest, most desperate desire of our hearts. You, who have never known your family, see them standing around you. Ronald Weasley, who has always been overshadowed by his brothers, sees himself standing alone, the best of all of them. However, this mirror will give us neither knowledge or truth. Men have wasted away before it, entranced by what they have seen, or been driven mad, not knowing if what it shows is real or even possible.  \n\n“The Mirror will be moved to a new home tomorrow, Harry, and I ask you not to go looking for it again. If you ever do run across it, you will now be prepared. It does not do to dwell on dreams and forget to live, remember that. Now, why don’t you put that admirable Cloak back on and get oŀ to bed?”  \n\nHarry stood up.  \n\n“Sir—Professor Dumbledore? Can I ask you something?”  \n\n“Obviously, you’ve just done so,” Dumbledore smiled. “You may ask me one more thing, however.”  \n\n“What do you see when you look in the mirror?”  \n\n“I? I see myself holding a pair of thick, woolen socks.”  \n\nHarry stared.  \n\n“One can never have enough socks,” said Dumbledore. “Another Christmas has come and gone and I didn’t get a single pair. People will insist on giving me books.”  \n\nIt was only when he was back in bed that it struck Harry that Dumbledore might not have been quite truthful. But then, he thought, as he shoved Scabbers oŀ his pillow, it had been quite a personal question.  \n\n![](images/image_1.jpg)  \n\numbledore had convinced Harry not to go looking for the Mirror of Erised again, and for the rest of the Christmas holidays the Invisibility Cloak stayed folded at the bottom of his trunk. Harry wished he could forget what he’d seen in the mirror  as  easily,  but  he  couldn’t.  He  started  having nightmares. Over and over again he dreamed about his parents disappearing in a łash of green light, while a high voice cackled with laughter.  \n\n“You see, Dumbledore was right, that mirror could drive you mad,” said Ron, when Harry told him about these dreams.  \n\nHermione, who came back the day before term started, took a diŀerent view of things. She was torn between horror at the idea of Harry being out of bed, roaming the school three nights  in  a  row  (“If  Filch  had  caught  you!”),  and disappointment that he hadn’t at least found out who Nicolas Flamel was.  \n\nThey had almost given up hope of ever Łnding Flamel in a library book, even though Harry was still sure he’d read the name somewhere. Once term had started, they were back to skimming through books for ten minutes during their breaks. Harry  had  even  less  time  than  the  other  two,  because Quidditch practice had started again.  \n\nWood was working the team harder than ever. Even the endless rain that had replaced the snow couldn’t dampen his spirits. The Weasleys complained that Wood was becoming a fanatic, but Harry was on Wood’s side. If they won their next match, against Huńepuŀ, they would overtake Slytherin in the House Championship for the Łrst time in seven years. Quite apart from wanting to win, Harry found that he had fewer nightmares when he was tired out after training.  \n\nThen, during one particularly wet and muddy practice session, Wood gave the team",
    "chunk_order_index": 6,
    "full_doc_id": "doc-fd27b74a49b59e27362e816c90bdaae2"
  },
  "chunk-8f8de2482ce99c7fd198feaf7d316941": {
    "tokens": 1200,
    "content": "’t dampen his spirits. The Weasleys complained that Wood was becoming a fanatic, but Harry was on Wood’s side. If they won their next match, against Huńepuŀ, they would overtake Slytherin in the House Championship for the Łrst time in seven years. Quite apart from wanting to win, Harry found that he had fewer nightmares when he was tired out after training.  \n\nThen, during one particularly wet and muddy practice session, Wood gave the team a bit of bad news. He’d just gotten very angry with the Weasleys, who kept dive-bombing each other and pretending to fall oŀ their brooms.  \n\n“Will you stop messing around!” he yelled. “That’s exactly the sort of thing that’ll lose us the match! Snape’s refereeing this time, and he’ll be looking for any excuse to knock points oŀ GryŃndor!”  \n\nGeorge Weasley really did fall oŀ his broom at these words.  \n\n“Snape’s refereeing?” he spluttered through a mouthful of mud. “When’s he ever refereed a Quidditch match? He’s not going to be fair if we might overtake Slytherin.”  \n\nThe rest of the team landed next to George to complain, too.  \n\n“It’s not my fault,” said Wood. “We’ve just got to make sure we play a clean game, so Snape hasn’t got an excuse to pick on us.”  \n\nWhich was all very well, thought Harry, but he had another reason for not wanting Snape near him while he was playing Quidditch....  \n\nThe rest of the team hung back to talk to one another as usual at the end of practice, but Harry headed straight back to the GryŃndor common room, where he found Ron and Hermione playing chess. Chess was the only thing Hermione ever lost at, something Harry and Ron thought was very good for her.  \n\n“Don’t talk to me for a moment,” said Ron when Harry sat down next to him, “I need to concen—” He caught sight of Harry’s face. “What’s the matter with you? You look terrible.”  \n\nSpeaking quietly so that no one else would hear, Harry told the other two about Snape’s sudden, sinister desire to be a Quidditch referee.  \n\n“Don’t play,” said Hermione at once.  \n\n“Say you’re ill,” said Ron.  \n\n“Pretend to break your leg,” Hermione suggested.  \n\n“Really break your leg,” said Ron.  \n\n“I can’t,” said Harry. “There isn’t a reserve Seeker. If I back out, GryŃndor can’t play at all.”  \n\nAt that moment Neville toppled into the common room. How he had managed to climb through the portrait hole was anyone’s guess, because his legs had been stuck together with what they recognized at once as the Leg-Locker Curse. He must have had to bunny hop all the way up to GryŃndor Tower.  \n\nEveryone fell over laughing except Hermione, who leapt up and performed the countercurse. Neville’s legs sprang apart and he got to his feet, trembling.  \n\n“What happened?” Hermione asked him, leading him over to sit with Harry and Ron.  \n\n“Malfoy,” said Neville shakily. “I met him outside the library. He said he’d been looking for someone to practice that on.”  \n\n“Go to Professor McGonagall!” Hermione urged Neville. “Report him!”  \n\nNeville shook his head.  \n\n“I don’t want more trouble,” he mumbled.  \n\n“You’ve got to stand up to him, Neville!” said Ron. “He’s used to walking all over people, but that’s no reason to lie down in front of him and make it easier.”  \n\n“There’s no need to tell me I’m not brave enough to be in GryŃndor, Malfoy’s already done that,” Neville choked out.  \n\nHarry felt in the pocket of his robes and pulled out a Chocolate Frog, the very last one from the box Hermione had given him for Christmas. He gave it to Neville, who looked as though he might cry.  \n\n“You’re worth twelve of Malfoy,” Harry said. “The Sorting Hat chose you for GryŃndor, didn’t it? And where’s Malfoy? In stinking Slytherin.”  \n\nNeville’s lips twitched in a weak smile as he unwrapped the frog.  \n\n“Thanks, Harry...I think I’ll go to bed....D’you want the card, you collect them, don’t you?”  \n\nAs Neville walked away, Harry looked at the Famous Wizard card.  \n\n“Dumbledore again,” he said, “He was the Łrst one I ever—”  \n\nHe gasped. He stared at the back of the card. Then he looked up at Ron and Hermione.  \n\n“I’ve found him!” he whispered. “I’ve found Flamel! I told you I’d read the name somewhere before, I read it on the train coming  here—listen  to  this:  ‘Dumbledore  is  particularly famous for his defeat of the Dark wizard Grindelwald in 1945, for the discovery of the twelve uses of dragon’s blood, and his work on alchemy with his partner, Nicolas Flamel’!”  \n\nHermione jumped to her feet. She hadn’t looked so excited since they’d gotten back the marks for their very Łrst piece of homework.  \n\n“Stay there!” she said, and she sprinted up the stairs to the girls’ dormitories. Harry and Ron barely had time to exchange mystiŁed looks before she was dashing back, an enormous old book in her arms.  \n\n“I never thought to look in here!” she whispered excitedly",
    "chunk_order_index": 7,
    "full_doc_id": "doc-fd27b74a49b59e27362e816c90bdaae2"
  },
  "chunk-e11c8c66d384737a25f35c710e9f1880": {
    "tokens": 1200,
    "content": "partner, Nicolas Flamel’!”  \n\nHermione jumped to her feet. She hadn’t looked so excited since they’d gotten back the marks for their very Łrst piece of homework.  \n\n“Stay there!” she said, and she sprinted up the stairs to the girls’ dormitories. Harry and Ron barely had time to exchange mystiŁed looks before she was dashing back, an enormous old book in her arms.  \n\n“I never thought to look in here!” she whispered excitedly. “I got this out of the library weeks ago for a bit of light reading.”  \n\n“Light?” said Ron, but Hermione told him to be quiet until she’d looked something up, and started łicking frantically through the pages, muttering to herself.  \n\nAt last she found what she was looking for.  \n\n“I knew it! I knew it!”  \n\n“Are  we  allowed  to  speak  yet?”  said  Ron  grumpily. Hermione ignored him.  \n\n“Nicolas Flamel,” she whispered dramatically, “is the only known maker of the Sorcerer’s Stone!”  \n\nThis didn’t have quite the eŀect she’d expected.  \n\n“The what?” said Harry and Ron.  \n\n“Oh, honestly, don’t you two read? Look—read that, there.” She pushed the book toward them, and Harry and Ron read:  \n\nThe ancient study of alchemy is concerned with making the Sorcerer’s Stone, a legendary substance with astonishing powers. The Stone will transform any metal into pure gold. It also produces the Elixir of Life, which will make the drinker immortal.  \n\nThere have been many reports of the Sorcerer’s Stone over the centuries, but the only Stone currently in existence belongs to Mr. Nicolas Flamel, the noted alchemist and opera lover. Mr. Flamel, who celebrated his six hundred and sixty-fifth birthday last year, enjoys a quiet life in Devon with his wife, Perenelle (six hundred and fifty-eight).  \n\n“See?” said Hermione, when Harry and Ron had Łnished. “The dog must be guarding Flamel’s Sorcerer’s Stone! I bet he asked Dumbledore to keep it safe for him, because they’re friends and he knew someone was after it, that’s why he wanted the Stone moved out of Gringotts!”  \n\n“A stone that makes gold and stops you from ever dying!” said Harry. “No wonder Snape’s after it! Anyone would want it.”  \n\n“And no wonder we couldn’t Łnd Flamel in that Study of Recent Developments in Wizardry,” said Ron. “He’s not exactly recent if he’s six hundred and sixty-Łve, is he?”  \n\nThe next morning in Defense Against the Dark Arts, while copying down diŀerent ways of treating werewolf bites, Harry and Ron were still discussing what they’d do with a Sorcerer’s Stone if they had one. It wasn’t until Ron said he’d buy his own Quidditch team that Harry remembered about Snape and the coming match.  \n\n“I’m going to play,” he told Ron and Hermione. “If I don’t, all the Slytherins will think I’m just too scared to face Snape. I’ll show them...it’ll really wipe the smiles oŀ their faces if we win.”  \n\n“Just as long as we’re not wiping you oŀ the Łeld,” said Hermione.  \n\nAs the match drew nearer, however, Harry became more and more nervous, whatever he told Ron and Hermione. The rest of the team wasn’t too calm, either. The idea of overtaking Slytherin in the House Championship was wonderful, no one had done it for seven years, but would they be allowed to, with such a biased referee?  \n\nHarry didn’t know whether he was imagining it or not, but he seemed to keep running into Snape wherever he went. At times, he even wondered whether Snape was following him, trying to catch him on his own. Potions lessons were turning into a sort of weekly torture, Snape was so horrible to Harry. Could  Snape  possibly  know  they’d  found  out  about  the Sorcerer’s Stone? Harry didn’t see how he could—yet he sometimes had the horrible feeling that Snape could read minds.  \n\nHarry knew, when they wished him good luck outside the locker rooms the next afternoon, that Ron and Hermione were wondering whether they’d ever see him alive again. This wasn’t what you’d call comforting. Harry hardly heard a word of Wood’s pep talk as he pulled on his Quidditch robes and picked up his Nimbus Two Thousand.  \n\nRon and Hermione, meanwhile, had found a place in the stands next to Neville, who couldn’t understand why they looked so grim and worried, or why they had both brought their wands to the match. Little did Harry know that Ron and Hermione had been secretly practicing the Leg-Locker Curse. They’d gotten the idea from Malfoy using it on Neville, and were ready to use it on Snape if he showed any sign of wanting to hurt Harry.  \n\n“Now,  don’t  forget,  it’s  Locomotor  Mortis,”  Hermione muttered as Ron slipped his wand up his sleeve.  \n\n“I know,” Ron snapped. “Don’t nag.”  \n\nBack in the locker room, Wood had taken Harry aside.  \n\n“Don’t want to pressure you, Potter, but if we ever need an early capture of the Snitch it’s now. Finish the game before Snape can favor Huńepuŀ too much.”  \n\n“The whole school’s out there!” said Fred Weasley, peering out  of  the  door.  “Even—blimey—Dumbledore’s  come",
    "chunk_order_index": 8,
    "full_doc_id": "doc-fd27b74a49b59e27362e816c90bdaae2"
  },
  "chunk-4b80c585d84a141efc3577a7b652f6d0": {
    "tokens": 1200,
    "content": "“Don’t nag.”  \n\nBack in the locker room, Wood had taken Harry aside.  \n\n“Don’t want to pressure you, Potter, but if we ever need an early capture of the Snitch it’s now. Finish the game before Snape can favor Huńepuŀ too much.”  \n\n“The whole school’s out there!” said Fred Weasley, peering out  of  the  door.  “Even—blimey—Dumbledore’s  come  to watch!”  \n\nHarry’s heart did a somersault.  \n\n“Dumbledore?” he said, dashing to the door to make sure. Fred was right. There was no mistaking that silver beard.  \n\nHarry could have laughed out loud with relief. He was safe. There was simply no way that Snape would dare to try to hurt him if Dumbledore was watching.  \n\nPerhaps that was why Snape was looking so angry as the teams marched onto the Łeld, something that Ron noticed, too.  \n\n“I’ve never seen Snape look so mean,” he told Hermione. “Look—they’re oŀ. Ouch!”  \n\nSomeone had poked Ron in the back of the head. It was Malfoy.  \n\n“Oh, sorry, Weasley, didn’t see you there.”  \n\nMalfoy grinned broadly at Crabbe and Goyle.  \n\n“Wonder how long Potter’s going to stay on his broom this time? Anyone want a bet? What about you, Weasley?”  \n\nRon didn’t answer; Snape had just awarded Huńepuŀ a penalty because George Weasley had hit a Bludger at him. Hermione, who had all her Łngers crossed in her lap, was squinting Łxedly at Harry, who was circling the game like a hawk, looking for the Snitch.  \n\n“You  know  how  I  think  they  choose  people  for  the GryŃndor team?” said Malfoy loudly a few minutes later, as Snape awarded Huńepuŀ another penalty for no reason at all. “It’s people they feel sorry for. See, there’s Potter, who’s got no parents, then there’s the Weasleys, who’ve got no money—you should be on the team, Longbottom, you’ve got no brains.”  \n\nNeville went bright red but turned in his seat to face Malfoy.  \n\n“I’m worth twelve of you, Malfoy,” he stammered.  \n\nMalfoy, Crabbe, and Goyle howled with laughter, but Ron, still not daring to take his eyes from the game, said, “You tell  \n\nhim, Neville.”  \n\n“Longbottom, if brains were gold you’d be poorer than Weasley, and that’s saying something.”  \n\nRon’s nerves were already stretched to the breaking point with anxiety about Harry.  \n\n“I’m warning you, Malfoy—one more word—”  \n\n“Ron!” said Hermione suddenly, “Harry—!”  \n\n“What? Where?”  \n\nHarry had suddenly gone into a spectacular dive, which drew gasps and cheers from the crowd. Hermione stood up, her crossed Łngers in her mouth, as Harry streaked toward the ground like a bullet.  \n\n“You’re in luck, Weasley, Potter’s obviously spotted some money on the ground!” said Malfoy.  \n\nRon snapped. Before Malfoy knew what was happening, Ron was on top of him, wrestling him to the ground. Neville hesitated, then clambered over the back of his seat to help.  \n\n“Come on, Harry!” Hermione screamed, leaping onto her seat to watch as Harry sped straight at Snape—she didn’t even notice Malfoy and Ron rolling around under her seat, or the scuńes and yelps coming from the whirl of Łsts that was Neville, Crabbe, and Goyle.  \n\nUp in the air, Snape turned on his broomstick just in time to see something scarlet shoot past him, missing him by inches —the next second, Harry had pulled out of the dive, his arm raised in triumph, the Snitch clasped in his hand.  \n\nThe stands erupted; it had to be a record, no one could ever remember the Snitch being caught so quickly.  \n\n“Ron! Ron! Where are you? The game’s over! Harry’s won! We’ve won! GryŃndor is in the lead!” shrieked Hermione, dancing up and down on her seat and hugging Parvati Patil in the row in front.  \n\nHarry jumped oŀ his broom, a foot from the ground. He couldn’t believe it. He’d done it—the game was over; it had barely lasted Łve minutes. As GryŃndors came spilling onto the Łeld, he saw Snape land nearby, white-faced and tightlipped—then Harry felt a hand on his shoulder and looked up into Dumbledore’s smiling face.  \n\n“Well done,” said Dumbledore quietly, so that only Harry could hear. “Nice to see you haven’t been brooding about that mirror...been keeping busy...excellent...”  \n\nSnape spat bitterly on the ground.  \n\nHarry left the locker room alone some time later, to take his Nimbus Two Thousand back to the broomshed. He couldn’t ever remember feeling happier. He’d really done something to be proud of now—no one could say he was just a famous name any more. The evening air had never smelled so sweet. He walked over the damp grass, reliving the last hour in his head, which was a happy blur: GryŃndors running to lift him onto their shoulders; Ron and Hermione in the distance, jumping up and down, Ron cheering through a heavy nosebleed.  \n\nHarry had",
    "chunk_order_index": 9,
    "full_doc_id": "doc-fd27b74a49b59e27362e816c90bdaae2"
  },
  "chunk-23d93806da9c36811f5748ca10e03166": {
    "tokens": 1200,
    "content": ". He couldn’t ever remember feeling happier. He’d really done something to be proud of now—no one could say he was just a famous name any more. The evening air had never smelled so sweet. He walked over the damp grass, reliving the last hour in his head, which was a happy blur: GryŃndors running to lift him onto their shoulders; Ron and Hermione in the distance, jumping up and down, Ron cheering through a heavy nosebleed.  \n\nHarry had reached the shed. He leaned against the wooden door and looked up at Hogwarts, with its windows glowing red in the setting sun. GryŃndor in the lead. He’d done it, he’d shown Snape....  \n\nAnd speaking of Snape...  \n\nA hooded Łgure came swiftly down the front steps of the castle. Clearly not wanting to be seen, it walked as fast as possible toward the forbidden forest. Harry’s victory faded from his mind as he watched. He recognized the Łgure’s prowling walk. Snape, sneaking into the forest while everyone else was at dinner—what was going on?  \n\nHarry jumped back on his Nimbus Two Thousand and took oŀ. Gliding silently over the castle he saw Snape enter the forest at a run. He followed.  \n\nThe trees were so thick he couldn’t see where Snape had gone. He łew in circles, lower and lower, brushing the top branches of trees until he heard voices. He glided toward them and landed noiselessly in a towering beech tree.  \n\nHe climbed carefully along one of the branches, holding tight to his broomstick, trying to see through the leaves.  \n\nBelow, in a shadowy clearing, stood Snape, but he wasn’t alone. Quirrell was there, too. Harry couldn’t make out the look on his face, but he was stuttering worse than ever. Harry strained to catch what they were saying.  \n\n“...d-don’t know why you wanted t-t-to meet here of all pplaces, Severus...”  \n\n“Oh, I thought we’d keep this private,” said Snape, his voice icy. “Students aren’t supposed to know about the Sorcerer’s Stone, after all.”  \n\nHarry leaned forward. Quirrell was mumbling something. Snape interrupted him.  \n\n“Have you found out how to get past that beast of Hagrid’s yet?”  \n\n“B-b-but Severus, I—”  \n\n“You don’t want me as your enemy, Quirrell,” said Snape, taking a step toward him.  \n\n“I-I don’t know what you—”  \n\n“You know perfectly well what I mean.”  \n\nAn owl hooted loudly, and Harry nearly fell out of the tree. He steadied himself in time to hear Snape say, “—your little bit of hocus-pocus. I’m waiting.”  \n\n“B-but I d-d-don’t—”  \n\n“Very well,” Snape cut in. “We’ll have another little chat soon, when you’ve had time to think things over and decided where your loyalties lie.”  \n\nHe threw his cloak over his head and strode out of the clearing. It was almost dark now, but Harry could see Quirrell, standing quite still as though he was petriŁed.  \n\n“Harry, where have you been?” Hermione squeaked.  \n\n“We won! You won! We won!” shouted Ron, thumping Harry on the back. “And I gave Malfoy a black eye, and Neville tried to take on Crabbe and Goyle single-handed! He’s still out cold but Madam Pomfrey says he’ll be all right—talk about showing Slytherin! Everyone’s waiting for you in the common room, we’re having a party, Fred and George stole some cakes and stuŀ from the kitchens.”  \n\n“Never mind that now,” said Harry breathlessly. “Let’s Łnd an empty room, you wait ’til you hear this....”  \n\nHe made sure Peeves wasn’t inside before shutting the door behind them, then he told them what he’d seen and heard.  \n\n“So we were right, it is the Sorcerer’s Stone, and Snape’s trying to force Quirrell to help him get it. He asked if he knew how to get past Fluŀy—and he said something about Quirrell’s ‘hocus-pocus’—I reckon there are other things guarding the stone apart from Fluŀy, loads of enchantments, probably, and Quirrell would have done some anti-Dark Arts spell that Snape needs to break through—”  \n\n“So you mean the Stone’s only safe as long as Quirrell stands up to Snape?” said Hermione in alarm.  \n\n“It’ll be gone by next Tuesday,” said Ron.  \n\n![](images/image_2.jpg)  \n\nuirrell, however, must have been braver than they’d thought. In the weeks that followed he did seem to be getting paler and thinner, but it didn’t look as though he’d cracked yet.  \n\nEvery time they passed the third-łoor corridor, Harry, Ron, and Hermione would press their ears to the door to check that Fluŀy was still growling inside. Snape was sweeping about in his usual bad temper, which surely meant that the Stone was still safe. Whenever Harry passed Quirrell these days he gave him an encouraging sort of smile, and Ron had started telling people oŀ for laughing at Quirrell’s stutter.  \n\nHermione, however, had more on her mind than the Sorcerer’s Stone. She had started drawing up study schedules and color-coding all her notes. Harry and Ron wouldn’t have minded, but she kept nagging them to do the same.  \n\n“Hermione,",
    "chunk_order_index": 10,
    "full_doc_id": "doc-fd27b74a49b59e27362e816c90bdaae2"
  },
  "chunk-1026a83eb32d73b4a41069a81f1ba177": {
    "tokens": 1200,
    "content": "the Stone was still safe. Whenever Harry passed Quirrell these days he gave him an encouraging sort of smile, and Ron had started telling people oŀ for laughing at Quirrell’s stutter.  \n\nHermione, however, had more on her mind than the Sorcerer’s Stone. She had started drawing up study schedules and color-coding all her notes. Harry and Ron wouldn’t have minded, but she kept nagging them to do the same.  \n\n“Hermione, the exams are ages away.”  \n\n“Ten weeks,” Hermione snapped. “That’s not ages, that’s like a second to Nicolas Flamel.”  \n\n“But we’re not six hundred years old,” Ron reminded her. “Anyway, what are you studying for, you already know it all.”  \n\n“What am I studying for? Are you crazy? You realize we need to pass these exams to get into the second year? They’re very important, I should have started studying a month ago, I don’t know what’s gotten into me....”  \n\nUnfortunately, the teachers seemed to be thinking along the same lines as Hermione. They piled so much homework on them that the Easter holidays weren’t nearly as much fun as the Christmas ones. It was hard to relax with Hermione next to you reciting the twelve uses of dragon’s blood or practicing wand movements. Moaning and yawning, Harry and Ron spent most of their free time in the library with her, trying to get through all their extra work.  \n\n“I’ll never remember this,” Ron burst out one afternoon, throwing down his quill and looking longingly out of the library window. It was the Łrst really Łne day they’d had in months. The sky was a clear, forget-me-not blue, and there was a feeling in the air of summer coming.  \n\nHarry, who was looking up “Dittany” in One Thousand Magical Herbs and Fungi, didn’t look up until he heard Ron say, “Hagrid! What are you doing in the library?”  \n\nHagrid shuńed into view, hiding something behind his back. He looked very out of place in his moleskin overcoat.  \n\n“Jus’ lookin’,” he said, in a shifty voice that got their interest at once. “An’ what’re you lot up ter?” He looked suddenly suspicious. “Yer not still lookin’ fer Nicolas Flamel, are yeh?”  \n\n“Oh,  we  found  out  who  he  is  ages  ago,”  said  Ron impressively. “And we know what that dog’s guarding, it’s a Sorcerer’s St—”  \n\n“Shhhh!” Hagrid looked around quickly to see if anyone was listening. “Don’ go shoutin’ about it, what’s the matter with yeh?”  \n\n“There are a few things we wanted to ask you, as a matter of fact,” said Harry, “about what’s guarding the Stone apart from Fluŀy—”  \n\n“SHHHH!” said Hagrid again. “Listen—come an’ see me later, I’m not promisin’ I’ll tell yeh anythin’, mind, but don’ go rabbitin’ about it in here, students aren’ s’pposed ter know. They’ll think I’ve told yeh—”  \n\n“See you later, then,” said Harry.  \n\nHagrid shuńed oŀ.  \n\n“What was he hiding behind his back?” said Hermione thoughtfully.  \n\n“Do you think it had anything to do with the Stone?”  \n\n“I’m going to see what section he was in,” said Ron, who’d had enough of working. He came back a minute later with a pile of books in his arms and slammed them down on the table.  \n\n“Dragons!” he whispered. “Hagrid was looking up stuŀ about dragons! Look at these: Dragon Species of Great Britain and Ireland; From Egg to Inferno, A Dragon Keeper’s Guide.”  \n\n“Hagrid’s always wanted a dragon, he told me so the Łrst time I ever met him,” said Harry.  \n\n“But it’s against our laws,” said Ron. “Dragon breeding was outlawed by the Warlocks’ Convention of 1709, everyone knows that. It’s hard to stop Muggles from noticing us if we’re keeping dragons in the back garden—anyway, you can’t tame dragons, it’s dangerous. You should see the burns Charlie’s got oŀ wild ones in Romania.”  \n\n“But there aren’t wild dragons in Britain?” said Harry.  \n\n“Of course there are,” said Ron. “Common Welsh Green and Hebridean Blacks. The Ministry of Magic has a job hushing them up, I can tell you. Our kind have to keep putting spells on Muggles who’ve spotted them, to make them forget.”  \n\n“So what on earth’s Hagrid up to?” said Hermione.  \n\nWhen they knocked on the door of the gamekeeper’s hut an hour later, they were surprised to see that all the curtains were closed. Hagrid called “Who is it?” before he let them in, and then shut the door quickly behind them.  \n\nIt was stiłing hot inside. Even though it was such a warm day, there was a blazing Łre in the grate. Hagrid made them tea and oŀered them stoat sandwiches, which they refused.  \n\n“So—yeh wanted to ask me somethin’?”  \n\n“Yes,” said Harry. There was no point beating around the bush. “We were wondering if you could tell us what’s guarding the Sorcerer’s Stone apart from Fluŀy.”  \n\nHagrid frowned at him.  \n\n“O’ course I can’t,” he said. “Number one, I don’ know meself. Number two, yeh know too much",
    "chunk_order_index": 11,
    "full_doc_id": "doc-fd27b74a49b59e27362e816c90bdaae2"
  },
  "chunk-c4572996c09aeceab1dc23531416b732": {
    "tokens": 1200,
    "content": "them stoat sandwiches, which they refused.  \n\n“So—yeh wanted to ask me somethin’?”  \n\n“Yes,” said Harry. There was no point beating around the bush. “We were wondering if you could tell us what’s guarding the Sorcerer’s Stone apart from Fluŀy.”  \n\nHagrid frowned at him.  \n\n“O’ course I can’t,” he said. “Number one, I don’ know meself. Number two, yeh know too much already, so I wouldn’ tell yeh if I could. That Stone’s here fer a good reason. It was almost stolen outta Gringotts—I s’ppose yeh’ve worked that out an’ all? Beats me how yeh even know abou’ Fluŀy.”  \n\n“Oh, come on, Hagrid, you might not want to tell us, but you do know, you know everything that goes on round here,” said Hermione in a warm, łattering voice. Hagrid’s beard twitched and they could tell he was smiling. “We only wondered who had done the guarding, really.” Hermione went on. “We wondered who Dumbledore had trusted enough to help him, apart from you.”  \n\nHagrid’s chest swelled at these last words. Harry and Ron beamed at Hermione.  \n\n“Well, I don’ s’pose it could hurt ter tell yeh that...let’s see...he borrowed Fluŀy from me...then some o’ the teachers did enchantments...Professor  Sprout—Professor  Flitwick— Professor McGonagall—” he ticked them oŀ on his Łngers, “Professor Quirrell—an’ Dumbledore himself did somethin’, o’ course. Hang on, I’ve forgotten someone. Oh yeah, Professor Snape.”  \n\n“Snape?”  \n\n“Yeah—yer not still on abou’ that, are yeh? Look, Snape helped protect the Stone, he’s not about ter steal it.”  \n\nHarry knew Ron and Hermione were thinking the same as he was. If Snape had been in on protecting the Stone, it must have been easy to Łnd out how the other teachers had guarded it. He probably knew everything—except, it seemed, Quirrell’s spell and how to get past Fluŀy.  \n\n“You’re the only one who knows how to get past Fluŀy, aren’t you, Hagrid?” said Harry anxiously. “And you wouldn’t tell anyone, would you? Not even one of the teachers?”  \n\n“Not a soul knows except me an’ Dumbledore,” said Hagrid proudly.  \n\n“Well, that’s something,” Harry muttered to the others. “Hagrid, can we have a window open? I’m boiling.”  \n\n“Can’t, Harry, sorry,” said Hagrid. Harry noticed him glance at the Łre. Harry looked at it, too.  \n\n“Hagrid—what’s that?”  \n\nBut he already knew what it was. In the very heart of the Łre, underneath the kettle, was a huge, black egg.  \n\n“Ah,” said Hagrid, Łddling nervously with his beard, “That’s —er...”  \n\n“Where did you get it, Hagrid?” said Ron, crouching over the Łre to get a closer look at the egg. “It must’ve cost you a fortune.”  \n\n“Won it,” said Hagrid. “Las’ night. I was down in the village havin’ a few drinks an’ got into a game o’ cards with a stranger. Think he was quite glad ter get rid of it, ter be honest.”  \n\n“But what are you going to do with it when it’s hatched?” said Hermione.  \n\n“Well, I’ve bin doin’ some readin’,” said Hagrid, pulling a large book from under his pillow. “Got this outta the library— Dragon Breeding for Pleasure and ProŁt—it’s a bit outta date, o’ course, but it’s all in here. Keep the egg in the Łre, ’cause their mothers breathe on ’em, see, an’ when it hatches, feed it on a bucket o’ brandy mixed with chicken blood every half hour. An’ see here—how ter recognize diŀ’rent eggs—what I got there’s a Norwegian Ridgeback. They’re rare, them.”  \n\nHe looked very pleased with himself, but Hermione didn’t.  \n\n“Hagrid, you live in a wooden house,” she said.  \n\nBut Hagrid wasn’t listening. He was humming merrily as he stoked the Łre.  \n\nSo now they had something else to worry about: what might happen to Hagrid if anyone found out he was hiding an illegal dragon in his hut.  \n\n“Wonder what it’s like to have a peaceful life,” Ron sighed, as evening after evening they struggled through all the extra homework they were getting. Hermione had now started making study schedules for Harry and Ron, too. It was driving them nuts.  \n\nThen, one breakfast time, Hedwig brought Harry another note from Hagrid. He had written only two words: It’s hatching.  \n\nRon wanted to skip Herbology and go straight down to the hut. Hermione wouldn’t hear of it.  \n\n“Hermione, how many times in our lives are we going to see a dragon hatching?”  \n\n“We’ve got lessons, we’ll get into trouble, and that’s nothing to what Hagrid’s going to be in when someone Łnds out what he’s doing—”  \n\n“Shut up!” Harry whispered.  \n\nMalfoy was only a few feet away and he had stopped dead to listen. How much had he heard? Harry didn’t like the look on Malfoy’s face",
    "chunk_order_index": 12,
    "full_doc_id": "doc-fd27b74a49b59e27362e816c90bdaae2"
  },
  "chunk-a2670a7037317b4e593a408430bdebfb": {
    "tokens": 1200,
    "content": "ermione, how many times in our lives are we going to see a dragon hatching?”  \n\n“We’ve got lessons, we’ll get into trouble, and that’s nothing to what Hagrid’s going to be in when someone Łnds out what he’s doing—”  \n\n“Shut up!” Harry whispered.  \n\nMalfoy was only a few feet away and he had stopped dead to listen. How much had he heard? Harry didn’t like the look on Malfoy’s face at all.  \n\nRon and Hermione argued all the way to Herbology and in the end, Hermione agreed to run down to Hagrid’s with the other two during morning break. When the bell sounded from the castle at the end of their lesson, the three of them dropped their trowels at once and hurried through the grounds to the edge of the forest. Hagrid greeted them, looking łushed and excited.  \n\n“It’s nearly out.” He ushered them inside.  \n\nThe egg was lying on the table. There were deep cracks in it. Something was moving inside; a funny clicking noise was coming from it.  \n\nThey all drew their chairs up to the table and watched with bated breath.  \n\nAll at once there was a scraping noise and the egg split open. The baby dragon łopped onto the table. It wasn’t exactly pretty;  Harry  thought  it  looked  like  a  crumpled,  black umbrella. Its spiny wings were huge compared to its skinny jet body, it had a long snout with wide nostrils, the stubs of horns and bulging, orange eyes.  \n\nIt sneezed. A couple of sparks łew out of its snout.  \n\n“Isn’t he beautiful?” Hagrid murmured. He reached out a hand to stroke the dragon’s head. It snapped at his Łngers, showing pointed fangs.  \n\n“Bless him, look, he knows his mummy!” said Hagrid.  \n\n“Hagrid,”  said  Hermione,  “how  fast  do  Norwegian Ridgebacks grow, exactly?”  \n\nHagrid was about to answer when the color suddenly drained from his face—he leapt to his feet and ran to the window.  \n\n“What’s the matter?”  \n\n“Someone was lookin’ through the gap in the curtains—it’s a kid—he’s runnin’ back up ter the school.”  \n\nHarry bolted to the door and looked out. Even at a distance there was no mistaking him.  \n\nMalfoy had seen the dragon.  \n\nSomething about the smile lurking on Malfoy’s face during the next week made Harry, Ron, and Hermione very nervous. They spent most of their free time in Hagrid’s darkened hut, trying to reason with him.  \n\n“Just let him go,” Harry urged. “Set him free.”  \n\n“I can’t,” said Hagrid. “He’s too little. He’d die.”  \n\nThey looked at the dragon. It had grown three times in length in just a week. Smoke kept furling out of its nostrils. Hagrid hadn’t been doing his gamekeeping duties because the dragon was keeping him so busy. There were empty brandy bottles and chicken feathers all over the łoor.  \n\n“I’ve decided to call him Norbert,” said Hagrid, looking at the dragon with misty eyes. “He really knows me now, watch. Norbert! Norbert! Where’s Mummy?”  \n\n“He’s lost his marbles,” Ron muttered in Harry’s ear.  \n\n“Hagrid,” said Harry loudly, “give it two weeks and Norbert’s going to be as long as your house. Malfoy could go to  \n\nDumbledore at any moment.”  \n\nHagrid bit his lip.  \n\n“I—I know I can’t keep him forever, but I can’t jus’ dump him, I can’t.”  \n\nHarry suddenly turned to Ron.  \n\n“Charlie,” he said.  \n\n“You’re losing it, too,” said Ron. “I’m Ron, remember?”  \n\n“No—Charlie—your brother, Charlie. In Romania. Studying dragons. We could send Norbert to him. Charlie can take care of him and then put him back in the wild!”  \n\n“Brilliant!” said Ron. “How about it, Hagrid?”  \n\nAnd in the end, Hagrid agreed that they could send an owl to Charlie to ask him.  \n\nThe following week dragged by. Wednesday night found Hermione and Harry sitting alone in the common room, long after everyone else had gone to bed. The clock on the wall had just chimed midnight when the portrait hole burst open. Ron appeared out of nowhere as he pulled oŀ Harry’s Invisibility Cloak. He had been down at Hagrid’s hut, helping him feed Norbert, who was now eating dead rats by the crate.  \n\n“It bit me!” he said, showing them his hand, which was wrapped in a bloody handkerchief. “I’m not going to be able to hold a quill for a week. I tell you, that dragon’s the most horrible animal I’ve ever met, but the way Hagrid goes on about it, you’d think it was a łuŀy little bunny rabbit. When it bit me he told me oŀ for frightening it. And when I left, he was singing it a lullaby.”  \n\nThere was a tap on the dark window.  \n\n“It’s Hedwig!” said Harry, hurrying to let her in. “She’ll have Charlie’s answer!”  \n\nThe three of them put their heads together to read the note.  \n\nDear Ron,  \n\nHow are you? Thanks for the letter—I’d be glad to take the Norwegian Ridgeback, but it won’t be easy getting him here. I think the best thing will be to send him over with some friends",
    "chunk_order_index": 13,
    "full_doc_id": "doc-fd27b74a49b59e27362e816c90bdaae2"
  },
  "chunk-6c220d65f3f022a0a5e61a08d33c9f11": {
    "tokens": 1200,
    "content": "lullaby.”  \n\nThere was a tap on the dark window.  \n\n“It’s Hedwig!” said Harry, hurrying to let her in. “She’ll have Charlie’s answer!”  \n\nThe three of them put their heads together to read the note.  \n\nDear Ron,  \n\nHow are you? Thanks for the letter—I’d be glad to take the Norwegian Ridgeback, but it won’t be easy getting him here. I think the best thing will be to send him over with some friends of mine who are coming to visit me next week. Trouble is, they mustn’t be seen carrying an illegal dragon.  \n\nCould you get the Ridgeback up the tallest tower at midnight on Saturday? They can meet you there and take him away while it’s still dark.  \n\nSend me an answer as soon as possible.  \n\nLove, Charlie  \n\nThey looked at one another.  \n\n“We’ve got the Invisibility Cloak,” said Harry. “It shouldn’t be too diŃcult—I think the cloak’s big enough to cover two of us and Norbert.”  \n\nIt was a mark of how bad the last week had been that the other two agreed with him. Anything to get rid of Norbert— and Malfoy.  \n\nThere was a hitch. By the next morning, Ron’s bitten hand had swollen to twice its usual size. He didn’t know whether it was safe to go to Madam Pomfrey—would she recognize a dragon bite? By the afternoon, though, he had no choice. The cut had turned a nasty shade of green. It looked as if Norbert’s fangs were poisonous.  \n\nHarry and Hermione rushed up to the hospital wing at the end of the day to Łnd Ron in a terrible state in bed.  \n\n“It’s not just my hand,” he whispered, “although that feels like it’s about to fall oŀ. Malfoy told Madam Pomfrey he wanted to borrow one of my books so he could come and have a good laugh at me. He kept threatening to tell her what really bit me —I’ve told her it was a dog, but I don’t think she believes me—I shouldn’t have hit him at the Quidditch match, that’s why he’s doing this.”  \n\nHarry and Hermione tried to calm Ron down.  \n\n“It’ll all be over at midnight on Saturday,” said Hermione, but this didn’t soothe Ron at all. On the contrary, he sat bolt upright and broke into a sweat.  \n\n“Midnight on Saturday!” he said in a hoarse voice. “Oh no— oh no—I’ve just remembered—Charlie’s letter was in that book Malfoy took, he’s going to know we’re getting rid of Norbert.”  \n\nHarry and Hermione didn’t get a chance to answer. Madam Pomfrey came over at that moment and made them leave, saying Ron needed sleep.  \n\n“It’s too late to change the plan now,” Harry told Hermione. “We haven’t got time to send Charlie another owl, and this could be our only chance to get rid of Norbert. We’ll have to risk it. And we have got the Invisibility Cloak, Malfoy doesn’t know about that.”  \n\nThey found Fang the boarhound sitting outside with a bandaged tail when they went to tell Hagrid, who opened a window to talk to them.  \n\n“I won’t let you in,” he puŀed. “Norbert’s at a tricky stage— nothin’ I can’t handle.”  \n\nWhen they told him about Charlie’s letter, his eyes Łlled with tears, although that might have been because Norbert  \n\nhad just bitten him on the leg.  \n\n“Aargh! It’s all right, he only got my boot—jus’ playin’—he’s only a baby, after all.”  \n\nThe baby banged its tail on the wall, making the windows rattle. Harry and Hermione walked back to the castle feeling Saturday couldn’t come quickly enough.  \n\nThey would have felt sorry for Hagrid when the time came for him to say good-bye to Norbert if they hadn’t been so worried about what they had to do. It was a very dark, cloudy night, and they were a bit late arriving at Hagrid’s hut because they’d had to wait for Peeves to get out of their way in the entrance hall, where he’d been playing tennis against the wall.  \n\nHagrid had Norbert packed and ready in a large crate.  \n\n“He’s got lots o’ rats an’ some brandy fer the journey,” said Hagrid in a muńed voice. “An’ I’ve packed his teddy bear in case he gets lonely.”  \n\nFrom inside the crate came ripping noises that sounded to Harry as though the teddy was having his head torn oŀ.  \n\n“Bye-bye, Norbert!” Hagrid sobbed, as Harry and Hermione covered the crate with the Invisibility Cloak and stepped underneath it themselves. “Mummy will never forget you!”  \n\nHow they managed to get the crate back up to the castle, they never knew. Midnight ticked nearer as they heaved Norbert up the marble staircase in the entrance hall and along the dark corridors. Up another staircase, then another—even one of Harry’s shortcuts didn’t make the work much easier.  \n\n“Nearly there!” Harry panted as they reached the corridor beneath the tallest tower.  \n\nThen a sudden movement ahead of them made them almost drop the crate. Forgetting that they were already invisible, they shrank into the shadows, staring at the dark outlines of two people grappling with each other ten feet away. A lamp łared.  \n\nProfessor McGonagall, in a tartan bathrobe and a hair net, had Malfoy by the ear.  \n\n“Detention!”  she  shouted.  “And  twenty  points  from",
    "chunk_order_index": 14,
    "full_doc_id": "doc-fd27b74a49b59e27362e816c90bdaae2"
  },
  "chunk-22be29572ff332657be573ab4cadf0fe": {
    "tokens": 1200,
    "content": "tower.  \n\nThen a sudden movement ahead of them made them almost drop the crate. Forgetting that they were already invisible, they shrank into the shadows, staring at the dark outlines of two people grappling with each other ten feet away. A lamp łared.  \n\nProfessor McGonagall, in a tartan bathrobe and a hair net, had Malfoy by the ear.  \n\n“Detention!”  she  shouted.  “And  twenty  points  from Slytherin! Wandering around in the middle of the night, how dare you—”  \n\n“You don’t understand, Professor. Harry Potter’s coming— he’s got a dragon!”  \n\n“What utter rubbish! How dare you tell such lies! Come on— I shall see Professor Snape about you, Malfoy!”  \n\nThe steep spiral staircase up to the top of the tower seemed the easiest thing in the world after that. Not until they’d stepped out into the cold night air did they throw oŀ the Cloak, glad to be able to breathe properly again. Hermione did a sort of jig.  \n\n“Malfoy’s got detention! I could sing!”  \n\n“Don’t,” Harry advised her.  \n\nChuckling about Malfoy, they waited, Norbert thrashing about in his crate. About ten minutes later, four broomsticks came swooping down out of the darkness.  \n\nCharlie’s friends were a cheery lot. They showed Harry and Hermione the harness they’d rigged up, so they could suspend Norbert between them. They all helped buckle Norbert safely into it and then Harry and Hermione shook hands with the others and thanked them very much.  \n\nAt last, Norbert was going...going...gone.  \n\nThey slipped back down the spiral staircase, their hearts as light as their hands, now that Norbert was oŀ them. No more dragon—Malfoy  in  detention—what  could  spoil  their happiness?  \n\nThe answer to that was waiting at the foot of the stairs. As they stepped into the corridor, Filch’s face loomed suddenly out of the darkness.  \n\n“Well, well, well,” he whispered, “we are in trouble.”  \n\nThey’d left the Invisibility Cloak on top of the tower.  \n\n![](images/image_3.jpg)  \n\n# hings couldn’t have been worse.  \n\nFilch took them down to Professor McGonagall’s study on the Łrst łoor, where they sat and waited without saying a word to each other. Hermione was trembling. Excuses, alibis, and wild cover-up stories chased each other around Harry’s brain, each more feeble than the last. He couldn’t see how they were going to get out of trouble this time. They were cornered. How could they have been so stupid as to forget the Cloak?  There  was  no  reason  on  earth  that  Professor McGonagall would accept for their being out of bed and creeping around the school in the dead of night, let alone being up the tallest Astronomy Tower, which was out-ofbounds except for classes. Add Norbert and the Invisibility Cloak, and they might as well be packing their bags already.  \n\nHad Harry thought that things couldn’t have been worse? He was wrong. When Professor McGonagall appeared, she was leading Neville.  \n\n“Harry!” Neville burst out, the moment he saw the other two. “I was trying to Łnd you to warn you, I heard Malfoy saying he was going to catch you, he said you had a drag—”  \n\nHarry shook his head violently to shut Neville up, but Professor McGonagall had seen. She looked more likely to breathe Łre than Norbert as she towered over the three of them.  \n\n“I would never have believed it of any of you. Mr. Filch says you were up in the Astronomy Tower. It’s one o’clock in the morning. Explain yourselves.”  \n\nIt was the Łrst time Hermione had ever failed to answer a teacher’s question. She was staring at her slippers, as still as a statue.  \n\n“I think I’ve got a good idea of what’s been going on,” said Professor McGonagall. “It doesn’t take a genius to work it out.  \n\nYou fed Draco Malfoy some cock-and-bull story about a dragon, trying to get him out of bed and into trouble. I’ve already caught him. I suppose you think it’s funny that Longbottom here heard the story and believed it, too?”  \n\nHarry caught Neville’s eye and tried to tell him without words that this wasn’t true, because Neville was looking stunned and hurt. Poor, blundering Neville—Harry knew what it must have cost him to try and Łnd them in the dark, to warn them.  \n\n“I’m disgusted,” said Professor McGonagall. “Four students out of bed in one night! I’ve never heard of such a thing before! You, Miss Granger, I thought you had more sense. As for you, Mr. Potter, I thought GryŃndor meant more to you than this. All three of you will receive detentions—yes, you too, Mr. Longbottom, nothing gives you the right to walk around school at night, especially these days, it’s very dangerous—and Łfty points will be taken from GryŃndor.”  \n\n“Fifty?” Harry gasped—they would lose the lead, the lead he’d won in the last Quidditch match.  \n\n“Fifty points each,” said Professor McGonagall, breathing heavily through her long, pointed nose.  \n\n“Professor—please—” “You can’t—”  \n\n“Don’t tell me what I can and can’t do,",
    "chunk_order_index": 15,
    "full_doc_id": "doc-fd27b74a49b59e27362e816c90bdaae2"
  },
  "chunk-a8ab5279f35c97b91adf0037c23e3d8d": {
    "tokens": 1200,
    "content": ", especially these days, it’s very dangerous—and Łfty points will be taken from GryŃndor.”  \n\n“Fifty?” Harry gasped—they would lose the lead, the lead he’d won in the last Quidditch match.  \n\n“Fifty points each,” said Professor McGonagall, breathing heavily through her long, pointed nose.  \n\n“Professor—please—” “You can’t—”  \n\n“Don’t tell me what I can and can’t do, Potter. Now get back to bed, all of you. I’ve never been more ashamed of GryŃndor students.”  \n\nA hundred and Łfty points lost. That put GryŃndor in last place. In one night, they’d ruined any chance GryŃndor had had for the House Cup. Harry felt as though the bottom had dropped out of his stomach. How could they ever make up for this?  \n\nHarry didn’t sleep all night. He could hear Neville sobbing into his pillow for what seemed like hours. Harry couldn’t think of anything to say to comfort him. He knew Neville, like himself, was dreading the dawn. What would happen when the rest of GryŃndor found out what they’d done?  \n\nAt Łrst, GryŃndors passing the giant hourglasses that recorded the House points the next day thought there’d been a mistake. How could they suddenly have a hundred and Łfty points fewer than yesterday? And then the story started to spread: Harry Potter, the famous Harry Potter, their hero of two Quidditch matches, had lost them all those points, him and a couple of other stupid Łrst years.  \n\nFrom being one of the most popular and admired people at the  school,  Harry  was  suddenly  the  most  hated.  Even Ravenclaws and Huńepuŀs turned on him, because everyone had  been  longing  to  see  Slytherin  lose  the  House  Cup. Everywhere Harry went, people pointed and didn’t trouble to lower their voices as they insulted him. Slytherins, on the other hand, clapped as he walked past them, whistling and cheering, “Thanks Potter, we owe you one!”  \n\nOnly Ron stood by him.  \n\n“They’ll all forget this in a few weeks. Fred and George have lost loads of points in all the time they’ve been here, and people still like them.”  \n\n“They’ve never lost a hundred and Łfty points in one go, though, have they?” said Harry miserably.  \n\n“Well—no,” Ron admitted.  \n\nIt was a bit late to repair the damage, but Harry swore to himself not to meddle in things that weren’t his business from now on. He’d had it with sneaking around and spying. He felt so ashamed of himself that he went to Wood and oŀered to resign from the Quidditch team.  \n\n“Resign?” Wood thundered. “What good’ll that do? How are we going to get any points back if we can’t win at Quidditch?”  \n\nBut even Quidditch had lost its fun. The rest of the team wouldn’t speak to Harry during practice, and if they had to speak about him, they called him “the Seeker.”  \n\nHermione and Neville were suŀering, too. They didn’t have as bad a time as Harry, because they weren’t as well-known, but nobody would speak to them, either. Hermione had stopped drawing attention to herself in class, keeping her head down and working in silence.  \n\nHarry was almost glad that the exams weren’t far away. All the studying he had to do kept his mind oŀ his misery. He, Ron, and Hermione kept to themselves, working late into the night, trying to remember the ingredients in complicated potions, learn charms and spells by heart, memorize the dates of magical discoveries and goblin rebellions....  \n\nThen, about a week before the exams were due to start, Harry’s new resolution not to interfere in anything that didn’t concern him was put to an unexpected test. Walking back from  the  library  on  his  own  one  afternoon,  he  heard somebody whimpering from a classroom up ahead. As he drew closer, he heard Quirrell’s voice.  \n\n“No—no—not again, please—”  \n\nIt sounded as though someone was threatening him. Harry moved closer.  \n\n“All right—all right—” he heard Quirrell sob.  \n\nNext second, Quirrell came hurrying out of the classroom straightening his turban. He was pale and looked as though he was about to cry. He strode out of sight; Harry didn’t think Quirrell had even noticed him. He waited until Quirrell’s footsteps had disappeared, then peered into the classroom. It was empty, but a door stood ajar at the other end. Harry was halfway toward it before he remembered what he’d promised himself about not meddling.  \n\nAll the same, he’d have gambled twelve Sorcerer’s Stones that Snape had just left the room, and from what Harry had just heard, Snape would be walking with a new spring in his step—Quirrell seemed to have given in at last.  \n\nHarry went back to the library, where Hermione was testing Ron on Astronomy. Harry told them what he’d heard.  \n\n“Snape’s done it, then!” said Ron. “If Quirrell’s told him how to break his Anti-Dark Force spell—”  \n\n“There’s still Fluŀy, though,” said Hermione.  \n\n“Maybe Snape’s found out how to get past him without asking Hagrid,” said Ron, looking up at the thousands of books surrounding them. “I bet there",
    "chunk_order_index": 16,
    "full_doc_id": "doc-fd27b74a49b59e27362e816c90bdaae2"
  },
  "chunk-2f091ce5f47281e4262e40ed41d5f273": {
    "tokens": 1200,
    "content": "the library, where Hermione was testing Ron on Astronomy. Harry told them what he’d heard.  \n\n“Snape’s done it, then!” said Ron. “If Quirrell’s told him how to break his Anti-Dark Force spell—”  \n\n“There’s still Fluŀy, though,” said Hermione.  \n\n“Maybe Snape’s found out how to get past him without asking Hagrid,” said Ron, looking up at the thousands of books surrounding them. “I bet there’s a book somewhere in here telling you how to get past a giant three-headed dog. So what do we do, Harry?”  \n\nThe light of adventure was kindling again in Ron’s eyes, but Hermione answered before Harry could.  \n\n“Go to Dumbledore. That’s what we should have done ages ago. If we try anything ourselves we’ll be thrown out for sure.”  \n\n“But we’ve got no proof!” said Harry. “Quirrell’s too scared to back us up. Snape’s only got to say he doesn’t know how the troll got in at Halloween and that he was nowhere near the third łoor—who do you think they’ll believe, him or us? It’s not exactly a secret we hate him, Dumbledore’ll think we made it up to get him sacked. Filch wouldn’t help us if his life depended on it, he’s too friendly with Snape, and the more students get thrown out, the better, he’ll think. And don’t forget, we’re not supposed to know about the Stone or Fluŀy. That’ll take a lot of explaining.”  \n\nHermione looked convinced, but Ron didn’t.  \n\n“If we just do a bit of poking around—”  \n\n“No,” said Harry łatly, “we’ve done enough poking around.”  \n\nHe pulled a map of Jupiter toward him and started to learn the names of its moons.  \n\nThe  following  morning,  notes  were  delivered  to  Harry, Hermione, and Neville at the breakfast table. They were all the same:  \n\nYour detention will take place at eleven o’clock tonight.  \n\nMeet Mr. Filch in the entrance hall.  \n\nProfessor M. McGonagall  \n\nHarry had forgotten they still had detentions to do in the furor over the points they’d lost. He half expected Hermione to complain that this was a whole night of studying lost, but she didn’t say a word. Like Harry, she felt they deserved what they’d got.  \n\nAt eleven o’clock that night, they said good-bye to Ron in the common room and went down to the entrance hall with Neville. Filch was already there—and so was Malfoy. Harry had also forgotten that Malfoy had gotten a detention, too.  \n\n“Follow me,” said Filch, lighting a lamp and leading them outside.  \n\n“I bet you’ll think twice about breaking a school rule again, won’t you, eh?” he said, leering at them. “Oh yes...hard work and pain are the best teachers if you ask me....It’s just a pity they let the old punishments die out...hang you by your wrists from the ceiling for a few days, I’ve got the chains still in my oŃce, keep ’em well oiled in case they’re ever needed....Right, oŀ we go, and don’t think of running oŀ, now, it’ll be worse for you if you do.”  \n\nThey marched oŀ across the dark grounds. Neville kept sniŃng. Harry wondered what their punishment was going to be. It must be something really horrible, or Filch wouldn’t be sounding so delighted.  \n\nThe moon was bright, but clouds scudding across it kept throwing them into darkness. Ahead, Harry could see the lighted windows of Hagrid’s hut. Then they heard a distant shout.  \n\n“Is that you, Filch? Hurry up, I want ter get started.”  \n\nHarry’s heart rose; if they were going to be working with Hagrid it wouldn’t be so bad. His relief must have showed in his face, because Filch said, “I suppose you think you’ll be enjoying yourself with that oaf? Well, think again, boy—it’s into the forest you’re going and I’m much mistaken if you’ll all come out in one piece.”  \n\nAt this, Neville let out a little moan, and Malfoy stopped dead in his tracks.  \n\n“The forest?” he repeated, and he didn’t sound quite as cool as usual. “We can’t go in there at night—there’s all sorts of things in there—werewolves, I heard.”  \n\nNeville clutched the sleeve of Harry’s robe and made a choking noise.  \n\n“That’s your problem, isn’t it?” said Filch, his voice cracking with glee. “Should’ve thought of them werewolves before you got in trouble, shouldn’t you?”  \n\nHagrid came striding toward them out of the dark, Fang at his heel. He was carrying his large crossbow, and a quiver of arrows hung over his shoulder.  \n\n“Abou’ time,” he said. “I bin waitin’ fer half an hour already. All right, Harry, Hermione?”  \n\n“I shouldn’t be too friendly to them, Hagrid,” said Filch coldly, “they’re here to be punished, after all.”  \n\n“That’s why yer late, is it?” said Hagrid, frowning at Filch. “Bin lecturin’ them, eh? ’Snot your place ter do that. Yeh’ve done yer bit, I’ll take over from here.”  \n\n“I’ll be back at dawn,” said Filch, “for what’s left of them,” he added nastily, and he turned and started back toward the",
    "chunk_order_index": 17,
    "full_doc_id": "doc-fd27b74a49b59e27362e816c90bdaae2"
  },
  "chunk-34e072efe83e2233fc63cc55bfecdef3": {
    "tokens": 1200,
    "content": "Filch coldly, “they’re here to be punished, after all.”  \n\n“That’s why yer late, is it?” said Hagrid, frowning at Filch. “Bin lecturin’ them, eh? ’Snot your place ter do that. Yeh’ve done yer bit, I’ll take over from here.”  \n\n“I’ll be back at dawn,” said Filch, “for what’s left of them,” he added nastily, and he turned and started back toward the castle, his lamp bobbing away in the darkness.  \n\nMalfoy now turned to Hagrid.  \n\n“I’m not going in that forest,” he said, and Harry was pleased to hear the note of panic in his voice.  \n\n“Yeh are if yeh want ter stay at Hogwarts,” said Hagrid Łercely. “Yeh’ve done wrong an’ now yeh’ve got ter pay fer it.”  \n\n“But this is servant stuŀ, it’s not for students to do. I thought we’d be copying lines or something, if my father knew I was doing this, he’d—”  \n\n“—tell yer that’s how it is at Hogwarts,” Hagrid growled. “Copyin’ lines! What good’s that ter anyone? Yeh’ll do summat useful or yeh’ll get out. If yeh think yer father’d rather you were expelled, then get back oŀ ter the castle an’ pack. Go on!”  \n\nMalfoy didn’t move. He looked at Hagrid furiously, but then dropped his gaze.  \n\n“Right then,” said Hagrid, “now, listen carefully, ’cause it’s dangerous what we’re gonna do tonight, an’ I don’ want no one takin’ risks. Follow me over here a moment.”  \n\nHe led them to the very edge of the forest. Holding his lamp up high, he pointed down a narrow, winding earth track that disappeared into the thick black trees. A light breeze lifted their hair as they looked into the forest.  \n\n“Look there,” said Hagrid, “see that stuŀ shinin’ on the ground? Silvery stuŀ? That’s unicorn blood. There’s a unicorn in there bin hurt badly by summat. This is the second time in a week. I found one dead last Wednesday. We’re gonna try an’ Łnd the poor thing. We might have ter put it out of its misery.”  \n\n“And what if whatever hurt the unicorn Łnds us Łrst?” said Malfoy, unable to keep the fear out of his voice.  \n\n“There’s nothin’ that lives in the forest that’ll hurt yeh if yer with me or Fang,” said Hagrid. “An’ keep ter the path. Right, now, we’re gonna split inter two parties an’ follow the trail in diŀ’rent directions. There’s blood all over the place, it must’ve bin staggerin’ around since last night at least.”  \n\n“I want Fang,” said Malfoy quickly, looking at Fang’s long teeth.  \n\n“All right, but I warn yeh, he’s a coward,” said Hagrid. “So me, Harry, an’ Hermione’ll go one way an’ Draco, Neville, an’ Fang’ll go the other. Now, if any of us Łnds the unicorn, we’ll send up green sparks, right? Get yer wands out an’ practice now—that’s it—an’ if anyone gets in trouble, send up red sparks, an’ we’ll all come an’ Łnd yeh—so, be careful—let’s go.”  \n\nThe forest was black and silent. A little way into it they reached a fork in the earth path, and Harry, Hermione, and Hagrid took the left path while Malfoy, Neville, and Fang took the right.  \n\nThey walked in silence, their eyes on the ground. Every now and then a ray of moonlight through the branches above lit a spot of silver-blue blood on the fallen leaves.  \n\nHarry saw that Hagrid looked very worried.  \n\n“Could a werewolf be killing the unicorns?” Harry asked.  \n\n“Not fast enough,” said Hagrid. “It’s not easy ter catch a unicorn, they’re powerful magic creatures. I never knew one ter be hurt before.”  \n\nThey walked past a mossy tree stump. Harry could hear running water; there must be a stream somewhere close by.  \n\nThere were still spots of unicorn blood here and there along the winding path.  \n\n“You all right, Hermione?” Hagrid whispered. “Don’ worry, it can’t’ve gone far if it’s this badly hurt, an’ then we’ll be able ter—GET BEHIND THAT TREE!”  \n\nHagrid seized Harry and Hermione and hoisted them oŀ the path behind a towering oak. He pulled out an arrow and Łtted it into his crossbow, raising it, ready to Łre. The three of them listened. Something was slithering over dead leaves nearby: it sounded like a cloak trailing along the ground. Hagrid was squinting up the dark path, but after a few seconds, the sound faded away.  \n\n“I knew it,” he murmured. “There’s summat in here that shouldn’ be.”  \n\n“A werewolf?” Harry suggested.  \n\n“That wasn’ no werewolf an’ it wasn’ no unicorn, neither,” said Hagrid grimly. “Right, follow me, but careful, now.”  \n\nThey walked more slowly, ears straining for the faintest sound. Suddenly, in a clearing ahead, something deŁnitely moved.  \n\n“Who’s there?” Hagrid called. “Show yerself—I’m armed!”  \n\nAnd into the clearing came—was it a man, or a horse? To the waist, a man, with red hair",
    "chunk_order_index": 18,
    "full_doc_id": "doc-fd27b74a49b59e27362e816c90bdaae2"
  },
  "chunk-92a7024dc7847f2109dfb0f0a951c822": {
    "tokens": 1200,
    "content": "’ it wasn’ no unicorn, neither,” said Hagrid grimly. “Right, follow me, but careful, now.”  \n\nThey walked more slowly, ears straining for the faintest sound. Suddenly, in a clearing ahead, something deŁnitely moved.  \n\n“Who’s there?” Hagrid called. “Show yerself—I’m armed!”  \n\nAnd into the clearing came—was it a man, or a horse? To the waist, a man, with red hair and beard, but below that was a  \n\nhorse’s gleaming chestnut body with a long, reddish tail.   \nHarry and Hermione’s jaws dropped.  \n\n“Oh, it’s you, Ronan,” said Hagrid in relief. “How are yeh?” He walked forward and shook the centaur’s hand.  \n\n“Good evening to you, Hagrid,” said Ronan. He had a deep, sorrowful voice. “Were you going to shoot me?”  \n\n“Can’t be too careful, Ronan,” said Hagrid, patting his crossbow. “There’s summat bad loose in this forest. This is Harry Potter an’ Hermione Granger, by the way. Students up at the school. An’ this is Ronan, you two. He’s a centaur.”  \n\n“We’d noticed,” said Hermione faintly.  \n\n“Good evening,” said Ronan. “Students, are you? And do you learn much, up at the school?”  \n\n“Erm—”  \n\n“A bit,” said Hermione timidly.  \n\n“A bit. Well, that’s something.” Ronan sighed. He łung back his head and stared at the sky. “Mars is bright tonight.”  \n\n“Yeah,” said Hagrid, glancing up, too. “Listen, I’m glad we’ve run inter yeh, Ronan, ’cause there’s a unicorn bin hurt—you seen anythin’?”  \n\nRonan didn’t answer immediately. He stared unblinkingly upward, then sighed again.  \n\n“Always the innocent are the Łrst victims,” he said. “So it has been for ages past, so it is now.”  \n\n“Yeah,” said Hagrid, “but have yeh seen anythin’, Ronan? Anythin’ unusual?”  \n\n“Mars is bright tonight,” Ronan repeated, while Hagrid watched him impatiently. “Unusually bright.”  \n\n“Yeah, but I was meanin’ anythin’ unusual a bit nearer home,” said Hagrid. “So yeh haven’t noticed anythin’ strange?”  \n\nYet again, Ronan took a while to answer. At last, he said, “The forest hides many secrets.”  \n\nA movement in the trees behind Ronan made Hagrid raise his bow again, but it was only a second centaur, black-haired and -bodied and wilder-looking than Ronan.  \n\n“Hullo, Bane,” said Hagrid. “All right?”  \n\n“Good evening, Hagrid, I hope you are well?”  \n\n“Well enough. Look, I’ve jus’ bin askin’ Ronan, you seen anythin’ odd in here lately? There’s a unicorn bin injured— would yeh know anythin’ about it?”  \n\nBane walked over to stand next to Ronan. He looked skyward.  \n\n“Mars is bright tonight,” he said simply.  \n\n“We’ve heard,” said Hagrid grumpily. “Well, if either of you do see anythin’, let me know, won’t yeh? We’ll be oŀ, then.”  \n\nHarry and Hermione followed him out of the clearing, staring over their shoulders at Ronan and Bane until the trees blocked their view.  \n\n“Never,” said Hagrid irritably, “try an’ get a straight answer out of a centaur. Ruddy stargazers. Not interested in anythin’ closer’n the moon.”  \n\n“Are there many of them in here?” asked Hermione.  \n\n“Oh, a fair few....Keep themselves to themselves mostly, but they’re good enough about turnin’ up if ever I want a word. They’re deep, mind, centaurs...they know things...jus’ don’ let on much.”  \n\n“D’you think that was a centaur we heard earlier?” said Harry.  \n\n“Did that sound like hooves to you? Nah, if yeh ask me, that was what’s bin killin’ the unicorns—never heard anythin’ like it before.”  \n\nThey walked on through the dense, dark trees. Harry kept looking nervously over his shoulder. He had the nasty feeling they were being watched. He was very glad they had Hagrid and his crossbow with them. They had just passed a bend in the path when Hermione grabbed Hagrid’s arm.  \n\n“Hagrid! Look! Red sparks, the others are in trouble!”  \n\n“You two wait here!” Hagrid shouted. “Stay on the path, I’ll come back for yeh!”  \n\nThey heard him crashing away through the undergrowth and stood looking at each other, very scared, until they couldn’t hear anything but the rustling of leaves around them.  \n\n“You don’t think they’ve been hurt, do you?” whispered Hermione.  \n\n“I don’t care if Malfoy has, but if something’s got Neville...it’s our fault he’s here in the Łrst place.”  \n\nThe minutes dragged by. Their ears seemed sharper than usual. Harry’s seemed to be picking up every sigh of the wind, every cracking twig. What was going on? Where were the others?  \n\nAt last, a great crunching noise announced Hagrid’s return. Malfoy, Neville, and Fang were with him. Hagrid was fuming. Malfoy, it seemed, had sneaked up behind Neville and grabbed him as a joke. Neville had pan",
    "chunk_order_index": 19,
    "full_doc_id": "doc-fd27b74a49b59e27362e816c90bdaae2"
  },
  "chunk-1bfb383df7e18f3feaa91fbf1511fba4": {
    "tokens": 1200,
    "content": "Łrst place.”  \n\nThe minutes dragged by. Their ears seemed sharper than usual. Harry’s seemed to be picking up every sigh of the wind, every cracking twig. What was going on? Where were the others?  \n\nAt last, a great crunching noise announced Hagrid’s return. Malfoy, Neville, and Fang were with him. Hagrid was fuming. Malfoy, it seemed, had sneaked up behind Neville and grabbed him as a joke. Neville had panicked and sent up the sparks.  \n\n“We’ll be lucky ter catch anythin’ now, with the racket you two were makin’. Right, we’re changin’ groups—Neville, you stay with me an’ Hermione, Harry, you go with Fang an’ this idiot. I’m sorry,” Hagrid added in a whisper to Harry, “but he’ll have a harder time frightenin’ you, an’ we’ve gotta get this done.”  \n\nSo Harry set oŀ into the heart of the forest with Malfoy and Fang. They walked for nearly half an hour, deeper and deeper into the forest, until the path became almost impossible to follow because the trees were so thick. Harry thought the blood seemed to be getting thicker. There were splashes on the roots of a tree, as though the poor creature had been thrashing around in pain close by. Harry could see a clearing ahead, through the tangled branches of an ancient oak.  \n\n“Look—” he murmured, holding out his arm to stop Malfoy.  \n\nSomething bright white was gleaming on the ground. They inched closer.  \n\nIt was the unicorn all right, and it was dead. Harry had never seen anything so beautiful and sad. Its long, slender legs were stuck out at odd angles where it had fallen and its mane was spread pearly-white on the dark leaves.  \n\nHarry had taken one step toward it when a slithering sound made him freeze where he stood. A bush on the edge of the clearing quivered....Then, out of the shadows, a hooded Łgure came crawling across the ground like some stalking beast. Harry, Malfoy, and Fang stood transŁxed. The cloaked Łgure reached the unicorn, lowered its head over the wound in the animal’s side, and began to drink its blood.  \n\n“AAAAAAAAAAARGH!”  \n\nMalfoy let out a terrible scream and bolted—so did Fang. The hooded Łgure raised its head and looked right at Harry— unicorn blood was dribbling down its front. It got to its feet and came swiftly toward Harry—he couldn’t move for fear.  \n\nThen a pain like he’d never felt before pierced his head; it was as though his scar were on Łre. Half blinded, he staggered backward.  He  heard  hooves  behind  him,  galloping,  and something jumped clean over Harry, charging at the Łgure.  \n\nThe pain in Harry’s head was so bad he fell to his knees. It took a minute or two to pass. When he looked up, the Łgure had gone. A centaur was standing over him, not Ronan or Bane; this one looked younger; he had white-blond hair and a palomino body.  \n\n“Are you all right?” said the centaur, pulling Harry to his feet.  \n\n“Yes—thank you—what was that?”  \n\nThe centaur didn’t answer. He had astonishingly blue eyes, like pale sapphires. He looked carefully at Harry, his eyes lingering on the scar that stood out, livid, on Harry’s forehead.  \n\n“You are the Potter boy,” he said. “You had better get back to Hagrid. The forest is not safe at this time—especially for you. Can you ride? It will be quicker this way.  \n\n“My name is Firenze,” he added, as he lowered himself on to his front legs so that Harry could clamber onto his back.  \n\nThere was suddenly a sound of more galloping from the other side of the clearing. Ronan and Bane came bursting through the trees, their łanks heaving and sweaty.  \n\n“Firenze!” Bane thundered. “What are you doing? You have a human on your back! Have you no shame? Are you a common mule?”  \n\n“Do you realize who this is?” said Firenze. “This is the Potter boy. The quicker he leaves this forest, the better.”  \n\n“What  have  you  been  telling  him?”  growled  Bane. “Remember, Firenze, we are sworn not to set ourselves against the heavens. Have we not read what is to come in the movements of the planets?”  \n\nRonan pawed the ground nervously. “I’m sure Firenze thought he was acting for the best,” he said in his gloomy voice.  \n\nBane kicked his back legs in anger.  \n\n“For the best! What is that to do with us? Centaurs are concerned with what has been foretold! It is not our business to run around like donkeys after stray humans in our forest!”  \n\nFirenze suddenly reared on to his hind legs in anger, so that Harry had to grab his shoulders to stay on.  \n\n“Do you not see that unicorn?” Firenze bellowed at Bane. “Do you not understand why it was killed? Or have the planets not let you in on that secret? I set myself against what is lurking in this forest, Bane, yes, with humans alongside me if I must.”  \n\nAnd Firenze whisked around; with Harry clutching on as best he could, they plunged oŀ into the trees, leaving Ronan and Bane behind them.  \n\nHarry didn’t have a clue what was going on.  \n\n“Why’s B",
    "chunk_order_index": 20,
    "full_doc_id": "doc-fd27b74a49b59e27362e816c90bdaae2"
  },
  "chunk-ad5c34e3bce6b11aafe596239c811968": {
    "tokens": 824,
    "content": "ane. “Do you not understand why it was killed? Or have the planets not let you in on that secret? I set myself against what is lurking in this forest, Bane, yes, with humans alongside me if I must.”  \n\nAnd Firenze whisked around; with Harry clutching on as best he could, they plunged oŀ into the trees, leaving Ronan and Bane behind them.  \n\nHarry didn’t have a clue what was going on.  \n\n“Why’s Bane so angry?” he asked. “What was that thing you saved me from, anyway?”  \n\nFirenze slowed to a walk, warned Harry to keep his head bowed in case of low-hanging branches, but did not answer Harry’s question. They made their way through the trees in silence for so long that Harry thought Firenze didn’t want to talk  to  him  anymore.  They  were  passing  through  a particularly dense patch of trees, however, when Firenze suddenly stopped.  \n\n“Harry Potter, do you know what unicorn blood is used for?”  \n\n“No,” said Harry, startled by the odd question. “We’ve only used the horn and tail hair in Potions.”  \n\n“That is because it is a monstrous thing, to slay a unicorn,” said  Firenze.  “Only  one  who  has  nothing  to  lose,  and everything to gain, would commit such a crime. The blood of a unicorn will keep you alive, even if you are an inch from death, but at a terrible price. You have slain something pure and defenseless to save yourself, and you will have but a halflife, a cursed life, from the moment the blood touches your lips.”  \n\nHarry stared at the back of Firenze’s head, which was dappled silver in the moonlight.  \n\n“But who’d be that desperate?” he wondered aloud. “If you’re going to be cursed forever, death’s better, isn’t it?”  \n\n“It is,” Firenze agreed, “unless all you need is to stay alive long enough to drink something else—something that will bring you back to full strength and power—something that will mean you can never die. Mr. Potter, do you know what is hidden in the school at this very moment?”  \n\n“The Sorcerer’s Stone! Of course—the Elixir of Life! But I don’t understand who—”  \n\n“Can you think of nobody who has waited many years to return to power, who has clung to life, awaiting their chance?”  \n\nIt was as though an iron Łst had clenched suddenly around Harry’s heart. Over the rustling of the trees, he seemed to hear once more what Hagrid had told him on the night they had met: “Some say he died. Codswallop, in my opinion. Dunno if he had enough human left in him to die.”  \n\n“Do you mean,” Harry croaked, “that was Vol—”  \n\n“Harry! Harry, are you all right?”  \n\nHermione was running toward them down the path, Hagrid puŃng along behind her.  \n\n“I’m Łne,” said Harry, hardly knowing what he was saying. “The unicorn’s dead, Hagrid, it’s in that clearing back there.”  \n\n“This is where I leave you,” Firenze murmured as Hagrid hurried oŀ to examine the unicorn. “You are safe now.”  \n\nHarry slid oŀ his back.  \n\n“Good luck, Harry Potter,” said Firenze. “The planets have been read wrongly before now, even by centaurs. I hope this is one of those times.”  \n\nHe turned and cantered back into the depths of the forest, leaving Harry shivering behind him.  \n\nRon had fallen asleep in the dark common room, waiting for them to return. He shouted something about Quidditch fouls when Harry roughly shook him awake. In a matter of seconds, though, he was wide-eyed as Harry began to tell him and Hermione what had happened in the forest.",
    "chunk_order_index": 21,
    "full_doc_id": "doc-fd27b74a49b59e27362e816c90bdaae2"
  }
}