{
    "image_1": [
        {
            "merged_entity_name": "Mustard",
            "entity_type": "Condiment",
            "description": "Mustard is a yellow condiment used in various French dishes, including steak frites and grilled sausages, and is considered indispensable in French cuisine. Its scarcity has caused a national debate and emotional response in France, as highlighted by the article discussing the cultural impact of mustard in the country.",
            "source_image_entities": [
                "MUSTARD"
            ],
            "source_text_entities": [
                "MUSTARD"
            ]
        }
    ],
    "image_2": [
        {
            "entity_name": "ROTUNDA",
            "entity_type": "GEO",
            "description": "The interior of a building with high ceilings and marble floors, likely a government building, as described in the context of the U.S. Capitol where Hershel Williams lay in honor.",
            "source_image_entities": [
                "ROTUNDA"
            ],
            "source_text_entities": [
                "U.S. CAPITOL"
            ]
        }
    ],
    "image_3": [
    ],
    "image_4": [
        {
            "merged_entity_name": "Ivana Trump",
            "entity_type": "PERSON",
            "description": "Ivana Trump was the former wife of Donald J. Trump, a Czech American businesswoman, and part of the 1980s New York power couple. She passed away at the age of 73.",
            "source_image_entities": [
                "WOMAN"
            ],
            "source_text_entities": [
                "IVANA TRUMP"
            ]
        },
        {
            "merged_entity_name": "Donald J. Trump",
            "entity_type": "PERSON",
            "description": "Donald J. Trump is the former president and part of the 1980s New York power couple with Ivana Trump. He announced Ivana Trump's death.",
            "source_image_entities": [
                "MAN"
            ],
            "source_text_entities": [
                "DONALD J. TRUMP"
            ]
        }
    ],
    "image_5": [
        {
            "merged_entity_name": "MARIO DRAGHI",
            "entity_type": "PERSON",
            "description": "Mario Draghi, the Prime Minister of Italy, is a man dressed in a dark suit and blue tie, seated on an ornate golden chair with a red upholstered background, appearing to be in a formal setting such as a parliament or legislative assembly. He recently offered to quit but had his resignation refused by the country's president, leaving Italy in political limbo.",
            "source_image_entities": [
                "MARIO DRAGHI"
            ],
            "source_text_entities": [
                "MARIO DRAGHI"
            ]
        }
    ],
    "image_6": [
    ]
}