{
  "chunk-4b770140e5e5e4132d8f615c50bfe737": {
    "tokens": 1200,
    "content": "# Che Neu Jork Cimes  \n\n# VOL. CLXXI . . . No. 59,485  \n\n© 2022  The New York Times Company  \n\nNEW YORK, FRIDAY, JULY 15, 2022  \n\n# Steak Frites Without Mustard? France Shudders as Jars Vanish.  \n\nThe facts became clearer on Wednesday, when The Columbus Dispatch reported that a man in Ohio had been arraigned in the rape.  \n\n# In Rape Case, Politics Raced Ahead of News  \n\n10-Year-Old’s Abortion Spurs Heated Debate  \n\nThe  Indianapolis  Star  first brought the case to the public’s attention in an article on July 1 that examined restrictions on abortion in the wake of the Supreme Court decision. The article referred to a case of Dr. Caitlin Bernard’s. Dr. Bernard, an Indianapolis obstetrician-gynecologist, treated a 10- year-old rape victim from Ohio who had traveled to Indiana for abortion care because she was past the newly imposed six-week abortion limit in her home state  \n\nA Fox News spokeswoman declined to comment on statements from Mr. Watters or other hosts, but pointed to reporting by the network on Tuesday that corroborated the case. A Wall Street Journal spokeswoman did not reply to requests for comment.  \n\n“It was extreme enough that the questions about it were logical questions  to  ask,”  said  Kelly McBride, a media ethics expert at the Poynter Institute. But, she added, journalists needed to do the reporting to answer questions and “not just put more opinions out without any more additional facts.”  \n\nFor nearly two weeks, the story of a 10-year-old Ohio girl who was raped and crossed state lines to get an abortion became a flash point in the national abortion debate. President Biden and other Democrats argued that it showed the harm resulting from the Supreme Court’s overturning of Roe v. Wade.  \n\nPARIS — Mustard runs deep in French culture. “My blood is boil$\\mathrm{ing^{,*}}$ is rendered in French by the expression “la moutarde me monte au nez,” or “the mustard is rising  into  my  nose”  —  and  as Bastille Day testifies, when that happens in France, the effect can be devastating.  \n\nBut by then, the debate over the case had placed mainstream publications  in  an  uncomfortable bind. A politicized narrative had evolved  faster  than  reporters could  accumulate  information, and was fueling its own news cycle outside the facts.  \n\nBut the facts were sparse, with reporters struggling to confirm a report in The Indianapolis Star that relied on a single named source.  \n\nConservative media questioned whether the girl existed. Jesse Watters, a host on Fox News, suggested that the story could be a “hoax”  meant  to  buttress  the abortion-rights position. The Wall Street Journal published an editorial on Tuesday with the headline: “An Abortion Story Too Good to Confirm.”  \n\nPeople on the left were quick to jump on and criticize any media report that noted how little was known about the girl and the circumstances of the crime. On Saturday, Glenn Kessler, a reporter at The Washington Post, wrote that he had been unable to confirm any of the details. “This is a very difficult story to check,” he wrote, a conclusion that led to a flurry of angry comments on The Post’s website. The case became an example of how, with a highly partisan issue, a single article can become the focus of a heated debate.  \n\nAs France marked its most important national holiday on Thursday, commemorating the storm  \n\n# By KATIE ROBERTSON  \n\nContinued on Page A13  \n\n# By ROGER COHEN  \n\n![](images/image_1.jpg)  \n\nA growing number of metro areas that once took housing affordability for granted faced shortages heading into the pandemic. By 2019, they lacked enough housing to meet demand, according to a new analysis.  \n\n# Shortages vs. Surpluses  \n\n# A Hero’s Farewell  \n\nHershel Williams, known as Woody, the last surviving Medal of Honor recipient from World War II, lay in honor at the U.S. Capitol on Thursday. As a 21-year-old Marine, he braved machine-gun fire to break through the Japanese defenses on Iwo Jima. He was 98.  \n\n# Across U.S., It’s Getting Harder to Find a Home  \n\nSan  Francisco,  Los  Angeles, New York and Washington have long failed to build enough housing to keep up with everyone trying to live there. And for nearly as long, other parts of the country have mostly been able to shrug off the housing shortage as a condition particular to big coastal cities. But in the years leading up to the pandemic, that condition advanced  around  the  country: Springfield, Mo., stopped having enough housing. And the same  \n\n![](images/image_2.jpg)  \n\n![](images/image_3.jpg)  \nNote: Shortage percentages reflect estimated housing units needed to meet demand, as a share of existing housing units. Source: Up for Growth analysis of U.S. Census Bureau and U.S. Department of Housing and Urban Development data.  \n\n# By EMILY BADGER and EVE WASHINGTON  \n\n# Soaring Prices Threaten Further Disruption to the Economy  \n\nwith Appleton, Wis., and Naples, Fla.  \n\nWhat once seemed a blue-state coastal problem has increasingly become a national one, with consequences for the quality of life of American families, the health of the national economy and the politics of housing construction.  \n\nToday more families in the middle of America who could once count on becoming homeowners can’t be so confident anymore. And communities that long relied on  their  relatively  affordable housing to draw new residents can no longer be so sure of that advantage",
    "chunk_order_index": 0,
    "full_doc_id": "doc-037bd216cd45a4f5233a69164993eea9"
  },
  "chunk-26e7ad5afcf5b527fe1cf0cb87e9c48a": {
    "tokens": 1200,
    "content": "with Appleton, Wis., and Naples, Fla.  \n\nWhat once seemed a blue-state coastal problem has increasingly become a national one, with consequences for the quality of life of American families, the health of the national economy and the politics of housing construction.  \n\nToday more families in the middle of America who could once count on becoming homeowners can’t be so confident anymore. And communities that long relied on  their  relatively  affordable housing to draw new residents can no longer be so sure of that advantage.  \n\n“It’s like the cancer was limited to certain parts of our economic body,” said Sam Khater, the chief economist at Freddie Mac. “And now it’s spreading.” Freddie Mac has estimated that the nation is short 3.8 million Continued on Page A14  \n\ners into insipidity without mustard. In Lyon, the idea of an offal sausage, or andouillette, without its mustard sauce is as inconceivable as cheese starved of wine. Another problem, it transpires, is that Dijon mustard is composed largely from ingredients that do not come from that lovely capital of the Burgundy region. A perfect storm of climate change, a European war, Covid supply problems and rising costs have left French producers  short  of  the  brown Continued on Page A9  \n\n“How are you going to accurately lead your country if your mind is still stuck 50, 60 or 70 years  ago?”  Ms.  Chadwick,  a customer service representative in Rialto, Calif., said of the many septuagenarian  leaders  at  the helm of her party. “It’s not the same, and people aren’t the same, and your old ideas aren’t going to work as well anymore.” While voters across the spec  \n\nTwo years later, as the Supreme Court has eroded federal protections on all three, Ms. Chadwick now sees President Biden and other Democratic leaders as lacking  both  the  imagination  and willpower to fight back. She points to a generational gap — one she once overlooked but now seems cavernous.  \n\nThe New York City police were investigating whether Ms. Trump fell down the stairs at her townhouse on the Upper East Side, according to two law enforcement officials with knowledge of the matter. One of the officials said  \n\nAlexandra Chadwick went to the polls in 2020 with the single goal of ousting Donald J. Trump. A 22-year-old first-time voter, she saw Joseph R. Biden Jr. as more of a safeguard than an inspiring political figure, someone who could stave off threats to abortion access, gun control and climate policy.  \n\n# Former President’s First Wife, Who Became a Mogul Herself  \n\n# Young Voters Say It Is Time For New Blood  \n\nIvana Trump, the glamorous Czech American businesswoman whose high-profile marriage to Donald J. Trump in the 1980s established them as one of the era’s quintessential New York power couples, died on Thursday at her home in Manhattan. She was 73. Mr.  Trump  announced  her death in a statement on Truth Social, the conservative social media platform he founded.  \n\n# By MAYA KING and JONATHAN WEISMAN  \n\nContinued on Page A12  \n\n# By CLAY RISEN  \n\n# IVANA TRUMP, 1949-2022  \n\nIt was because of these human rights concerns that Mr. Biden vowed during his election campaign to make Saudi Arabia a “pariah” and refused once in office to speak with Prince Mohammed, seeking to punish him with isolation.  \n\n“By the simple fact that M.B.S. managed to hold onto his position domestically, he is the necessary interlocutor if you want to talk to Saudi Arabia,” said Cinzia Bianco, a visiting fellow at the European Council on Foreign Relations.  \n\nHIGH-STAKESMEETINGDIFFERING APPROACHES The U.S. and Israel are divided on how exactly to deal with Iran. PAGE A6 that there was no sign of forced entry at the home and that the death appeared to be accidental. A spokeswoman for the city’s chief medical examiner’s office said it would investigate the death. Continued on Page A18  \n\n# COURTING SAUDIS,BIDEN MUST FACE A VILIFIED PRINCE  \n\nRegardless  of  the  trip’s  outcome, the image of Mr. Biden meeting Prince Mohammed on his own turf will provide validation of the young royal’s position at the helm of one of the most important countries in the Middle East and provide a boost to his vision for the kingdom and its more Continued on Page A7  \n\nDe Facto Ruler Is Key to Helping U.S. on Iran and Oil Prices  \n\n![](images/image_4.jpg)  \n\nWith  Russia’s  invasion  of Ukraine affecting oil prices and Iran believed to be expanding its nuclear  capabilities,  Mr.  Biden suddenly needs Saudi Arabia’s help — and must confront the reality that the only way to get it is through  Prince  Mohammed, widely known as M.B.S.  \n\nBut the prince’s rule has also been defined by his institutionalization of force — both to quash domestic dissent and to pursue a more  muscular  foreign  policy. Stepping beyond the old Saudi model of quietly cultivating influence with cash-driven diplomacy, Prince Mohammed has bombed Yemen, moved aggressively to jail activists and critics and, according  to  the  Central  Intelligence Agency, dispatched the hit squad that murdered the Saudi journalist Jamal Khashoggi.  \n\nBEIRUT, Lebanon — The Saudi Arabia that President Biden will visit this week is a country being actively reshaped by the whims and visions of one man: Crown Prince Mohammed bin Salman. As the de facto ruler of the oilrich monarchy, the 36-year-old prince has cast himself as a reformer, loosening some restrictions of ultraconservative Islam by permitting women to drive and allowing once-for",
    "chunk_order_index": 1,
    "full_doc_id": "doc-037bd216cd45a4f5233a69164993eea9"
  },
  "chunk-188e21b8eb7b6553be96db3b2829cf6a": {
    "tokens": 589,
    "content": "Intelligence Agency, dispatched the hit squad that murdered the Saudi journalist Jamal Khashoggi.  \n\nBEIRUT, Lebanon — The Saudi Arabia that President Biden will visit this week is a country being actively reshaped by the whims and visions of one man: Crown Prince Mohammed bin Salman. As the de facto ruler of the oilrich monarchy, the 36-year-old prince has cast himself as a reformer, loosening some restrictions of ultraconservative Islam by permitting women to drive and allowing once-forbidden cinemas and concerts.  \n\nIvana and Donald J. Trump, a 1980s New York power couple.  \n\n# By BEN HUBBARD  \n\n# INTERNATIONAL A4-9  \n\n# NATIONAL A10-15  \n\n# BUSINESS B1-5  \n\n# WEEKEND ARTS C1-12  \n\n# SPORTS B6-10  \n\nUkraine Priests Draw Scrutiny Officials suspect some clergy members in the Ukrainian Orthodox Church may be collaborating with Russia.  PAGE A8 Prime Minister Offers to Quit Italy’s president refused to accept Mario Draghi’s resignation, leaving the country in political limbo. PAGE A9 A Crushing Debt to Society A new report asserts that ordering juvenile offenders to pay restitution often derails their lives and doesn’t compensate the victims either. PAGE A10 Exonerated and Suing City Muhammad A. Aziz filed a \\$40 million claim against New York, seeking redress for his wrongful conviction in the killing of Malcolm X. PAGE A15 Manchin Sinks Spending Deal Senator Joe Manchin III said he would not back tax increases or climate funding, dashing hopes that the Biden agenda could be salvaged. PAGE A14  \n\n![](images/image_5.jpg)  \n\n# Inflating the Airwaves  \n\nPrices are soaring, and so are political ads by Republicans castigating Democrats for the problem as the midterm elections approach. PAGE B1 Questionable Surveillance A data breach has caused some people in China to express concerns about the country’s surveillance state, which shows no signs of easing. PAGE B1 Empty Airport Carousels Surging demand for air travel and airport staffing shortages have made this a bedeviling season when it comes to missing luggage. PAGE B5  \n\n# A Nice Role After All  \n\nJennifer Coolidge wasn’t wild about taking a role in “The White Lotus.” Now she’s an Emmy nominee. PAGE C3 Speaking Her Language Two shows explore the art of Barbara Kruger. Below, a variation on her “Untitled (I Shop Therefore I Am).”  PAGE C1  \n\n![](images/image_6.jpg)  \n\n# A Clunker at the British Open  \n\nTiger Woods, a three-time Open champion, was six over par after the first round at St. Andrews. PAGE B6 Latinos Lack Voice in Baseball Nearly 30 percent of big-league players are Hispanic, but they are largely absent from union leadership.  PAGE B10  \n\n0 1354613",
    "chunk_order_index": 2,
    "full_doc_id": "doc-037bd216cd45a4f5233a69164993eea9"
  }
}