{
    "chunk-fc8cd8056074dc0bf9f555f4d74b9ff9": [
        {
            "entity_name": "Tweedledum ('DUM', 'First Boy')",
            "entity_type": "PERSON",
            "description": "One of the two characters, often paired with Tweedledee, known for their peculiar behavior and logic. He is identified by the 'DUM' embroidery on his collar and is referred to as 'First Boy' by Alice.",
            "source_entities": [
                "\"TWEEDLEDUM\"",
                "\"THE FIRST BOY\""
            ]
        },
        {
            "entity_name": "Tweedledee ('DEE', 'Next Boy')",
            "entity_type": "PERSON",
            "description": "The other character, often paired with Tweedledum, known for their peculiar behavior and logic. He is identified by the 'DEE' embroidery on his collar and is referred to as 'Next Boy' by Alice.",
            "source_entities": [
                "\"TWEEDLEDEE\"",
                "\"THE NEXT BOY\""
            ]
        }
    ],
    "chunk-655e59e5d6e63fafc3aba38f4b0967fa": [
        {
            "entity_name": "Humpty Dumpty",
            "entity_type": "PERSON",
            "description": "Humpty Dumpty is a character Alice encounters, initially mistaken for an egg due to his egg-like appearance, and is sitting on a high wall. He is portrayed as having an enormous face and is later revealed to be a person when he speaks.",
            "source_entities": [
                "HUMPTY DUMPTY",
                "EGG"
            ]
        }
    ],
    "chunk-92dcf7f8c01b64223fb81fdf9cd1f473": [
        {
            "entity_name": "Humpty Dumpty (Dumpty)",
            "entity_type": "PERSON",
            "description": "A character who interacts with Alice, displaying a discontented tone and making unusual remarks about faces. He is also known as Dumpty.",
            "source_entities": [
                "\"HUMPTY DUMPTY\"",
                "\"DUMPTY\""
            ]
        }
    ],
    "chunk-89e32c9b67baf561f124619c34d8f9ab": [
        {
            "entity_name": "Haigha (ANGLO-SAXON MESSENGER)",
            "entity_type": "PERSON",
            "description": "Haigha, also known as the Anglo-Saxon Messenger, is an Anglo-Saxon who uses peculiar attitudes to express happiness and delivers messages and food to the King. He is one of the two messengers, living on the Hill.",
            "source_entities": [
                "MESSENGER",
                "ANGLO-SAXON MESSENGER"
            ]
        }
    ],
    "chunk-2adf172dea4c3ec6f34eca88a6b6b035": [
        {
            "entity_name": "White Knight",
            "entity_type": "PERSON",
            "description": "The White Knight is a character who engages in a battle with the Red Knight over Alice, characterized by his tin armour and upside-down box. He promises to see Alice safe to the end of the wood and is involved in a peculiar plan to get honey from bees that might nest in his discarded box.",
            "source_entities": [
                "WHITE KNIGHT",
                "WHITE KNIGHT"
            ]
        }
    ],
    "chunk-01e44b3e69b04f6d4f4c4d87b5ecd71a": [
        {
            "entity_name": "Knight",
            "entity_type": "PERSON",
            "description": "A character who frequently falls off his horse, discusses his inventions, and shares his thoughts on various topics with Alice. He is also known as the White Knight, who mistakenly wore the Knight's helmet, causing a mix-up and a humorous situation.",
            "source_entities": [
                "KNIGHT",
                "WHITE KNIGHT"
            ]
        }
    ],
    "chunk-8bc797ee5f0bdbf691817640d60d286f": [
        {
            "entity_name": "Alice",
            "entity_type": "PERSON",
            "description": "The main character who interacts with the Red Queen and the White Queen, and is involved in a series of nonsensical discussions and mathematical riddles. Also referred to as 'CHILD' by the Red Queen, indicating her youth and implying a lack of understanding or importance.",
            "source_entities": [
                "\"ALICE\"",
                "\"CHILD\""
            ]
        }
    ]
}