{
  "chunk-6c59374ebd57c4cadd215ce86b60a88c": {
    "tokens": 1200,
    "content": "# “All the News The New ork Cimes That's Fit to Print'\"  \n\nVOL. CLXXIII . . . . No. 59,943 © 2023  The New York Times Company  \n\nMONDAY, OCTOBER 16, 2023  \n\n![](images/image_1.jpg)  \nInjured children were rushed to Al-Shifa Hospital on Sunday. It is one of 21 hospitals in Gaza that have been ordered to evacuate.  \n\n# A Rave, Then a Shattering Awakening, and Israel Is Transformed  \n\n# By ROGER COHEN  \n\nRE’IM, Israel — At daybreak, Hila Fakliro looked up to the sky from the vodka and Red Bull cocktails she was mixing: “Oh, my God,” she said. “Look! There are fireworks!”  \n\nA fitness instructor, aged 26, she was drawn to trance music festivals as a means, she said, “to disconnect your mind from all the tension in Israel.” The Tribe of Nova gathering, celebrating the Jewish holiday of Sukkot amid groves of eucalyptus trees only three miles from Gaza, seemed particularly well organized, so the fireworks struck her as no more than an extravagant flourish. Her fellow bartender, whom she had met just hours before, turned to her: “I don’t think those are fireworks.”  \n\nThey were, in fact, the white flashes of Hamas rockets from Gaza, the fire at dawn signaling an attack that would turn fields full of young Israelis dancing to psychedelic music into a slaughterhouse. In this massacre, Israel’s 75-yearold quest for carefree normalcy met the murderous fury of those extremists who deny the state’s  \n\n# Drawing Together, as a Nation Loses Its Complacency  \n\nIf some sinister choreographer had sought a consummate staging of the failure of Israelis and Palestinians to reach beyond hatred and war, this savage meeting of two adjacent but distant worlds in idyllic  undulating  countryside came close, leaving at least 260 acs with guns and people falling one by one,” Ms. Fakliro said. “It was like a shooting range.” Initially, she froze. The music stopped; the cancellation of the festival was announced. She lay down between refrigerators at the bar. Carefree dancers in galaxy leggings, even a reveler looping rhythmically on a Segway, turned in an instant to a terrified, stunned human mass. All of the psychedelics and other drugs used at trance parties redoubled panic attacks Continued on Page A12  \n\n# In Back Rooms, Trump Twisted Primary Rules  \n\nThis article is by Shane Goldmacher, Jonathan Swan and Maggie Haberman.  \n\nNot long after the new chairman of the Republican Party in Hawaii was elected in May, he received  a  voicemail  from  none other than Donald J. Trump.  \n\n“It’s your all-time favorite president,” Mr. Trump told the chairman, Tim Dalhouse. “I just called to congratulate you.”  \n\nThe head of the Kansas G.O.P. received a similar message after he became chairman. The Nebraska chairman had a couple of minutes and a photo arranged with the former president during an Iowa stop. And the chairman of the Nevada Republican Party, Michael McDonald, who had served as a fake elector for Mr. Trump after the 2020 election, was among a group of state party officials who were treated to an hourslong Mara-Lago meal in March that ended in ice cream sundaes.  \n\nMonths later, Mr. McDonald’s party  in  Nevada  dramatically transformed the state’s influential early contest. The party enacted new rules that distinctively disadvantage Mr. Trump’s chief rival, Gov. Ron DeSantis of Florida, by effectively  blocking  the  super PAC he relies upon from participating in the state’s new caucus. Mr. McDonald has tilted the rules so significantly that some of Mr. Trump’s opponents have accused the party of manipulating the election for him — and have mostly pulled up stakes in the state entirely.  \n\n![](images/image_2.jpg)  \nThe Board of Pardons in Minnesota meets twice a year to consider applications for clemency.  \n\n# 10 Minutes to Plead for Grace, and a New Life  \n\n# By DAN BARRY  \n\nThe supplicants clustered outside the enormous closed doors. They paced the hallway, fidgeted on benches, knitted their hands and waited, waited, for their 10- minute chance at mercy. A tall man in a sharp blazer, caught a quarter-century ago with 127 doses of LSD. A pony-tailed Navy veteran who critically injured  someone  while  driving drunk in 2008. A burly man twice convicted of assaulting his wife, now sitting beside him. A former addict once found unconscious in  \n\n# In Minnesota, Seeking Pardons in Public  \n\na car, syringe jutting from his arm. Others dogged by the past. They had come to the Minnesota capital of St. Paul on this steamy summer day to be forgiven. Restored. Redeemed. The  doors  opened  to  reveal Minnesota  officialdom  personified: the governor, the attorney general and the state’s chief justice — the three members of the Board of Pardons. They sat, unsmiling, at a long table facing a much smaller table that featured tissue boxes and a digital clock set at 10 minutes.  \n\nTen minutes: the time allotted the supplicants to prove that they were worthy; that, like St. Paul, they had traveled their own rutted road to Damascus. This buzzerbeating pressure intensified a raw pardon process unlike those in most other states, with the powerless beseeching the powerful in public, and the decision rendered in the moment.  \n\n# Hospitals Face Another Layer Of Impossible  \n\nIsraeli Order Is Called a ‘Death Sentence’  \n\n# BEHIND CURTAINS, TENSE DIPLO",
    "chunk_order_index": 0,
    "full_doc_id": "doc-aea673ffceefa0b34a14d3ce56f219c9"
  },
  "chunk-5179416af4cc4a09f5ed74117ac25b4f": {
    "tokens": 1200,
    "content": "allotted the supplicants to prove that they were worthy; that, like St. Paul, they had traveled their own rutted road to Damascus. This buzzerbeating pressure intensified a raw pardon process unlike those in most other states, with the powerless beseeching the powerful in public, and the decision rendered in the moment.  \n\n# Hospitals Face Another Layer Of Impossible  \n\nIsraeli Order Is Called a ‘Death Sentence’  \n\n# BEHIND CURTAINS, TENSE DIPLOMACY TO CURTAIL SIEGE  \n\nFEARS OF A WIDER WAR  \n\n# By RAJA ABDULRAHIM  \n\nJERUSALEM — Hundreds of people injured in Israeli airstrikes are streaming into hospitals in Gaza, transported by overfilled ambulances and sharing bloodied gurneys at the entrances. Workers and bystanders rush to carry the victims inside, where only the most critically wounded are allowed to stay, and the rest are sent home.  \n\nOn Friday, Israel ordered hospitals in northern Gaza — along with more than one million Palestinians — to evacuate and flee southward before an anticipated Israeli ground invasion of the territory. The order has created for patients and their caretakers an impossible dilemma: stay or go. “It’s absolutely impossible to evacuate the hospital,” said Dr. Muhammad Abu Salima, the director of Gaza City’s Al Shifa Hospital, the territory’s largest medical complex. “There is nowhere in Gaza that can accept the number of patients in our intensive care unit or neonatal intensive care unit or even the operating rooms.” “If someone doesn’t die from the bombardment, then he’ll die from the lack of medical service,” he said.  \n\nAt Al Shifa Hospital, patients included 70 people on ventilators, 200 receiving dialysis and many babies  in  incubators.  Moving them elsewhere is logistically impossible, said. Dr. Abu Salima. Friday’s evacuation order came as Israel has been pummeling the territory  with  airstrikes  in  response to the Oct. 7 attack by Hamas, the group that controls Gaza, which killed more than 1,300 people. The attack was the single deadliest day in Israel’s modern history and the deadliest day for Jews since the Holocaust, according to Israeli officials.  \n\nThe  evacuation  of  northern Gaza is meant to take civilians out of harm’s way, Israel says. But it has left people in Gaza with an impossible choice. Services in southern Gaza, already strained after years of an international blockade, are at their breaking point, and the south is also subject to airstrikes. Hundreds of thousands of Palestinians have already fled south, and by Sunday, displaced families had crammed into every inch  of  schools,  hospitals  and mosques. Others crowded into the houses  of  friends  and  family. Many more slept out in the open in the streets even as the airstrikes, including on southern Gaza, continued.  \n\nMany Gazans also say they would rather die in their homes than flee.  \n\nU.S., Egypt and Others Confer as Aid to Gaza Piles Up at Border  \n\nThis article is by Thomas Fuller, Aaron Boxerman and Raja Abdulrahim.  \n\nDiplomats were locked in frantic talks on Sunday to ease the humanitarian crisis in Gaza as an Israeli ground invasion appeared imminent.  \n\nAt the same time, the United States was deploying a second aircraft carrier to the eastern Mediterranean amid fears of a wider war.  \n\nOfficials from the United States, Egypt and Middle Eastern countries sought to ease what Israeli officials have called the “siege” of Gaza, which has led to dire shortages of food, water, gasoline and other essentials in the blockaded territory.  \n\nVideo  images  on  Sunday showed lines of trucks idling on the road to Gaza in the Egyptian city of Arish, about 30 miles from the border they were not allowed to cross.  \n\n![](images/image_3.jpg)  \nFood donated to displaced Palestinians in Khan Younis.  \n\nAfter days of acute water short  \nages in Gaza, Jake Sullivan, the   \nWhite House national security ad  \nviser, said on Sunday that Israel   \nhad agreed to restore water to a   \npipeline that served a southern   \npart of the enclave. As Israeli troops massed on the   \nborder, more than two million   \nGaza residents endured a pan  \nicked countdown to the expected   \nstart  of  a  ground  invasion  of   \nnorthern Gaza. “We will take Hamas apart,”  \n\nPrime Minister Benjamin Netanyahu told government ministers on Sunday at the first formal meeting of Israel’s new emergency wartime government, acContinued on Page A8  \n\nAt least 2,760 Palestinians in Gaza have been killed since last Saturday, the Palestinian Health Continued on Page A14  \n\nDIVIDED ATTENTION Some fear the Israel-Hamas war could take focus from Ukraine. PAGE A7  \n\n# Museum Reckons With Remains Collected From Racist Research  \n\n# By ZACHARY SMALL  \n\nThe American Museum of Natural History is planning to overhaul  its  stewardship  of  some 12,000 human remains, the painful legacy of collecting practices that saw the museum acquire the skeletons of Indigenous and enslaved people taken from their graves and the bodies of New Yorkers who died as recently as the 1940s. The new policy will include the removal of all human bones now on public display and improvements  to  the  storage  facilities where the remains are now kept. Anthropologists will also spend more time studying the collection to determine the origins and identities of remains, as the museum  \n\nfaces questions about the legality and the ethics of its acquisitions. “Figuring out the answers to exactly what we have here, and how to actually describe that as completely as we can, is something that is important to do moving forward,” said Sean M. Decatur, who became the museum’s president in April.",
    "chunk_order_index": 1,
    "full_doc_id": "doc-aea673ffceefa0b34a14d3ce56f219c9"
  },
  "chunk-dee5847a95227f620be61666e65ad9ef": {
    "tokens": 594,
    "content": "to  the  storage  facilities where the remains are now kept. Anthropologists will also spend more time studying the collection to determine the origins and identities of remains, as the museum  \n\nfaces questions about the legality and the ethics of its acquisitions. “Figuring out the answers to exactly what we have here, and how to actually describe that as completely as we can, is something that is important to do moving forward,” said Sean M. Decatur, who became the museum’s president in April.  \n\nThe  effort,  which  was  announced to staff members last week, comes as natural history museums face increasing scrutiny over remains they often acquired in the name of discredited scientific theories, like eugenics, and which typically involved colContinued on Page A21  \n\n![](images/image_4.jpg)  \n\nGridlock for Food Cart Permits Despite New York City reforms, few vendors have received permits, leaving many to work outside the law. PAGE A15 An Unflinching Judge Tanya S. Chutkan, who is presiding over Donald J. Trump’s Jan. 6 trial, shows no sign of being intimidated by it. PAGE A18  \n\n# INTERNATIONAL A4-14  \n\nVatican Synod Draws All A meeting on sensitive issues in the Roman Catholic Church is being held with the utmost secrecy and discretion. Outside, it’s a different story.  PAGE A4 Feeling Safer Sleeping Outside Earthquakes in Afghanistan have killed nearly 1,300 people and amplified already troubling times. PAGE A6 OBITUARIES D7 A Star on Her Own Terms Piper Laurie, who began as a product of the studio system, went on to receive three Oscar nominations. She was 91.  \n\n![](images/image_5.jpg)  \n\n# ARTS C1-6  \n\nPerforming Like a Trouper After a health-related delay, Madonna began her Celebration Tour at a 20,000- capacity arena in London. PAGE C5 Taylormania on Film A movie built upon a performance in Taylor Swift’s “Eras Tour” has arrived. Wesley Morris has the review.  PAGE C1  \n\n# SPORTS D1-6  \n\nA Showdown of Wild Cards A preview of the National League Championship Series between the Philadelphia Phillies and the Arizona Diamondbacks, who each eliminated teams with at least 100 wins.  PAGE D1 ‘Boomshakalaka!’ Endures Thirty years ago, the original arcade version of NBA Jam was released. Since then, it and its distinctive voice have remained special to fans of pro basketball who love video games. PAGE D2  \n\n# OPINION A26-27  \n\n# Lydia Polgreen  \n\nPAGE A27  \n\n![](images/image_6.jpg)  \n\n# BUSINESS B1-7  \n\nA Pricey Trade-Off for Nepal Insiders and documents surrounding a “signature” airport project reveal the pitfalls of China’s infrastructure-at-anycost model. PAGE B1",
    "chunk_order_index": 2,
    "full_doc_id": "doc-aea673ffceefa0b34a14d3ce56f219c9"
  }
}