{
    "chunk-33911236aa6107381f93f86f33327320": [
        {
            "entity_name": "Oglala Sioux Tribe (Lakota)",
            "entity_type": "ORGANIZATION",
            "description": "The Oglala Sioux Tribe, also known as the Lakota, is a Native American tribe to which cultural objects and belongings were returned after more than a century. These items, including moccasins, sacred pipes, ritual clothing, and beaded leather bags, were believed to have been taken from Wounded Knee after the 1890 massacre and were kept in the Founders Museum in Barre, Mass.",
            "source_entities": [
                "OGLALA SIOUX TRIBE",
                "LAKOTA"
            ]
        },
        {
            "entity_name": "U.S. (United States)",
            "entity_type": "GEO",
            "description": "The United States, referred to as the U.S., is the country where the Lakota cultural objects were kept before being returned to the Oglala Sioux Tribe. It is also involved in supporting Ukraine's military efforts by preparing to ship artillery rounds and rockets through NATO.",
            "source_entities": [
                "U.S.",
                "UNITED STATES"
            ]
        },
        {
            "entity_name": "Bakhmut",
            "entity_type": "GEO",
            "description": "Bakhmut is the eastern city in Ukraine where the Ukrainian military is engaged in an intense bombardment, raising concerns about ammunition supply for future campaigns. The city is a focal point of the current military conflict, with the Pentagon expressing concerns about the unsustainable pace of artillery shell firing.",
            "source_entities": [
                "BAKHMUT",
                "KYIV"
            ]
        }
    ],
    "chunk-6a6dca492cdaad913d5de757b6b6fe0e": [
        {
            "entity_name": "Ukrainian Counteroffensive",
            "entity_type": "Event",
            "description": "The Ukrainian counteroffensive is an event where Ukraine is attempting to regain lost territory with support from the United States and Britain, who are preparing to ship thousands of NATO and Soviet-type artillery rounds and rockets to help shore up supplies for the offensive.",
            "source_entities": [
                "UKRAINIAN COUNTEROFFENSIVE",
                "UNITED STATES",
                "BRITAIN"
            ]
        },
        {
            "entity_name": "First Republic Bank Support",
            "entity_type": "Event",
            "description": "Eleven of the largest U.S. banks, including JPMorgan Chase, Bank of America, Wells Fargo, and Citigroup, came together to inject $30 billion into First Republic Bank to prevent its collapse following the implosion of Silicon Valley Bank. This extraordinary effort was aimed at staving off financial contagion and reassuring the stability of the American financial system.",
            "source_entities": [
                "FIRST REPUBLIC BANK",
                "SILICON VALLEY BANK",
                "JANET L. YELLEN",
                "JAMIE DIMON",
                "JPMORGAN CHASE",
                "BANK OF AMERICA",
                "WELLS FARGO",
                "CITIGROUP",
                "GOLDMAN SACHS",
                "MORGAN STANLEY",
                "PNC FINANCIAL",
                "TRUIST",
                "BNY MELLON",
                "STATE STREET",
                "U.S. BANK",
                "FEDERAL RESERVE",
                "AMERICAN FINANCIAL SYSTEM",
                "FINANCIAL CONTAGION",
                "2008 FINANCIAL CRISIS",
                "SIGNATURE BANK"
            ]
        },
        {
            "entity_name": "Toxic Chemicals Regulation",
            "entity_type": "Event",
            "description": "The Biden administration is preparing to impose new rules to restrict or ban an array of toxic chemicals widely used in manufacturing, presenting a balance between economic agenda and public health. This regulation faces opposition from industries such as chip makers, the electric vehicle industry, and military contractors, who argue it could hinder the administration's drive to nurture the American economy, while public health groups advocate for regulation to protect workers and communities from health risks.",
            "source_entities": [
                "BIDEN ADMINISTRATION",
                "TOXIC CHEMICALS REGULATION",
                "CHIP MAKERS",
                "ELECTRIC VEHICLE INDUSTRY",
                "MILITARY CONTRACTORS",
                "PUBLIC HEALTH GROUPS"
            ]
        },
        {
            "entity_name": "Social Studies Curriculum Review in Florida",
            "entity_type": "Event",
            "description": "The review and approval of social studies curriculum in Florida has become a contentious political issue, with Gov. Ron DeSantis leading a campaign against what he describes as 'woke indoctrination' in public schools. The state is scrutinizing curriculum content, including flagging anything that could hint at critical race theory, as part of Gov. DeSantis's efforts.",
            "source_entities": [
                "GOV. RON DESANTIS",
                "SOCIAL STUDIES CURRICULUM",
                "CRITICAL RACE THEORY"
            ]
        }
    ],
    "chunk-ce5e77442d8a01e24524144690ba295e": [
        {
            "entity_name": "MAGA, With Martinins",
            "entity_type": "ORGANIZATION",
            "description": "A combative young Republican group in New York, known for being Trump-friendly and wary of the GOP's moderate path.",
            "source_entities": [
                "MAGA, WITH MARTINIS",
                "NATIONAL A10-16 MAGA, WITH MARTINIS"
            ]
        },
        {
            "entity_name": "INTERNATIONAL A4-9 Anger After Migrant Tragedy",
            "entity_type": "EVENT",
            "description": "An event referring to a sinking that killed 86 migrants, sparking a debate in Italy about responsibility.",
            "source_entities": [
                "INTERNATIONAL A4-9 ANGER AFTER MIGRANT TRAGEDY",
                "ITALY"
            ]
        },
        {
            "entity_name": "Trump Team Plans Attack",
            "entity_type": "EVENT",
            "description": "An event where the former president's campaign plans to accuse Alvin Bragg of political bias if criminal charges are faced.",
            "source_entities": [
                "TRUMP TEAM",
                "TRUMP TEAM PLANS ATTACK",
                "ALVIN BRAGG"
            ]
        },
        {
            "entity_name": "Picturing Systemic Violence",
            "entity_type": "EVENT",
            "description": "An event or exhibition, part of WEEKEND ARTS, featuring Kehinde Wiley’s art and focusing on systemic violence.",
            "source_entities": [
                "KEHINDE WILEY",
                "WEEKEND ARTS C1-16",
                "PICTURING SYSTEMIC VIOLENCE"
            ]
        },
        {
            "entity_name": "State Blocks Abortion Ban",
            "entity_type": "EVENT",
            "description": "An event where North Dakota’s Supreme Court upheld a lower court’s decision protecting abortion rights in some situations.",
            "source_entities": [
                "NORTH DAKOTA’S SUPREME COURT",
                "STATE BLOCKS ABORTION BAN"
            ]
        },
        {
            "entity_name": "State Experts, Teachers, Parents, Political Activists",
            "entity_type": "ORGANIZATION",
            "description": "A group of state-level experts, educators, parents, and political activists involved in the review process, evaluating academic content and flagging sensitive issues.",
            "source_entities": [
                "STATE EXPERTS",
                "TEACHERS",
                "PARENTS",
                "POLITICAL ACTIVISTS"
            ]
        },
        {
            "entity_name": "Conservative Education Group",
            "entity_type": "ORGANIZATION",
            "description": "A prominent conservative group whose members volunteered to review textbooks and objected to many of them.",
            "source_entities": [
                "CONSERVATIVE EDUCATION GROUP"
            ]
        },
        {
            "entity_name": "Wanted: Buyer for TikTok",
            "entity_type": "EVENT",
            "description": "An event or situation where finding a company to buy TikTok for billions is proving difficult due to cost and antitrust concerns, among other issues.",
            "source_entities": [
                "BUSINESS B1-6",
                "WANTED: BUYER FOR TIKTOK"
            ]
        },
        {
            "entity_name": "A Struggle for College Towns",
            "entity_type": "EVENT",
            "description": "An event or situation where rural areas, having turned to colleges for economic support, are now facing challenges due to declining student enrollment.",
            "source_entities": [
                "BUSINESS B1-6",
                "A STRUGGLE FOR COLLEGE TOWNS"
            ]
        },
        {
            "entity_name": "Edwin Díaz",
            "entity_type": "PERSON",
            "description": "The Mets’ closer who will miss the season after injuring his right knee at the World Baseball Classic.",
            "source_entities": [
                "EDWIN DÍAZ",
                "SPORTS B8-12"
            ]
        }
    ]
}