{
    "image_1": {
        "image_id": 1,
        "image_path": "./fusion_research/fusion_dataset/news/20230810/images/image_1.jpg",
        "caption": [
            "Officials in Pinecrest, Fla., announced a mitigation plan to help rein in the peafowl and keep them from breeding and running amok. "
        ],
        "footnote": [],
        "context": "Biden’s Order Bans Investing Long a mainstay in bohemian Coconut Grove, a Miami neighborhood up the road, the nonna ECONOMIC THREAT Spending slowdown deepens concerns for heavily indebted China. PAGE B1 The order will prohibit venture capital and private equity firms from pumping more money into Chinese efforts to develop semiconductors and other microelectronics, quantum computers and certain artificial intelligence applications. Administration officials stressed that the move was tailored to guard national security, but China is likely to see it as part of a wider campaign to contain its ris Overrun Miami Suburb to Clip Its Peacocks (Not the Feathers) . . . No. 59,876 © 2023 The New York Times Company NEW YORK, THURSDAY, AUGUST 10, 2023 Limits Could Escalate Conflict With Beijing PINECREST, Fla. — The prevailing theory about why the peacocks flocked to suburban Pinecrest is that, like many a Floridian, they went hunting for better real estate. WASHINGTON — President Biden escalated his confrontation with China on Wednesday by signing an executive order banning new American investment in key technology industries that could be used to enhance Beijing’s military capabilities, the latest in a series of moves putting more distance between the world’s two largest economies. ",
        "chunk_order_index": 0,
        "chunk_id": "chunk-28037bf173637ec0ec59c3237f570304",
        "description": "The image depicts a scene of five peafowl crossing a paved road. The largest bird, likely an adult female peacock (peahen), is leading the way with a confident stride. She has a distinctive crest on her head and a long neck with iridescent blue-green feathers. Following her are four smaller birds, which appear to be juveniles or young peahens. They have similar crests but lack the vibrant plumage of the adult. The group is walking in a single file line, with the adult bird slightly ahead of the others. The background shows a grassy area on one side of the road, suggesting a suburban or rural setting. The overall atmosphere is calm and serene, with the birds moving purposefully across the road. The lighting indicates a sunny day, casting shadows of the birds on the pavement.",
        "segmentation": true
    },
    "image_2": {
        "image_id": 2,
        "image_path": "./fusion_research/fusion_dataset/news/20230810/images/image_2.jpg",
        "caption": [
            "A charred boat sat on the scorched waterfront Wednesday as wildfires fanned by Hurricane Dora swept the island of Maui in Hawaii. "
        ],
        "footnote": [],
        "context": "For every increase in temperature of 1 degree Celsius, or Turning to Vasectomies to Curb Population Uncovering the Effects bors’ liking. The peacocks scratched the roofs of stately homes, pecked the paint off fancy cars and defecated on manicured driveways. Their piercing High temperatures are strongly associated with an increase in suicides, researchers have found. Heat has been linked to a rise in violent crime and aggression, emergency room visits and hospitalizations for mental disorders, and deaths — especially among people with schizophrenia, dementia, psychosis and substance use. By APOORVA MANDAVILLI The Extreme Heat May Be Getting to Your Head and irritable, even depressed, it’s not all in your head. Soaring temperatures can damage not just the body but also the mind. As heat waves become more intense, more frequent and longer, it has become increasingly important to address the impact on mental health, scientists say. “It’s really only been over the past five years that there’s been a real recognition of the impact,” said Dr. Joshua Wortzel, chair of the American Psychiatric Association’s committee on climate change and mental health, which was set up just two years ago. “Our understanding of the basic biology of why this association ex ",
        "chunk_order_index": 0,
        "chunk_id": "chunk-28037bf173637ec0ec59c3237f570304",
        "description": "The image depicts a scene of devastation following a wildfire on the island of Maui in Hawaii. The foreground shows a charred boat sitting on a scorched waterfront, with remnants of debris scattered around it. The water appears to be calm, reflecting the smoke-filled sky above. In the background, several palm trees stand tall but are visibly burnt, their fronds hanging limply. A building, likely part of a marina or dock facility, is also visible and appears to have suffered significant damage. The overall atmosphere is one of desolation and destruction, with a thick haze of smoke lingering in the air, indicating that the fire may still be active or has recently been extinguished. The sky is overcast with a mix of gray and orange hues, suggesting the presence of ongoing wildfires. The scene conveys a sense of loss and the aftermath of a natural disaster.",
        "segmentation": true
    },
    "image_3": {
        "image_id": 3,
        "image_path": "./fusion_research/fusion_dataset/news/20230810/images/image_3.jpg",
        "caption": [],
        "footnote": [],
        "context": "A Needed Harvest Is in Peril Extreme weather has Kansas facing a shrinking wheat crop, an added worry in a hurting global grain market. PAGE A11 DeSantis Suspends Prosecutor Florida’s governor NATIONAL A11-17  The Path Not Taken For a while, the actor Justin H. Min believed that he should try a career in journalism. Now he has a starring role in the comedy “Shortcomings.” PAGE C1 ARTS C1-6  Britain’s vegetable producers are hoping that a time of rising food prices could produce a revival of their humble but cost-effective staple. PAGE A8 Frozen Peas, Please INTERNATIONAL A4-10  By ALAN FEUER Jan. 6, 2021. But the papers indicate that prosecutors received permission from the judge not to tell Mr. Trump for months that they had obtained the warrant for his account. The prosecutors feared that if Mr. Trump learned about the warrant, it “would seriously jeopardize the ongoing investigation” by giving him “an opportunity to destroy evidence, change patterns of behavior [or] notify confederates,” the papers said. Mr. Trump quickly responded to the news about the warrant on his own social media site, Truth Social.  First Known Effort to Dig Directly Into Trump’s Communications TWITTER ACCOUNT OF EX-PRESIDENT SEARCHED BY U.S. ",
        "chunk_order_index": 2,
        "chunk_id": "chunk-3e7d3be70e49737c0caddd881b5e8620",
        "description": "The image is a black and white photograph of a young man playing an electric guitar. He has shoulder-length hair and is wearing a dark suit jacket over a light-colored shirt with a tie. The guitar is a Fender Stratocaster, characterized by its distinctive shape and the three single-coil pickups. The man appears to be focused on his performance, with his eyes slightly closed and his mouth open as if he is singing or expressing emotion through his music. The background is dark, which helps to highlight the figure and the guitar. The overall atmosphere conveys a sense of intensity and passion, typical of a live music performance.",
        "segmentation": true
    },
    "image_4": {
        "image_id": 4,
        "image_path": "./fusion_research/fusion_dataset/news/20230810/images/image_4.jpg",
        "caption": [],
        "footnote": [],
        "context": "A Needed Harvest Is in Peril Extreme weather has Kansas facing a shrinking wheat crop, an added worry in a hurting global grain market. PAGE A11 DeSantis Suspends Prosecutor Florida’s governor said the elected NATIONAL A11-17  The Path Not Taken For a while, the actor Justin H. Min believed that he should try a career in journalism. Now he has a starring role in the comedy “Shortcomings.” PAGE C1 ARTS C1-6  Britain’s vegetable producers are hoping that a time of rising food prices could produce a revival of their humble but cost-effective staple. PAGE A8 Frozen Peas, Please INTERNATIONAL A4-10 But the papers indicate that prosecutors received permission from the judge not to tell Mr. Trump for months that they had obtained the warrant for his account. The prosecutors feared that if Mr. Trump learned about the warrant, it “would seriously jeopardize the ongoing investigation” by giving him “an opportunity to destroy evidence, change patterns of behavior [or] notify confederates,” the papers said. Mr. Trump quickly responded to the news about the warrant on his own social media site, Truth Social.  First Known Effort to Dig Directly Into Trump’s Communications TWITTER ACCOUNT OF EX-PRESIDENT SEARCHED BY U.S.  By ALAN FEUER ",
        "chunk_order_index": 2,
        "chunk_id": "chunk-3e7d3be70e49737c0caddd881b5e8620",
        "description": "The image depicts a vast field of mature wheat under a clear sky with scattered clouds. In the foreground, there is a dense growth of wheat plants that appear dry and ready for harvest. The wheat stalks are tall and golden, indicating full maturity. In the background, a green combine harvester is positioned in the field, its large cutting head facing the viewer. The harvester is stationary, suggesting it is either preparing to start or has paused during the harvesting process. The horizon line is visible in the distance, showing a flat landscape typical of agricultural regions. The overall scene conveys a sense of readiness for harvest amidst a backdrop of open farmland under a bright sky.",
        "segmentation": true
    },
    "image_5": {
        "image_id": 5,
        "image_path": "./fusion_research/fusion_dataset/news/20230810/images/image_5.jpg",
        "caption": [],
        "footnote": [],
        "context": "A Needed Harvest Is in Peril Extreme weather has Kansas facing a shrinking wheat crop, an added worry in a hurting global grain market. PAGE A11 DeSantis Suspends Prosecutor Florida’s governor said the elected state attorney in Orlando, a Democrat, was too lenient, a claim she denied. PAGE A14 A Concert Shakes Up Rome A rap show set off vibrations at the Circus NATIONAL A11-17  The Path Not Taken For a while, the actor Justin H. Min believed that he should try a career in journalism. Now he has a starring role in the comedy “Shortcomings.” PAGE C1 ARTS C1-6 feared that if Mr. Trump learned about the warrant, it “would seriously jeopardize the ongoing investigation” by giving him “an opportunity to destroy evidence, change patterns of behavior [or] notify confederates,” the papers said. Mr. Trump quickly responded to the news about the warrant on his own social media site, Truth Social.  First Known Effort to Dig Directly Into Trump’s Communications TWITTER ACCOUNT OF EX-PRESIDENT SEARCHED BY U.S.  By ALAN FEUER  INTERNATIONAL A4-10 Frozen Peas, Please Britain’s vegetable producers are hoping that a time of rising food prices could produce a revival of their humble but cost-effective staple. PAGE A8 ",
        "chunk_order_index": 2,
        "chunk_id": "chunk-3e7d3be70e49737c0caddd881b5e8620",
        "description": "The image depicts a man sitting at an outdoor table, engaged in the act of opening or inspecting a steaming bamboo steamer. The man is wearing a black shirt and a cap, and he appears to be focused on the contents of the steamer. Steam is visibly rising from the steamer, indicating that it contains hot food. The setting appears to be a rustic outdoor area with wooden walls and plants in the background. There are two metal chairs visible behind the man, and a black mug is placed on the table next to him. The overall atmosphere suggests a casual dining experience, possibly in a traditional or rustic restaurant setting.",
        "segmentation": true
    },
    "image_6": {
        "image_id": 6,
        "image_path": "./fusion_research/fusion_dataset/news/20230810/images/image_6.jpg",
        "caption": [],
        "footnote": [],
        "context": "BUSINESS B1-5    A Needed Harvest Is in Peril Extreme weather has Kansas facing a shrinking wheat crop, an added worry in a hurting global grain market. PAGE A11 DeSantis Suspends Prosecutor Florida’s governor said the elected state attorney in Orlando, a Democrat, was too lenient, a claim she denied. PAGE A14 A Concert Shakes Up Rome A rap show set off vibrations at the Circus Maximus, raising concerns about using ancient venues. PAGE A10 OBITUARIES B10 Folk Singer Found Fame Late Rodriguez, who performed using only his surname and was the subject of a 2012 documentary, was 81. NATIONAL A11-17 Trump quickly responded to the news about the warrant on his own social media site, Truth Social.  First Known Effort to Dig Directly Into Trump’s Communications TWITTER ACCOUNT OF EX-PRESIDENT SEARCHED BY U.S.  By ALAN FEUER  INTERNATIONAL A4-10 Frozen Peas, Please Britain’s vegetable producers are hoping that a time of rising food prices could produce a revival of their humble but cost-effective staple. PAGE A8  ARTS C1-6 The Path Not Taken For a while, the actor Justin H. Min believed that he should try a career in journalism. Now he has a starring role in the comedy “Shortcomings.” PAGE C1 ",
        "chunk_order_index": 2,
        "chunk_id": "chunk-3e7d3be70e49737c0caddd881b5e8620",
        "description": "The image displays a series of lit candles arranged in two rows on what appears to be stone or concrete steps. Each candle is encased in a glass holder that features colorful religious imagery, likely depicting saints or other holy figures. The holders have a cylindrical shape and are adorned with intricate designs and text, possibly prayers or names of the saints. The flames of the candles are visible, indicating they are currently burning. The background is a plain, dark surface, which contrasts with the bright colors of the candle holders and the warm glow of the flames. The overall atmosphere conveyed by the image is one of reverence and solemnity, often associated with places of worship or memorial sites.",
        "segmentation": true
    }
}