{
    "chunk-8de81d42144b7b3a6be1e0259b3d40e8": [
        {
            "entity_name": "Bratstvo Battalion",
            "entity_type": "ORGANIZATION",
            "description": "A volunteer Ukrainian special forces team conducting secret raids and special operations against Russian forces, including forward spotting and sabotage along the front lines in cities such as Kyiv and Kharkiv. The battalion commander is Oleksiy Serediuk.",
            "source_entities": [
                "BRATSTVO BATTALION",
                "OLEKSIY SEREDIUK"
            ]
        },
        {
            "entity_name": "Dnipro River",
            "entity_type": "GEO",
            "description": "A strategic waterway that bisects Ukraine and has become the dividing line of the southern front, with Ukrainian forces holding the western bank and Russian troops on the eastern bank.",
            "source_entities": [
                "DNIPRO RIVER",
                "KHERSON"
            ]
        },
        {
            "entity_name": "Club Q Shooting",
            "entity_type": "EVENT",
            "description": "An event where a gunman, Anderson Lee Aldrich, opened fire at Club Q in Colorado Springs, which was stopped by Richard M. Fierro, a veteran with combat experience. The incident resulted in multiple casualties and Aldrich was held on charges of murder and bias-motivated crime causing bodily injury.",
            "source_entities": [
                "RICHARD M. FIERRO",
                "ANDERSON LEE ALDRICH",
                "CLUB Q",
                "COLORADO",
                "JOHN SUTHERS",
                "COMBAT MODE"
            ]
        }
    ],
    "chunk-c45dfe4719bdcc8adbaa88476e1507a5": [
        {
            "entity_name": "Richard M. Fierro (Mr. Fierro)",
            "entity_type": "PERSON",
            "description": "Richard M. Fierro, also known as Mr. Fierro, is a person who engaged in heroic actions during the shooting incident, pulling a friend down with him and later tackling the gunman.",
            "source_entities": [
                "RICHARD M. FIERRO",
                "MR. FIERRO"
            ]
        },
        {
            "entity_name": "Raymond Green Vance (Mr. Green Vance)",
            "entity_type": "PERSON",
            "description": "Raymond Green Vance, also known as Mr. Green Vance, is one of the victims identified in the shooting incident and was the longtime boyfriend of Mr. Fierro's daughter.",
            "source_entities": [
                "RAYMOND GREEN VANCE",
                "MR. GREEN VANCE"
            ]
        },
        {
            "entity_name": "New York City's Welfare Agency (Administration for Children’s Services)",
            "entity_type": "ORGANIZATION",
            "description": "New York City's welfare agency, officially known as the Administration for Children’s Services, is accused of racial bias against Black families.",
            "source_entities": [
                "NEW YORK CITY'S WELFARE AGENCY",
                "ADMINISTRATION FOR CHILDREN’S SERVICES"
            ]
        }
    ],
    "chunk-9688cd4dc7b1c931e2dee1d16a10a8ad": null
}