{
    "chunk-84ace6753f0e3d29d1edddce0663ee70": [
        {
            "entity_name": "Norfolk Southern",
            "entity_type": "ORGANIZATION",
            "description": "Norfolk Southern is the company responsible for the train that derailed in East Palestine, causing a toxic spill and facing public scrutiny.",
            "source_entities": [
                "NORFOLK SOUTHERN"
            ]
        },
        {
            "entity_name": "Greg Mascher (Raylix)",
            "entity_type": "PERSON",
            "description": "Greg Mascher is a resident of East Palestine, raising his granddaughters, including Raylix, and concerned about the health effects of a toxic spill caused by a train derailment.",
            "source_entities": [
                "GREG MASCHER",
                "RAYLIX"
            ]
        },
        {
            "entity_name": "Elvis Presley (Elvis's Estate)",
            "entity_type": "PERSON",
            "description": "Elvis, also known as the King of Rock 'n' Roll, is the central figure in the estate dispute following his death, involving his ex-wife Priscilla Presley, daughter Lisa Marie, and granddaughter Riley Keough.",
            "source_entities": [
                "ELVIS",
                "ELVIS’S ESTATE"
            ]
        }
    ],
    "chunk-28dc4ea73403f05f696621b093e81a4a": [
        {
            "entity_name": "Elvis's Estate",
            "entity_type": "Event",
            "description": "The estate of Elvis Presley, which involves Lisa Marie, Priscilla, and Riley Keough in its administration and legal challenges.",
            "source_entities": [
                "LISA MARIE",
                "PRISCILLA",
                "RILEY KEOUGH"
            ]
        },
        {
            "entity_name": "Joseph R. Biden Jr.",
            "entity_type": "Person",
            "description": "The President who unveiled a budget proposal to curb the budget gap and strengthen the country, also known for his actions on various policies including rejecting a District of Columbia measure and addressing illegal immigration.",
            "source_entities": [
                "JOSEPH R. BIDEN JR."
            ]
        },
        {
            "entity_name": "Democratic Party",
            "entity_type": "Organization",
            "description": "The political party that did not mention the word 'deficit' in their platform approved by Mr. Biden and is now focusing on deficit reduction and other centrist policies.",
            "source_entities": [
                "DEMOCRATIC PARTY",
                "THIRD WAY"
            ]
        },
        {
            "entity_name": "Russia's Aerial Assault on Ukraine",
            "entity_type": "Event",
            "description": "Russia's largest aerial barrage in weeks on Ukraine, including the use of hypersonic Kinzhals missiles, which is part of their campaign to black out Ukrainian cities and undermine morale.",
            "source_entities": [
                "RUSSIA",
                "UKRAINE",
                "AERIAL BARRAGE",
                "RUSSIA'S AIR FORCE",
                "KYIV",
                "KINZHALS"
            ]
        },
        {
            "entity_name": "Biden's Budget Proposal",
            "entity_type": "Event",
            "description": "President Biden's proposed $6.8 trillion budget aimed at increasing military spending and social programs while reducing future budget deficits, which includes a $5 trillion tax increase on high earners and corporations over a decade.",
            "source_entities": [
                "$6.8 TRILLION BUDGET",
                "BUDGET GAP",
                "$5 TRILLION TAX INCREASE"
            ]
        }
    ],
    "chunk-13b64296070c2afd0e45e5532a07136d": [
        {
            "entity_name": "Russia (Russian, Moscow)",
            "entity_type": "GEO",
            "description": "Russia, also referred to as 'Russian' and 'Moscow', is involved in a campaign targeting Ukrainian cities, aiming to black out cities and undermine morale. Moscow's forces are part of the campaign to overwhelm air defenses and continue the attack on Ukrainian cities.",
            "source_entities": [
                "RUSSIAN",
                "UKRAINIAN",
                "MOSCOW"
            ]
        },
        {
            "entity_name": "Rosatom",
            "entity_type": "ORGANIZATION",
            "description": "Rosatom is Russia's state-owned nuclear power company, which Europe is finding difficult to sever ties with, as it works to reduce its dependency on Russian oil and natural gas.",
            "source_entities": [
                "ROSATOM",
                "EUROPEAN"
            ]
        },
        {
            "entity_name": "Rupert Murdoch's Media Empire (Fox News, Dominion Voting Systems)",
            "entity_type": "ORGANIZATION",
            "description": "Rupert Murdoch's media empire, which includes Fox News, is involved in a defamation suit with Dominion Voting Systems, providing insight into Murdoch's influence over his news organizations.",
            "source_entities": [
                "RUPERT MURDOCH",
                "DOMINION VOTING SYSTEMS",
                "FOX NEWS"
            ]
        },
        {
            "entity_name": "Ibsen's 'A Doll's House' (Jamie Lloyd, Jesse Green)",
            "entity_type": "EVENT",
            "description": "Ibsen's 1879 drama 'A Doll's House' is being revived by Jamie Lloyd and is compared to an episode of 'CSI: Norway' by critic Jesse Green.",
            "source_entities": [
                "IBSEN",
                "JAMIE LLOYD",
                "A DOLL'S HOUSE",
                "JESSE GREEN"
            ]
        }
    ]
}