{
    "image_1": {
        "image_id": 1,
        "image_path": "./fusion_research/fusion_dataset/novel/Harry Potter and the Sorcerers Stone Illustrated Edition (J. K. Rowling, Jim Kay (Illustrator)) (1)/images/image_1.jpg",
        "caption": [],
        "footnote": [],
        "context": "Mr. Dursley was the director of a Łrm called Grunnings, which made drills. He was a big, beefy man with hardly any neck, although he did have a very large mustache. Mrs. Dursley was thin and blonde and had nearly r. and Mrs. Dursley, of number four, Privet Drive, were proud to say that they were perfectly normal, thank you very much. They were the last people you’d expect to be involved in anything strange or mysterious, because they just didn’t hold with such nonsense.   for Louise I went in search of str awberries, and found unfathomable love. Jim Kay HatyPotter ANDTEE SORCERER'SSTONE Two Ways to Read This book features art and animation speciŁcally designed to enhance this story. You can control your experience on compatible devices by using the Show Media option in the Aa menu. Haty Pott! AND THE SORCERER'S STO J.K. ROWLING ILLUSTRATED BY JIM KAY Pulermore from J.K. Rowling  for Jessica, who loves stories, for Anne, who loved them too, and for Di, who heard this one Łrst. J.K. Rowling ",
        "chunk_order_index": 0,
        "chunk_id": "chunk-fb8e5b95ca964e204d9e59caeaf25f09",
        "description": "The image is an illustration featuring a black dog with one brown eye and one blue eye, giving it a heterochromatic appearance. The dog has a somber expression and floppy ears. It is holding a pink stuffed toy in its mouth, which appears to be a plush creature with long limbs and a small head. The background is a simple, light gray circle that frames the dog's face, emphasizing its features and the toy. The overall mood of the image conveys a sense of melancholy or pensiveness, as the dog's expression and the choice of toy suggest a playful yet sad demeanor.",
        "segmentation": true
    },
    "image_2": {
        "image_id": 2,
        "image_path": "./fusion_research/fusion_dataset/novel/Harry Potter and the Sorcerers Stone Illustrated Edition (J. K. Rowling, Jim Kay (Illustrator)) (1)/images/image_2.jpg",
        "caption": [],
        "footnote": [],
        "context": "Mr. Dursley was the director of a Łrm called Grunnings, which made drills. He was a big, beefy man with hardly any neck, although he did have a very large mustache. Mrs. Dursley was thin and blonde and had nearly twice the usual amount of neck, which came in very useful as she spent so r. and Mrs. Dursley, of number four, Privet Drive, were proud to say that they were perfectly normal, thank you very much. They were the last people you’d expect to be involved in anything strange or mysterious, because they just didn’t hold with such nonsense.  HatyPotter ANDTEE SORCERER'SSTONE Two Ways to Read This book features art and animation speciŁcally designed to enhance this story. You can control your experience on compatible devices by using the Show Media option in the Aa menu. Haty Pott! AND THE SORCERER'S STO J.K. ROWLING ILLUSTRATED BY JIM KAY Pulermore from J.K. Rowling  for Jessica, who loves stories, for Anne, who loved them too, and for Di, who heard this one Łrst. J.K. Rowling  for Louise I went in search of str awberries, and found unfathomable love. Jim Kay ",
        "chunk_order_index": 0,
        "chunk_id": "chunk-fb8e5b95ca964e204d9e59caeaf25f09",
        "description": "The image depicts a wall adorned with framed pictures and posters. The central frame contains a family portrait featuring two adults and a baby. The man has a large mustache and is smiling broadly, while the woman, who has blonde hair, is also smiling. The baby in the picture is crying and is dressed in a white outfit with a hood resembling rabbit ears. To the right of this central frame are three smaller frames, each containing images of babies. One baby is wearing a red hat with a pom-pom, another is dressed as a bumblebee, and the third is wearing a green hat with a pattern. Above the central frame is a calendar with the month 'November' visible, and to the left is a poster with text that reads 'Drills & Spills.' The overall atmosphere conveyed by the image is one of warmth and familial love, juxtaposed with the contrasting emotions of the crying baby.",
        "segmentation": true
    },
    "image_3": {
        "image_id": 3,
        "image_path": "./fusion_research/fusion_dataset/novel/Harry Potter and the Sorcerers Stone Illustrated Edition (J. K. Rowling, Jim Kay (Illustrator)) (1)/images/image_3.jpg",
        "caption": [],
        "footnote": [],
        "context": "Mr. Dursley was the director of a Łrm called Grunnings, which made drills. He was a big, beefy man with hardly any neck, although he did have a very large mustache. Mrs. Dursley was thin and blonde and had nearly twice the usual amount of neck, which came in very useful as she spent so r. and Mrs. Dursley, of number four, Privet Drive, were proud to say that they were perfectly normal, thank you very much. They were the last people you’d expect to be involved in anything strange or mysterious, because they just didn’t hold with such nonsense. HatyPotter ANDTEE SORCERER'SSTONE Two Ways to Read This book features art and animation speciŁcally designed to enhance this story. You can control your experience on compatible devices by using the Show Media option in the Aa menu. Haty Pott! AND THE SORCERER'S STO J.K. ROWLING ILLUSTRATED BY JIM KAY Pulermore from J.K. Rowling  for Jessica, who loves stories, for Anne, who loved them too, and for Di, who heard this one Łrst. J.K. Rowling  for Louise I went in search of str awberries, and found unfathomable love. Jim Kay  ",
        "chunk_order_index": 0,
        "chunk_id": "chunk-fb8e5b95ca964e204d9e59caeaf25f09",
        "description": "The image is an illustration from the book 'Harry Potter and the Sorcerer's Stone' by J.K. Rowling, illustrated by Jim Kay. It features a title card for Chapter One, titled 'The Boy Who Lived.' The illustration includes two characters: Mr. Dursley, who is depicted as a big, beefy man with a very large mustache and hardly any neck, and Mrs. Dursley, who is thin and blonde with nearly twice the usual amount of neck. Both characters appear to be in a state of shock or surprise, with their mouths open and eyes wide. In the foreground, there is a snow globe with a miniature house inside, labeled 'Privet Drive.' To the right, there is a postcard with an owl stamp and some text that is partially obscured. The overall atmosphere conveyed by the image is one of tension and surprise, fitting the context of the chapter where Harry Potter's arrival at the Dursleys' home is introduced.",
        "segmentation": true
    },
    "image_4": {
        "image_id": 4,
        "image_path": "./fusion_research/fusion_dataset/novel/Harry Potter and the Sorcerers Stone Illustrated Edition (J. K. Rowling, Jim Kay (Illustrator)) (1)/images/image_4.jpg",
        "caption": [],
        "footnote": [],
        "context": "early ten years had passed since the Dursleys had woken up to Łnd their nephew on the front step, but Privet Drive had hardly changed at all. The sun rose on the same tidy front gardens and lit up the brass number four on the Dursleys’ front door; it crept into their living room, which was almost exactly the same as it had been on the night when Mr. Dursley had seen that fateful news report about the owls. Only the photographs on the mantelpiece really showed how much time had passed. Ten years ago, there had been lots of waking up. One small hand closed on the letter beside him and he slept on, not knowing he was special, not knowing he was famous, not knowing he would be woken in a few hours’ time by Mrs. Dursley’s scream as she opened the front door to put out the milk bottles, nor that he would spend the next few weeks being prodded and pinched by his cousin Dudley....He couldn’t know that at this very moment, people meeting in secret all over the country were holding up their glasses and saying in hushed voices: “To Harry Potter—the boy who lived!” ",
        "chunk_order_index": 6,
        "chunk_id": "chunk-6d76f10fa63c18d601d74dd0adab4688",
        "description": "The image is an illustration featuring a vibrant chameleon with a mix of orange, yellow, and green colors. The chameleon is perched on a round sign that reads 'CHAPTER TWO THE VANISHING GLASS.' The background consists of lush, green foliage, giving the scene a tropical or jungle-like atmosphere. The chameleon's posture is relaxed, with its tail curled around the signpost. A small spider can be seen near the bottom right of the sign. The overall mood of the image is whimsical and adventurous, fitting the theme of a storybook or fantasy narrative.",
        "segmentation": true
    },
    "image_5": {
        "image_id": 5,
        "image_path": "./fusion_research/fusion_dataset/novel/Harry Potter and the Sorcerers Stone Illustrated Edition (J. K. Rowling, Jim Kay (Illustrator)) (1)/images/image_5.jpg",
        "caption": [],
        "footnote": [],
        "context": "Harry was glad school was over, but there was no escaping Dudley’s gang, who visited the house every single day. Piers, Dennis, Malcolm, and Gordon were all big and stupid, but as Dudley was the biggest he escape of the Brazilian boa constrictor earned Harry his longest-ever punishment. By the time he was allowed out of his cupboard again, the summer holidays had started and Dudley had already broken his new video camera, crashed his remote control airplane, and, Łrst time out on his racing bike, knocked down old Mrs. Figg as she crossed Privet Drive on her crutches. T anything. A wildlooking old woman dressed all in green had waved merrily at him once on a bus. A bald man in a very long purple coat had actually shaken his hand in the street the other day and then walked away without a word. The weirdest thing about all these people was the way they seemed to vanish the second Harry tried to get a closer look.  At school, Harry had no one. Everybody knew that Dudley’s gang hated that odd Harry Potter in his baggy old clothes and broken glasses, and nobody liked to disagree with Dudley’s gang. ",
        "chunk_order_index": 10,
        "chunk_id": "chunk-c0adf19ffbaf04196fe0e7bb8138b451",
        "description": "The image depicts a title page for Chapter Three of a book, titled 'The Letters From No One'. The title is prominently displayed in the center of the image on a piece of parchment held by two clawed hands. The background features a watercolor illustration of a dragon with a light blue and white color scheme. The dragon's claws are gripping the edges of the parchment, which has a slightly worn and aged appearance. The text on the parchment reads: 'CHAPTER THREE THE LETTERS FROM NO ONE'. The overall atmosphere of the image is whimsical and magical, suggesting a fantasy setting.",
        "segmentation": false
    },
    "image_6": {
        "image_id": 6,
        "image_path": "./fusion_research/fusion_dataset/novel/Harry Potter and the Sorcerers Stone Illustrated Edition (J. K. Rowling, Jim Kay (Illustrator)) (1)/images/image_6.jpg",
        "caption": [],
        "footnote": [],
        "context": "A giant of a man was standing in the doorway. His face was almost completely hidden by a The door was hit with such force that it swung clean oŀ its hinges and with a deafening crash landed łat on the łoor. SMASH! “Who’s there?” he shouted. “I warn you—I’m armed!” There was a pause. Then— There was a crash behind them and Uncle Vernon came skidding into the room. He was holding a riłe in his hands— now they knew what had been in the long, thin package he had brought with them. “Where’s the cannon?” he said stupidly.  Four minutes to go. Maybe the house in Privet Drive would be so full of letters when they got back that he’d be able to steal one somehow. Three minutes to go. Was that the sea, slapping hard on the rock like that? And (two minutes to go) what was that funny crunching noise? Was the rock crumbling into the sea? One minute to go and he’d be eleven. Thirty seconds...twenty...ten...nine—maybe he’d wake Dudley up, just to annoy him—three...two...one... BOOM. The whole shack shivered and Harry sat bolt upright, staring at the door. Someone was outside, knocking to come in. ",
        "chunk_order_index": 14,
        "chunk_id": "chunk-80e96499bc1d25513790a42d11402683",
        "description": "The image is an artistic illustration for Chapter Four titled 'The Keeper of the Keys' from a book. The central focus is on a large, ornate key with the title text inscribed on it. Surrounding this key are various other keys of different shapes and sizes, including one with a broomstick handle and another with a winged key design. The background is a mix of watercolor splashes in soft pastel colors, giving the image a whimsical and magical atmosphere. There is also a small figure of a troll or goblin-like creature peeking out from behind some keys, adding to the fantastical theme. The overall mood conveyed by the image is one of mystery and enchantment, fitting the theme of a magical story.",
        "segmentation": true
    },
    "image_7": {
        "image_id": 7,
        "image_path": "./fusion_research/fusion_dataset/novel/Harry Potter and the Sorcerers Stone Illustrated Edition (J. K. Rowling, Jim Kay (Illustrator)) (1)/images/image_7.jpg",
        "caption": [],
        "footnote": [],
        "context": "A giant of a man was standing in the doorway. His face was almost completely hidden by a The door was hit with such force that it swung clean oŀ its hinges and with a deafening crash landed łat on the łoor. SMASH! “Who’s there?” he shouted. “I warn you—I’m armed!” There was a pause. Then— There was a crash behind them and Uncle Vernon came skidding into the room. He was holding a riłe in his hands— now they knew what had been in the long, thin package he had brought with them. “Where’s the cannon?” he said stupidly. Four minutes to go. Maybe the house in Privet Drive would be so full of letters when they got back that he’d be able to steal one somehow. Three minutes to go. Was that the sea, slapping hard on the rock like that? And (two minutes to go) what was that funny crunching noise? Was the rock crumbling into the sea? One minute to go and he’d be eleven. Thirty seconds...twenty...ten...nine—maybe he’d wake Dudley up, just to annoy him—three...two...one... BOOM. The whole shack shivered and Harry sat bolt upright, staring at the door. Someone was outside, knocking to come in.  ",
        "chunk_order_index": 14,
        "chunk_id": "chunk-80e96499bc1d25513790a42d11402683",
        "description": "The image is a black and white graphic of the letter 'B' in a serif font. The letter 'B' is bold and occupies most of the frame. Below the letter 'B', there are smaller letters 'QDMT' arranged horizontally. The background is plain and does not contain any additional elements or details.",
        "segmentation": false
    },
    "image_8": {
        "image_id": 8,
        "image_path": "./fusion_research/fusion_dataset/novel/Harry Potter and the Sorcerers Stone Illustrated Edition (J. K. Rowling, Jim Kay (Illustrator)) (1)/images/image_8.jpg",
        "caption": [],
        "footnote": [],
        "context": "“All right,” Harry mumbled, “I’m getting Tap. Tap. Tap. had been such a good dream. And there’s Aunt Petunia knocking on the door, Harry thought, his heart sinking. But he still didn’t open his eyes. It There was suddenly a loud tapping noise. “It was a dream,” he told himself Łrmly. “I dreamed a giant called Hagrid came to tell me I was going to a school for wizards. When I open my eyes I’ll be at home in my cupboard.” arry woke early the next morning. Although he could tell it was daylight, he kept his eyes shut tight. meself but I—er—got expelled, ter tell yeh the truth. In me third year. They snapped me wand in half an’ everything. But Dumbledore let me stay on as gamekeeper. Great man, Dumbledore.” “Why were you expelled?” “It’s gettin’ late and we’ve got lots ter do tomorrow,” said Hagrid loudly. “Gotta get up ter town, get all yer books an’ that.” He took oŀ his thick black coat and threw it to Harry. “You can kip under that,” he said. “Don’ mind if it wriggles a bit, I think I still got a couple o’ dormice in one o’ the pockets.” ",
        "chunk_order_index": 19,
        "chunk_id": "chunk-a70c5caca846bf8cbc4fe9b74da6313b",
        "description": "The image is an illustration depicting a man with a bushy beard and long hair, lying on a blue and white striped sofa. He appears to be asleep or unconscious, with his mouth open and a relaxed expression. The man is wearing a green shirt and brown pants, and he has a large key hanging from his belt. A book titled 'Chapter Five: Diagon Alley' is prominently displayed in the foreground, suggesting a connection to the Harry Potter series. The background is minimalistic, focusing attention on the character and the book. The overall atmosphere conveys a sense of exhaustion or relief after a significant event.",
        "segmentation": true
    }
}