{
    "image_1": [
        {
            "merged_entity_name": "BERT",
            "entity_type": "ORGANIZATION",
            "description": "A deep learning model used for natural language processing tasks, including reading comprehension and as the basis for a single-hop QA model in the research on multi-hop reading comprehension.",
            "source_image_entities": [
                "BERT"
            ],
            "source_text_entities": [
                "BERT"
            ]
        },
        
        {
            "merged_entity_name": "Y_EMPTY",
            "entity_type": "CONCEPT",
            "description": "An output indicating whether the answer is empty or not, used in the single-paragraph BERT model to select the answer from the paragraph with the lowest score.",
            "source_image_entities": [
                "Y_EMPTY"
            ],
            "source_text_entities": [
                "YEMPTY"
            ]
        }
    ],
    "image_2": [
    ],
    "image_3": [
        {
            "entity_name": "RALPH HEFFERLINE",
            "entity_type": "PERSON",
            "description": "Ralph Hefferline is an example of a person used in a multi-hop question where the location of his position as a psychology professor is sought. He was a psychology professor at a university.",
            "source_image_entities": [
                "RALPH HEFFERLINE"
            ],
            "source_text_entities": [
                "RALPH HEFFERLINE"
            ]
        },
        {
            "entity_name": "KAISER VENTURES CORPORATION",
            "entity_type": "ORGANIZATION",
            "description": "An American company founded by an industrialist known as the father of modern American shipbuilding, referred to in the context of questions solvable using only part of the question.",
            "source_image_entities": [
                "KAISER VENTURES CORPORATION"
            ],
            "source_text_entities": [
                "KAISER VENTURES"
            ]
        }
    ],
    "image_4": [
    ],
    "image_5": [
    ],
    "image_6": [
    ],
    "image_7": [
        {
            "merged_entity_name": "BERT",
            "entity_type": "ORGANIZATION",
            "description": "A deep learning model used for natural language processing tasks, shown in the diagram as a central component that processes input data and generates outputs. It is also mentioned in the text as a model that receives a question and a single paragraph as input, merging them into a single sequence to be processed.",
            "source_image_entities": [
                "BERT"
            ],
            "source_text_entities": [
                "BERT"
            ]
        }
    ],
    "image_8": [
    ],   
    "image_9": [
    ]
}