{
    "chunk-b592d04d5ced8b96eebb6a344d84cdb1": [
        {
            "entity_name": "Bonobo (Pan paniscus)",
            "entity_type": "GEO",
            "description": "Bonobo, also known as 'Pan paniscus', is an endangered great ape whose habitat is protected by the Lomako Forest Reserve in the Democratic Republic of the Congo. It is formerly known as Pygmy Chimpanzee, Dwarf Chimpanzee, and Gracile Chimpanzee, and is part of the multi-hop reading comprehension research context.",
            "source_entities": [
                "BONOBO",
                "PAN PANISCUS"
            ]
        },
        {
            "entity_name": "Lomako Forest Reserve (R´eserve Naturelle Lomako Yokokala)",
            "entity_type": "GEO",
            "description": "The Lomako Forest Reserve, also known as R´eserve Naturelle Lomako Yokokala, is a geographical location established to protect the habitat of the Bonobo apes in the Democratic Republic of the Congo. It is mentioned in the context of multi-hop reading comprehension research.",
            "source_entities": [
                "LOMAKO FOREST RESERVE",
                "R´ESERVE NATURELLE LOMAKO YOKOKALA"
            ]
        }
    ],
    "chunk-641cd529de353090b26104297132f871": [
        {
            "entity_name": "TF-IDF SIMILARITY(BIGRAM TF-IDF SIMILARITY)",
            "entity_type": "CONCEPT",
            "description": "TF-IDF similarity is a method used to select spurious paragraphs in the Distractor Setting and to retrieve paragraphs in the Open-domain Setting of HOTPOTQA, also referred to as BIGRAM TF-IDF SIMILARITY in the context of paragraph retrieval.",
            "source_entities": [
                "TF-IDF SIMILARITY",
                "BIGRAM TF-IDF SIMILARITY"
            ]
        }
    ],
    "chunk-5e7ccf1d72e7b038983b2017f5d8ddb6": [
        {
            "entity_name": "R´eserve Naturelle du Grand Cul-de-Sac Marin (Guadeloupe Archipelago)",
            "entity_type": "ORGANIZATION",
            "description": "A marine protected area adjacent to the park and administered in conjunction with it, part of the Guadeloupe Archipelago biosphere reserve, which comprises protected areas in the Guadeloupe region.",
            "source_entities": [
                "\"R´ESERVE NATURELLE DU GRAND CUL-DE-SAC MARIN\"",
                "\"GUADELOUPE ARCHIPELAGO\""
            ]
        },
        {
            "entity_name": "La D´esirade National Nature Reserve (De´sirade Island)",
            "entity_type": "ORGANIZATION",
            "description": "A reserve in De´sirade Island in Guadeloupe, established for its special geological features, representing the geological heritage of the Caribbean tectonic plate, with an area of 62 ha.",
            "source_entities": [
                "\"LA D´ESIRADE NATIONAL NATURE RESERVE\"",
                "\"DE´SIRADE ISLAND\""
            ]
        }
    ]
}