{
  "chunk-c3c181b5c58c434b47cfecd1f212ca3e": {
    "tokens": 1200,
    "content": "VOL. CLXXII . . . . No. 59,820 © 2023  The New York Times Company NEW YORK, THURSDAY, JUNE 15, 2023  \n\n![](images/image_1.jpg)  \nUranium enrichment centrifuges at a European-owned plant in Ohio yield much less than the growing U.S. nuclear industry needs.  \n\n# Despite War, Paying Russia For Uranium  \n\n# By MAX BEARAK  \n\nPIKETON, Ohio — In a cavernous, Pentagon-size facility nestled in an Appalachian valley, thousands upon thousands of empty holes line the bare concrete floor. A mere 16 of them house the that enrich uranium, converting it into the key ingredient that fuels nuclear power plants. And for now, they are dormant.  \n\nBut if each hole housed a working centrifuge, the facility could get the United States out of a predicament that has implications both for the war in Ukraine and for America’s transition from burning fossil fuels. Today, American companies are paying around \\$1 billion a year to Russia’s state-owned nuclear agency to buy the fuel that generates more than half of the United States’ emissions-free energy.  \n\nIt is one of the most significant remaining flows of money from the United States to Russia, and it continues despite strenuous efforts among U.S. allies to sever economic ties with Moscow. The enriched uranium payments are made to subsidiaries of Rosatom, which in turn is closely intertwined with Russia’s military apparatus.  \n\nThe United States’ reliance on nuclear power is primed to grow as the country aims to decrease reliance on fossil fuels. But no American-owned  company  enriches uranium. The United States once dominated the market, until a swirl of historical factors, including an enriched-uranium-buying deal  between  Russia  and  the United States designed to promote Russia’s peaceful nuclear program after the Soviet Union’s collapse, enabled Russia to corner half the global market. The United States ceased enriching uranium entirely.  \n\nThe United States and Europe have largely stopped buying Russian fossil fuels as punishment for Continued on Page A11  \n\n# Trump’s Allies May Be Prosecution’s Witnesses  \n\nThis article is by Alan Feuer, Maggie Haberman and Glenn Thrush. Throughout the inquiry into former President Donald J. Trump’s handling of classified material, his insular world at Mar-a-Lago was rife with intrigue, anxiety and competing motives as investigators sought testimony and evidence from his some of his closest aides, advisers, lawyers and even members of his Secret Service detail.  \n\nNow, with Mr. Trump under federal indictment and with people who currently, or used to, work for him seen as potential prosecution witnesses, the pressure on those around him — both at Mar-a-Lago  \n\n# Court Puts Limits on Ex-President With His Inner Circle  \n\nin Florida and at his summer residence in Bedminster, N.J. — has only increased.  \n\nMr. Trump is in the position of waging a presidential campaign and preparing a defense at the same time. Complicating matters, he has been prohibited from discussing the latter with a number of people who could presumably help him with the former, some of whom are no doubt wondering who is saying what to the government as they go about their jobs. In court in Miami on Tuesday, the federal magistrate judge who handled Mr. Trump’s arraignment ordered the former president not to discuss the case with his co-defendant and personal aide, Walt Nauta, saying that any communications about it would have to go through their lawyers.  \n\nThe judge also made clear that he did not want Mr. Trump talking about the facts in his indictment with  any  potential  witnesses, leading prosecutors to agree to provide him and his lawyers with a further list of people with whom he would have to be careful in conContinued on Page A17  \n\n# ROBERT GOTTLIEB, 1931-2023  \n\n# Editor to a Who’s Who of 20th-Century Writers  \n\n# By ROBERT D. McFADDEN  \n\nRobert Gottlieb, an illustrious editor at Simon & Schuster, Alfred A. Knopf and The New Yorker whose deft touch shaped a bibliophile’s library of novels, nonfiction books and magazine articles by a pantheon  of  acclaimed  writers from the middle to the late 20th century, died on Wednesday in Manhattan. He was 92. The death, at a hospital, was confirmed  by  his  wife,  Maria  \n\nMr. Gottlieb edited novels by, among  many  others,  John  le Carré, Toni Morrison, John Cheever, Joseph Heller, Doris Lessing and Chaim Potok; science fiction by  Michael  Crichton  and  Ray Bradbury; histories by Antonia Fraser and Barbara Tuchman; memoirs by former President Bill Clinton and Katharine Graham, the former publisher of The Washington Post; and works by Jessica Mitford and Anthony Burgess. For three decades at the publishing houses Simon & Schuster and Knopf, he turned hundreds of manuscripts  into  well-received books, many of which sold millions of copies, won awards and  \n\n![](images/image_2.jpg)  \n\nRobert Gottlieb guided authors like John le Carré during his career at Simon & Schuster, Alfred A. Knopf and The New Yorker.  \n\nmade authors wealthy and famous. Colleagues called him incisive  but  sensitive  to  writers’ eggshell egos. His skills won him a loyal following of authors, and he became Knopf’s president as well as editor in chief. Then, in 1987, in an abrupt career change from the relative anonymity and serenity of book publishing, Mr. Gottlieb was named the third editor in the 62-year history of The New Yorker, one of American  journalism’s  highestprofile jobs. He replaced William Shawn, the magazine’s legendary editor",
    "chunk_order_index": 0,
    "full_doc_id": "doc-8be1385371c5fc3848fc1044dbffef21"
  },
  "chunk-7ee79e0e87eb2dbb3ee85b4d72874a6b": {
    "tokens": 1200,
    "content": "but  sensitive  to  writers’ eggshell egos. His skills won him a loyal following of authors, and he became Knopf’s president as well as editor in chief. Then, in 1987, in an abrupt career change from the relative anonymity and serenity of book publishing, Mr. Gottlieb was named the third editor in the 62-year history of The New Yorker, one of American  journalism’s  highestprofile jobs. He replaced William Shawn, the magazine’s legendary editor for 35 years, who had succeeded the founding editor, Harold Ross.  \n\nThe appointment by S.I. Newhouse Jr., whose family owned Continued on Page A21  \n\n# Judge’s Record In Trump Case Raises Concern  \n\nA Lack of Experience in Criminal Trials  \n\n# IN BID FOR TIME, FED ENDS STRING OF RAISING RATES  \n\nHALT ONLY TEMPORARY  \n\n# By MICHAEL S. SCHMIDT and CHARLIE SAVAGE  \n\nAileen M. Cannon, the Federal District Court judge assigned to preside  over  former  President Donald J. Trump’s classified documents case, has scant experience running  criminal  trials,  calling into  question  her  readiness  to handle what is likely to be an extraordinarily complex and highprofile courtroom clash.  \n\nJudge Cannon, 42, has been on the bench since November 2020, when Mr. Trump gave her a lifetime appointment shortly after he lost re-election. She had not previously served as any kind of judge, and because about 98 percent of federal  criminal  cases  are  resolved with plea deals, she has had only a limited opportunity to learn how to preside over a trial. A  Bloomberg  Law  database lists 224 criminal cases that have been assigned to her, and a New York Times review of those cases identified four that went to trial. Each was a relatively routine matter, like a felon who was charged with illegally possessing a gun. In all, the four cases added up to 14 trial days.  \n\nJudge Cannon’s suitability to handle such a high-stakes and high-profile case has already attracted scrutiny amid widespread perceptions that she demonstrated bias in the former president’s favor last year, when she oversaw a long-shot lawsuit filed by Mr. Trump  challenging  the  F.B.I.’s court-approved search of his Florida home and club, Mar-a-Lago. In that case, she shocked legal experts across the ideological divide by disrupting the investigation — including suggesting that Mr. Trump gets special protections as a former president that any other target of a search warrant would not receive — before a conservative appeals court shut her down, ruling that she never had legitimate legal authority to intervene.  \n\n“She’s both an inexperienced judge and a judge who has previously indicated that she thinks the former president is subject to special rules so who knows what she will do with those issues?” said Julie O’Sullivan, a Georgetown University criminal law professor and former federal prosecutor. Continued on Page A16  \n\nPausing to Assess Effects of Prior Moves to Ease Stubborn Inflation  \n\n# By JEANNA SMIALEK  \n\nFederal Reserve officials left interest  rates  unchanged  on Wednesday, skipping an increase after raising rates 10 times in a row since March 2022. Still, policymakers  predicted  that  they might need to raise rates two more times this year as inflation, while moderating, remains stubborn.  \n\nFed  officials,  in  their  policy statement, said that they were giving themselves time to assess how the economy was reacting to what has been a rapid campaign to slow demand and wrestle fast inflation under control. The central bank had already raised rates to a range of 5 to 5.25 percent over a little more than a year. But  policymakers  also  predicted in their economic forecasts  \n\n# Federal Funds Target Rate  \n\n![](images/image_3.jpg)  \n\nSource: Federal Reserve | Note: The rate since December 2008 is the upper limit of the federal funds target range.  \n\nthat  they  might  raise  interest rates even further — to 5.6 percent by the end of 2023. That would amount to two more quarter-point rate increases over the course of the Fed’s four remaining meetings this year. The projections sent a clear signal that Fed officials are increasingly worried about inflation’s staying power and will need to do more to cool growth and bring price increases under control.  \n\n“The process of getting inflation down is going to be a gradual one Continued on Page A14  \n\n# U.S. and Iran Quietly Discussing A Deal to Ease Nuclear Tensions  \n\nThis article is by Michael Crowley, Farnaz Fassihi and  Ronen Bergman.  \n\nWASHINGTON — The Biden administration has been negotiating  quietly  with  Iran  to  limit Tehran’s  nuclear  program  and free imprisoned Americans, according  to  officials  from  three countries, in part of a larger U.S. effort to ease tensions and reduce the risk of a military confrontation with the Islamic Republic.  \n\nThe U.S. goal is to reach an informal,  unwritten  agreement, which some Iranian officials are calling a “political cease-fire.” It would aim to prevent further escalation in a long-hostile relationship that has grown even more fraught as Iran builds up a stockpile of highly enriched uranium close to bomb-grade purity, supplies Russia with drones for use in Ukraine and brutally cracks down on domestic political protests. The broad outlines of the talks were confirmed by three senior Israeli officials, an Iranian official and a U.S. official. American officials would not discuss efforts to win the release of prisoners in detail, beyond calling that an urgent U.S. priority.  \n\nThe indirect talks, some occurring this spring in the Gulf Arab state of Oman, reflect a resumption of diplomacy between the United States and Iran after the Continued on Page A8  \n\n![](images/image_4.jpg)",
    "chunk_order_index": 1,
    "full_doc_id": "doc-8be1385371c5fc3848fc1044dbffef21"
  },
  "chunk-6b02ccb5b162ba5966ff1a00ecf2952e": {
    "tokens": 495,
    "content": "on domestic political protests. The broad outlines of the talks were confirmed by three senior Israeli officials, an Iranian official and a U.S. official. American officials would not discuss efforts to win the release of prisoners in detail, beyond calling that an urgent U.S. priority.  \n\nThe indirect talks, some occurring this spring in the Gulf Arab state of Oman, reflect a resumption of diplomacy between the United States and Iran after the Continued on Page A8  \n\n![](images/image_4.jpg)  \n\n# INTERNATIONAL A4-12  \n\n# Rerouting Food Scraps  \n\nSouth Korea has a national program to cut emissions and process its food waste into fuel, feed and fertilizer. Other countries are taking note. PAGE A4 Pushback on U.S. Aid to Kyiv Spending caps set by the debt limit bill have empowered critics of U.S. aid to Ukraine, bringing into question future assistance for Kyiv. PAGE A10  \n\nSPORTS B6-10  \n\nGolden Knights, Silver Chalice Many people wondered how hockey would play in Las Vegas, but the Golden Knights immediately became the toast of the town. Six years later, they’re also Stanley Cup champs. PAGE B7  \n\n# NATIONAL A13-19  \n\n# Shutting Women Out  \n\nDelegates to the annual meeting of the Southern Baptist Convention voted that “only men” can be any kind of pastor or elder in its churches. PAGE A15 Beautiful Tunes From a Sewer New Yorkers gathered on the shores of the East River to hear floating musicians taking advantage of the unique acoustics of a drainage tunnel. PAGE A13  \n\n# BUSINESS B1-5  \n\nAmazon Union Bid Stalls Over 700 workers in Coventry, England, wanted to start the first recognized Amazon union in Britain. But amid accusations of “dirty tricks,” the application was pulled back. PAGE B1 ARTS C1-8 Such an Amiable Presence For years, Pat Sajak, the soon-to-retire “Wheel of Fortune” host, was, well, just there, James Poniewozik says.  PAGE C1 Fashion’s Reluctant Star Eli Russell Linnetz has worked with Ye, Gaga, Dior and Comme des Garçons. But what makes him so much in demand in the world of style? PAGE D5  \n\n![](images/image_5.jpg)  \n\n![](images/image_6.jpg)  \nOPINION A22-23 Gail Collins  \n\nPAGE A23  \n\n![](images/image_7.jpg)",
    "chunk_order_index": 2,
    "full_doc_id": "doc-8be1385371c5fc3848fc1044dbffef21"
  }
}