{
    "image_1": [
        {
            "merged_entity_name": "LAKE POWELL",
            "entity_type": "GEO",
            "description": "Lake Powell is a large body of water with a dark blue color, nestled within a vast desert landscape on the Arizona-Utah border. The lake, which is a reservoir on the Colorado River, is surrounded by rugged, sandstone cliffs that have been eroded into unique formations and is currently facing a crisis with water levels at 28 percent of total capacity due to the river's diminished flow and increased demand.",
            "source_image_entities": [
                "LAKE POWELL"
            ],
            "source_text_entities": [
                "LAKE POWELL"
            ]
        },
        {
            "merged_entity_name": "CLIFFS",
            "entity_type": "GEO",
            "description": "The rugged, sandstone cliffs with varying shades of orange and brown surround Lake Powell and have been shaped by erosion over time, adding to the unique landscape of the area.",
            "source_image_entities": [
                "CLIFFS"
            ],
            "source_text_entities": [
                "LAKE POWELL"
            ]
        },
        {
            "merged_entity_name": "DESERT LANDSCAPE",
            "entity_type": "GEO",
            "description": "The expansive desert landscape, mostly barren with sparse vegetation, is characterized by a flat horizon in the distance and is part of the region affected by the water crisis in the Colorado River, which includes Lake Powell.",
            "source_image_entities": [
                "DESERT LANDSCAPE"
            ],
            "source_text_entities": [
                "LAKE POWELL"
            ]
        }
    ],
    "image_2": [
        {
            "merged_entity_name": "LAKE POWELL",
            "entity_type": "GEO",
            "description": "Lake Powell is a reservoir on the Colorado River, located on the Arizona-Utah border, with water levels at 28 percent of total capacity. It is one of the two immense reservoirs, along with Lake Mead, that are facing a crisis due to low water levels and drought, affecting the water supply to 40 million people in the United States and Mexico and billions of dollars of agricultural production across the region.",
            "source_image_entities": [
                "BUILDING"
            ],
            "source_text_entities": [
                "LAKE POWELL"
            ]
        }
    ],
    "image_3": [
        {
            "merged_entity_name": "GLASS DOOR",
            "entity_type": "GEO",
            "description": "A clear glass door with a metal frame, part of a building entrance, as mentioned in the context of the article discussing various events and topics.",
            "source_image_entities": [
                "GLASS DOOR"
            ],
            "source_text_entities": [
                "WASHINGTON"
            ]
        }
    ],
    "image_4": [
        {
            "merged_entity_name": "MAN",
            "entity_type": "PERSON",
            "description": "A man with a bald head, wearing a light blue shirt and a watch on his left wrist. He is holding a pair of tweezers in his right hand and appears to be examining or sorting small, shiny objects on a table.",
            "source_image_entities": [
                "MAN"
            ],
            "source_text_entities": []
        },
        {
            "merged_entity_name": "TWEEZERS",
            "entity_type": "OBJECT",
            "description": "A pair of metal tweezers held by the man's right hand.",
            "source_image_entities": [
                "TWEEZERS"
            ],
            "source_text_entities": []
        },
        {
            "merged_entity_name": "SHINY OBJECTS",
            "entity_type": "OBJECT",
            "description": "Small, reflective objects scattered on the table in front of the man.",
            "source_image_entities": [
                "SHINY OBJECTS"
            ],
            "source_text_entities": []
        },
        {
            "merged_entity_name": "TABLE",
            "entity_type": "GEO",
            "description": "A flat surface on which the man is working, covered with shiny objects.",
            "source_image_entities": [
                "TABLE"
            ],
            "source_text_entities": []
        }
    ],
    "image_5": [
        {
            "entity_name": "Tacos and Taquiza",
            "entity_type": "FOOD",
            "description": "Tacos, as described in the image, are two with shredded meat, salsa, and lime wedges on a white plate. Taquiza, mentioned in the text, is an event for an end-of-summer party where guests can make their own tacos from a spread of ingredients.",
            "source_image_entities": [
                "TACOS"
            ],
            "source_text_entities": [
                "TAQUIZA"
            ]
        },
        {
            "entity_name": "Salsa",
            "entity_type": "FOOD",
            "description": "Salsa is red and is presented in a small bowl next to the tacos in the image. It is also an ingredient in the Taquiza event, where guests make their own tacos from a spread of ingredients, including salsa.",
            "source_image_entities": [
                "SALSA"
            ],
            "source_text_entities": [
                "TAQUIZA"
            ]
        },
        {
            "entity_name": "Lime Wedges",
            "entity_type": "FOOD",
            "description": "Lime wedges are green and are placed on a white plate in the image. They are also an ingredient in the Taquiza event, where guests make their own tacos from a spread of ingredients, including lime wedges.",
            "source_image_entities": [
                "LIME WEDGES"
            ],
            "source_text_entities": [
                "TAQUIZA"
            ]
        }
    ],
    "image_6": [
        {
            "merged_entity_name": "Sabrina Ionescu",
            "entity_type": "PERSON",
            "description": "Sabrina Ionescu is a player relied upon by the Liberty in the W.N.B.A. playoffs, having a breakout season in her third year, and is recognized as Player 1 from image_6.",
            "source_image_entities": [
                "PLAYER 1"
            ],
            "source_text_entities": [
                "SABRINA IONESCU"
            ]
        },
        {
            "merged_entity_name": "W.N.B.A. Playoffs",
            "entity_type": "EVENT",
            "description": "The W.N.B.A. playoffs is an event where the Liberty team is relying on Sabrina Ionescu for a strong performance in her third year, and is also related to Player 2 from image_6.",
            "source_image_entities": [
                "PLAYER 2"
            ],
            "source_text_entities": [
                "W.N.B.A. PLAYOFFS"
            ]
        }
    ]
}