{
  "chunk-97ca427fd8ebfd82af396a959a2e1da7": {
    "tokens": 1200,
    "content": "\"All the News That's Fit to Print\"  \n\n# Che New ork Cimes  \n\nTHE WEATHER Today, cloudy, snow and rain arriving late, high 38. Tonight, snow and rain, low 34. Tomorrow, snow tapers off, total accumulation 1 to 3 inches, high 36. Weather map, Page B10.  \n\nVOL. CLXXIII . . . . No. 60,025 © 2024  The New York Times Company SATURDAY, JANUARY 6, 2024  \n\n# Justices to Rule On Ballot Case Barring Trump  \n\nCourt in Colorado Had Disqualified Him  \n\n# By ADAM LIPTAK  \n\nWASHINGTON  —  The  Supreme Court agreed on Friday to decide whether former President Donald J. Trump is eligible for Colorado’s Republican primary ballot, thrusting the justices into a pivotal role that could alter the course of this year’s presidential election.  \n\nThe sweep of the court’s ruling is likely to be broad. It will probably resolve not only whether Mr. Trump may appear on the Colorado primary ballot after the state’s top court declared that he had engaged in insurrection in his efforts to subvert the 2020 election, but it will most likely also determine his eligibility to run in the general election and to hold office at all.  \n\nNot since Bush v. Gore, the 2000 decision that handed the presidency to George W. Bush, has the Supreme Court taken such a central role in an election for the nation’s highest office.  \n\nThe case will be argued on Feb. 8, and the court will probably decide it quickly. The Colorado Republican Party had urged the justices to rule by March 5, when many states, including Colorado, hold primaries.  \n\nThe number of challenges to Mr. Trump’s eligibility across the country can only have added presDonald J. Trump in August.  \n\n![](images/image_1.jpg)  \n\nsure on the court to hear the Colorado case, as they underscored the need for a nationwide resolution of the question.  \n\nThe case is one of several involving or affecting Mr. Trump on the court’s docket or on the horizon. An appeals court will hear arguments on Tuesday on whether he has absolute immunity from prosecution, and the losing side is all but certain to appeal. And the Continued on Page A14  \n\nBIDEN ON ATTACK The president said that Donald J. Trump was “trying to steal history.” PAGE A11 TESTING TRUMP’S CLAIM A threejudge panel will weigh in on presidents and immunity. PAGE A12  \n\n![](images/image_2.jpg)  \n\n# Heavy Rains Pelt Europe  \n\nA submerged playground Friday in Buckhurst Hill, northeast of London. Flooding also occurred in regions of France and Germany.  \n\n# As Trial Nears, N.R.A. Leader Plans to Resign  \n\n# By DANNY HAKIM  \n\nOn the eve of a legal battle in New York, Wayne LaPierre told board members on Friday that he would step down as the longtime chief of the National Rifle Association.  \n\nMr. LaPierre, 74, has led the N.R.A., once one of the nation’s most prominent lobbying organizations, for more than three decades. But his resignation came as he faced his gravest challenge yet, a corruption trial in Manhattan amid a legal showdown with New York’s attorney general, Letitia James.  \n\nJury selection has already begun, and Mr. LaPierre has been in the  courtroom  for  some  of  it. Opening arguments were scheduled for early next week. Mr.  LaPierre’s  resignation, which is effective on Jan. 31, did not stem from a deal with the attorney general’s office, and Ms. James said on Friday that she expected the trial to go forward. Mr. LaPierre’s longtime spokesman, Andrew Arulanandam, will become the N.R.A.’s interim chief executive.  The  development  was first reported by The Wall Street Journal.  \n\n“With pride in all that we have accomplished, I am announcing my resignation from the N.R.A.,” Mr. LaPierre said in a statement. Continued on Page A16  \n\n# Biden Squeezed by Both Sides on Immigration  \n\n# By MICHAEL D. SHEAR and MIRIAM JORDAN  \n\nWASHINGTON — President Biden is under growing pressure to curb record numbers of migrants crossing into the United States — not just from the usual Republican critics, but also from Democratic mayors and governors in cities thousands of miles from the border.  \n\n# Feeling Pressure From Democratic Mayors  \n\nfew years ago. In Denver, more than 36,000 migrants  have  arrived  in  recent months, with 4,100 still in city shelters, and more are arriving daily. In Boston, migrants have camped out at the airport. In New York, more than 164,500 migrants have poured into shelters since April 2022, with many still living in one of the 215 hotels, converted office buildings or tent camps set up to accommodate them. “It’s both a humanitarian and fiscal crisis,” said Mike Johnston, the Democratic mayor of Denver. Continued on Page A10  \n\nWhat used to be a clear-cut, ideological fight between Democrats and Republicans has become a bipartisan demand for action, and some of the most intense pressure on Mr. Biden is coming from places like Boston, Denver, Chicago and New York, where leaders in the president’s own party are issuing cries for help. Publicly, the Democratic politicians have described mounting crises in their cities. Privately, they are in almost daily contact with Tom Perez, director of the White House Office of Intergovernmental Affairs, and other administration  officials.  For  the most part, they are not calling for the kind of severe border restrictions that Republicans are demanding, but they want help with overflowing  migrant  encampments",
    "chunk_order_index": 0,
    "full_doc_id": "doc-7334e9a3f6d15c2b20a7fbd75a19baa8"
  },
  "chunk-aa1d2a93ea4e43412f301f5e83efbd0a": {
    "tokens": 1200,
    "content": ", Chicago and New York, where leaders in the president’s own party are issuing cries for help. Publicly, the Democratic politicians have described mounting crises in their cities. Privately, they are in almost daily contact with Tom Perez, director of the White House Office of Intergovernmental Affairs, and other administration  officials.  For  the most part, they are not calling for the kind of severe border restrictions that Republicans are demanding, but they want help with overflowing  migrant  encampments,  packed  shelters  and busted budgets.  \n\nThe  intraparty  pressure  has turned the politics of immigration upside down at the beginning of a campaign year. And it has increased the likelihood that Mr. Biden and Democratic lawmakers will approve immigration concessions to Republicans that would  \n\n![](images/image_3.jpg)  \nThis child’s family was stopped Wednesday in Eagle Pass, Texas.  \n\n# F.D.A. OPENS DOOR TO IMPORT DRUGS MADE IN CANADA  \n\nFLORIDA TO BUY IN BULK  \n\nBid to Rein In U.S. Prices Unsettles Big Pharma, and Canadians  \n\n# By CHRISTINA JEWETT and SHERYL GAY STOLBERG  \n\nThe Food and Drug Administration has allowed Florida to import millions of dollars worth of medications from Canada at far lower prices than in the United States, overriding fierce decades-long objections from the pharmaceutical industry.  \n\nThe approval, issued in a letter to Florida on Friday, is a major policy shift for the United States, and supporters hope it will be a significant step forward in the long and largely unsuccessful effort to rein in drug prices. Individuals in the United States are allowed to buy directly from Canadian pharmacies, but states have long wanted to be able to purchase medicines in bulk for their Medicaid programs, government clinics and prisons from Canadian wholesalers.  \n\nFlorida has estimated that it could save up to \\$150 million in its first year of the program, importing medicines that treat H.I.V., AIDS, diabetes, hepatitis C and psychiatric  conditions.  Other states have applied to the F.D.A. to set up similar programs.  \n\nBut significant hurdles remain. Some drug manufacturers have agreements with Canadian wholesalers not to export their medicines, and the Canadian government has already taken steps to block the export of prescription drugs that are in short supply.  \n\n“Canada’s drug supply is too small to meet the demands of both American  and  Canadian  consumers,”  Maryse  Durette,  a spokeswoman for Health Canada, wrote in an email message. “Bulk importation will not provide an effective solution to the problem of high drug prices in the U.S.”  \n\nThe pharmaceutical industry’s major lobbying organization, the Pharmaceutical  Research  and Manufacturers  of  America,  or PhRMA, which has sued over previous importation efforts, is expected to file suit to block the Florida plan. In a statement Friday morning,  PhRMA  called  the F.D.A.’s decision “reckless” and warned that it was “considering all options” to prevent it from taking effect.  \n\nCongress passed a law allowing drug  importation  two  decades ago, but federal health officials delayed implementing it for years, citing safety concerns, one of the main arguments drug companies have used against it. In 2020, Continued on Page A15  \n\n![](images/image_4.jpg)  \nGalaxies in their infancy, as captured by the James Webb Space Telescope, appear to be elongated.  \n\n# The Early Universe May Have Gone Bananas  \n\n# By DENNIS OVERBYE  \n\nWhat does a newborn galaxy look like?  \n\nFor the longest time, many astrophysicists  and  cosmologists have assumed that newborn galaxies would look like the orbs and spidery discs familiar in the modern universe.  \n\nBut according to an analysis of new images from the James Webb Space Telescope, baby galaxies  \n\n# Images Defy Theory on Newborn Galaxies  \n\nwere neither eggs nor discs. They were bananas. Or pickles, or cigars, or surfboards — choose your own metaphor. That is the tentative conclusion of a team of astronomers who re-examined images of some 4,000 newborn gal  \n\n# axies observed by Webb at the dawn of time.  \n\n“This is both a surprising and unexpected result, though there were already hints of it with Hubble,” said Viraj Pandya, a postdoctoral fellow at Columbia University, referring to the Hubble Space Telescope. He is the lead author of a paper soon to be published in the Astrophysical Journal under the provocative title “Galaxies Going Continued on Page A15  \n\n# Pulitzer Winner Led The Times Through Growth  \n\nJoseph Lelyveld, a former executive editor and foreign correspondent  for  The  New  York Times, who won the 1986 Pulitzer Prize for nonfiction for his book “Move Your Shadow: South Africa, Black and White,” died on Friday at his home in Manhattan. He was 86.  \n\nThe cause was complications of Parkinson’s disease, said Janny Scott, his partner of 19 years and a former Times reporter.  \n\nCerebral and introspective, Mr. Lelyveld was one of the most respected journalists in America for nearly four decades, a globe-trotting  adventurer  who  reported from Washington, Congo, India, Hong Kong, Johannesburg and  \n\n![](images/image_5.jpg)  \n\n# Joseph Lelyveld  \n\nLondon, winning acclaim for his prolific and perceptive articles. Coming home, he rose up The Times’s editorial pyramid to its pinnacle,  the  executive  editorship, arguably the most powerful post in American journalism. In his seven years at the helm, from 1994 to 2001, The Times climbed to record levels of revenue and profits, expanded its national and international  readerships,  introduced color photographs to the front page, created new sections,",
    "chunk_order_index": 1,
    "full_doc_id": "doc-7334e9a3f6d15c2b20a7fbd75a19baa8"
  },
  "chunk-ba204505f86c95de41c93f01fb0052c5": {
    "tokens": 652,
    "content": "# Joseph Lelyveld  \n\nLondon, winning acclaim for his prolific and perceptive articles. Coming home, he rose up The Times’s editorial pyramid to its pinnacle,  the  executive  editorship, arguably the most powerful post in American journalism. In his seven years at the helm, from 1994 to 2001, The Times climbed to record levels of revenue and profits, expanded its national and international  readerships,  introduced color photographs to the front page, created new sections, and ushered in the digital age with a Times website and round-theclock news operations.  \n\nMr. Lelyveld presided over one of the world’s largest and most influential news organizations — with 1,200 reporters and editors in New York, Washington and an archipelago of 16 regional, 11 national and 26 foreign bureaus — all the while taking strides to diversify the staff’s racial and gender Continued on Page A20  \n\n# OBITUARIES A17, 20  \n\n# NATIONAL A9-16  \n\n# BUSINESS B1-5  \n\n# ARTS C1-6  \n\n# SPORTS B6-9  \n\nJazz Missionary and Professor Willie Ruff, a master of the French horn, toured the world and taught music at Yale. He was 92. PAGE A17 Actress in ‘Mary Poppins’ In a more-than-60-year career, Glynis Johns also won a Tony for $^{\\ast}\\mathrm{A}$ Little Night Music.” She was 100. PAGE A17 Targeting Higher Education With two prominent university presidents resigning, House Republicans are planning an expansive inquiry into academia in America. PAGE A11 Strict Abortion Rule Upheld The Supreme Court reinstated Idaho’s statute, but it also agreed to hear an appeal of the case. PAGE A14 INTERNATIONAL A4-8 Planning Britain’s Vote Prime Minister Rishi Sunak signaled that citizens will go to the polls in the fall, mirroring the U.S. election. PAGE A5  \n\n![](images/image_6.jpg)  \n\n# China Cashing In on War  \n\nThe war in Ukraine has led Russia to switch from the West to Beijing for the purchases of everything from cars to computer chips. PAGE B1 Apple Antitrust Suit Is Likely A Justice Department investigation is taking aim at the company’s tactics to guard the iPhone’s dominance. PAGE B1 THIS WEEKEND Hesitantly Going Hollywood For Lily Gladstone, awards attention has taken some adjustment. A special edition on the Oscars in Arts & Leisure.  \n\nA Bounce House Divided Nile Harris’s play “This House Is Not a Home” uses an unconventional set to convey American divisions. PAGE C1 Cinema’s Fake Noses, Rated Bradley Cooper’s “Maestro” sniffer inspires a look back. Below, Steve Martin in “Roxanne.” PAGE C5  \n\n![](images/image_7.jpg)  \n\n# Paths to N.F.L. Playoffs  \n\nThere are 11 teams in the running for five spots. Here is how Week 18 results will affect their chances. PAGES B8-9 A Case for Pasadena College football could build some familiarity by having the Rose Bowl determine the champion each year.  PAGE B7 \"354613",
    "chunk_order_index": 2,
    "full_doc_id": "doc-7334e9a3f6d15c2b20a7fbd75a19baa8"
  }
}