{
    "chunk-af7e26a7374b68f94f07bbc33b1e514e": [
        {
            "entity_name": "Russia (Russian Federation, Moscow)",
            "entity_type": "GEO",
            "description": "Russia, also known as the Russian Federation, is highlighted in the NATO mission statement for its attempts to undercut the rules-based international order alongside China. Moscow, its capital, is named by NATO as the primary adversary due to recent aggressive actions, including the invasion of Ukraine.",
            "source_entities": [
                "RUSSIAN FEDERATION",
                "MOSCOW",
                "RUSSIA"
            ]
        },
        {
            "entity_name": "China (Beijing, People’s Republic of China)",
            "entity_type": "GEO",
            "description": "China, also known as Beijing and the People’s Republic of China, is identified as a strategic 'challenge' by NATO due to its deepening partnership with Russia. This partnership challenges the international order and has led to NATO redefining its strategic focus.",
            "source_entities": [
                "CHINA",
                "BEIJING",
                "PEOPLE’S REPUBLIC OF CHINA"
            ]
        },
        {
            "entity_name": "United States (Washington)",
            "entity_type": "GEO",
            "description": "The United States, represented by Washington, is involved in NATO's decisions and is taking steps to deploy forces in response to Russia's actions and NATO's redefined mission. This includes the deployment of an Army garrison headquarters and a field support battalion in Poland.",
            "source_entities": [
                "WASHINGTON",
                "UNITED STATES"
            ]
        }
    ],
    "chunk-56696889ce13522c71485b671e1a26e2": [
        
        {
            "entity_name": "Medication Abortion in Brazil",
            "entity_type": "EVENT",
            "description": "An event that Xaiana underwent at home with her boyfriend, using unmarked white pills, fearing prosecution due to the illegality of abortion in Brazil, which carries a penalty of up to three years in jail.",
            "source_entities": [
                "MEDICATION ABORTION",
                "ABORTION IN BRAZIL"
            ]
        }
    ]
}