{
    "image_1": "[\n    {\n        \"merged_entity_name\": \"Liz Truss\",\n        \"entity_type\": \"PERSON\",\n        \"description\": \"Liz Truss is a British politician who has been chosen to replace Prime Minister Boris Johnson, leading a country in economic crisis. She is set to become Prime Minister of the United Kingdom, facing significant economic and political challenges. She will be formally anointed by Queen Elizabeth II at Balmoral Castle in Scotland.\",\n        \"source_image_entities\": [\"WOMAN\"],\n        \"source_text_entities\": [\"LIZ TRUSS\"]\n    }\n]",
    "image_2": [
        {
            "merged_entity_name": "BEAVER",
            "entity_type": "ANIMAL",
            "description": "Beavers, also known as 'beaver believers', are seen as helpers and furry weapons of climate resilience in Nevada. They are wild, swimming rodents that build dams and ponds, which help with water management, reducing the impact of droughts and floods. Beavers' landscape-altering activities disrupt agriculture but also provide benefits such as maintaining water supply for cattle during droughts, slowing the torrent of water during heavy rains, protecting hay crops, and creating wetlands that clean water, birth new meadows, and create a buffer against wildfires.",
            "source_image_entities": [
                "BEAVER"
            ],
            "source_text_entities": [
                "BEAVERS",
                "BEAVER POOLS",
                "BEAVER DAMS",
                "WETLANDS"
            ]
        },
        {
            "merged_entity_name": "COTTONWOOD RANCH",
            "entity_type": "GEO",
            "description": "Cottonwood Ranch is a property in northeastern Nevada owned by the Smith family. Horace Smith, the previous owner, had issues with beaver dams causing flooding and drying of parts of his property, leading him to blow up the dams. However, his son Agee Smith, who took over the ranch, made peace with the beavers and recognized their benefits for the land, such as water management and creating wetlands that help with climate resilience.",
            "source_image_entities": [],
            "source_text_entities": [
                "COTTONWOOD RANCH",
                "HORACE SMITH",
                "AGEE SMITH"
            ]
        },
        {
            "merged_entity_name": "WATER",
            "entity_type": "GEO",
            "description": "Water is a critical resource in northeastern Nevada, especially for properties like Cottonwood Ranch. Beavers' dams and ponds help manage water supply, which is crucial during droughts and heavy rains. These beaver-altered landscapes maintain water for cattle, slow the torrent of water during heavy rains, and clean water in the created wetlands.",
            "source_image_entities": [
                "WATER"
            ],
            "source_text_entities": [
                "BEAVER POOLS",
                "WETLANDS"
            ]
        },
        {
            "merged_entity_name": "REEDS",
            "entity_type": "PLANT",
            "description": "Reeds are tall green plants growing at the edge of water bodies, providing a natural habitat for various species and contributing to the overall ecosystem health. They are part of the landscape that beavers interact with, as beavers' activities can influence the surrounding vegetation and water systems.",
            "source_image_entities": [
                "REEDS"
            ],
            "source_text_entities": []
        }
    ],
    "image_3": [
        {
            "merged_entity_name": "STREET PARADE",
            "entity_type": "EVENT",
            "description": "A festive event taking place on a city street, with a crowd of spectators watching the performance, known as West Indian revelry which returned to Brooklyn after two years of scaled-back celebrations due to Covid-19.",
            "source_image_entities": [
                "STREET PARADE"
            ],
            "source_text_entities": [
                "WEST INDIAN REVELRY"
            ]
        },
        {
            "merged_entity_name": "DANCERS",
            "entity_type": "PERSON",
            "description": "A group of women dressed in colorful costumes with yellow and orange skirts, performing a dance routine on the street as part of the West Indian revelry.",
            "source_image_entities": [
                "DANCERS"
            ],
            "source_text_entities": [
                "WEST INDIAN REVELRY"
            ]
        },
        {
            "merged_entity_name": "COSTUMES",
            "entity_type": "OBJECT",
            "description": "Colorful outfits worn by the dancers, featuring yellow and orange skirts and headpieces, as part of their performance in the West Indian revelry.",
            "source_image_entities": [
                "COSTUMES"
            ],
            "source_text_entities": [
                "WEST INDIAN REVELRY"
            ]
        },
        {
            "merged_entity_name": "SPECTATORS",
            "entity_type": "PERSON",
            "description": "People standing behind barriers, watching the dancers perform as part of the West Indian revelry in Brooklyn.",
            "source_image_entities": [
                "SPECTATORS"
            ],
            "source_text_entities": [
                "WEST INDIAN REVELRY"
            ]
        }
    ],
    "image_4": [
        {
            "merged_entity_name": "OCEAN",
            "entity_type": "GEO",
            "description": "The vast expanse of blue water where the humpback whale is breaching, also serving as the environment affected by climate change and beavers' activity.",
            "source_image_entities": [
                "OCEAN"
            ],
            "source_text_entities": [
                "BEAVER POOLS",
                "BEAVER DAMS",
                "WETLANDS"
            ]
        },
        {
            "merged_entity_name": "WHALE",
            "entity_type": "ANIMAL",
            "description": "A humpback whale breaching out of the ocean, an impressive display of marine life that also shares songs across vast ocean distances.",
            "source_image_entities": [
                "WHALE"
            ],
            "source_text_entities": [
                "WHALES"
            ]
        }
    ],
    "image_5": [
        {
            "merged_entity_name": "TENNIS PLAYER",
            "entity_type": "PERSON",
            "description": "A male tennis player in action, wearing a white cap, orange and white shirt, wristbands, and holding a colorful tennis racket, participating in the U.S. Open event.",
            "source_image_entities": [
                "TENNIS PLAYER"
            ],
            "source_text_entities": [
                "RAFAEL NADAL"
            ]
        },
        {
            "merged_entity_name": "TENNIS RACKET",
            "entity_type": "OBJECT",
            "description": "A colorful tennis racket being swung by the tennis player, used in the U.S. Open event where players like Rafael Nadal compete.",
            "source_image_entities": [
                "TENNIS RACKET"
            ],
            "source_text_entities": [
                "RAFAEL NADAL"
            ]
        }
    ]
}