{
    "chunk-9fae2b6cf38c8180c2cbfdd0c9f91a4e": null,
    "chunk-d8b2214d9c8ac101eca13f2fd640c721": [
        {
            "entity_name": "Portland (South Portland)",
            "entity_type": "GEO",
            "description": "Portland is a city in Maine that includes South Portland and has a family shelter directed by Mike Guthrie. The city is facing challenges in providing shelter for newly arrived asylum seekers due to emergency housing being at capacity. Portland is also known for its General Assistance program, which provides financial support for rent and other expenses to asylum seekers.",
            "source_entities": [
                "SOUTH PORTLAND",
                "PORTLAND"
            ]
        },
        {
            "entity_name": "Zaporizhzhia Nuclear Plant (Ukrainian Power Plant)",
            "entity_type": "GEO",
            "description": "The Zaporizhzhia Nuclear Plant, also known as the Ukrainian Power Plant, is Europe’s largest nuclear power plant located in southern Ukraine. It has been disconnected from the national power grid due to a fire caused by shelling, raising fears of a potential disaster. The plant is under Russian occupation, and United Nations inspectors are present to ensure its safety and potentially reduce fighting in the area.",
            "source_entities": [
                "ZAPORIZHZHIA NUCLEAR PLANT",
                "UKRAINIAN POWER PLANT"
            ]
        },
        {
            "entity_name": "United Nations",
            "entity_type": "ORGANIZATION",
            "description": "The United Nations has a team of inspectors present at the Zaporizhzhia nuclear plant to ensure safety and potentially reduce fighting in the area.",
            "source_entities": [
                "UNITED NATIONS"
            ]
        },
        {
            "entity_name": "Herman Galushchenko",
            "entity_type": "PERSON",
            "description": "Herman Galushchenko is a Ukrainian official who commented on the critical situation at the Zaporizhzhia nuclear plant.",
            "source_entities": [
                "HERMAN GALUSHCHENKO"
            ]
        },
        {
            "entity_name": "Federal District Court for the Southern District of Florida",
            "entity_type": "ORGANIZATION",
            "description": "The Federal District Court for the Southern District of Florida is where Judge Aileen M. Cannon serves and issued an order in the case involving Donald J. Trump, temporarily banning the Justice Department from using seized materials for investigative purposes related to Mr. Trump's case until the special master's work is completed.",
            "source_entities": [
                "FEDERAL DISTRICT COURT FOR THE SOUTHERN DISTRICT OF FLORIDA"
            ]
        }
    ],
    "chunk-1021cca6cf48178eb4801961c0cabe53": [
        {
            "entity_name": "Cottonwood Ranch",
            "entity_type": "GEO",
            "description": "A property in northeastern Nevada owned by the Smith family, where beavers were both a nuisance and later seen as beneficial for the land, providing water supply during droughts and protecting hay crops from heavy rains.",
            "source_entities": [
                "COTTONWOOD RANCH",
                "CATTLE",
                "HAY CROP"
            ]
        },
        {
            "entity_name": "Beavers",
            "entity_type": "GEO",
            "description": "Beavers are seen as both a nuisance and a tool for climate resilience in Nevada, helping with water management and reducing the impact of droughts and floods by building dams, creating beaver pools, and forming wetlands that clean water, create new meadows, and act as a buffer against wildfires.",
            "source_entities": [
                "BEAVERS",
                "BEAVER POOLS",
                "BEAVER DAMS",
                "WETLANDS"
            ]
        },
        {
            "entity_name": "West Indian Revelry",
            "entity_type": "EVENT",
            "description": "West Indian Revelry is a cultural event in Brooklyn that returned after two years of scaled-back celebrations due to Covid-19.",
            "source_entities": [
                "WEST INDIAN REVELRY",
                "COVID-19"
            ]
        },
        {
            "entity_name": "Louisiana's Gulf Coast",
            "entity_type": "GEO",
            "description": "Louisiana's Gulf Coast is a location where residents still fear the worst despite the hurricane season's calm start.",
            "source_entities": [
                "LOUISIANA'S GULF COAST",
                "HURRICANE SEASON"
            ]
        },
        {
            "entity_name": "Biden Administration's Plan for U.S. Semiconductor Industry",
            "entity_type": "ORGANIZATION",
            "description": "The Biden administration's plan aims to bolster the U.S. semiconductor industry and counter China's influence.",
            "source_entities": [
                "BIDEN ADMINISTRATION",
                "U.S. SEMICONDUCTOR INDUSTRY"
            ]
        },
        {
            "entity_name": "France's Green Lawmaker",
            "entity_type": "PERSON",
            "description": "A Green lawmaker in France who suggested men give up barbecue for the sake of the planet, causing a swift uproar.",
            "source_entities": [
                "FRANCE",
                "GREEN LAWMAKER"
            ]
        },
        {
            "entity_name": "U.S. Open",
            "entity_type": "EVENT",
            "description": "U.S. Open is a tennis event where Frances Tiafoe beat the No. 2 seed and 22-time Grand Slam singles champion, Rafael Nadal.",
            "source_entities": [
                "U.S. OPEN",
                "RAFAEL NADAL"
            ]
        }
    ]
}