{
    "image_1": [
        {
            "merged_entity_name": "Dnipro River",
            "entity_type": "GEO",
            "description": "Dnipro River is a strategic waterway that bisects Ukraine and has become the dividing line of the southern front, with a wooden dock extending into the water, lit by a red light, and is the site of secret raids and special operations conducted by the Bratstvo battalion.",
            "source_image_entities": [
                "DOCK"
            ],
            "source_text_entities": [
                "DNIPRO RIVER"
            ]
        },
        {
            "merged_entity_name": "Bratstvo Battalion",
            "entity_type": "ORGANIZATION",
            "description": "Bratstvo battalion is a volunteer Ukrainian special forces team, including PERSON 1 and PERSON 2, standing on the dock and preparing for an activity, which involves conducting secret raids and special operations against Russian forces on the Dnipro River.",
            "source_image_entities": [
                "PERSON 1",
                "PERSON 2"
            ],
            "source_text_entities": [
                "BRATSTVO BATTALION"
            ]
        },
        {
            "merged_entity_name": "Russian Troops",
            "entity_type": "ORGANIZATION",
            "description": "Russian troops are the opposing force in Ukraine, retreating to the eastern bank of the Dnipro River, and are the target of the Bratstvo battalion's secret raids and special operations, including laying mines and attacking mortar positions.",
            "source_image_entities": [],
            "source_text_entities": [
                "RUSSIAN TROOPS"
            ]
        }
    ],
    "image_2": [
        {
            "merged_entity_name": "Bratstvo Battalion",
            "entity_type": "ORGANIZATION",
            "description": "Bratstvo battalion, a volunteer Ukrainian special forces team, is conducting secret raids and special operations against Russian forces. They have undertaken some of the conflict's most difficult missions, including forward spotting and sabotage along the front lines in cities like Kyiv and Kharkiv.",
            "source_image_entities": [
                "BASEBALL PLAYER"
            ],
            "source_text_entities": [
                "BRATSTVO BATTALION"
            ]
        },
        {
            "merged_entity_name": "Dnipro River",
            "entity_type": "GEO",
            "description": "Dnipro River is a strategic waterway that bisects Ukraine and has become the dividing line of the southern front, with Ukrainian forces holding the western bank and Russian forces the eastern bank.",
            "source_image_entities": [],
            "source_text_entities": [
                "DNIPRO RIVER"
            ]
        },
        {
            "merged_entity_name": "Gareth Bale",
            "entity_type": "PERSON",
            "description": "Gareth Bale, playing for Wales, scored a penalty kick resulting in a 1-1 final score in the World Cup.",
            "source_image_entities": [
                "PLAYER 11 (RED)"
            ],
            "source_text_entities": [
                "GARETH BALE"
            ]
        }
    ],
    "image_3": [
        {
            "entity_name": "Richard M. Fierro",
            "entity_type": "PERSON",
            "description": "Richard M. Fierro, also known as Mr. Fierro, is an older man with a serious expression, wearing a black hoodie, who engaged in heroic actions during the shooting incident, pulling a friend down with him and later tackling the gunman.",
            "source_image_entities": [
                "MAN",
                "BLACK HOODIE"
            ],
            "source_text_entities": [
                "RICHARD M. FIERRO (MR. FIERRO)"
            ]
        }
    ],
    "image_4": [
        {
            "merged_entity_name": "Richard M. Fierro",
            "entity_type": "PERSON",
            "description": "Richard M. Fierro, also known as Mr. Fierro, is a person who engaged in heroic actions during the shooting incident, pulling a friend down with him and later tackling the gunman. He was present at Club Q with his family when the shooting started and acted to stop the gunman, Anderson Lee Aldrich.",
            "source_image_entities": [
                "PERSON IN GRAY CLOTHING"
            ],
            "source_text_entities": [
                "RICHARD M. FIERRO (MR. FIERRO)"
            ]
        },
        {
            "merged_entity_name": "Anderson Lee Aldrich",
            "entity_type": "PERSON",
            "description": "Anderson Lee Aldrich is the suspected gunman in the shooting incident at Club Q, held on suspicion of five counts of murder and five counts of bias-motivated crime causing bodily injury. He is the person Mr. Fierro tackled to the ground to stop the rampage.",
            "source_image_entities": [],
            "source_text_entities": [
                "ANDERSON LEE ALDRICH"
            ]
        },
        {
            "merged_entity_name": "Club Q",
            "entity_type": "GEO",
            "description": "Club Q is the nightclub in Colorado Springs where a shooting occurred, resulting in multiple casualties. It was at this location where Richard M. Fierro intervened to stop the gunman, Anderson Lee Aldrich.",
            "source_image_entities": [],
            "source_text_entities": [
                "CLUB Q"
            ]
        },
        {
            "merged_entity_name": "Person in Orange Clothing",
            "entity_type": "PERSON",
            "description": "A person wearing orange clothing, holding a yellow container. This individual is distinct from the other persons mentioned in the text and does not have a direct link to the events described.",
            "source_image_entities": [
                "PERSON IN ORANGE CLOTHING"
            ],
            "source_text_entities": []
        },
        {
            "merged_entity_name": "Yellow Container",
            "entity_type": "OBJECT",
            "description": "A yellow container being held by the person in orange clothing. This object is not mentioned in the text and does not have a direct link to the events described.",
            "source_image_entities": [
                "YELLOW CONTAINER"
            ],
            "source_text_entities": []
        },
        {
            "merged_entity_name": "Child in Black Clothing",
            "entity_type": "PERSON",
            "description": "A child dressed in black clothing, looking up towards the camera. This individual is distinct from the other persons mentioned in the text and does not have a direct link to the events described.",
            "source_image_entities": [
                "CHILD IN BLACK CLOTHING"
            ],
            "source_text_entities": []
        },
        {
            "merged_entity_name": "Woman in Pink and Red Dress",
            "entity_type": "PERSON",
            "description": "A woman wearing a pink and red dress, reaching out with her hand to receive something from another person. This individual is distinct from the other persons mentioned in the text and does not have a direct link to the events described.",
            "source_image_entities": [
                "WOMAN IN PINK AND RED DRESS"
            ],
            "source_text_entities": []
        }
    ],
    "image_5": [
        {
            "entity_name": "Richard M. Fierro",
            "entity_type": "PERSON",
            "description": "Richard M. Fierro, also known as Mr. Fierro, is a person who engaged in heroic actions during the shooting incident, pulling a friend down with him and later tackling the gunman. He is described as a man with short, curly black hair, wearing a light-colored shirt with a subtle pattern, and looking directly at the camera.",
            "source_image_entities": [
                "MAN",
                "SHIRT"
            ],
            "source_text_entities": [
                "RICHARD M. FIERRO (MR. FIERRO)"
            ]
        }
    ],
    "image_6": [
        {
            "merged_entity_name": "WOMAN PETTING COW",
            "entity_type": "PERSON_AND_ANIMAL",
            "description": "A woman with glasses, wearing a dark sweater, smiling and petting a brown and white cow in a grassy field.",
            "source_image_entities": [
                "WOMAN",
                "COW"
            ],
            "source_text_entities": []
        }
    ]
}