{
    "chunk-aada19701828ea2be7d3e8f9c4c384cf": [
        {
            "entity_name": "Lewis Carroll (Charles Lutwidge Dodgson)",
            "entity_type": "PERSON",
            "description": "Lewis Carroll was the pseudonym of Charles Lutwidge Dodgson, an author, mathematician, and photographer known for his famous books 'Alice's Adventures in Wonderland' and 'Through the Looking-Glass and What Alice Found There'. He was born on 27 January 1832 at Daresbury, Cheshire, and went to Christ Church, Oxford, where he lived for the rest of his life. He was a Reverend, a Mathematical Lecturer, and was admitted to deacon’s orders in 1861. Carroll was also a noted photographer, especially of children, a prolific diarist, letter-writer, and pamphleteer. He died at Guildford on 14 January 1898 and is buried there.",
            "source_entities": [
                "LEWIS CARROLL",
                "CHARLES LUTWIDGE DODGSON"
            ]
        }
    ],
    "chunk-61b6d5b1b42dd8260585b2140e959638": [
        {
            "entity_name": "Lewis Carroll (Charles Lutwidge Dodgson)",
            "entity_type": "PERSON",
            "description": "Charles Lutwidge Dodgson, known by his pseudonym Lewis Carroll, was the author of 'Alice's Adventures in Wonderland' and its sequel 'Through the Looking-Glass and What Alice Found There'. He is internationally recognized for his work on the 'Alice' books, which have been influential in literature and popular culture.",
            "source_entities": [
                "C. L. DODGSON",
                "LEWIS CARROLL"
            ]
        }
    ],
    "chunk-63e0005b7085bcc9c8b8fe828c6d7a9d": [
        {
            "entity_name": "The Nursery Alice",
            "entity_type": "Event",
            "description": "A publication event that occurred in 1890, initially priced at four shillings but later sold at the same terms as ordinary shilling picture-books.",
            "source_entities": [
                "THE NURSERY ALICE",
                "NURSERY ‘ALICE’"
            ]
        }
    ],
    "chunk-4754eef30eba5accf2e874409f3e91d2": [
        {
            "entity_name": "Little Bottle 'DRINK ME'",
            "entity_type": "GEO",
            "description": "Little bottle is the object that Alice finds on the table with a label saying 'DRINK ME'. It is associated with the event where Alice is instructed to drink its contents.",
            "source_entities": [
                "\"LITTLE BOTTLE\"",
                "\"DRINK ME\""
            ]
        }
    ]
}