{
    "chunk-aada19701828ea2be7d3e8f9c4c384cf": [
        {
            "entity_name": "Lewis Carroll (Charles Lutwidge Dodgson)",
            "entity_type": "PERSON",
            "description": "Lewis Carroll was the pseudonym of Charles Lutwidge Dodgson, an author, mathematician, and photographer known for his famous books 'Alice's Adventures in Wonderland' and 'Through the Looking-Glass and What Alice Found There'. He was born on 27 January 1832 at Daresbury, Cheshire, and went to Christ Church, Oxford, where he lived for the rest of his life. He was a Reverend, a Mathematical Lecturer, and was admitted to deacon’s orders in 1861. Carroll was also a noted photographer, especially of children, a prolific diarist, letter-writer, and pamphleteer. He died at Guildford on 14 January 1898 and is buried there.",
            "source_entities": [
                "LEWIS CARROLL",
                "CHARLES LUTWIDGE DODGSON"
            ]
        }
    ],
    "chunk-61b6d5b1b42dd8260585b2140e959638": [
        {
            "entity_name": "Lewis Carroll (Charles Lutwidge Dodgson)",
            "entity_type": "PERSON",
            "description": "Charles Lutwidge Dodgson, known by his pseudonym Lewis Carroll, was the author of 'Alice's Adventures in Wonderland' and its sequel 'Through the Looking-Glass and What Alice Found There'. He is internationally recognized for his work on the 'Alice' books, which have been influential in literature and popular culture.",
            "source_entities": [
                "C. L. DODGSON",
                "LEWIS CARROLL"
            ]
        }
    ],
    "chunk-30217968371283d5e3b700d712d42d85": [
        {
            "entity_name": "Lewis Carroll (W. M. Thackeray)",
            "entity_type": "PERSON",
            "description": "Lewis Carroll is the pseudonym of Charles Lutwidge Dodgson, an individual associated with Christ Church, known for his literary works and photography. He first used the pseudonym for a poem in The Train and is also connected with the creation of Alice's Adventures in Wonderland, which was inspired by the Liddell sisters, particularly Alice Liddell. W. M. Thackeray is mentioned in connection with Christ Church and The Rose and the Ring, and he met Lewis Carroll in May 1857.",
            "source_entities": [
                "LEWIS CARROLL",
                "W. M. THACKERAY",
                "THACKERAY"
            ]
        },
        {
            "entity_name": "Lorina, Alice, and Edith Liddell",
            "entity_type": "PERSON",
            "description": "Lorina, Alice, and Edith Liddell are the daughters of Henry Liddell, the dean of Christ Church, Oxford. They are particularly noted for their association with Lewis Carroll, as Alice Liddell is the inspiration for Alice's Adventures in Wonderland. The river trips with the Liddell sisters are credited as the genesis of the story.",
            "source_entities": [
                "LORINA, ALICE, AND EDITH LIDDELL"
            ]
        },
        {
            "entity_name": "Alice's Adventures in Wonderland (Alice's Adventures Under Ground)",
            "entity_type": "EVENT",
            "description": "Alice's Adventures in Wonderland is a novel written by Lewis Carroll, inspired by Alice Liddell. It began as Alice's Adventures Under Ground, an early version that was later published as Alice's Adventures in Wonderland. The story has become a classic of children's literature and has been translated into multiple languages.",
            "source_entities": [
                "ALICE'S ADVENTURES UNDER GROUND",
                "ALICE'S ADVENTURES IN WONDERLAND"
            ]
        },
        {
            "entity_name": "Christ Church",
            "entity_type": "ORGANIZATION",
            "description": "Christ Church is an institution where various events and roles are associated, such as employment and academic positions. It is the place where Charles Lutwidge Dodgson, who wrote under the pseudonym Lewis Carroll, worked as a sub-librarian and lecturer in mathematics. Christ Church is also associated with the construction of The New Belfry of Christ Church, Oxford.",
            "source_entities": [
                "CHRIST CHURCH",
                "THE NEW BELFRY OF CHRIST CHURCH, OXFORD"
            ]
        }
    ],
    "chunk-63e0005b7085bcc9c8b8fe828c6d7a9d": [
        {
            "entity_name": "Alice's Adventures in Wonderland",
            "entity_type": "Event",
            "description": "A publication event that occurred on 22nd December 1886 as 'Alice’s Adventures under Ground' and later as 'Alice in Wonderland', a play that premiered at the Prince of Wales Theatre on 23rd December and was published in early 1887, dated 1886.",
            "source_entities": [
                "ALICE’S ADVENTURES UNDER GROUND",
                "ALICE IN WONDERLAND"
            ]
        },
        {
            "entity_name": "Lewis Carroll",
            "entity_type": "Person",
            "description": "Author of various works including 'Alice's Adventures in Wonderland', 'Symbolic Logic, Part 1', and 'The Nursery Alice'. He died at 'The Chestnuts' in Guildford on 14th January 1898.",
            "source_entities": [
                "LEWIS CARROLL",
                "THE CHESTNUTS",
                "GUILDFORD"
            ]
        },
        {
            "entity_name": "The Nursery Alice",
            "entity_type": "Event",
            "description": "A publication event that occurred in 1890, initially priced at four shillings but later sold at the same terms as ordinary shilling picture-books.",
            "source_entities": [
                "THE NURSERY ALICE",
                "NURSERY ‘ALICE’"
            ]
        }
    ],
    "chunk-4e7114a3dd027707a5fdf7786a65618e": [
        {
            "entity_name": "Alice",
            "entity_type": "PERSON",
            "description": "The main character in the story, who follows a White Rabbit down a rabbit-hole and embarks on a series of adventures, including meeting various characters and participating in events such as the Mad Tea-Party and the trial of the Queen of Hearts.",
            "source_entities": [
                "\"ALICE\""
            ]
        },
        {
            "entity_name": "White Rabbit",
            "entity_type": "PERSON",
            "description": "A character with pink eyes who checks a watch and speaks to itself, leading Alice to follow it down a rabbit-hole and initiating her adventures in Wonderland.",
            "source_entities": [
                "\"WHITE RABBIT\""
            ]
        },
        {
            "entity_name": "Rabbit-Hole",
            "entity_type": "GEO",
            "description": "A large hole under a hedge that Alice follows the White Rabbit into, leading to a series of adventures and标志着她奇妙冒险的开始。",
            "source_entities": [
                "\"RABBIT-HOLE\"",
                "\"DOWN THE RABBIT-HOLE\""
            ]
        },
        {
            "entity_name": "The Queen of Hearts",
            "entity_type": "PERSON",
            "description": "A character who presides over the trial and is known for her irritable and capricious behavior; she is one of the key figures in the events involving Alice towards the end of her adventures.",
            "source_entities": [
                "\"THE QUEEN OF HEARTS\""
            ]
        },
        {
            "entity_name": "The King of Hearts",
            "entity_type": "PERSON",
            "description": "A character who presides over the trial alongside the Queen of Hearts, often trying to maintain order, and is part of the final events experienced by Alice.",
            "source_entities": [
                "\"THE KING OF HEARTS\""
            ]
        },
        {
            "entity_name": "The Red Queen",
            "entity_type": "PERSON",
            "description": "A character who plays croquet with Alice and is known for her unpredictable and autocratic nature, contributing to the surreal and challenging experiences Alice encounters.",
            "source_entities": [
                "\"THE RED QUEEN\""
            ]
        },
        {
            "entity_name": "The Mock Turtle",
            "entity_type": "PERSON",
            "description": "A character who tells Alice his life story, imparting wisdom and reflection, and is one of the many peculiar beings Alice meets on her journey.",
            "source_entities": [
                "\"THE MOCK TURTLE\""
            ]
        },
        {
            "entity_name": "The Mad Hatter",
            "entity_type": "PERSON",
            "description": "A character at the Mad Tea-Party who is known for his eccentric behavior and hat-making skills, providing one of the most memorable interactions for Alice in her adventures.",
            "source_entities": [
                "\"THE MAD HATTER\""
            ]
        },
        {
            "entity_name": "The March Hare",
            "entity_type": "PERSON",
            "description": "A character at the Mad Tea-Party who engages in nonsensical conversation with Alice, adding to the absurdity of the events Alice experiences.",
            "source_entities": [
                "\"THE MARCH HARE\""
            ]
        }
    ],
    "chunk-4754eef30eba5accf2e874409f3e91d2": [
        {
            "entity_name": "Alice",
            "entity_type": "PERSON",
            "description": "Alice is the main character in the story, who falls through the air and has various adventures. She is also the one who thinks about her cat Dinah during her fall and later finds herself in a series of locations including the long passage, low hall, and the loveliest garden.",
            "source_entities": [
                "\"ALICE\""
            ]
        },
        {
            "entity_name": "Dinah",
            "entity_type": "PERSON",
            "description": "Dinah is Alice's cat, whom she thinks about during her fall and wishes were with her. Alice also hopes that Dinah's saucer of milk will be remembered at tea-time.",
            "source_entities": [
                "\"DINAH\"",
                "\"DINAH'S SAUCER OF MILK\""
            ]
        },
        {
            "entity_name": "White Rabbit",
            "entity_type": "PERSON",
            "description": "The White Rabbit is a character that Alice chases through a long passage and later hears speaking about being late. Alice follows the White Rabbit into the low hall and continues her adventure.",
            "source_entities": [
                "\"WHITE RABBIT\""
            ]
        },
        {
            "entity_name": "Heap of Sticks and Dry Leaves",
            "entity_type": "GEO",
            "description": "Heap of sticks and dry leaves is the location where Alice lands after falling and is not hurt, ending her fall through the air.",
            "source_entities": [
                "\"HEAP OF STICKS AND DRY LEAVES\""
            ]
        },
        {
            "entity_name": "Long Passage",
            "entity_type": "GEO",
            "description": "Long passage is the location where Alice sees the White Rabbit and chases after it, leading her to the low hall.",
            "source_entities": [
                "\"LONG PASSAGE\""
            ]
        },
        {
            "entity_name": "Low Hall",
            "entity_type": "GEO",
            "description": "Low hall is the location where Alice finds herself after following the White Rabbit, with doors all around. It is here that she discovers the three-legged table with the golden key and the little door.",
            "source_entities": [
                "\"LOW HALL\"",
                "\"THREE-LEGGED TABLE\"",
                "\"LITTLE DOOR\""
            ]
        },
        {
            "entity_name": "Small Passage and Loveliest Garden",
            "entity_type": "GEO",
            "description": "Small passage is the location that Alice enters after opening the little door with the golden key, leading to the loveliest garden that she longs to explore.",
            "source_entities": [
                "\"SMALL PASSAGE\"",
                "\"LOVELIEST GARDEN\""
            ]
        },
        {
            "entity_name": "Little Bottle 'DRINK ME'",
            "entity_type": "GEO",
            "description": "Little bottle is the object that Alice finds on the table with a label saying 'DRINK ME'. It is associated with the event where Alice is instructed to drink its contents.",
            "source_entities": [
                "\"LITTLE BOTTLE\"",
                "\"DRINK ME\""
            ]
        }
    ],
    "chunk-c241a81be54f0c742288bc69a5baadc8": [
        {
            "entity_name": "Eat Me Cake",
            "entity_type": "OBJECT",
            "description": "The 'Eat Me' cake is an object that Alice consumes, which has the potential to change her size and help her enter the garden. It is found in a little glass box and is marked with the words 'EAT ME' in currants.",
            "source_entities": [
                "EAT ME CAKE",
                "LITTLE GLASS BOX"
            ]
        },
        {
            "entity_name": "Alice",
            "entity_type": "PERSON",
            "description": "Alice is the main character in the story, who experiences unusual adventures and transformations in size. She encounters various objects and situations, such as drinking from a bottle that causes her to shrink, eating a cake that might change her size, and trying to reach a golden key on a table.",
            "source_entities": [
                "\"ALICE\"",
                "\"BOTTLE\"",
                "\"GOLDEN KEY\"",
                "\"TABLE\""
            ]
        },
        {
            "entity_name": "Pool of Tears",
            "entity_type": "GEO",
            "description": "The pool of tears is a location where Alice finds herself after growing too large. It is a result of her own tears due to her size transformation and surprise.",
            "source_entities": [
                "\"POOL OF TEARS\""
            ]
        }
    ]
}