{
    "chunk-6c59374ebd57c4cadd215ce86b60a88c": [
        {
            "entity_name": "Hila Fakliro",
            "entity_type": "PERSON",
            "description": "A fitness instructor aged 26, who was working at the Tribe of Nova gathering festival and experienced the attack firsthand. She is also referred to as Ms. Fakliro in the text.",
            "source_entities": [
                "HILA FAKLIRO",
                "MS. FAKLIRO"
            ]
        },
        {
            "entity_name": "The Tribe of Nova Gathering (Sukkot)",
            "entity_type": "EVENT",
            "description": "A trance music festival celebrating the Jewish holiday of Sukkot, which was disrupted by an attack from Hamas. The event took place only three miles from Gaza and resulted in a massacre, turning a carefree environment into a scene of panic and violence.",
            "source_entities": [
                "THE TRIBE OF NOVA GATHERING",
                "SUKKOT"
            ]
        },
        {
            "entity_name": "Republican Party",
            "entity_type": "ORGANIZATION",
            "description": "A political organization with various state officials being contacted by Donald J. Trump, including the chairman of the Republican Party in Hawaii, the head of the Kansas G.O.P., the Nebraska chairman, and the chairman of the Nevada Republican Party. The party has been accused of manipulating the election for Mr. Trump by changing the rules in Nevada to disadvantage his chief rival, Gov. Ron DeSantis of Florida.",
            "source_entities": [
                "REPUBLICAN PARTY",
                "REPUBLICAN PARTY IN HAWAII",
                "KANSAS G.O.P.",
                "NEBRASKA CHAIRMAN",
                "NEVADA REPUBLICAN PARTY"
            ]
        },
        {
            "entity_name": "Board of Pardons in Minnesota",
            "entity_type": "ORGANIZATION",
            "description": "An official body in Minnesota consisting of the governor, attorney general, and the state's chief justice that meets to consider applications for clemency. The process is unique as it involves a public appeal and a decision is rendered in the moment.",
            "source_entities": [
                "BOARD OF PARDONS IN MINNESOTA",
                "BOARD OF PARDONS",
                "GOVERNOR",
                "ATTORNEY GENERAL",
                "STATE’S CHIEF JUSTICE"
            ]
        }
    ],
    "chunk-5179416af4cc4a09f5ed74117ac25b4f": [
        {
            "entity_name": "ISRAEL",
            "entity_type": "GEO",
            "description": "Israel is a country in the Middle East that has been conducting airstrikes and is planning a ground invasion in Gaza. It has also been involved in diplomatic talks to ease the humanitarian crisis and is deploying an aircraft carrier to the eastern Mediterranean.",
            "source_entities": [
                "ISRAEL",
                "ISRAELI GROUND INVASION",
                "UNITED STATES"
            ]
        },
        {
            "entity_name": "GAZA",
            "entity_type": "GEO",
            "description": "Gaza is a Palestinian territory where hospitals are overwhelmed with injured people and is facing an evacuation order from Israel. It is also the location of the Oct. 7 attack by Hamas, which controls the territory, and where the humanitarian crisis is unfolding.",
            "source_entities": [
                "GAZA",
                "PALESTINIANS",
                "OCT. 7 ATTACK"
            ]
        },
        {
            "entity_name": "HAMAS",
            "entity_type": "ORGANIZATION",
            "description": "Hamas is the group that controls Gaza and which Israel is responding to with airstrikes following an attack that killed over 1,300 people. It is also the reason for the Israeli ground invasion and the evacuation order in northern Gaza.",
            "source_entities": [
                "HAMAS"
            ]
        },
        {
            "entity_name": "AL SHIFA HOSPITAL",
            "entity_type": "ORGANIZATION",
            "description": "Al Shifa Hospital is the largest medical complex in Gaza, struggling with the influx of injured patients and the evacuation order. It is managed by Dr. Muhammad Abu Salima, who has expressed the impossibility of evacuating the hospital.",
            "source_entities": [
                "AL SHIFA HOSPITAL",
                "DR. MUHAMMAD ABU SALIMA"
            ]
        },
        {
            "entity_name": "EGYPT",
            "entity_type": "GEO",
            "description": "Egypt is involved in diplomatic talks to ease the humanitarian crisis in Gaza and has trucks of aid idling at the border. It is also the location where food and other essentials are being stockpiled for Gaza.",
            "source_entities": [
                "EGYPT"
            ]
        },
        {
            "entity_name": "WHITE HOUSE",
            "entity_type": "ORGANIZATION",
            "description": "The White House, represented by national security adviser Jake Sullivan, is involved in diplomatic efforts to address the crisis in Gaza, including restoring water to a pipeline. It is also part of the diplomatic talks to ease the humanitarian crisis.",
            "source_entities": [
                "WHITE HOUSE",
                "JAKE SULLIVAN"
            ]
        },
        {
            "entity_name": "BENJAMIN NETANYAHU",
            "entity_type": "PERSON",
            "description": "Benjamin Netanyahu, the Prime Minister of Israel, stated that Israel will take Hamas apart during a meeting of Israel’s new emergency wartime government. He is a key figure in the Israeli response to the conflict in Gaza.",
            "source_entities": [
                "BENJAMIN NETANYAHU"
            ]
        }
    ],
    "chunk-dee5847a95227f620be61666e65ad9ef": [
        {
            "entity_name": "Natural History Museums",
            "entity_type": "ORGANIZATION",
            "description": "Natural history museums, including the museum led by President Sean M. Decatur, are facing increasing scrutiny over the legality and ethics of their acquisitions, often based on discredited scientific theories like eugenics.",
            "source_entities": [
                "MUSEUM",
                "NATURAL HISTORY MUSEUMS"
            ]
        },
        {
            "entity_name": "Vatican Synod",
            "entity_type": "EVENT",
            "description": "The Vatican Synod is a secretive and discreet meeting held by the Roman Catholic Church to address sensitive issues.",
            "source_entities": [
                "VATICAN SYNOD",
                "ROMAN CATHOLIC CHURCH"
            ]
        },
        {
            "entity_name": "Madonna's Celebration Tour",
            "entity_type": "EVENT",
            "description": "Madonna's Celebration Tour is a series of performances that began after a health-related delay in a 20,000-capacity arena in London.",
            "source_entities": [
                "MADONNA",
                "CELEBRATION TOUR"
            ]
        },
        {
            "entity_name": "Taylor Swift's Eras Tour",
            "entity_type": "EVENT",
            "description": "Taylor Swift's Eras Tour is a performance event that has been made into a movie, reviewed by Wesley Morris.",
            "source_entities": [
                "TAYLOR SWIFT",
                "ERAS TOUR"
            ]
        },
        {
            "entity_name": "National League Championship Series",
            "entity_type": "EVENT",
            "description": "The National League Championship Series is an event featuring a showdown between the Philadelphia Phillies and the Arizona Diamondbacks, both of whom eliminated teams with at least 100 wins.",
            "source_entities": [
                "NATIONAL LEAGUE CHAMPIONSHIP SERIES",
                "PHILADELPHIA PHILLIES",
                "ARIZONA DIAMONDBACKS"
            ]
        }
    ]
}