{
    "image_1": {
        "entity_name": "Defenders of Democracy",
        "entity_type": "ORGANIZATION",
        "description": "A group that observed the anniversary of the January 6, 2021, event at the Capitol.",
        "reason": "The image depicts a formal or ceremonial setting with a sense of gravity and formality, which aligns with the description of Defenders of Democracy observing the anniversary of the January 6, 2021, event at the Capitol.",
        "matched_chunk_entity_name": "Defenders of Democracy"
    },
    "image_2": {
        "entity_name": "Katy Freeway",
        "entity_type": "GEO",
        "description": "A highway in Houston that spans 26 lanes in some spots.",
        "reason": "The image clearly shows a complex highway interchange, which matches the description of the Katy Freeway in Houston. The text also mentions the Katy Freeway as one of the world's widest highways, spanning 26 lanes in some sections.",
        "matched_chunk_entity_name": "Katy Freeway"
    },
    "image_3": {
        "entity_name": "MONTHLY CHANGE IN JOBS",
        "entity_type": "EVENT",
        "description": "The event depicted in the bar chart showing monthly job changes over a series of months, with each bar representing the number of jobs added or lost in that month.",
        "reason": "The image is a bar chart titled 'MONTHLY CHANGE IN JOBS' which directly corresponds to the text describing the data on monthly job changes. The chart displays fluctuations in job additions, aligning with the textual information about job creation rates.",
        "matched_chunk_entity_name": "BUREAU OF LABOR STATISTICS"
    },
    "image_4": {
        "entity_name": "NATIONAL A9-18",
        "entity_type": "EVENT",
        "description": "An event or section in a publication discussing severe weather impacts on California's trees.",
        "reason": "The image depicts a fallen tree with an extensive root system, which aligns with the description of severe weather impacts on California's trees mentioned in the text. The caution tape around the tree also suggests a hazardous situation, which is consistent with the theme of disruption and danger due to severe weather.",
        "matched_chunk_entity_name": "NATIONAL A9-18"
    },
    "image_5": {
        "entity_name": "Creative Rebirth at City Ballet",
        "entity_type": "EVENT",
        "description": "An event or period of creative renewal at City Ballet with Alexei Ratmansky's involvement.",
        "reason": "The image depicts a ballet performance, which aligns with the text mentioning 'Creative Rebirth at City Ballet' and Alexei Ratmansky joining as an artist in residence. The synchronized pose and classical ballet moves are indicative of a ballet company's performance.",
        "matched_chunk_entity_name": "Creative Rebirth at City Ballet"
    }
}