{
    "chunk-cadfed8974ee21c1b7231ddd6f30482d": null,
    "chunk-c08c72c2819b7238dbc77dc7b29b9028": [
        {
            "entity_name": "CBOW Algorithm",
            "entity_type": "Event",
            "description": "The CBOW algorithm, developed by Mikolov et al., 2013, is an event in the process of training word embeddings and is used for initializing the embedding layer weights of models.",
            "source_entities": [
                "\"CBOW ALGORITHM\"",
                "\"MIKOLOV ET AL., 2013\""
            ]
        },
        {
            "entity_name": "BLEU Score",
            "entity_type": "Event",
            "description": "BLEU score is an evaluation metric used to assess the quality of machine translation, referenced in the context of pre-trained word embeddings' efficacy and used to measure gains from pre-training in various languages and conditions.",
            "source_entities": [
                "\"BLEU SCORE\""
            ]
        },
        {
            "entity_name": "Neural Machine Translation (NMT)",
            "entity_type": "Concept",
            "description": "NMT stands for Neural Machine Translation, a concept central to the discussion of pre-trained embeddings and their impact on translation quality, as well as the examination of pre-training efficacy across various languages and conditions.",
            "source_entities": [
                "\"NMT\"",
                "\"NEISHI ET AL., 2017\"",
                "\"ARTETXE ET AL., 2017\"",
                "\"GANGI AND FEDERICO, 2017\""
            ]
        },
        {
            "entity_name": "Glorot and Bengio (2010)",
            "entity_type": "Organization",
            "description": "Glorot and Bengio (2010) refers to the authors who proposed the uniform initialization method used in baseline models without pre-training, as well as the initialization method used when pre-trained word embeddings are not available.",
            "source_entities": [
                "\"GLOROT AND BENGIO (2010)\""
            ]
        },
        {
            "entity_name": "Smith et al., 2017",
            "entity_type": "Organization",
            "description": "Smith et al., 2017 proposed an approach to learn orthogonal transformations for aligning word embeddings of multiple languages into a single space, which was tested for its effect on the efficacy of pre-trained embeddings.",
            "source_entities": [
                "\"SMITH ET AL., 2017\""
            ]
        },
        {
            "entity_name": "Linguistic Similarity Study",
            "entity_type": "Event",
            "description": "The Linguistic Similarity Study investigates the effect of linguistic similarity on the efficacy of pre-trained embeddings, using Portuguese as the target language and selecting source languages from each family in the language family tree leading to Portuguese.",
            "source_entities": [
                "\"ES\"",
                "\"FR\"",
                "\"IT\"",
                "\"RU\"",
                "\"HE\"",
                "\"PORTUGUESE\"",
                "\"INDO-EUROPEAN\"",
                "\"ROMANCE\"",
                "\"WESTERN ROMANCE\"",
                "\"WEST-IBERIAN\""
            ]
        }
    ],
    "chunk-6693f64a0d61b07061a158adb3d374d9": null,
    "chunk-43ef8f2b64d677304846728712f7107c": null
}