{
    "image_1": {
        "entity_name": "San Salvador",
        "entity_type": "GEO",
        "description": "San Salvador is mentioned as a location where the incarcerated population has exploded and prisons are run by gangs.",
        "reason": "The image depicts a scene inside a prison in San Salvador, highlighting the overcrowded and tense conditions. The text also mentions San Salvador as a location where the incarcerated population has exploded and prisons are run by gangs.",
        "matched_chunk_entity_name": "San Salvador"
    },
    "image_2": {
        "entity_name": "HOSTAGES",
        "entity_type": "PERSON",
        "description": "The individuals who were kidnapped and became the focus of support in the plaza in front of the Tel Aviv Museum of Art.",
        "reason": "The image depicts an elderly man standing inside a tunnel, which is described as a simulation of the experiences of hostages. The text mentions that the tunnel was installed to simulate the experiences of hostages, aligning with the content of the image.",
        "matched_chunk_entity_name": "HOSTAGES"
    },
    "image_3": {
        "entity_name": "BORDER PATROL",
        "entity_type": "ORGANIZATION",
        "description": "The Border Patrol is a law enforcement agency responsible for securing the borders of the United States.",
        "reason": "The image clearly shows officers with 'BORDER PATROL' visible on their backs, indicating their affiliation with this organization. The scene depicts a law enforcement operation involving the detention of an individual, which aligns with the activities typically carried out by the Border Patrol.",
        "matched_chunk_entity_name": "no match"
    },
    "image_4": {
        "entity_name": "no_match",
        "entity_type": "NONE",
        "description": "N/A",
        "reason": "The image depicts a snow-covered urban area at night, which does not align with any specific entity mentioned in the text. The text discusses various topics such as poverty levels in New York City, international news, and sports events, none of which are visually represented in the image.",
        "matched_chunk_entity_name": "no match"
    },
    "image_5": {
        "entity_name": "Danielle Brooks",
        "entity_type": "NONE",
        "description": "N/A",
        "reason": "The image depicts a portrait of a person with a thoughtful or contemplative pose.",
        "matched_chunk_entity_name": "Danielle Brooks"
    },
    "image_6": {
        "entity_name": "Monster Jam",
        "entity_type": "EVENT",
        "description": "Monster Jam is an event in Newark where gigantic trucks like Grave Digger and Zombie performed, drawing a rapt crowd.",
        "reason": "The image clearly shows a monster truck in motion on a dirt track, which aligns with the description of Monster Jam as an event featuring such trucks performing stunts and racing. The text also mentions Monster Jam, describing it as an event with a lively atmosphere and enthusiastic audience.",
        "matched_chunk_entity_name": "Monster Jam"
    }
}