{
  "chunk-1646de4a14fa1735eaf04bf7f5664e4f": {
    "tokens": 1200,
    "content": "VOL. CLXXIII . . . . No. 60,072 © 2024  The New York Times Company  \n\nTHURSDAY, FEBRUARY 22, 2024  \n\n![](images/image_1.jpg)  \nIn San Salvador, above, and elsewhere in Latin America, the incarcerated population has exploded. Many prisons are run by gangs.  \n\n# Headquarters For the Gangs? Penitentiaries.  \n\nThis  article  is  by  Maria  AbiHabib,  Annie  Correal and  Jack Nicas.  \n\nMEXICO CITY — Ecuador’s military was sent in to seize control of the country’s prisons last month after two major gang leaders escaped and criminal groups quickly set off a nationwide revolt that paralyzed the country.  \n\nOn Feb. 14 in Brazil, two inmates with connections to a major gang became the first to escape from one of the nation’s five maximum-security federal prisons, officials said.  \n\nOfficials in Colombia have declared an emergency in its prisons after two guards were killed and several more targeted in what the government said was retaliation for its crackdown on major criminal groups.  \n\nInside  prisons  across  Latin America, criminal groups exercise unchallenged authority over inmates, extracting money from them to buy protection or basic necessities, like food.  \n\nThe prisons also act as a safe haven of sorts for incarcerated criminal leaders to remotely run their criminal enterprises on the outside, ordering killings, orchestrating the smuggling of drugs to the United States and Europe, and directing kidnappings and extortion of local businesses.  \n\nWhen officials attempt to curtail the power criminal groups exercise  from  behind  bars,  their leaders often deploy members on the outside to push back.  \n\n“The principal center of gravity, the nexus of control of organized crime, lies within the prison compounds,” said Mario Pazmiño, a retired colonel and former director of intelligence for Ecuador’s Army, and an analyst on security matters.  \n\n# Where Hostages’ Loved Ones Gather for Solace  \n\n# By RONI CARYN RABIN  \n\nTEL AVIV — A week after Hamas-led terrorists stormed his kibbutz and kidnapped his wife and three young children, Avihai Brodutch planted himself on the sidewalk in front of army headquarters in Tel Aviv holding a sign scrawled with the words “My family’s in Gaza,” and said he would not budge until they were brought home. Passers-by stopped to commis  \n\n# TEL AVIV DISPATCH  \n\n“It was Israel at its finest,” he said. “There was a feeling of a common destiny.”  \n\nThe one-man sit-in mushroomed in the weeks after the attacks. But the sidewalks outside the military headquarters could not contain multitudes, and some people were uncomfortable with the location, which was associated with anti-government protests last year.  \n\nSo the mass moved a block north to the plaza in front of the Tel Aviv Museum of Art, where a long rectangular table set for 234 people and surrounded by empty chairs had been installed to represent the captives. Since some 110 hostages have come home, half of the table has been reset to correspond to the conditions of captivity they described, with half a moldy piece of pita bread on each plate and bottles of dirty water on the table in  \n\nstead of wineglasses. In the months since the attacks, the plaza has continued to attract a steady stream of Israelis and tourists on volunteer missions who want to support the families. But it has also become a home away from home for the parents, adult children, siblings, cousins and other relatives of hostages.  \n\nAlthough it can get damp and chilly in Tel Aviv in the winter, many have set up tents in the plaza, often sleeping there, keeping company with the only other people in the world who they say can truly understand what they are experiencing — the family members of other hostages. Continued on Page A6  \n\n![](images/image_2.jpg)  \nIn a Tel Aviv square, an artist installed a 30-yard tunnel to simulate the experiences of hostages.  \n\n“That’s where let’s say the management positions are, the command positions,” he added. “It is where they give the orders and dispensations for gangs to terrorize the country.”  \n\nLatin America’s prison population has exploded over the last two decades, driven by stricter crime measures like pretrial detentions, but governments across the region have not spent enough to handle the surge and instead have often relinquished control to inmates, experts on penal systems say.  \n\nThose sent to prison are often left with one choice: Join a gang or face their wrath.  \n\n# A Tiny Isle’s Fight to Reclaim Its Domain Online  \n\n# By JACOB JUDAH  \n\nThe South Pacific island of Niue is one the most remote places in the world. Its closest neighbors, Tonga and American Samoa, are hundreds of miles away. The advent of the internet promised, in a small way, to make Niue and its 2,000 or so residents more connected to the rest of the world. In the late 1990s, an American businessman offered to hook up the island to the internet. All he  \n\n# Niue Wants What May  \n\n# Be Due From .nu  \n\nwanted in exchange was the right to control the .nu suffix that Niue was  assigned  for  its  web  addresses. The domain did not seem as lucrative as .tv — which was slotted to Tuvalu, another South Pacific nation — and the leaders of Niue (pronounced  New-ay)  \n\nsigned off on the deal. But the two sides were soon at odds.  \n\nNow, after more than two decades of back and forth, the disagreement is finally nearing a resolution in a court of law. Disputes over domain names were not uncommon during the internet’s infancy  but  experts  are  hard pressed to recall one that",
    "chunk_order_index": 0,
    "full_doc_id": "doc-6930636b407aa2be49b5def38b1e0964"
  },
  "chunk-9466cadee8a3aa8c8b63658188134f77": {
    "tokens": 1200,
    "content": "lucrative as .tv — which was slotted to Tuvalu, another South Pacific nation — and the leaders of Niue (pronounced  New-ay)  \n\nsigned off on the deal. But the two sides were soon at odds.  \n\nNow, after more than two decades of back and forth, the disagreement is finally nearing a resolution in a court of law. Disputes over domain names were not uncommon during the internet’s infancy  but  experts  are  hard pressed to recall one that has lasted this long.  \n\nIt turned out that .nu was, in fact, very valuable. “Nu” means Continued on Page A8  \n\n# Arizona Denies BIDEN CONSIDERS An Extradition EXECUTIVE ACTION To Manhattan TO GIRD BORDER  \n\nG.O.P. Prosecutor Jabs at District Attorney  \n\nPULLING BACK ASYLUM  \n\n# By CHELSIA ROSE MARCIUS  \n\nOn Feb. 8, a woman was found dead in a Manhattan hotel room, bludgeoned to death with an iron. This  week,  the  police  announced that a 26-year-old man suspected  of  committing the crime had been arrested in Arizona, where he was accused of stabbing another woman a few days after the homicide in New York.  A  Manhattan  prosecutor flew to Arizona to discuss bringing the man back to face charges. In most homicide cases across the country, it would be a routine extradition. But on Wednesday, an Arizona prosecutor refused, saying she did not believe Alvin L. Bragg, Manhattan’s district attorney, could be trusted to keep him behind bars.  \n\nRachel Mitchell, the Maricopa County attorney, said at a news conference on Wednesday that her team would not work with Mr. Bragg, whose office is seeking to charge the man, Raad Almansoori, in the killing of 38-year-old Denisse Oleas-Arancibia.  \n\n“Having  observed  the  treatment of violent criminals in the New York area by the Manhattan D.A.  there,  Alvin  Bragg,”  Ms. Mitchell told reporters, “I think it’s safer to keep him here and keep him in custody, so that he cannot be out doing this to individuals either in our state, county, or anywhere in the United States.” With that statement, which a spokeswoman later tried to temper, a local New York City story was swept into a national debate over politics and crime, a cyclone fanned by Mr. Bragg’s prosecution of former President Donald J. Trump on charges that he orchestrated the cover-up of a hushmoney payment to a porn star in Lack of Resources May Prevent Significant Improvement  \n\nThis article is by Hamed Aleaziz, Charlie Savage, Maggie Haberman and Zolan Kanno-Youngs.  \n\nPresident Biden is considering executive action that could prevent people who cross illegally into the United States from claiming asylum, several people with knowledge of the proposal said Wednesday. The move would suspend longtime guarantees that give anyone who steps onto U.S. soil the right to ask for safe haven. The order would put into effect a key policy in a bipartisan bill that Republicans thwarted earlier this month, even though it had some of the most significant border security restrictions Congress has contemplated in years. The bill would have essentially shut down the border to new entrants if more than an average of 5,000 migrants per day tried to cross unlawfully in the course of a Asylum seekers and migrants in Boulevard, Calif., last week.  \n\n![](images/image_3.jpg)  \n\nan attempt to conceal her story of an affair before the 2016 election. Both prosecutors have national profiles: Ms. Mitchell, a Republican, was tapped in 2018 to play a key role in the Senate confirmation  hearings  of  one  of  Mr. Trump’s Supreme Court nominees. Mr. Bragg, a Democrat, has been a lightning rod for complaints by Mr. Trump and his supporters that he is being persecuted as he seeks another term in the White House.  \n\nEmily Tuttle, a spokeswoman for  Mr.  Bragg,  called  Ms. Mitchell’s statement a grave insult.  \n\n“It is deeply disturbing that D.A. Mitchell is playing political games in a murder investigation,” Ms. Tuttle said in a statement. She also noted that killings and shootings had dropped since Mr. Bragg took office.  \n\n“New York’s murder rate is less Continued on Page A15  \n\ncross in a given day.   \nThe action under consideration by the White House would have a similar trigger for blocking asylum to new entrants, the people with knowledge of the proposal say. They spoke on the condition of anonymity to discuss internal deliberations.  \n\nThe move, if enacted, would echo a 2018 effort by President Donald J. Trump to block migration, which was assailed by Democrats  and  blocked  by  federal courts.  \n\nAlthough such an action would undoubtedly  face  legal  challenges, the fact that Mr. Biden is considering it shows just how far he has shifted on immigration since he came into office, promising a more humane system after the Trump years.  \n\nMr. Biden has taken a much Continued on Page A14  \n\n# Poverty Soars in New York City, With Children Bearing the Brunt  \n\n# By STEFANOS CHEN  \n\nAfter several years of declining poverty, New York City saw a sharp reversal in 2022, when it experienced its largest yearly increase in the poverty level in a decade.  \n\nTwenty-three  percent  of  the city’s residents were unable to afford basic necessities like housing and food, according to a new report by a research group at Columbia  University  and  Robin Hood, a large philanthropic organization. In 2021, that number was 18 percent.  \n\nThe number of New Yorkers living in poverty, nearly two million in all, included one in four children.  \n\n# Covid",
    "chunk_order_index": 1,
    "full_doc_id": "doc-6930636b407aa2be49b5def38b1e0964"
  },
  "chunk-32123ed7fa698f9f9905a2a30e35582a": {
    "tokens": 632,
    "content": ", when it experienced its largest yearly increase in the poverty level in a decade.  \n\nTwenty-three  percent  of  the city’s residents were unable to afford basic necessities like housing and food, according to a new report by a research group at Columbia  University  and  Robin Hood, a large philanthropic organization. In 2021, that number was 18 percent.  \n\nThe number of New Yorkers living in poverty, nearly two million in all, included one in four children.  \n\n# Covid Aid’s End Spurred Reversal of Trend  \n\npanded government aid during the coronavirus pandemic had helped to counteract job losses, rising rents and high inflation. With most of the programs ending, poverty has risen nationwide, but the surge has been especially clear in New York, said Christopher Wimer, director of the Center on Poverty and Social Policy at the Columbia School of Social Work and a co-author of the report. The national poverty rate in 2022 was 12.4 percent, up from 7.8 percent in 2021, the largest one  \n\nThe findings mark a major setback for New York City, where exBidenomics Squeezing Europe Generous subsidies are helping the United States steal green industries from overseas. PAGE B6 Boeing 737 Max Chief Is Out The head of the factory where the jets are made is leaving the company as it faces federal scrutiny. PAGE B1  \n\n![](images/image_4.jpg)  \n\n# INTERNATIONAL A4-8  \n\n# Pakistanis Rebuke Military  \n\nThis month’s elections broke the illusion of generals as an iron hand controlling politics. News Analysis. PAGE A4  \n\nRussian assaults on the village of Robotyne are meant to pressure Ukraine on the front line, analysts say. PAGE A5  \n\n# SPORTS B8-12  \n\n‘Fangirling’ in South Korea In one of the world’s most patriarchal societies, the sports culture is powered by female fans’ intense devotion to the star players. PAGE B9 An Oscar Contender’s View After nearly a decade, Danielle Brooks bids goodbye to her role in “The Color Purple.” The Projectionist. PAGE C1 Energized by Zombies Directing “Lisa Frankenstein” was a cathartic experience for Zelda Williams, the daughter of Robin Williams. PAGE C1  \n\n![](images/image_5.jpg)  \n\n# NATIONAL A9-16  \n\nEmbryo Ruling’s Long Reach The largest health care system in Alabama has paused in vitro fertilization treatments after a state Supreme Court ruling that frozen embryos should be considered children. PAGE A10 More Student Debt Relief The Biden administration announced the cancellation of another \\$1.2 billion in student loan debt for over 150,000 borrowers on Wednesday, as the president works to energize voters. PAGE A13  \n\n# OPINION A18-19  \n\n# Ross Douthat  \n\n![](images/image_6.jpg)  \n\n# THURSDAY STYLES D1-6  \n\nGeared Up for Monster Jam A rapt crowd in Newark watched as Grave Digger, Zombie and other gigantic trucks soared through the air and crashed to the ground. PAGE D1",
    "chunk_order_index": 2,
    "full_doc_id": "doc-6930636b407aa2be49b5def38b1e0964"
  }
}