{
    "image_1": [],
    "image_2": [],
    "image_3": [
        {
            "entity_name": "KING OF HEARTS",
            "entity_type": "PERSON",
            "description": "The King of Hearts is a crowned figure who presides over the trial alongside the Queen of Hearts, often trying to maintain order, and is depicted as sitting on a throne in the courtroom.",
            "source_image_entities": [
                "KING OF HEARTS"
            ],
            "source_text_entities": [
                "THE KING OF HEARTS"
            ]
        },
        {
            "entity_name": "QUEEN OF HEARTS",
            "entity_type": "PERSON",
            "description": "The Queen of Hearts is a crowned figure known for her angry and capricious behavior, presiding over the trial, and is depicted as sitting beside the King of Hearts in the courtroom.",
            "source_image_entities": [
                "QUEEN OF HEARTS"
            ],
            "source_text_entities": [
                "THE QUEEN OF HEARTS"
            ]
        },
        {
            "entity_name": "WHITE RABBIT",
            "entity_type": "PERSON",
            "description": "The White Rabbit is a character with pink eyes who checks a watch and speaks to itself, leading Alice to follow it down a rabbit-hole, and is depicted as a rabbit dressed in formal attire, standing near the King of Hearts.",
            "source_image_entities": [
                "WHITE RABBIT"
            ],
            "source_text_entities": [
                "WHITE RABBIT"
            ]
        }
    ],
    "image_4": [
        {
            "merged_entity_name": "WHITE RABBIT",
            "entity_type": "PERSON",
            "description": "The White Rabbit is a character with pink eyes who checks a watch and speaks to itself, leading Alice to follow it down a rabbit-hole. A rabbit dressed in a checkered vest and pants, holding a pocket watch and an umbrella, appearing to be in a hurry.",
            "source_image_entities": [
                "WHITE RABBIT"
            ],
            "source_text_entities": [
                "WHITE RABBIT"
            ]
        }
    ],
    "image_5": [
        {
            "merged_entity_name": "ALICE",
            "entity_type": "PERSON",
            "description": "Alice is the main character in the story, who follows a White Rabbit down a rabbit-hole and embarks on a series of adventures. She is a young girl with long hair, wearing a dress and shoes, pulling back a curtain.",
            "source_image_entities": [
                "ALICE"
            ],
            "source_text_entities": [
                "\"ALICE\""
            ]
        },
        {
            "merged_entity_name": "DOOR",
            "entity_type": "OBJECT",
            "description": "A small door behind the curtain that Alice finds in the low hall, which she tries to open with a golden key.",
            "source_image_entities": [
                "DOOR"
            ],
            "source_text_entities": [
                "\"LITTLE DOOR\""
            ]
        }
    ],
    "image_6": [
        {
            "merged_entity_name": "ALICE",
            "entity_type": "PERSON",
            "description": "A young girl with long hair, wearing a dress and holding a bottle labeled 'DRINK ME' in her hand. Alice is the main character in the story, who follows a White Rabbit down a rabbit-hole and embarks on a series of adventures, including falling through the air, encountering various characters, and experiencing unusual adventures and transformations in size.",
            "source_image_entities": [
                "ALICE"
            ],
            "source_text_entities": [
                "\"ALICE\"",
                "\"ALICE\""
            ]
        },
        {
            "merged_entity_name": "BOTTLE",
            "entity_type": "OBJECT",
            "description": "A small bottle with a label that reads 'DRINK ME', held by Alice. The bottle is an object from which Alice drinks, causing her to shrink, and it has a sort of mixed flavor of cherry-tart, custard, pine-apple, roast turkey, toffy, and hot buttered toast.",
            "source_image_entities": [
                "BOTTLE"
            ],
            "source_text_entities": [
                "\"BOTTLE\""
            ]
        },
        {
            "merged_entity_name": "TABLE",
            "entity_type": "OBJECT",
            "description": "A small table with a single drawer, on which the bottle is placed. The table is an object where the golden key is located, which Alice struggles to reach, and it is also where she finds the little bottle with the label saying 'DRINK ME'.",
            "source_image_entities": [
                "TABLE"
            ],
            "source_text_entities": [
                "\"TABLE\""
            ]
        }
    ],
    "image_7": [],
    "image_8": [],
    "image_9": [
        {
            "merged_entity_name": "ALICE",
            "entity_type": "PERSON",
            "description": "Alice is the main character in the story, who falls through the air and has various adventures. She is a young girl with long hair, wearing a dress and standing next to a pole. She experiences unusual adventures and transformations in size.",
            "source_image_entities": [
                "ALICE"
            ],
            "source_text_entities": [
                "\"ALICE\"",
                "\"ALICE\""
            ]
        }
    ]
}