{
  "chunk-aada19701828ea2be7d3e8f9c4c384cf": {
    "tokens": 1200,
    "content": "![](images/image_1.jpg)  \n\n# Lewis Carroll  \n\nAlice's Adventures inWonderland andThroughtheLooking-Glass  \n\nOXFORDWORLD'SCLASSICS  \n\n![](images/image_2.jpg)  \n\n# oxford world’s classics  \n\n# ALICE’S ADVENTURES IN WONDERLAND and  \n\n# THROUGH THE LOOKING-GLASS  \n\nLewis  Carroll  was  the  pseudonym  of  the  Revd  Charles Lutwidge Dodgson, born 27 January $_{\\mathrm{I}}8_{32}$ at Daresbury, Cheshire. He went to Christ Church, Oxford, in $\\boldsymbol{\\mathrm{~I~}}\\!\\!85\\boldsymbol{\\mathrm{I}}$ , where he became a Senior Student, and lived there for the rest of his life. He was Mathematical Lecturer $(\\mathbf{\\sigma}_{\\mathbf{I}}8_{55}5\\substack{-8\\,\\mathbf{I}})$ and was admitted to deacon’s orders in 1861, although he did not proceed to priest’s orders. He was a noted photographer, especially of children, a prolific diarist, letter-writer and pamphleteer; although in some ways reclusive, he had a wide range of acquaintances in literary and theatrical circles. His many mathematical publications include Euclid and his Modern Rivals $(\\mathrm{r}\\,879)$ and Symbolic Logic (1896). His two most famous books, Alice’s Adventures in Wonderland (1865) and Through the Looking-Glass and What Alice Found There (1872), were initially inspired by his friendship with Alice Liddell, the daughter of the Dean of Christ Church. He also published a facsimile of the original manuscript of Alice’s Adventures in Wonderland, Alice’s Adventures under Ground (1886), and an adaptation for young children, The Nursery Alice (1890). The Hunting of the Snark (1876) is widely regarded as a surreal masterpiece, but his other works of fiction, Sylvie and Bruno (1889) and Sylvie and Bruno Concluded (1893), were not successful. He died at Guildford on 14 January 1898, and is buried there.  \n\nPeter Hunt is Professor Emeritus in Children’s Literature at Cardiff University. He has written or edited fifteen books on the subject, including An Introduction to Children’s Literature (OUP, 1994) and the International Companion Encyclopedia of Children’s Literature (2004). He has also written novels for children, including Backtrack (1986).  \n\n# oxford world’s classics  \n\nFor over 100 years Oxford World’s Classics have brought   \nreaders closer to the world’s great literature. Now with over 700   \ntitles––from the 4,000-year-old myths of Mesopotamia to the   \ntwentieth century’s greatest novels––the series makes available lesser-known as well as celebrated writing.  \n\nThe pocket-sized hardbacks of the early years contained introductions by Virginia Woolf, T. S. Eliot, Graham Greene, and other literary figures which enriched the experience of reading.  \n\nToday the series is recognized for its fine scholarship and   \nreliability in texts that span world literature, drama and poetry,   \nreligion, philosophy and politics. Each edition includes perceptive   \ncommentary and essential background information to meet the changing needs of readers.  \n\nLEWIS CARROLL  \n\n# Through the Looking-Glass and what alice found there  \n\nEdited with an Introduction and Notes by PETER HUNT  \n\nWith illustrations by JOHN TENNIEL  \n\n# 3 UNIVERSITY PRESS  \n\nGreat Clarendon Street, Oxford ox2 6dp  \n\nOxford University Press is a department of the University of Oxford. It furthers the University’s objective of excellence in research, scholarship, and education by publishing worldwide in  \n\nOxford New York  \n\nAuckland Cape Town Dar es Salaam Hong Kong Karachi Kuala Lumpur Madrid Melbourne Mexico City Nairobi New Delhi Shanghai Taipei Toronto  \n\nWith offices in  \n\nArgentina Austria Brazil Chile Czech Republic France Greece Guatemala Hungary ltaly Japan Poland Portugal Singapore South Korea Switzerland Thailand Turkey Ukraine Vietnam Oxford is a registered trade mark of Oxford University Press in the UK and in certain other countries  \n\nPublished in the United States   \nby Oxford University Press Inc., New York   \nEditorial material $@$ Peter Hunt 2009   \nThe moral rights of the author have been asserted   \nDatabase right Oxford University Press (maker)   \nFirst published as a World’s Classics paperback 1982   \nReissued as an Oxford World’s Classics paperback 1998   \nThis edition published 2009  \n\nAll rights reserved. No part of this publication may be reproduced, stored in a retrieval system, or transmitted, in any form or by any means, without the prior permission in writing of Oxford University Press, or as expressly permitted by law, or under terms agreed with the appropriate reprographics rights organization. Enquiries concerning reproduction outside the scope of the above should be sent to the Rights Department, Oxford University Press, at the address above  \n\nYou must not circulate this book in any other binding or cover and you must impose this same condition on any acquirer British Library Cataloguing in Publication Data Data available  \n\nLibrary of Congress Cataloging in Publication Data   \nData available   \nTypeset in Ehrhardt   \nby RefineCatch Limited, Bungay, Suffolk   \nPrinted in Great Britain   \non acid-free paper by   \nClays Ltd., St. Ives plc   \nISBN 978–0–19–955829–2   \n1 3 5 7 9 10 $8\\;\\mathrm{~6~}\\mathrm{~4~}\\,2$  \n\n# CONTENTS  \n\nIntroduction vi Note on the Text xliii Select Bibliography xlv A Chronology of C. L. Dodgson/‘Lewis Carroll’ lALICE’S ADVENTURES IN WONDERLAND  \n\nPrefatory Poem 3   \nPreface to the Seventy-ninth",
    "chunk_order_index": 0,
    "full_doc_id": "doc-25e80a930cbb6f47e8c54c6356e1edba"
  },
  "chunk-61b6d5b1b42dd8260585b2140e959638": {
    "tokens": 1200,
    "content": "–19–955829–2   \n1 3 5 7 9 10 $8\\;\\mathrm{~6~}\\mathrm{~4~}\\,2$  \n\n# CONTENTS  \n\nIntroduction vi Note on the Text xliii Select Bibliography xlv A Chronology of C. L. Dodgson/‘Lewis Carroll’ lALICE’S ADVENTURES IN WONDERLAND  \n\nPrefatory Poem 3   \nPreface to the Seventy-ninth Thousand (1886) 5   \nPreface to the Eighty-sixth Thousand (1896) 6   \nContents 7   \nalice’s adventures in wonderland 9  \n\nTHROUGH THE LOOKING-GLASS  \n\nChess Problem 114   \nDramatis Personæ 115   \nPrefatory Poem 116   \nAdvertisement [for the ‘Sixtieth Thousand’] (1893) 117   \nPreface to the Sixty-first Thousand (1896) 118   \nContents 121   \nthrough the looking-glass, and what alice   \nfound there 123   \nChristmas-Greetings [from a Fairy to a Child] 247   \nTo all Child-Readers of ‘Alice’s Adventures in   \nWonderland’ 248   \nAn Easter Greeting to Every Child who Loves ‘Alice’ 249  \n\nAppendix: ‘The Wasp in a Wig’ 251 Explanatory Notes 257  \n\n# INTRODUCTION  \n\nAlice’s Adventures in Wonderland (1865) and Through the Looking-Glass and What Alice Found There $(\\mathbf{\\sigma_{I}}8\\mathbf{\\overline{{7}}}\\mathbf{I}$ , dated $\\phantom{0}\\mathbf{I}\\phantom{0}\\!\\!\\!8\\neg\\!\\!\\!2$ )are two of the most famous, most translated, and most quoted books in the world. They have some claim to be the most influential children’s books ever, which is to say, possibly the most influential works of literature ever––as children’s books often have a more profound and lasting influence on their audiences than adults’ books.  \n\nAlice (or Alis, Alisa, Alenka, Elsje, and many other variations) has had her adventures im Wunderland, du pays des merveilles, and I eventyrland, and in almost every country from Iceland to Australia––where the native peoples who live around Uluru, or Ayer’s Rock, and whose language is Pitjantjatjara, can read about Alitjinja ngura tjukurtjarangka (Alitji in the Dreamtime). The book was translated into Russian by Vladimir Nabokov (as V. Sirin), a link that has not escaped critics: an Italian edition in 1962, La meravigliosa Alice, was subtitled Una lucida invenzione, la creazione poetica di una ‘lolita’ vittoriana. Like other great pieces of popular culture, the books are highly adaptable: Alice has been everywhere from Blufferland to Debitland, and she has been borrowed by feminists (Maeve Kelly’s Alice in Thunderland, 1993), satirists (Latham R. Reid’s Frankie in Wonderland: With Apologies to Lewis Carroll, the Originator and Pre-Historian of the New Deal, 1934), and propagandists (James Dyrenforth’s Adolf in Blunderland, 1940).  \n\nSeveral words that first appeared in the books, such as ‘chortled’, have entered the language, and phrases have become axioms: ‘The rule is, jam to-morrow and jam yesterday––but never jam to-day’. The words ‘Alice’ and ‘Wonderland’ appear in everyday media relating to economics, politics, literary theory, sociology, and a hundred other topics thought worthy of scorn. Interestingly, ‘Wonderland’ is not used to equal ‘stupid’ or ‘idiotic’: as in the books, Wonderland is the place where everyone else is mad, blindly playing absurd, solipsistic games; we are invited to identify with the outsider, the sane and clear-eyed Alice, and to regard the others (as she does) with astonishment or pity. And Alice’s Adventures in Wonderland has even become a yardstick for other books: Flann O’Brien’s surreal masterpiece, The Third Policeman (1967), was described by the Observer as ‘comparable only to Alice in Wonderland as an allegory of the absurd’. And, one might add, as funny, and as chilling.  \n\nThe author is almost as famous as the books: there have been at least fifteen biographies in English alone of Charles Lutwidge Dodgson, who wrote a small number of his books under the name of Lewis Carroll. It seems that all the minutiae of his life have been examined: quite apart from the twelve volumes of his diaries and two volumes of his letters, recent works have included Lewis Carroll in His Own Account: The Complete Bank Account of the Rev. C. L. Dodgson, and ‘The Illnesses of Lewis Carroll’.2 Even Alice Liddell, the little girl who initially inspired the books, has been the subject of two biographies. Parts of the story of Dodgson and Alice Liddell have been fictionalized in Katie Riophe’s novel Still She Haunts Me (2001), and Donald Thomas’s crime novel Belladonna: A Lewis Carroll Nightmare (1983). Dodgson’s life and its intricate connections have been explored exhaustively in the graphic ‘entertainment’ Alice in Sunderland (2007) by Bryan Talbot.  \n\nIn short, Dodgson, ‘Lewis Carroll’, and the ‘Alice’ books are international phenomena, and British national institutions.  \n\nThere are Alice in Wonderland rides at Disneyland in Paris and California, a White Rabbit Statue (unveiled by Lloyd George in 1933",
    "chunk_order_index": 1,
    "full_doc_id": "doc-25e80a930cbb6f47e8c54c6356e1edba"
  },
  "chunk-d0315aa452ca75b1192139416e104a93": {
    "tokens": 1200,
    "content": "onna: A Lewis Carroll Nightmare (1983). Dodgson’s life and its intricate connections have been explored exhaustively in the graphic ‘entertainment’ Alice in Sunderland (2007) by Bryan Talbot.  \n\nIn short, Dodgson, ‘Lewis Carroll’, and the ‘Alice’ books are international phenomena, and British national institutions.  \n\nThere are Alice in Wonderland rides at Disneyland in Paris and California, a White Rabbit Statue (unveiled by Lloyd George in 1933) at Llandudno (where Dodgson never actually visited); 2,525 items on Dodgson-Carroll are held at the University of Texas at Austin, and James Joyce’s ultimate experiment in fiction, Finnegans Wake (1939), is suffused with Carrollian allusions.  \n\nBut what exactly are the ‘Alice’ books? What gives them their global, perennial fascination? Are they harmless, innocent children’s stories, simple fantasies with eccentric characters and nonsense verses? Or are they studies of Victorian female repression, stories that take place in nightmare worlds of aggression and godlessness, allegories of Victorian and Oxford society, intricate textures of mathematical, philosophical, and semantic puzzles, or symbolic explorations of ‘some of the deepest existential problems in a light-hearted way $\\??^{4}\\,\\mathrm{Or}$ gifts of love (or possibly lust) from a frustrated academic to a young girl?  \n\nMuch of this confusion stems from the fact that they are, or at least were, books for children––and because they are perhaps now more accessible to, and interesting for, adults. They pivot on the clash between the idealized view of what a children’s book should be and what childhood should be, and the often uncomfortable fact that the relationships between adults, childhood, and stories are rarely pure and never simple. As a result of these deep-seated attitudes to children’s books, questions are asked of the ‘Alice’ books that would not be considered particularly interesting if they were ‘adult’ books: are they ‘suitable’ for their audience, do children enjoy them, can children see what adults see––and, especially, was Dodgson the kind of man that should have been allowed to write for children? The need to protect an idea of innocence comes up against the difficult realities of the books.  \n\nOf course, the ‘Alice’ books were popular with children when they were first published: they were not only witty and inventive, but they were subversive, parodying pious nursery verses, and, almost for the first time, having a narrative voice that is soundly on the side of the child. In one of the most-quoted remarks on the books, F. J. Harvey Darton described Alice’s Adventures in Wonderland as ‘the spiritual volcano of children’s books . . . the first unapologetic . . . appearance in print, for readers who sorely needed it, of liberty of thought in children’s books . . . Henceforth . . . there was to be in hours of pleasure no more dread about the moral value . . . of the pleasure itself.’ This has usually been taken to mean that the ‘Alice’ books are free of the moralizing that had marked the majority of children’s books since their beginnings in the mid-eighteenth century, and that is true enough. But what Dodgson replaced it with was not, as so many critics have assumed, some kind of light-hearted freedom: the books are actually concerned with discipline, logic, life and death, passion, and a ruthless critique of the adult world. And that does not mean that they are therefore not for children. For, unlike the vast majority of both his predecessors and successors, Dodgson had no doubts as to what children could and should be capable of dealing with. The most important, most neglected, fact about ‘Wonderland’ is that it is not a ‘land of wonders’, but rather ‘a land where one wonders’.  \n\nWhen Alice’s Adventures in Wonderland was first published, Dodgson noted in his Diary nineteen reviews, which used words such as ‘glorious’, ‘original’, ‘charming’, and ‘graceful’. The Athenaeum, however, demurred: ‘We fancy that any child might be more puzzled than enchanted by this stiff, overwrought story’ (16 December $\\mathrm{{\\bfI}}\\,865)^{6}$ and it has not been alone. A Canadian critic, Michelle Landsberg, omitted it from her compendious guide, The World of Children’s Books (1989), on the grounds that it ‘terrified me so much as a child (particularly those sinister, surrealistic Tenniel drawings) that it is the only book that I have ever defaced; the nightmare of shrinking and stretching held a fevered horror for me’. Peter Coveney thought that it had ‘the claustrophobic atmosphere of a children’s Kafka’.  \n\nReaders have often found themselves tempted into complex analyses of the books––and with good reason, for, as we shall see, Dodgson’s literary method was to embed intricate allusions into his texts, and to play with both the language and his readers. However, some of the interpretations of the books may seem more probable than others: Richard Wallace, for example, ‘proves’ that Dodgson was Jack the Ripper, and that ‘these crimes began as a caper, fuelled by rage, boredom, antiestablishment feelings, and emboldened by years of successfully hiding Victorian smut in his children’s works’. At the other extreme is Virginia Woolf, no less, who wrote (perhaps a little unguardedly) in 1939: ‘Only Lewis Carroll has shown us the world upside down as a child sees it, and has made us laugh as children laugh, irresponsibly. Down the groves of pure nonsense we whirl laughing, laughing––’.  However, with",
    "chunk_order_index": 2,
    "full_doc_id": "doc-25e80a930cbb6f47e8c54c6356e1edba"
  },
  "chunk-aece4132b7924312d195ce5ac01f24c8": {
    "tokens": 1200,
    "content": ", boredom, antiestablishment feelings, and emboldened by years of successfully hiding Victorian smut in his children’s works’. At the other extreme is Virginia Woolf, no less, who wrote (perhaps a little unguardedly) in 1939: ‘Only Lewis Carroll has shown us the world upside down as a child sees it, and has made us laugh as children laugh, irresponsibly. Down the groves of pure nonsense we whirl laughing, laughing––’.  However, with that comment, she was perpetuating a myth that had been carefully developed by Dodgson, who described his books as ‘innocent and healthy amusement . . . for the children I love so well’. And yet there is actually very little ‘nonsense’ in the books––but plenty of satire and parody, and, as Walter de la Mare wrote, ‘all satire and most parody in themselves are mortal enemies of true Nonsense, which is concerned with the joys of a new world not with the follies and excesses of an old’.11 The ‘Alice’ books are never quite what they seem, and they relate in a complex way to the complex personality of their author, and to a rapidly changing world. Juliet Dusinberre notes that ‘cultural change was both reflected and pioneered in the books which children read. Radical experiments in the arts in the early modern period began in the books which Lewis Carroll and his successors wrote for children.’  Similarly, Humphrey Carpenter notes that Alice’s Adventures in Wonderland ‘was published just as the two great religious spearheads of the nineteenth century, the Evangelicals and the Oxford Movement, were losing their original force, and in its anti-religious sentiments it heralded the coming of an era of scepticism’.  \n\nAnd yet the idea of the innocence of the book persists, and it is rooted in another myth, of how the book was written. On 4 July 1862, an idyllic ‘golden afternoon’, a shy, stuttering Oxford mathematician-clergyman, Charles Dodgson, and his friend the Revd (later Canon) Robinson Duckworth, took three little girls, the daughters of the Dean of their college, for a picnic on the River Thames or Isis. As they rowed, Dodgson made up an impromptu story about one of the girls, Alice, and at the end of the day, she begged him to write it down. He wrote it out and illustrated the story, Alice’s Adventures under Ground, and gave it to her on 26 November $\\mathbf{I}864$ , later expanding it as Alice’s Adventures in Wonderland. It is an attractive story, perhaps none the worse for the fact that it is only partially true; but, like other myths about books supposedly written for specific children–– Kenneth Grahame’s The Wind in the Willows or A. A. Milne’s Winnie-the-Pooh––it is culturally important that it should be true.  \n\nDodgson has been described as ‘One of the great Victorian eccentrics’14 but his background was more than respectable. His great-grandfather Charles Dodgson (1722?–1795 or 1796)–– who was grandfather of both his parents––was bishop of Elphin, in Ireland (part of United Diocese of Kilmore, Elphin and Ardagh, since $\\phantom{}{\\mathrm{I}}\\,84\\phantom{}$ ). His grandfather Captain Charles Dodgson $\\scriptstyle\\left(\\mathbf{I}76\\mathbf{9}:-\\mathbf{I}803\\right)$ was killed in an ambush by Irish rebels near Phillipstown in Ireland. His father, the Revd Charles Dodgson (1800–68), took a double first in classics and mathematics at Christ Church, Oxford, and married his cousin, Frances Jane Lutwidge $\\left(\\mathbf{1}803{-}5\\mathbf{I}\\right)$ in $\\phantom{0}\\mathrm{I}\\!\\left827$ , thus failing to comply with the requirement for Christ Church scholars to remain single. He was granted the curacy at Daresbury, an isolated village in Cheshire in $\\phantom{0}\\mathbf{I}\\&27$ ; in $\\operatorname{I}843$ , he moved to St Peter’s church, Croft, and later became a canon of Ripon cathedral, and archdeacon of Richmond. Although a witty man, his ‘reverence for sacred things was so great that he was never known to relate a story which included a jest upon words from the Bible’.  \n\nCharles Lutwidge was born 27 January $\\mathrm{I}\\,8_{32}$ at the parsonage at Daresbury; he was the third child and eldest son of a family of eleven (seven girls and four boys) all of whom lived to old age–– two of the boys, Skeffington and Wilfred, and one of the girls, Mary, married. His brother Edwin became a missionary on Tristan da Cunha and later on the Cape Verde Islands.  \n\nGiven that almost all biographies of Charles Lutwidge Dodgson contain an element of hagiography, it does seem that he was brought up in a pious, loving family atmosphere. When he was 12 he was sent to Richmond Grammar School for two terms, and then in January $\\phantom{0}\\mathrm{I}846$ to Rugby School––of which he wrote in his Diary in $\\operatorname{I}855$ :‘I cannot say that I look back upon my life at a Public School with any sensations of pleasure, or that any earthly considerations would induce me to go through my three years again.’ (There is a school book, dated 13 November $\\mathbf{I}846.$ ,with Dodgson’s name in it followed",
    "chunk_order_index": 3,
    "full_doc_id": "doc-25e80a930cbb6f47e8c54c6356e1edba"
  },
  "chunk-6b5841a291645626a191a049d0845216": {
    "tokens": 1200,
    "content": "in January $\\phantom{0}\\mathrm{I}846$ to Rugby School––of which he wrote in his Diary in $\\operatorname{I}855$ :‘I cannot say that I look back upon my life at a Public School with any sensations of pleasure, or that any earthly considerations would induce me to go through my three years again.’ (There is a school book, dated 13 November $\\mathbf{I}846.$ ,with Dodgson’s name in it followed by the words, in a different hand, ‘is a muff’.) But he was academically successful, and a survivor.  \n\nHe and his siblings produced a series of family magazines, beginning with Useful and Instructive Poetry in $\\phantom{-}\\mathrm{I}\\,845$ , followed by The Rectory Magazine (while he was at Rugby), The Rectory Umbrella (all his own work), and Mischmasch, and Dodgson shows a taste for lively comedy, reminiscent of Edward Lear, and a talent for parody.  \n\nHis life at Christ Church, Oxford, began sadly: two days after he arrived on 24 January 1851, his mother died. The following year he was nominated to a Studentship (Fellowship) which allowed him to live at Christ Church for the rest of his life, on condition that he did not marry, and that he proceed to Holy Orders. He took a first class in mathematics, and in 1855 was appointed mathematical lecturer (a post that he held, giving, by his own account, uninspiring lectures which his students sometimes openly mocked, until 1881). Although a deeply religious and pious man, he felt himself unsuited to work in a parish (possibly because of his speech impediment); he was admitted to deacon’s orders on 22 December 1861, ‘as a sort of experiment’, as he wrote in his Diary, and regarded himself ‘as practically a layman’. He did not proceed to priest’s orders, although he did occasionally preach long ‘plain, evangelical sermon(s) of the old-fashioned kind’.  \n\nHe took his responsibilities as head of his family seriously, after his father died in 1868, and took a lease on ‘The Chestnuts’, Guildford, for his unmarried siblings. He continued to support them throughout his life––his recently published bank-accounts suggest that this may have put a great strain on his finances (although he makes no mention of this in his Diary). He often spent time with his cousins in the Sunderland area, and was involved in nursing his godson at Guildford in $\\phantom{}_{\\mathrm{I}}8\\neg\\mathinner{|{4}\\rangle}$ ; from $\\phantom{0}\\mathbf{I}877$ ,he spent his summers at Eastbourne.  \n\nFor a man in such an apparently sheltered situation, Dodgson led an obsessively hard-working and varied life. He produced several works on mathematics, notably on Euclid, which have been highly regarded. And he wrote endlessly. In $\\operatorname{I}853$ he began his Diary; his Register of letters sent and received, maintained for thirty-seven years, recorded 98,721 items, not counting his extensive correspondence from $\\mathbf{\\tau}_{\\mathbf{I}}88_{2}$ to $\\operatorname{I}892$ when he was curator of Christ Church common room. (This appears to have been a particularly lively period, producing a flood of letters, pamphlets, and notices.) $\\operatorname{In}\\,\\mathbf{1}856$ he bought his first camera; this used collodiol wet-plate techniques (invented in 1855) which tended to stain the hands––hence Dodgson’s habit of wearing gloves when in society. He was a pioneer photographer, especially of children, and was noted for the naturalness of his compositions: ‘Very few amateurs from Dodgson’s period constantly photographed for so many years. [He was] a polymath of remarkable talent.’17 It was a hobby that brought him into contact with many distinguished contemporaries, notably the Tennysons and the MacDonalds; Dodgson and MacDonald were both members of the Society for Psychical Research, and shared interests in homeopathy and anti-vivisection.  \n\nDodgson was an avid theatregoer, making the acquaintance of Ellen Terry and her family, and took a vocal interest in national issues. For example, he had some influence in bringing about the Net Book Agreement (1900–97) which regulated the prices at which booksellers could sell books. W. T. Stead’s campaign against child prostitution in the Pall Mall Gazette in the 1880s, which led in $\\mathbf{I}885$ to the raising of the age of consent to 16, provoked Dodgson into a passionate response: he wanted Stead to be prosecuted for obscene libel for the graphic way in which he presented his findings.  \n\nIn Oxford, he settled down to a life of local controversy, publishing dozens of privately printed pamphlets generally on the conservative side of arguments, and often in conflict with Henry George Liddell who became Dean of Christ Church in 1855. He also used the talent for versification which he had shown in his ‘domestic’ writings, and in $\\operatorname{I}855$ he contributed pieces to the Comic Times and its successor, The Train. Its editor, Edmund Yates, asked him for a pseudonym, and Dodgson noted in his Diary for 11 February, 1856: ‘Wrote to Mr Yates sending him a choice of names: 1. Edgar Cuthwellis (made by transposition out of “Charles Lutwidge”). 2. Edgar U. C. Westhill (ditto). 3. Louis Carroll (",
    "chunk_order_index": 4,
    "full_doc_id": "doc-25e80a930cbb6f47e8c54c6356e1edba"
  },
  "chunk-de163ecd1668531ab0959c5c8a4478ce": {
    "tokens": 1200,
    "content": "he contributed pieces to the Comic Times and its successor, The Train. Its editor, Edmund Yates, asked him for a pseudonym, and Dodgson noted in his Diary for 11 February, 1856: ‘Wrote to Mr Yates sending him a choice of names: 1. Edgar Cuthwellis (made by transposition out of “Charles Lutwidge”). 2. Edgar U. C. Westhill (ditto). 3. Louis Carroll (derived from Lutwidge . . Ludovic . . Louis, and Charles). Lewis Carroll (ditto).’ On 1 March, he added the note: ‘“Lewis Carroll” was chosen’.  \n\nAs ‘Lewis Carroll’, apart from the two highly successful ‘Alice’ books, he published verse: Phantasmagoria and Other Poems (1869), his surreal nonsense masterpiece, The Hunting of the Snark $(\\mathrm{r}\\,876)$ , and Rhyme? And Reason? (1883). His other sizeable attempts at fiction for children, Sylvie and Bruno (1889) and Sylvie and Bruno Concluded (1893), are, as his biographer Morton Cohen puts it, ‘overburdened by seriousness, calculated messages, ponderous cogitations, and fulminations that reflect the map of Charles’s aging mind and broken heart. They are at one and the same time his apologia pro vita mea and his consolation philosophiae.’  They resemble another solipsistic epic, Charles Kingsley’s The Water Babies (1863)––which at least had a rather stronger narrative to support its many digressions and eccentricities––and their religiosity is quite alien to the world of Alice. In 1892, Dodgson wrote to the Revd C. A. Goodhart, Rector of Lambourne, Essex: ‘In “Sylvie and Bruno” I took courage to introduce what I had entirely avoided in the two “Alice” books––some reference to subjects which are, after all, the only subjects of real interest in life, subjects which are so intimately bound up with every topic of human interest that it needs more effort to avoid them than to touch on them; and I felt that such a book was more suitable to a clerical writer than one of mere fun.’19 His final collection, of ‘serious’ poems, Three Sunsets and Other Poems, was published in February $\\mathbf{\\delta}_{\\mathbf{I}}898$ .  \n\nHe died, still working hard on his sermons and on Euclid, on 14 January $\\mathbf{\\delta}_{\\mathbf{I}}898$ at ‘The Chestnuts’ in his sixty-sixth year; he is buried at the Mount cemetery in Guildford. In his will (his effects were sold for $\\mathcal{f}_{5}729$ . 2s. 6d. at Holywell Music Room, Oxford, on 10 and 11 May 1898) he divided his estate between his siblings, and requested a plain funeral: ‘simple and inexpensive, avoiding all things that are merely done for show, and retaining only what is . . . requisite for its decent and reverent performance’.  \n\nAfter his death, it was suggested, following the example of a project run by Aunt Judy’s Magazine from 1868, that a subscription be got up to endow a cot at Great Ormond Street Hospital in his name. Subscribers included not only the ‘original’ Alice, Alice Pleasance (Liddell) Hargreaves, Canon Duckworth, and Sir John Tenniel, but a galaxy of eminent Victorians, including George Meredith, George MacDonald, Jerome K. Jerome, Dante Gabriel Rossetti, Anthony Hope Hawkins, R. D. Blackmore, Holman Hunt, Walter Crane, Sir Henry Irving, Sir Walter Besant, Alice Meynall, and the Princess Alice.  \n\nAnd what was the man who led this life of detail like? The American writer Mark Twain, who met him at the MacDonalds’ in July $\\phantom{0}\\mathbf{I}8\\phantom{0}79$ , described him as ‘the stillest and shyest full-grown man’ he had ever met.20 The Revd W. Tuckwell in his Reminiscences of Oxford (1900) regarded him as ‘austere, shy, precise, absorbed in mathematical reverie, watchfully tenacious of his dignity, stiffly conservative in political, theological, social theory, his life mapped out in squares like Alice’s landscape, he struck discords in the frank harmonious camaraderie of College life’.21 John Goldthwaite has an even less flattering view:  \n\nHis own piety made him a public nuisance. His illustrators were forbidden to illustrate on Sundays. Upon discovering that a stage production of The Water Babies contained a burlesque of a Salvation Army Hymn, he campaigned to have the theatre’s licence revoked. The infamous Bowdler edition of Shakespeare was a scandal to the prudish don . . . He doted on maudlin songs, the pathetic in drama . . . Unembarrassed by his own bad taste, he was a snob and a lion hunter, chasing after celebrities with his camera.22  \n\nCertainly he tried to keep the lives of Charles Dodgson and Lewis Carroll separate––although he denied that there was any truth in the story that when Queen Victoria wrote to him, having read Alice’s Adventures in Wonderland, asking for his next book, he sent her An Elementary Treatise on Determinants.23  \n\nBut one aspect of his character has tended to overshadow everything else––Dodgson was devoted to ‘child-friends’, little girls for preference, whom he liked to entertain, photograph, and sketch. For several of these, his friendship extended into",
    "chunk_order_index": 5,
    "full_doc_id": "doc-25e80a930cbb6f47e8c54c6356e1edba"
  },
  "chunk-9fb91c06407e6c305702623a272e95bc": {
    "tokens": 1200,
    "content": "Lewis Carroll separate––although he denied that there was any truth in the story that when Queen Victoria wrote to him, having read Alice’s Adventures in Wonderland, asking for his next book, he sent her An Elementary Treatise on Determinants.23  \n\nBut one aspect of his character has tended to overshadow everything else––Dodgson was devoted to ‘child-friends’, little girls for preference, whom he liked to entertain, photograph, and sketch. For several of these, his friendship extended into adulthood, and there is no record of any of them having anything but praise for his care and kindness. Rather, he was remembered with much affection––and certainly there was no hint of any impropriety. However, some of the parents of these children did have their objections, and it seems that there was some gossip in Oxford, which may well have been the reason that he gave up photography in 1880. In a letter of 7 June $\\mathbf{I}894$ to the actress Ellen Terry, he wrote: ‘Now that I have entered on the stage of being a “lean and slippered pantaloon”, and no longer dread the frown of Mrs Grundy [a byword for propriety] I have taken to giving tête-à-tête dinner-parties––the guest being, in most cases, a lady of age varying from 12 to 67.  \n\nBut many modern readers have found it difficult to accept that the photographs that Dodgson took of undressed or partly dressed young girls are not salacious, or that his letters to parents negotiating in detail whether the girls could or could not wear drawers while he photographed them are anything less than excruciatingly embarrassing. The famous, or notorious, picture of Alice Liddell posing as a beggar-girl, in carefully revealing rags, has seemed to make the case against Dodgson as a latent paedophile incontestable. The question is, whether this is actually relevant to the reading of his books? (Roger Taylor points out that the ‘beggar-girl’ portrait is almost always judged out of context: it is one of a contrasting pair, the other showing Alice ‘in her best outfit’.)  \n\nIt is, however, as well to remember that times change: for example, until $\\mathbf{I}885$ the age of consent was 12, and at the end of the century the average age of menarche was about 16. As Kimberley Reynolds points out, ‘it was not uncommon in the nineteenth century for grown men to be attracted to young girls––girls too young to be sexually demanding or threatening and she cites the examples of Swinburne, Ruskin, Mayne Reid, ‘E. W. Benson (who became Archbishop of Canterbury) [who] fell in love with an eleven-year-old to whom he proposed when she was twelve’––and Queen Victoria’s daughter, Beatrice, who was engaged at 13. 25  \n\nEqually, as Anne Higonnet observed, attitudes to certain images differed, too: ‘To [Dodgson’s] contemporaries . . . Alice’s beggar portrait did not look prurient at all . . . In their time [such pictures] were . . . seen as . . . images of natural innocence and therefore naturally innocent themselves . . . Carroll was absolutely convinced that the innocence of the child was a natural quality.’26 James Kincaid’s pioneering Child-Loving: The Erotic Child and Victorian Culture also places the Victorian fascination with the child in its context, suggesting, of the ‘Alice’ books, that they are characteristic of ‘a paradigm of play [that] is not seeking fulfilment, wants not even to construct a seduction drama but to stand on the threshold of such a drama. It is an erotics of temptation and flirtation . . . because, in the catching, the world would collapse and desire would end.’27  \n\nNevertheless, it seems unlikely that an unbiased observer in the twenty-first century could read the following account of Dodgson without, at the very least, a raised eyebrow. Written by the founding editor of Puffin Books, Eleanor Graham, it is aimed at children, and appeared in the 1946 Puffin edition of the ‘Alice’ books, under the title ‘How the Story Was Told’. The Revd Dodgson, Graham wrote, without any perceptible irony, was  \n\nvery fond of children and had many child friends, though often he did not keep them long. He took great pains for their entertainment and invited them, sometimes to tea or lunch in his rooms, sometimes to go to London with him for the day, to a theatre or to the zoo. Even when he set out alone on a journey by train, he took with him a supply of puzzles, games, and small toys in case he found a child in his compartment. Moreover, when he went to the seaside he kept a bunch of large safety pins in his pocket for the convenience of little girls who might want their frocks pinned up so that they could paddle more comfortably.  \n\nOr, perhaps, we might read that with a feeling of regret for a lost, innocent age––that age being the 1940s as much as the 1860s. In 1937, Edward Ardizzone’s picture-book Lucy Brown and Mr Grimes portrayed a small girl befriending an old man in a park: because of what Ardizzone described as ‘silly women librarians’ the story was modified for its reissue in 1970, so that Mr Grimes became an old family friend.  \n\nBut even the most sympathetic of Dodgson’s biographers, Morton Cohen, finds it necessary to face this particular problem directly (given that his index contains the item, ‘Dodgson, nude female form, attachment to’) and makes what has become a common connection:  \n\nWe",
    "chunk_order_index": 6,
    "full_doc_id": "doc-25e80a930cbb6f47e8c54c6356e1edba"
  },
  "chunk-0ce578c31a126d9f28ea0d89b8cbe31b": {
    "tokens": 1200,
    "content": "in a park: because of what Ardizzone described as ‘silly women librarians’ the story was modified for its reissue in 1970, so that Mr Grimes became an old family friend.  \n\nBut even the most sympathetic of Dodgson’s biographers, Morton Cohen, finds it necessary to face this particular problem directly (given that his index contains the item, ‘Dodgson, nude female form, attachment to’) and makes what has become a common connection:  \n\nWe cannot know to what extent sexual urges lay behind Charles’s preference for drawing and photographing children in the nude. He contended that the preference was entirely aesthetic . . . but . . . he probably felt more than he dared acknowledge, even to himself . . . For posterity, however, there were compensations. If Charles Dodgson’s suppressed and diverted sexual energies caused him unspeakable torments, and they did, they were in all probability the source of those exceptional flashes of genius that gave the world his remarkable creative works.29  \n\nThis aspect of Dodgson’s character has led to a library of analytical works, which were prophesied by J. B. Priestley in  \n\n1921 (apropos of Alice’s Adventures in Wonderland being translated into German):  \n\nA cloud of commentators will gather, and . . . sit down to write huge volumes of comment and criticism; they will contrast and compare the characters (there will even be a short chapter on Bill the Lizard), and will offer numerous conflicting interpretations of the jokes. After that, Freud and Jung and their followers will inevitably arrive upon the scene, and they will give us appalling volumes on the ‘Sexualtheorie’ of Alice in Wonderland . . . We shall understand, for the first time, the particularly revolting symbolism of the Mad Hatter’s Tea-Party.  \n\nConsequently, there is a good deal of irony in the fact that the first ‘Freudian’ study, ‘Alice in Wonderland Psycho-Analysed’ (The New Oxford Outlook, 1933), by an Oxford undergraduate, A. M. E. (Tony) Goldschmidt, was almost certainly intended as satire. He began: ‘no critic upon whom the Freudian theory has made even the slightest impression can refrain from recognising sexual symbolism . . . when it is very clearly manifested’, and he then explores Alice falling down a deep hole (‘perhaps the bestknown symbol of coitus’), pursuing the White Rabbit (‘trying to make up disparity in ages’), and the symbolism of locks, keys, doors, changing sizes, neck length, and little houses. ‘Had [Dodgson] lived today,’ Goldschmidt concludes (blandly), ‘he might have undergone analysis, discovered the cause of his neurosis, and lived a more contented life.’31  \n\nWhat followed, however, was rather more serious, or was taken more seriously. Dodgson’s psyche, and his relationship with the real Alice, became happy hunting grounds for psychologists and psychological critics, notably Paul Schilder in The Journal of Nervous and Mental Disease (1938), Florence Becker Lennon in Victoria Through the Looking Glass: The Life of Lewis Carroll (1945), and Phyllis Greenacre in Swift and Carroll: $\\mathcal{A}$ Psychoanalytical Study of Two Lives (1955).  More recent critics have been more pragmatic; as Martin Gardner noted, ‘the point here is not that Carroll was not neurotic (we all know that he was), but that books of nonsense fantasy for children are not such fruitful sources of psychoanalytic insight as one might suppose them to be. They are much too rich in symbols. The symbols have too many explanations.’  \n\nSpecifically, Dodgson’s muse was Alice Pleasance Liddell, second daughter of Dean Liddell of Christ Church. Alexander L. Taylor was convinced that Dodgson was in love with her: ‘She and she alone was his lost love . . . the little ghost that was to come crying in the night to the windows of his bachelor room in Tom Quad.’  Dodgson became a friend of the family, and especially the children––Harry and the three (later five) daughters–– whom he photographed and took for excursions, including river trips. The friendship continued until June 1863, when there was a sudden estrangement; Dodgson was no longer welcome at the Deanery, and Mrs Liddell tore up his letters to Alice. (In 1932, Alice wrote: ‘I cannot remember what any of them were like, but it is an awful thought to contemplate what may have perished in the Deanery waste-paper basket.’)  From that time, Dodgson saw the girls only occasionally. There has been a great deal of speculation on what happened, especially as key pages have been cut from Dodgson’s Diary, probably by his niece, Menella. (Four of the thirteen volumes of his diaries have been lost, and pages were removed from the others by members of Dodgson’s family.) The most common speculation has been that Mrs Liddell felt that Dodgson was becoming too fond of Alice and the girls, and felt that with their aristocratic connections, her daughters could aim higher. Others were that he proposed to Alice, or to Lorina (who was 14), that he displeased Mrs Liddell by disapproving of a party proposed by an eligible undergraduate, Lord Newry––or, as in Katie Roiphe’s novel, Still She Haunts Me, that Dodgson overstepped the photographic mark. It has also been suggested that there was no rift, but that Mrs Liddell and Dodgson mutually agreed to reduce his involvement with the family to end rumours about his intentions towards Lorina and/or Miss Prickett, the governess. Karoline Leach has argued (",
    "chunk_order_index": 7,
    "full_doc_id": "doc-25e80a930cbb6f47e8c54c6356e1edba"
  },
  "chunk-753165eb51ca3dfd776df5dc5a510756": {
    "tokens": 1200,
    "content": "ving of a party proposed by an eligible undergraduate, Lord Newry––or, as in Katie Roiphe’s novel, Still She Haunts Me, that Dodgson overstepped the photographic mark. It has also been suggested that there was no rift, but that Mrs Liddell and Dodgson mutually agreed to reduce his involvement with the family to end rumours about his intentions towards Lorina and/or Miss Prickett, the governess. Karoline Leach has argued (controversially) in In the Shadow of the Dreamchild: A New Understanding of Lewis Carroll that the generally accepted views of Dodgson’s life and character are based on unsubstantiated psychological readings, and on the biography by Dodgson’s nephew, Stuart Dodgson Collingwood (1899), which she describes as ‘absurd and ultimately deceitful’.36  \n\nDodgson transferred his affections to a long succession of other ‘child-friends’, but there can be little doubt that Alice was very important to him (he took his last photograph of her in $\\phantom{0}\\mathrm{I}\\,870)$ ). While there may be something in Humphrey Carpenter’s suggestion that all of this complex story ‘hardly matters, for Alice’s Adventures in Wonderland is not about Alice Liddell at all’  she was certainly its inspiration.  \n\n# The Books  \n\nAs we have seen, Friday, 4 July 1862 has acquired mythological status as the day upon which Dodgson began Alice’s Adventures in Wonderland, and as the prefatory poem has it: ‘All in the golden afternoon | Full leisurely we glide . . . Beneath such dreamy weather’. (And, as Walter de la Mare observed, in his short book on Dodgson: ‘afternoons in July, if fair and cloudless, are apt to be narcotic. The rhythm of sculling quiets the mind and sets the workaday wits drowsing.’ ) In $\\phantom{0}\\mathbf{I}88\\phantom{7}$ , in an article for The Theatre, ‘“Alice” on the Stage’, Dodgson recalled, in romantic tones, that  \n\nMany a day had we rowed together on that quiet stream . . . and many a fairy tale had been extemporised for their benefit . . . yet none of these many tales got written down: they lived and died, like summer midges, each in its golden afternoon . . . Full many a year has slipped away, since that ‘golden afternoon’ that gave thee birth, but I can call it up almost as clearly as if it were yesterday––the cloudless blue above, the watery mirror below.39  \n\nAs to the date, Dodgson had taken the Liddell sisters on several river trips––a trip downriver to Nuneham Park on 3 July $\\phantom{-}\\mathbf{1}862$ was cancelled because of rain. On the following day, Dodgson made this entry in his Diary:  \n\nDuckworth and I made an expedition up the river to Godstow with the 3 Liddells: we had tea on the bank there, and did not reach Christ Church again until $^{1\\!}/_{2}$ past 8, when we took them on to my rooms to see my collection of micro-photographs, and restored them to the Deanery, just before 9.  \n\nSo far, so good. But, curiously, that entry does not mention the birth of the book: it was not until six months later, on 10 February 1863, that Dodgson added, on a blank page opposite the 4 July entry: ‘On which occasion I told them the fairy-tale of Alice’s Adventures under Ground which I undertook to write out for Alice, and which is now finished.’ His first mention of the book in his Diary is on 6 August 1862 when, on another trip to Godstow he noted, ‘had to go on with my interminable fairy-tale of Alice’s Adventures’. Even more curiously, 4 July wasn’t a ‘golden afternoon’: the records of the Meteorological Office in London show that the weather near Oxford was ‘cool and rather wet’. The records at the Radcliffe Observatory, Oxford, give ‘rain after 2 p.m., and cloud cover 10/10; temperature $67.9^{\\circ}\\mathrm{F}\\mathrm{:}$ .And then there is the letter from Alice (now Mrs Hargreaves), printed in 1899 by Stuart Collingwood, which supports the good weather, but not the destination:  \n\nI believe the beginning of ‘Alice’ was told one summer afternoon when the sun was so burning that we had landed in the meadows down the river [which suggests that they had gone to Nuneham Park], deserting the boat to take refuge in the only bit of shade that was to be found, which was under a new-made hayrick.40  \n\nAs an old lady, Alice altered this story to fit the accepted version: ‘that blazing summer afternoon with the heat haze shimmering over the meadows . . . near Godstow’.41 Nor is Canon Duckworth, the other passenger, any help: his account, in 1899, although it has joined the much-quoted folklore, does not mention either the date or the weather:  \n\nI rowed stroke and he rowed bow in the famous Long Vacation voyage to Godstow, when the three Miss Liddells were our passengers, and the story was actually composed and spoken over my shoulder for the benefit of Alice Liddell, who was acting as ‘cox’ of our gig. I remember turning round and saying, ‘Dodgson, is this an extempore romance of yours?’ And he replied, ‘",
    "chunk_order_index": 8,
    "full_doc_id": "doc-25e80a930cbb6f47e8c54c6356e1edba"
  },
  "chunk-f13cf66c8266ff0d906f36fc396809d3": {
    "tokens": 1200,
    "content": "does not mention either the date or the weather:  \n\nI rowed stroke and he rowed bow in the famous Long Vacation voyage to Godstow, when the three Miss Liddells were our passengers, and the story was actually composed and spoken over my shoulder for the benefit of Alice Liddell, who was acting as ‘cox’ of our gig. I remember turning round and saying, ‘Dodgson, is this an extempore romance of yours?’ And he replied, ‘Yes I’m inventing as we go along.’  \n\nWhen subscribing to the Lewis Carroll Memorial Cot in 1898, Duckworth maintained the story: ‘on that beautiful summer afternoon in the Long Vacation which is described in the introductory verses to the story’.43  \n\nAnd so, sad to say, the only actual evidence that the story was begun on 4 July, seems to be an afterthought. But the myth of a happy, innocent, sunny, and spontaneous story was established, and Dodgson, according to Duckworth, ‘sat up nearly the whole night’ writing the story down.  \n\nWhat happened then seems to be that Dodgson produced a draft version (now lost), sometime before 10 February 1863, and sent it to George MacDonald’s son, Henry. The family endorsed it, and encouraged by Duckworth, Dodgson began to expand the book. Meanwhile, he also hand-lettered and illustrated a version as a gift for Alice Liddell, a green leather booklet called Alice’s Adventures under Ground which he presented to her as a Christmas gift in $\\mathbf{I}864$ . Interestingly, Dodgson seems to have made no attempt to depict Alice Liddell in his pictures, except in a cameo on the final page, which he then covered with a small photograph of her. Henry Kingsley (brother of Charles) saw Alice’s Adventures under Ground at the Deanery and suggested that Dodgson be encouraged to publish it. As Humphrey Carpenter points out, it seems that Alice Liddell was one of the few people not consulted over the publication.  \n\nAlice’s Adventures under Ground is just over half as long as Alice’s Adventures in Wonderland. In producing the full text, Dodgson  made  many  small  revisions––for  example,  he smoothed out the oddity that the Red Queen is also the ‘Marchioness of Mock Turtles’––and made several major additions. There were two completely new chapters––Chapter VI, ‘Pig and Pepper’, and Chapter VII, ‘The Mad Tea Party’––and he expanded the chapters on the Queen’s croquet ground, and the lobster quadrille; the trial scene was expanded from one page to two chapters. He also made the book less personal. The Caucus race, led by the Dodo, replaced the thinly disguised true-to-life account of a picnic that had taken place on Tuesday, 17 June 1862. He recorded in his Diary an expedition downriver to Nuneham; the party included his sisters, Frances and Elizabeth, his aunt, Lucy Lutwidge, Duckworth, the three Liddell sisters, and (almost certainly) their governess, Miss Prickett. (Some of them appear in the story: the sulky Lory is Alice’s eldest sister Lorinda, the mouse is probably Miss Prickett––who reads from the lesson-book that she had been using with the children, Dodo is Dodgson, and the Duck, Duckworth.) When it rained, Dodgson took the children to a house that he knew nearby to dry themselves. In Alice’s Adventures under Ground, the story is very much the same: the Dodo walks on ‘with Alice, the Lory, and the Eaglet, and soon brought them to a little cottage, and there they sat snugly by the fire, wrapped up in blankets, until the rest of the party had arrived, and they were all dry again’. The version in Alice’s Adventures in Wonderland removes these real-life references: ‘“What I was going to say,” said the Dodo in an offended tone, “was, that the best thing to get us dry would be a Caucus-race”’ (p. 26) which, as several critics have pointed out, seems to have rather wider political and satirical implications.  \n\nThrough an acquaintance, Dodgson met Alexander Macmillan, whose firm had published Charles Kingsley’s The Water Babies, and he began to look for an illustrator: partly at Duckworth’s suggestion, he recruited John Tenniel, one of the political cartoonists for Punch––which some critics have seen as demonstrating Dodgson’s satirical intent.  \n\nFrom then on, the history of the ‘Alice’ books says a great deal about their author’s character––meticulous to the point of fussiness, and perfectionist to the point of pettiness. His relationship with Macmillan was sometimes fractious: Charles Morgan, the historian of the company, observed that ‘There never was an author more elaborately careful than Lewis Carroll for the details of production, or one that can have more sorely tried the patience of his publisher . . . [He] never allowed himself to be far absent from the minds of publisher, printer, or binder . . . Books, ingenuities and trouble poured from him.’45 John Pudney notes that ‘not even the packers escaped his attention. He sent in a diagram, showing how parcels were to be stringed and how the knots were to be tied. This hung for years in the Macmillan post-room.’46  \n\nThe first problem with the printing of Alice’s Adventures in Wonderland, however, was not Dodgson’s fault. In June 1865, 2,000 copies were printed (at Dodgson’s expense) by the Clarendon Press in",
    "chunk_order_index": 9,
    "full_doc_id": "doc-25e80a930cbb6f47e8c54c6356e1edba"
  },
  "chunk-d13c896d9378a4efe478ab6374dfe2aa": {
    "tokens": 1200,
    "content": "ney notes that ‘not even the packers escaped his attention. He sent in a diagram, showing how parcels were to be stringed and how the knots were to be tied. This hung for years in the Macmillan post-room.’46  \n\nThe first problem with the printing of Alice’s Adventures in Wonderland, however, was not Dodgson’s fault. In June 1865, 2,000 copies were printed (at Dodgson’s expense) by the Clarendon Press in Oxford, to be published on 4 July––three years after the ostensible date of the boat ride. Tenniel, however, objected to the quality of the printing––it had been set up from ‘improperly sorted’ type, the layout was erratic, and a poor mixture of ink had led to pigment seeping through the pages – –and Dodgson wrote in his Diary (2 August): ‘Finally decided on the re-print of Alice, and that the first 2000 shall be sold as waste paper.’ He had the book reprinted (by Richard Clay) at a cost to himself of $\\mathcal{f}_{\\mathrm{s}}6\\mathrm{0}0$ , and calculated that he would have to sell 4,000 copies merely to break even. The unbound sheets were not, in the end, sold as waste paper, but were bound and sold to the American publisher D. Appleton. Forty-eight copies had already been given away, of which twenty-three––which have become bibliophiles’ treasures––are known to survive. Dodgson did not make a loss––in fact, the book had sold 12,000 copies by 1868.  \n\nThrough the Looking-Glass had a less dramatic birth, although Tenniel at first refused to illustrate it. Dodgson invited (among others) Kingsley’s illustrator, Sir Joseph Noel Paton––a painter in the lush Pre-Raphaelite style––which some critics have seen as further evidence of Dodgson’s lack of taste or idea of appropriateness. Noel Paton refused, on the grounds of illness, and Tenniel was, after two and a half years, finally persuaded. Early in $\\phantom{}_{\\displaystyle\\mathrm{I}}87\\phantom{}$ , Dodgson consulted some mothers of young children over whether the picture of the Jabberwock should be the frontispiece, on the grounds that it was ‘too terrible a monster, and likely to alarm nervous and imaginative children’, and it was replaced by a picture of the White Knight. The book was published for Christmas $\\phantom{0}{\\boldsymbol{\\mathrm{I}}}\\,87\\phantom{0}$ , the 9,000 copies printed proving inadequate to the demand. When Macmillan wanted to print another 6,000 copies ‘as fast as possible’, Dodgson objected: ‘My decision is, we must have no more hurry . . . You will think me a lunatic for thus wishing to send away money from the doors. . . . I wish I could put into words how entirely such arguments go for nothing with me. As to how many copies we sell I care absolutely nothing: the one thing I do care is, that all copies that are sold shall be artistically first-rate.’48  \n\nThe book was in galley proof, when there was another intervention from Tenniel. Just after Alice’s meeting with the White Knight, and before she crosses the last brook to become a queen, Dodgson had included another episode, ‘The Wasp in a Wig’. In a letter to Dodgson on 1 June $\\phantom{0}\\mathbf{I}870$ , Tenniel wrote: ‘Don’t think me brutal, but I am bound to say that the “wasp” chapter doesn’t interest me in the least, & that I can’t see my way to a picture. If you want to shorten the book, I can’t help thinking––with all submission––that there is your opportunity.’ Collingwood, who published the letter in Life and Letters, added: ‘Apart from the difficulties of illustration, the “wasp” chapter was not considered to be up to the rest of the book, and this was probably the principal reason of its being left out.’49  \n\nThrough the Looking-Glass was enthusiastically reviewed, and sold 25,000 copies within the year. At Dodgson’s death, it had sold over 100,000, compared with Alice’s Adventures in Wonderland’s 150,000. (Comparing it to Alice’s Adventures in Wonderland, in 1898, the Academy observed that ‘we now and then hear the pump at work’.)  \n\nThe next ‘Alice’ venture was the facsimile edition of Alice’s Adventures under Ground, published in 1886. On 1 March $\\mathbf{I}885$ Dodgson wrote to Alice Hargreaves, to ask her to lend him the original hand-lettered copy. If there is any doubt that Dodgson retained strong feelings for her (as a child) one might consider the perhaps inadvertent passion of the opening of the letter:  \n\n# My dear Mrs Hargreaves,  \n\nI fancy this will come to you almost like a voice from the dead, after so many years of silence [although he had sent her an inscribed copy of his Rhyme? and Reason? in $\\phantom{-}\\mathrm{{I}}\\,883\\phantom{.}$ ––and yet those years have made no difference, that I can perceive, in my clearness of memory of the days when we did correspond . . . my mental picture is as vivid as ever, of one who was, through so many years, my ideal child-friend. I have had scores of child-friends since your time:",
    "chunk_order_index": 10,
    "full_doc_id": "doc-25e80a930cbb6f47e8c54c6356e1edba"
  },
  "chunk-b1c020958d119c6327b85c39f69ab0bc": {
    "tokens": 1200,
    "content": "an inscribed copy of his Rhyme? and Reason? in $\\phantom{-}\\mathrm{{I}}\\,883\\phantom{.}$ ––and yet those years have made no difference, that I can perceive, in my clearness of memory of the days when we did correspond . . . my mental picture is as vivid as ever, of one who was, through so many years, my ideal child-friend. I have had scores of child-friends since your time: but they have been quite a different thing.  \n\nHowever, I did not begin this letter to say all that. What I want to ask is . . .  \n\nIn 1928, Alice Hargreaves, in some need of money, sold the manuscript at Sotheby’s in London; it was bought by Dr A. S. W. Rosenbach for $\\mathcal{L}_{\\mathrm{{I}}}\\,\\mathfrak{s},400$ , who sold it on ‘for nearly double that sum’ to Eldridge R. Johnson of New York. It returned to England in $\\mathbf{I948}$ as a gift from Rosenbach (who had bought it again after Johnson’s death in 1944) and other benefactors (who raised $\\mathcal{f}_{\\mathbf{1}2,500})$ as an expression of thanks to the British, ‘a noble people’, for their war effort. Dr Luther Evans of the Library of Congress brought it across the Atlantic (keeping it under his pillow) and it was received by the Archbishop of Canterbury. (It is now in the British Library and can be read online.)  \n\nThefinal version of Alice’s Adventures in Wonderland prepared by Dodgson, The Nursery Alice (1890), is the most curious of all: all that remains of the sharpness of the original book is Tenniel’s illustrations. Dodgson adopts a totally different tone of voice, which can be demonstrated from the ‘Preface (addressed to any mother)’:  \n\nAnd my ambition now is (is it a vain one?) to be read by Children aged from Nought to Five. To be read? Nay, not so! Say rather to be thumbed, to be cooed over, to be dogs’-eared, to be rumpled, to be kissed by the illiterate, ungrammatical, dimpled Darlings, that fill your Nursery with merry uproar, and your inmost heart of hearts with a restful gladness!  \n\nSuch, for instance, as a child I once knew, who––having been carefully instructed that one of any earthly thing was enough for any little girl; and that to ask for two buns, two oranges, two of anything, would certainly bring upon her the awful charge of being ‘greedy’––was found one morning sitting up in bed, solemnly regarding her two little naked feet, and murmuring to herself, softly and penitently, ‘deedy!’ Predictably enough, Dodgson condemned the first printing, of 10,000, in 1889 as ‘far too bright and gaudy’: 4,000 copies were sold to America and 500 to Australia and many more given away to hospitals.  \n\nSeveral critics, notably Humphrey Carpenter, have suggested that Alice’s Adventures in Wonderland and Through the LookingGlass represented Dodgson’s glimpse into the abyss of a godless world, in which adults are mad, and children selfish.The Nursery Alice, together with the sentimental verses, and the pious pamphlets that appeared in later editions of Alice’s Adventures in Wonderland and Through the Looking-Glass were ways of ‘unwriting’ these frightening and radical texts.50 Certainly there is a profound paradox in the man who parodied religious verses and who created what can be seen as nihilistic and emotionally questionable texts, and yet who changed the passion flower in Alice’s garden to a tiger lily when it was pointed out to him that the passion in passion flower referred to Christ’s passion.  \n\n# ‘Alice’ in the History of Children’s Literature  \n\nFrom the beginnings of modern children’s literature in the mideighteenth century, delight had been harnessed to instruction, particularly religious and moral instruction. Perhaps the most famous and characteristic of such books was Mary Martha Sherwood’s best-selling The Fairchild Family (1818––third volume $\\phantom{0}\\mathrm{I}\\!\\left847$ ) (which Dodgson read as a child) whose cautionary tales each ended with a hymn and a prayer. Good actions were rewarded (in heaven, at least), bad ones graphically punished–– often by gruesome deaths; the families were loving, although perhaps rather stern by today’s standards, and there was a rigid hierarchy from the father (standing in place of God) to the mother and the children.  \n\nBut from around the 1830s, the evangelical grip on children’s education and books was gradually eroded. One of the key books was Catherine Sinclair’s Holiday House (1839): Sinclair noted in the ‘Preface’ that ‘the minds of young people are now manufactured like webs of linen, all alike, and nothing left to Nature. From the hour when children can speak . . . they are carefully prompted what to say, and what to think, and how to look, and how to feel; while in most school-rooms Nature has been turned out of doors with obloquy, and Art has entirely supplanted her.’ Building her book ‘on the solid foundation of Christian faith and sound morality’, she wished to show ‘that species of noisy, frolicsome, mischievous children [which is] now almost extinct’, and she did so by distinguishing between wickedness and thoughtlessness. An equally influential proponent of a more balanced view of childhood was Heinrich Hoffman, a German doctor who, despairing of the diet of moralistic tales, produced his",
    "chunk_order_index": 11,
    "full_doc_id": "doc-25e80a930cbb6f47e8c54c6356e1edba"
  },
  "chunk-199c11949ba3a0436262ed0fb448de82": {
    "tokens": 1200,
    "content": "obloquy, and Art has entirely supplanted her.’ Building her book ‘on the solid foundation of Christian faith and sound morality’, she wished to show ‘that species of noisy, frolicsome, mischievous children [which is] now almost extinct’, and she did so by distinguishing between wickedness and thoughtlessness. An equally influential proponent of a more balanced view of childhood was Heinrich Hoffman, a German doctor who, despairing of the diet of moralistic tales, produced his own best-selling satire on them, Strewwelpeter (English translation $\\mathbf{I}\\left848\\right)$ ). Edward Lear, another writer with a penchant for entertaining children (and thus camouflaging his own feelings), produced his first collection of eccentric limericks, $\\mathcal{A}$ Book of Nonsense, in $\\mathbf{I}846$ (revised 1861).  \n\nDodgson, then, was not alone: he was writing at a time of radical cultural change, which was reflected in changes in attitudes to childhood and children’s books. Louisa May Alcott’s Little Women (1868), with its latent feminism, marks a turning point in attitudes to girls and to religion; Richard Jefferies’s Bevis, the Story of a Boy (1882) and Robert Louis Stevenson’s Treasure Island (1883) both rethought the adventure story, and brought moral ambiguity and amorality into a world of polarized certainties. Of course, the older attitudes persisted in best-sellers such as Mary Louisa Charlesworth’s Ministering Children (1854), Martha Finlay’sElsie Dinsmore (1867), or Susan Coolidge’s What Katy Did (1872).  \n\nBut because Dodgson was so close to the minds of his first readers (or listeners), and because he respected their intelligence and their situation, he was able to voice their silent rebellion. Thus he parodied the oldest of the moralists––Isaac Watts–– whose often savage Divine Songs Attempted in Easy Language for the Use of Children (1715) was still current. The ‘little busy bee’ in Watts’s song ‘Against Idleness and Mischief’ becomes a ‘little crocodile’, and Robert Southey’s ‘The Old Man’s Comforts and How He Gained Them’ (‘You are old, Father William’) and Mary Howitt’s ‘The Spider and the Fly’ (‘Will you walk a little faster . . .’) are put to the parodic sword. And when Alice comes upon the bottle labelled ‘drink me’, she pauses because ‘she had read several nice little stories about children who had got burnt, and eaten up by wild beasts, and other unpleasant things, all because they would not remember the simple rules their friends had taught them’ (p. 13).  \n\nThis leads us to Dodgson’s major contribution to children’s literature, which was to find a narrative voice that closed, or gave the impression of closing, the gap between writer and reader. By doing so he shifted the balance of power within the texts, removing the adult’s controlling voice and allowing children to think for themselves. Previous to that, the adult narrators were in firm control––take Thomas Hughes in Tom Brown’s Schooldays (1857), who interrupts his narrative for a brief homily: ‘So it is, and must be always, my dear boys . . . You only want to have your heads set straight to take the right side: so bear in mind that majorities, especially respectable ones are nine times out of ten in the wrong.’ Or, notoriously, the narrator’s voice in Charles Kingsley’s The Water Babies––a book commonly held to be the first book in the first ‘golden age’ of children’s books. It begins: ‘Once upon a time there was a little chimney-sweep, and his name was Tom. That is a short name, and you have heard it before, so you will not have much trouble in remembering it.’ It is not difficult to see why Goldthwaite feels that ‘much of Alice is a running argument with Kingsley over how one goes about telling a children’s story’.51  \n\nDodgson’s focus on a real child, Alice Liddell, in Alice’s Adventures in Wonderland (and his nostalgic memory of her in Through the Looking-Glass) may have been the catalyst for this change. As Barbara Wall notes, it meant that the narratorDodgson  \n\ncould share with ten-year-old narratee-Alice delight in the adventures of seven-year-old character-Alice . . . Alice’s became the first childmind, in the history of children’s fiction, to occupy the centre. No narrator of a story for children had stood so close to a child protagonist, observing nothing except that child, describing, never criticising, showing only what that child saw . . . he never, until she has woken from her dream, looks away from her. 52  \n\nConsequently, unlike in books by Kingsley, or many of Dodgson’s imitators, the jokes do not go over the child-character’s head, aimed at the knowing adult. For example, the first (of several) death-jokes––‘“Why, I wouldn’t say anything about it, even if I fell off the top of the house!” (Which was very likely true)’––is there to be understood and appreciated and pondered on by the child reader. (Not all critics concur: Zohar Shavit argues, for example, that Dodgson left the parodies out of The Nursery Alice precisely because he had previously been aiming for two audiences.)  \n\nIn Through the Looking-Glass, not surprisingly, as he was now six years away from his close contact with Alice Liddell, Dodgson’s touch is slightly less sure. He provides a frame of reference by repeating phrases such as, ‘as she",
    "chunk_order_index": 12,
    "full_doc_id": "doc-25e80a930cbb6f47e8c54c6356e1edba"
  },
  "chunk-d1cf2a45469a8f97e5a6f04cf17b8c8a": {
    "tokens": 1200,
    "content": "ed on by the child reader. (Not all critics concur: Zohar Shavit argues, for example, that Dodgson left the parodies out of The Nursery Alice precisely because he had previously been aiming for two audiences.)  \n\nIn Through the Looking-Glass, not surprisingly, as he was now six years away from his close contact with Alice Liddell, Dodgson’s touch is slightly less sure. He provides a frame of reference by repeating phrases such as, ‘as she described it afterwards’ (p. 137), and indulges in romantic musings that break the narrator-narratee contract: ‘And here I wish I could tell you half the things Alice used to say’ (p. 126), or ‘(here came the favourite little toss of the head)’ (p. 148). At its most extreme, there is the overladen scene when Alice and the sheep encounter the scented rushes: ‘And then the little sleeves were carefully rolled up, and the little arms were plunged in elbow-deep [and] she caught at one bunch after another of the darling scented rushes’ (p. 181).  \n\nThis sentimental attitude, which is anathema to the general tough-mindedness that gives the ‘Alice’ books their place in history, lurks around edges of the books, because, when it came to the crunch, Dodgson was no revolutionary. He repudiates the fictional Alice’s moments of power by making them dreams, and then hedges them round with ultra-conventional sentimentalreligious verse. As in A. A. Milne’s Winnie-the-Pooh and The House at Pooh Corner, these discordant frames suggest that the author is not keeping faith with his ostensible audience, and is now aiming over their heads, and constructing, or falling in with,  an  audience  that  sees  childhood  quite  differently. The Dodgson of The Nursery Alice is relating to the fin de siècle ‘beautiful-child’ cult which was such a feature of late nineteenth-century British society. It was a modification of the Romantics’ attitude to children, and survived into the 1920s when Richmal Crompton administered an effective antidote with her ‘William’ books.  \n\nThere were many direct imitations of Alice’s Adventures in Wonderland and Through the Looking-Glass (indeed, Dodgson began to collect ‘books of the Alice type’) but the influence of the ‘Alice’ books has been more important over the long term than the short term. This is because, for all their ingenuity, the imitations generally tried to reproduce the comic surfaceelements of the books, rather than the subtle undercurrents or the radical, child-centred voice. Carolyn Sigler estimates that between 1869 and 1930 there were ‘almost two hundred literary imitations, revisions, and parodies’.  Perhaps the most famous was G. E. Farrow’sThe Wallypug of Why (1895 and two sequels), which has a female hero called, ominously, ‘Girlie’, and which in its attempts at verbal wit, often talks over the heads of its supposed audience:  \n\n‘What is the microscope for?’ asked Girlie in a whisper. ‘To see the jokes with,’ replied the Penguin. ‘Some of them cannot be seen at all without it.’  \n\nOthers, such as Alice Corkran’s Down the Snow Stairs (1887) or Christina Rossetti’s Speaking Likenesses (1870), use ‘Alice’-like devices to reinvent the didactic tale. Later, as Sigler suggests, the post-1930 imitations ‘tend simply to make reference to the Alice mythos, while commentating upon issues and concerns far from Alice’s world’.  \n\nThus the true (and profound) legacy of Dodgson can be found in those writers who followed his lead in respecting the intelligence of the child-readers, and who developed a narrative voice that treated them as equals. Some of these attempts were faltering––as with Edith Nesbit––but with Rudyard Kipling, the later Frances Hodgson Burnett, John Masefield’s fantasies, Arthur Ransome, and Noel Streatfeild, a tradition was established for writing genuinely for children, that has survived through to J. K. Rowling.  \n\n# Reading the ‘Alice’ Books  \n\nIn $\\phantom{0}\\mathbf{I}88\\phantom{7}$ ,  Dodgson  described  the  composition  of  Alice’s Adventures in Wonderland: having first told the story while rowing on the river,  \n\nto please a child I loved (I don’t remember any other motive), I printed in manuscript . . . the book which I have just had published in facsimile. In writing it out, I added many fresh ideas, which seemed to grow themselves upon the original stock; and many more added themselves when . . . I wrote it all over again for publication . . . ‘Alice’ and the ‘Looking-Glass’ are made up almost wholly of bits and scraps, single ideas that came of themselves.56  \n\nPerhaps as a result of this process, the books are intricately layered. There is the conscious, personal level, using incidents, characters, and places familiar to Alice Liddell and Dodgson’s immediate circle. Next there is the matrix of philosophy, mathematics, and linguistics––serious games for both child and adult readers. Then there is a wider world of references to Oxford and national personalities and politics––both the preoccupations of a singular mind, and the natural furniture of the mind of a well-educated Victorian scholar and gentleman. Finally, and more contentiously, there are passages which seem (notably in Through the Looking-Glass) to be very personal–– conscious or unconscious manifestations of Dodgson’s psyche. As Derek Hudson put it,",
    "chunk_order_index": 13,
    "full_doc_id": "doc-25e80a930cbb6f47e8c54c6356e1edba"
  },
  "chunk-14865dc6c5ad37e2bb9137280aa7bb86": {
    "tokens": 1200,
    "content": "linguistics––serious games for both child and adult readers. Then there is a wider world of references to Oxford and national personalities and politics––both the preoccupations of a singular mind, and the natural furniture of the mind of a well-educated Victorian scholar and gentleman. Finally, and more contentiously, there are passages which seem (notably in Through the Looking-Glass) to be very personal–– conscious or unconscious manifestations of Dodgson’s psyche. As Derek Hudson put it, ‘the“Alice” books were in some degree an autobiographical miscellany, woven together with extraordinary skill: an Odyssey of the subconscious’.  All of this suggests that whatever the books may be, they are scarcely ‘nonsense’, if nonsense is defined as occurring when the mind is unable to make an association: as Elizabeth Sewell pointed out, ‘nonsense . . . requires as few relations . . . as possible’.58  \n\nDodgson’s conscious use of his personal circle can be seen during the Mad Tea-Party, in Alice’s Adventures in Wonderland. The Dormouse begins a story:  \n\n‘Once upon a time there were three little sisters . . . and their names were Elsie, Lacie, and Tillie: and they lived at the bottom of a well––’ ‘What did they live on?’ said Alice, who always took a great interest in questions of eating and drinking.  \n\n‘They lived on treacle,’ said the Dormouse, after thinking a minute or two. (p. 65)  \n\nThere is a lot going on here. Leaving aside speculations on who the Dormouse is supposed to be (candidates include the Christian Socialist theologian F. D. Maurice, and Dante Gabriel Rossetti’s pet wombat), it is clear that it is the three little/ Liddell sisters in the well. Elsie is a pun on Lorinda Charlotte’s initials, ‘Lacie’ is an anagram of Alice, and Tillie is an abbreviation of Matilda, Edith’s nickname. And the treacle well is not nonsense. Medicinal springs in Oxfordshire were known as ‘treacle wells’––treacle being an obsolete word for ‘balm’ (the ‘Treacle Bibles’ of $\\mathbf{I}\\,568$ are those where the word ‘balm’ is rendered as ‘treacle’, as at Jeremiah 8:22––‘Is there not treacle in Gilead?’). There is a treacle well in the grounds of St Margaret’s church at Binsey, near Oxford, dedicated to, and said to have appeared as the answer to the prayers of, the Saxon St Frideswide, patron saint of Oxford. Dodgson’s college, Christ Church, founded in $\\mathbf{I}\\,564$ , took over the site of St Frideswide’s Abbey. St Frideswide’s window in Christ Church Cathedral, by Edward Burne-Jones (1858), has a panel depicting pilgrims going to the well.  \n\nAll of this would almost certainly have been within the grasp of the real Alice, as would (at least in Dodgson’s expectations) the mathematical and logical puzzles scattered through the text, on as it were ‘the next level’. Dodgson, after all, is the man who wrote $A$ Tangled Tale, for Charlotte Yonge’s The Monthly Packet (the full title of which was The Monthly Packet of Evening Readings for Younger Members of the English Church). His series, beginning in April 1880, consisted of twelve ‘knots’, and the idea was, in Dodgson’s words, ‘to embody in each Knot (like the medicine so dexterously, but ineffectively, concealed in the jam of our early childhood) one or more mathematical questions––in Arithmetic, Algebra, or Geometry, as the case may be––for the amusement, and possible edification, of the fair readers of that magazine’. The word ‘amusement’ is important here, for Dodgson would certainly not have recognized the critic David Holbrook’s description of him as ‘a man who led a more or less dull life, often producing dull mathematical and logical texts . . . but also producing the “Alice” books’.  To Dodgson, there was nothing dull about mathematics.  \n\nAnd so, when the puzzled Alice is trying over lessons she used to know:  \n\n‘Let me see: four times five is twelve, and four times six is thirteen, and four times seven is––oh dear! I shall never get to twenty at that rate!’ (p. 19)  \n\nDodgson is having a good deal of fun with dullness (or, perhaps, dull readers). As Martin Gardner points out, this mathematical progression is not nonsense.  \n\nThe multiplication table traditionally stops with the twelves, so if you continue this nonsense progression––4 times 5 is 12, 4 times 6 is 13, 4 times 7 is 14, and so on––you end with $^{4}$ times 12 (the highest she can go) is 19––just one short of 20.  \n\nIf this seems to a modern reader to take the books outside the range of children (that is, of what we suppose to be the capabilities of twenty-first-century children), Dodgson would probably have disagreed. Thus he doesn’t evade themes generally considered to be taboo for children’s books: when Alice encounters the sleeping Red King in Through the LookingGlass, she finds herself in a discussion with Tweedledum and Tweedledee of what is in effect Bishop Berkeley’s view that we are all nothing but ideas in the mind of God. Alice, the pragmatist, dismisses the idea (‘If I wasn’t real . . . I shouldn’t be able to cry’, p. 168) but the question of",
    "chunk_order_index": 14,
    "full_doc_id": "doc-25e80a930cbb6f47e8c54c6356e1edba"
  },
  "chunk-419e1765ea5695ef0bd2b7e0817be3de": {
    "tokens": 1200,
    "content": "evade themes generally considered to be taboo for children’s books: when Alice encounters the sleeping Red King in Through the LookingGlass, she finds herself in a discussion with Tweedledum and Tweedledee of what is in effect Bishop Berkeley’s view that we are all nothing but ideas in the mind of God. Alice, the pragmatist, dismisses the idea (‘If I wasn’t real . . . I shouldn’t be able to cry’, p. 168) but the question of who dreams who, and how dreams relate to death runs darkly through both books.  \n\nAs in many fantasies, the worlds which Alice enters are not places of freedom or escape, but are full of other people’s rules. Dodgson’s fascination with the discipline inherent in games is clear throughout the books, and especially in Through the Looking-Glass. Although perhaps initially derived from real-life chess games with Alice Liddell and her siblings, Dodgson’s version plays with the logic and validity of moves and turns. And Alice may say enthusiastically, ‘It’s a great huge game of chess that’s being played––all over the world’ (p. 144), but the story dwells rather more on the predetermination of moves, the lack of communication, and arbitrary fate.  \n\nPerhaps the most critical ink has been expended on the layer (alleged or actual) of social and political reference in the books. Early in Alice’s Adventures in Wonderland, she encounters a huge, playful (or threatening) puppy. In Tenniel’s drawing not only is the puppy an English Beagle (a heavier dog in the nineteenth century than now), but its face clearly resembles that of the young Charles Darwin. Alice, to avoid being trampled, ‘dodges behind a great thistle’––and it so happens that there was a notable biologist at Christ Church––a non-Darwinian––with the singular name of William Turner Thistleton Dyer. The ‘dodging’ Dodgson was not a Darwinian, although he had nineteen volumes by Darwin and his critics in his library; in $\\phantom{0}\\mathrm{I}\\!\\left8\\!\\right72$ ,he read Darwin’s The Expression of Emotion in Man and Animals and sent him one of his photographs, possibly offering to supply more, if needed. Had Dodgson, on another level from his pleasure in telling a story to a favourite child, also found in the children’s book (like many writers after him) a medium for satire and criticism? For all his apparently circumscribed life, Dodgson, as we have seen, was a polymath, and his wide interests saturate the two ‘Alice’ books: as companions to Victorian culture, from melodramatic novels to sentimental ditties, and from matters of faith and doubt to matters of snobbery and tyranny, they have few rivals. And had he also found a way of discussing his own needs and obsessions? Victor Watson takes a charitable view of this.  \n\n[Dodgson] . . . established new possibilities for children’s books. He showed how they could be made into an imaginative space for writing about the dynamics that exist when adults and children engage with one another––dynamics that might be complex, loving, intimate or problematical, but were no longer just authoritarian. He demonstrated how a children’s story could become a celebratory utterance of greeting, farewell, or longing. Since that time, many of the greatest children’s books have had about them a touch of the valedictory.61 Critics are generally agreed that Dodgson wrote himself into the books––usually as misunderstood or sympathetic characters–– the Dodo, the Knave of Hearts, the Gnat, the Gryphon, the excised ancient Wasp, and perhaps the sardonic Cheshire Cat. But his private-public farewell to his ‘dreamchild’ is taken most vividly in the scenes with the White Knight in Through the Looking-Glass, who says to Alice: ‘“I’ll see you safe to the end of the wood––and then I must go back, you know. That’s the end of my move.”’ (p. 211). The Knight is easily seen as an ironic self-portrait of a harmless, simple-minded man who invents eccentric and unsuccessful things, who delivers a lecture on the logic of language, sings a nonsense song to a sentimental tune, and, of course, keeps on falling off his horse, ‘generally . . . on the side on which Alice was walking’ (p. 214). The image that Dodgson then creates, the image that Alice ‘always remembered most clearly’, is a romantic, Pre-Raphaelite picture, and there is a sharp and sad acknowledgement of the inevitability of loss. The Knight says, turning back,  \n\n‘You’ll wait and wave your handkerchief when I get to that turn in the   \nroad! I think it’ll encourage me, you see.’ ‘Of course I’ll wait,’ said Alice: ‘and thank you very much for coming   \nso far––and for the song––I liked it very much.’ ‘I hope so,’ the Knight said doubtfully: ‘but you didn’t cry as much as   \nI thought you would.’ (p. 222)  \n\nAs J. M. Barrie wrote at the end of Peter and Wendy (1911) ‘and thus it will go on, so long as children are gay and innocent and heartless’––but what is going on, although it may be steeped in an unfashionably Victorian sentimentality, is a complex statement of desire and loss.  \n\nThe ‘Alice’ books, then, can be profitably read as protofeminist, as modernist or postmodernist, as hugely experimental and eclectic, or as deeply conservative and egotistical. They crystallize the dilem",
    "chunk_order_index": 15,
    "full_doc_id": "doc-25e80a930cbb6f47e8c54c6356e1edba"
  },
  "chunk-6d552971aa011ee05cc8e68757fbcafa": {
    "tokens": 1200,
    "content": ") ‘and thus it will go on, so long as children are gay and innocent and heartless’––but what is going on, although it may be steeped in an unfashionably Victorian sentimentality, is a complex statement of desire and loss.  \n\nThe ‘Alice’ books, then, can be profitably read as protofeminist, as modernist or postmodernist, as hugely experimental and eclectic, or as deeply conservative and egotistical. They crystallize the dilemmas of adult readers confronted with texts designed for childhood (whether or not that childhood is still recognizable), and they challenge assumptions about the nature of fantasy, and perhaps even the nature of fiction.  \n\nAnd where do they now stand in a century in which literary criticism has become an industry? As Dodgson’s biographer Donald Thomas has pointed out:  \n\nThe works of the Reverend Dodgson seem particularly hazardous to critics, whether the psychoanalytical school, so piteously hoaxed in the 1930s, or the later schools of critical theory and practice. Such diligent hunters of the seminar room, waddling along with nets and traps in the wake of the Cheshire Cat and its companions, are apt to take a picture which uncannily deconstructs itself, leaving only a grin for their contemplation.  \n\nThe books have certainly proved to be fruitful for more advanced theorists such as Karen Coats in Looking Glasses and Neverlands:  \n\nLacan, Desire, and Subjectivity in Children’s Literature,63 or Alan Lopez, who, in an article ‘Deleuze with Carroll: Schizophrenia and Simulacrum and the Philosophy of Lewis Carroll’s Nonsense’, suggests that ‘a more productive examination of the question of a critical subject in Alice would occur in the context of the complex negotiations between the madness of nonsense and the epistemic and ontological doubt grounded in the simulacrum’.  \n\nIncreasingly, the ‘Alice’ books are taken in their historical context, from John Docherty’s argument that Dodgson’s books form a complex dialogue with George MacDonald’s,  to Fred Inglis’s view that ‘the theory of education and childhood development which the Romantics put into circulation has Alice as its first, best triumph’.  Perhaps a little more arcanely, there has been research into where the books fit into ‘the oralliterary continuum’––and it has been suggested that, if Alice’s Adventures in Wonderland is tested against Antti Aarne and Stith Thompson’s classic The Types of the Folk-tale (1961), then, morphologically, it has the sequence  \n\n$$\na\\mathrm{\\betaaBC\\mathrm{\\uparrow}D\\,\\&\\,\\&\\,F\\,\\S\\,F\\,\\S\\,G^{**}D\\,\\S\\,E\\,\\S\\,F\\,\\S\\,G^{**}H I K}\\downarrow_{\\mathrm{oMNQExTUW}}\n$$  \n\nand thus ‘fulfils the criteria of one specific folktale, namely type AT $480$ . . . Probably the best-known exponent of the type is “Mother Holle”. . . in the second selection of German Popular Stories (1826).’  This is, one can’t help feeling, the kind of research that would have delighted Charles Dodgson.  \n\nIt has been said that children do not find the ‘Alice’ books as extraordinary as adults do, because they present an all-toofamiliar world to a child––a world of rude, aggressive adults, all playing complex, bewildering games. And even if Alice does, for a while, hold her own against them, in the end, it’s only a dream. For adults, the books provide some uncomfortable images and pose uncomfortable questions––and challenge many accepted ideas about themselves and their children. That the books were for children––in a way that books had seldom been before––is unquestionable, and very important, because it means that adult readers are, as it were, listening in to a conversation not intended for them. Whether the books are still for children is a question really only of interest to those who mediate books for children. But all adult readers can do well to ponder W. H. Auden’s observation: ‘In assessing their value, there are two questions one can ask: first, what insight do they provide as to how the world appears to a child?; and the second, to what extent is the world really like that?’  \n\n# NOTE ON THE TEXT  \n\nDodgson had made numerous small revisions, largely to the punctuation, of the text of Alice’s Adventures in Wonderland in its various printings; Through the Looking-Glass was printed from electrotypes from the outset, and so the main text was not altered.  \n\nThis text is printed from the revised editions of 1897, which contain Dodgson’s final corrections and additions. He made these in copies of the $\\mathbf{\\tau}_{\\mathbf{I}}88_{2}$ edition of Alice’s Adventures in Wonderland and the $\\mathbf{\\tau}_{\\mathrm{I}}880$ edition of Through the Looking-Glass, bound in one volume, which he borrowed from May Barber (later Mrs H. T. Stretton), one of his child-friends, whom he had first met at Eastbourne. (He had previously made many revisions to the $\\phantom{0}\\mathbf{I}88\\phantom{7}$ ‘People’s Edition.’)  \n\nDetails of the changes can be found in Selwyn H. Goodacre, ‘The Textual Alterations for the 1897 6s Edition of Alice’s Adventures in Wonderland’, Jabberwocky, 51 (11/3) (Summer 1982), and Stanley Godman, ‘Lewis Carroll’s Final Corrections to “Alice”’, TLS, 2 May 195",
    "chunk_order_index": 16,
    "full_doc_id": "doc-25e80a930cbb6f47e8c54c6356e1edba"
  },
  "chunk-ed5e5d81efbbffa7ec84c97dc9ec4e92": {
    "tokens": 1200,
    "content": "0}\\mathbf{I}88\\phantom{7}$ ‘People’s Edition.’)  \n\nDetails of the changes can be found in Selwyn H. Goodacre, ‘The Textual Alterations for the 1897 6s Edition of Alice’s Adventures in Wonderland’, Jabberwocky, 51 (11/3) (Summer 1982), and Stanley Godman, ‘Lewis Carroll’s Final Corrections to “Alice”’, TLS, 2 May 1958. Dodgson made more than four hundred changes, including standardizing contractions such as‘ca’n’t’. At least two of these changes were not picked up by the printer, but have been made in this edition: p. 136.5 ‘And hast’ becomes ‘And, hast’; p. 230.5 ‘smooth’ becomes ‘smoothe’.  \n\nThe page references for the chess game were wrong in the 1897 edition, which had been set up from the $\\phantom{0}\\mathbf{I}\\phantom{0}88\\phantom{7}$ ‘People’s Edition’.  \n\nThe list of Dramatis Personæ was omitted from the 1897 and subsequent editions, but retained in reprints of the ‘People’s Edition’.  \n\nAdvertisement [60th thousand]: this was a loose sheet inserted in the first edition of Sylvie and Bruno Concluded (1893).  \n\n‘Christmas-Greetings [From a Fairy to a Child]’, first published in Phantasmagoria (1869), reprinted separately $\\phantom{-}\\mathrm{I}884$ , and included in Alice’s Adventures under Ground (1886), and in Alice’s Adventures in Wonderland and Through the Looking-Glass from $\\phantom{0}\\mathbf{I}\\phantom{0}88\\phantom{7}$ .  \n\n‘To All Child-Readers of “Alice’s Adventures in Wonderland”’, printed separately as a miniature pamphlet of four pages $(4^{3}/16\\,\\times2^{3}/4\\,\\mathrm{in}$ ) in December $\\phantom{}_{\\displaystyle\\mathrm{I}}87\\phantom{}$ ; it was inserted in the first edition of Through the Looking-Glass, and the $\\phantom{0}\\mathbf{I}\\phantom{0}\\!\\!\\!8\\neg\\!\\!\\!2$ edition of Alice’s Adventures in Wonderland.  \n\n‘An Easter Greeting to Every Child who Loves “Alice”’ which had a similar format and was printed for Easter $\\mathbf{\\delta}_{\\mathbf{I}}8\\mathbf{\\eta}76$ and inserted in copies of The Hunting of the Snark. It was reprinted in the People’s Edition of Through the Looking-Glass in $\\phantom{0}\\mathbf{I}\\phantom{0}88\\phantom{7}$ and the People’s Edition of Alice’s Adventures in Wonderland, Alice’s Adventures under Ground (1886), and in The Nursery Alice (1890).  \n\n‘The Wasp in a Wig’, an episode cut from the galley-proofs of Through the Looking-Glass, and reproduced by permission of A. P. Watt Ltd on behalf of The Trustees of the C. L. Dodgson Estate.  \n\n# SELECT BIBLIOGRAPHY  \n\nA great deal of material is available on various ‘Lewis Carroll’ websites. A selection of the key print materials is given here. Authoritative articles on every aspect of Dodgson’s work can be found in the journal of The Lewis Carroll Society, Jabberwocky (1969–97), renamed The Carrollian (1998– ).  \n\n# Works by Charles Dodgson/Lewis Carroll  \n\nLewis Carroll, The Annotated Alice: The Definitive Edition, ed. Martin Gardner (New York: Norton, 2000; London: Penguin, 2001) [includes ‘The Wasp in a Wig’ episode].  \n\nAlice’s Adventures in Wonderland and Through the Looking-Glass, ed. Hugh Haughton (London: Penguin, 1998) [includes Alice’s Adventures under Ground]. Alice in Wonderland, ed. Donald J. Gray (1971; 2nd edn., New York: Norton, 1992) [includes The Hunting of the Snark]. Alice’s Adventures in Wonderland, ed. Richard Kelly (Peterborough,  Ontario:  Broadview  Press,  2000)  [includes  Alice’s Adventures under Ground, The Nursery Alice, Symbolic Logic]. Alice’s Adventures under Ground (facsimile), introd. Martin Gardner (New York: Dover, 1965); introd. Mary Jean St Clair (London: Pavilion/British Library, 1995). The Nursery Alice (facsimile) (London: Macmillan, 1970); introd. Martin Gardner (New York: Dover, 1966). The Complete Illustrated Lewis Carroll (New York: Nonesuch Press, 1939; London: Penguin, 1988; Ware: Wordsworth Classics, 1996). The Annotated Hunting of the Snark, ed. Martin Gardner (Centenary edn.: New York: Norton, 2006). Stuart Dodgson Collingwood (ed.), The Lewis Carroll Picture Book (London: T. Fisher Unwin, 1899; reissued as Diversions and Digressions of Lewis Carroll, New York: Dover, 1961; and as The Unknown Lewis Carroll, New York: Dover, n.d. [1961]).  \n\nC. L. Dodgson, The Oxford Pamphlets, Leaflets and Circulars of Charles Lutwidge Dodgson, ed. Edward Wakeling, The Pamphlets of Lewis Carroll, vol. i (Charlottesville, Va.: University Press of Virginia for the Lewis Carroll Society of",
    "chunk_order_index": 17,
    "full_doc_id": "doc-25e80a930cbb6f47e8c54c6356e1edba"
  },
  "chunk-04a18434c6ea16e0134712a7681d99bc": {
    "tokens": 1200,
    "content": "ions and Digressions of Lewis Carroll, New York: Dover, 1961; and as The Unknown Lewis Carroll, New York: Dover, n.d. [1961]).  \n\nC. L. Dodgson, The Oxford Pamphlets, Leaflets and Circulars of Charles Lutwidge Dodgson, ed. Edward Wakeling, The Pamphlets of Lewis Carroll, vol. i (Charlottesville, Va.: University Press of Virginia for the Lewis Carroll Society of North America, 1993).  \n\nThe Political Pamphlets and Letters of Lewis Carroll and Related Pieces. $\\mathcal{A}$ Mathematical Approach, ed. Francine F. Abeles, The Pamphlets of Lewis Carroll, vol. iii (Charlottesville, Va.: University Press of Virginia for the Lewis Carroll Society of North America, 2002).  \n\nThe Rectory Umbrella and Mischmasch (facsimile) (London: Cassell, 1932; New York: Dover, 1971).  \n\nLewis Carroll’s Diaries: The Private Journals of Charles Lutwidge Dodgson, ed. Edward Wakeling, 10 vols. (Luton: The Lewis Carroll Society, 1993–2008).  \n\nThe Letters of Lewis Carroll, ed. Morton N. Cohen with the assistance of Roger Lancelyn Green, 2 vols. (London: Macmillan, 1979).  \n\nThe Selected Letters of Lewis Carroll, ed. Morton N. Cohen (London and Basingstoke: Macmillan, 1989/1996).  \n\n# Biography  \n\nMichael Bakewell, Lewis Carroll: A Biography (London: Heinemann, 1996).  \n\nMorton N. Cohen, Lewis Carroll: A Biography (London and Basingstoke: Macmillan, 1995).  \n\n(ed.), Lewis Carroll: Interviews and Recollections (London: Palgrave Macmillan; Iowa City: Iowa State University Press, 1989).  \n\nand Anita Gandolfo, Lewis Carroll and the House of Macmillan (Cambridge: Cambridge University Press, 1987). and Edward Wakeling, Lewis Carroll and His Illustrators: Collaborations and Correspondence, 1865–1898 (New York: Cornell University Press; London: Macmillan, 2003).  \n\nStuart Dodgson Collingwood, The Life and Letters of Lewis Carroll (Rev. C. L. Dodgson) (London: T. Fisher Unwin, 1899).  \n\nDerek Hudson, Lewis Carroll: An Illustrated Biography (1954; rev. edn., London: Constable, 1976).  \n\nKaroline Leach, In the Shadow of the Dreamchild: A New Understanding of Lewis Carroll (London: Peter Owen, 1999; 2nd edn. as In the Shadow of the Dreamchild: The Myth and Reality of Lewis Carroll, 2008).  \n\nRoger Taylor and Edward Wakeling, Lewis Carroll, Photographer (Princeton: Princeton University Press, 2002).  \n\nDonald Thomas, Lewis Carroll: A Portrait with Background (London: John Murray, 1996).  \n\nRobin Wilson, Lewis Carroll in Numberland: His Fantastical Mathematical Logical Life (London: Allen Lane, 2008).  \n\nJenny Woolf, Lewis Carroll in His Own Account: The Complete Bank Account of the Rev. C. L. Dodgson (London, Jabberwock Press, 2005).  \n\n# Contexts  \n\nMavis Batey, The World of Alice (Norwich: Pitkin, 1998).  \n\nWill Brooker, Alice’s Adventures: Lewis Carroll in Popular Culture (New York: Continuum, 2004).   \nMichael Hancher, The Tenniel Illustrations to the ‘Alice’ Books (Columbus, Ohio: Ohio State University Press, 1986).   \nJo Elwyn Jones and J. Francis Gladstone, The Alice Companion (Basingstoke: Macmillan, 1998). The Red King’s Dream or Lewis Carroll in Wonderland (London: Cape, 1995).   \nCharlie Lovett, Lewis Carroll’s England (London: White Stone Publishing/The Lewis Carroll Society, 1998).   \nCarolyn Sigler (ed.), Alternative Alices: Visions and Revisions of Lewis Carroll’s Alice Books (Lexington, Ky.: The University Press of Kentucky, 1997).   \nStephanie Lovett Stoffel, Lewis Carroll and Alice (London: Thames and Hudson, 1997).  \n\nBryan Talbot, Alice in Sunderland (London: Cape, 2007).  \n\n# Bibliography  \n\nRachel Fordyce, Lewis Carroll: A Reference Guide (Boston: G. K. Hall, 1988).  \n\nEdward  Guiliano,  Lewis  Carroll:  An  Annotated  International Bibliography, 1960–1977 (Charlottesville, Va.: University Press of Virginia, 1980; Brighton: Harvester, 1981).   \nCharles C. Lovett, Lewis Carroll and the Press: An Annotated Bibliography of Charles Dodgson’s Contributions to Periodicals (New Castle, Dela.: Oak Knoll Press; London: British Library, 1999).   \nS. H. Williams, Falconer Madan, Roger Lancelyn Green, and Denis Crutch, The Lewis Carroll Handbook (1931; 4th edn., Folkstone: Dawson Archon Books, 1979).  \n\n# Criticism  \n\nRachel Fordyce (ed.), Semiotics and Linguistics in Alice’s Worlds (Berlin: de Gruyter, 1994).  \n\nEdward Guiliano (ed.), Lewis Carroll: A Celebration (New York: Clarkson N. Potter, 1981).  \n\nRobert Phillips (ed.), Aspects of Alice: Lewis Carroll’s Dream",
    "chunk_order_index": 18,
    "full_doc_id": "doc-25e80a930cbb6f47e8c54c6356e1edba"
  },
  "chunk-e26734a5f4c38268dc39f7921ed7b3f5": {
    "tokens": 1200,
    "content": ", The Lewis Carroll Handbook (1931; 4th edn., Folkstone: Dawson Archon Books, 1979).  \n\n# Criticism  \n\nRachel Fordyce (ed.), Semiotics and Linguistics in Alice’s Worlds (Berlin: de Gruyter, 1994).  \n\nEdward Guiliano (ed.), Lewis Carroll: A Celebration (New York: Clarkson N. Potter, 1981).  \n\nRobert Phillips (ed.), Aspects of Alice: Lewis Carroll’s Dreamchild as Seen Through the Critics’ Looking-Glasses 1865–1971 (London: Gollancz, 1972; Harmondsworth: Penguin, 1974).  \n\nDonald Rackin, Alice’s Adventures in Wonderland and Through the Looking-Glass: Nonsense, Sense and Meaning (New York: Twayne, 1991).  \n\nRonald Reichertz, The Making of the Alice Books: Lewis Carroll’s Uses of Earlier Children’s Literature (Montreal: McGill-Queen’s University Press, 1997).  \n\n# Chapters on Dodgson and the ‘Alice’ Books  \n\nGillian Avery and Julia Briggs (eds.), Children and Their Books (Oxford: Clarendon Press, 1989).  \n\nHumphrey Carpenter, Secret Gardens (1985; London: Unwin, 1987). Karen Coats, Looking Glasses and Neverlands: Lacan, Desire, and Subjectivity in Children’s Literature (Iowa City: University of Iowa Press, 2004).  \n\nJuliet Dusinberre, Alice to the Lighthouse: Children’s Books and Radical Experiments in Art (London: Macmillan Press, 1987).  \n\nJohn Goldthwaite, The Natural History of Make-Believe (New York: Oxford University Press, 1996).  \n\nRoderick McGillis, The Nimble Reader (New York: Twayne, 1996). Elizabeth Sewell, The Field of Nonsense (London: Chatto and Windus, 1952).  \n\nDeborah Cogan Thacker and Jean Webb, Introducing Children’s Literature:  From  Romanticism  to  Postmodernism  (London: Routledge, 2002).  \n\n# Articles  \n\nJennifer Geer, ‘“All Sorts of Pitfalls and Surprises”: Competing Views of Idealized Girlhood in Lewis Carroll’s Alice Books’, Children’s Literature, 31 (2003), 1–24.  \n\nCecily Raysor Hancock, ‘Musical Notes to The Annotated Alice’, Children’s Literature, 16 (1988), 1–30.  \n\nMichael Holquist, ‘What is a Boojum? Nonsense and Modernism’, Yale French Studies, 43 (1969), ${\\bf I}45^{-6}4$ .U. C. Knoepflmacher, ‘Avenging Alice: Christina Rossetti and Lewis Carroll’, Nineteenth Century Literature, 41/1 (1986), 299–328. Carolyn  Sigler,  ‘Authorizing  Alice:  Professional  Authority,  the Literary Marketplace, and Victorian Women’s Re-Visions of the Alice Books’, The Lion and the Unicorn, 22 (1998), 351–63.  \n\n# A CHRONOLOGY OF C. L. DODGSON/‘LEWIS CARROLL’  \n\n1827 The Revd Charles Dodgson marries Frances Jane Lutwidge, and is presented to the living of Daresbury, Cheshire.   \n1832 (27 Jan.) Charles Lutwidge Dodgson, third child and first son, born at Daresbury Parsonage.   \n1839 Catherine Sinclair, Holiday House.   \n1843 Family moves to Croft, near Richmond, Yorkshire; father becomes Rector.   \n1844–5 Attends Richmond School.   \n1845 Composes first ‘family magazine’, Useful and Instructive Poetry (published 1954).   \n1846 Edward Lear, $_{\\textit{A}}$ Book of Nonsense.   \n1846 Attends Rugby School.   \n1848 Heinrich Hoffman, The English Struwwelpeter.   \n1849 Returns to Croft to prepare for Oxford; has mumps, which leave him permanently deaf in his right ear; writes The Rectory Umbrella (to 1850).   \n1851 (24 Jan.) Comes into Residence at Christ Church, Oxford; death of his mother. John Ruskin, King of the Golden River   \n1852 1st Class in Mathematical and 2nd in Classical Moderations; nominated by Dr Pusey to a studentship.   \n1854 1st Class in Mathematics (Final Schools); spends summer being coached by Bartholomew Price at Whitby for his mathematics examination; first publications, in The Whitby Gazette; BA; epidemic of cholera at Oxford.   \n1855 (1 Jan.) Begins diary; (8 Sept.) ‘She’s All My Fancy Painted Him’ (first version of poem in Alice’s Adventures in Wonderland, chapter 12) published in Comic Times; made ‘A Master of the  House’  and  Senior  Student;  ‘Stanza  of  AngloSaxon Poetry’ (first stanza of ‘Jabberwocky’) written in family  \n\nmagazine, Mischmasch; Henry George Liddell appointed Dean of Christ Church. W. M. Thackeray, The Rose and the  \n\nRing.   \n1855–7 Sub-librarian at Christ Church (salary $\\mathcal{L}35)$ ).   \n$\\mathbf{I}\\,855{-}8\\mathbf{I}$ Lecturer in Mathematics at Christ Church.   \n1856 (Mar.) First uses pseudonym ‘Lewis Carroll’ to poem ‘Solitude’ in The Train (i. $\\mathbf{I}\\,54\\substack",
    "chunk_order_index": 19,
    "full_doc_id": "doc-25e80a930cbb6f47e8c54c6356e1edba"
  },
  "chunk-30217968371283d5e3b700d712d42d85": {
    "tokens": 1200,
    "content": "Christ Church. W. M. Thackeray, The Rose and the  \n\nRing.   \n1855–7 Sub-librarian at Christ Church (salary $\\mathcal{L}35)$ ).   \n$\\mathbf{I}\\,855{-}8\\mathbf{I}$ Lecturer in Mathematics at Christ Church.   \n1856 (Mar.) First uses pseudonym ‘Lewis Carroll’ to poem ‘Solitude’ in The Train (i. $\\mathbf{I}\\,54\\substack{-5},$ ); (18 Mar.) buys first camera, made by Thomas Ottewill for $\\mathcal{L}\\mathbf{I}\\,5$ (delivered 1 May); (25 Apr.) meets Lorina, Alice, and Edith Liddell.   \n1857 Takes MA; (May) meets Thackeray; (June) meets Holman Hunt; (Sept.) meets Tennyson; (Oct.) meets Ruskin; (Dec.) ‘Hiawatha’s Photographing’ published in The Train.   \n1858 Publication of his first book: The Fifth Book of Euclid treated Algebraically, ‘By a College Tutor’. George MacDonald’s Phantastes.   \n1859 Begins therapy for his ‘stammer’ with Dr James Hunt at Hastings; meets George MacDonald.   \n1860 Publication of his first acknowledged book, A Syllabus of Plane Algebraical Geometry, ‘by Charles Lutwidge Dodgson’; publishes ‘A Photographer’s Day Out’ in the South Shields Amateur Magazine.   \n1861 (22 Dec.) Admitted to Deacon’s Orders (‘regard myself . . . as practically a layman’) by Samuel Wilberforce, Bishop of Oxford.   \n1862 River trips with Liddell sisters: genesis of Alice’s Adventures in Wonderland; (13 Nov.) begins writing. Christina Rossetti, Goblin Market.   \n1863 (10 Feb.) Completes Alice’s Adventures under Ground; (May) sends MS of Alice’s Adventures in Wonderland to the MacDonalds; (June) estrangement from Liddell family; (Sept.) first visits Dante Gabriel Rossetti at Cheyne Walk, Chelsea; (Oct.) meets Alexander Macmillan; John Tenniel agrees to illustrate the book. Charles Kingsley’s The Water Babies.   \n1864 (26 Nov.) Sends hand-lettered copy of Alice’s Adventures under Ground to Alice Liddell.   \n1865 (27 June) Receives first copies of Alice’s Adventures in Wonderland; (14 July) photographs Ellen Terry; (2 Aug.) orders reprint of Alice; (14 Dec.) sends copy to Alice Liddell.   \n1866 (June) Meets Charlotte M. Yonge.   \n1867 (12 July–14 Sept.) Travels with Henry Parry Litton to Moscow (his only trip abroad); (Dec.) publishes ‘Bruno’s Revenge’ in Aunt Judy’s Magazine, iv; Electoral Reform Act. ‘Hesba Stretton’, Jessica’s First Prayer.   \n1868 (21 June) Death of his father: ‘the greatest blow that has ever fallen on my life’; moves into rooms on Tom quad, which he occupies for the rest of his life; leases ‘The Chestnuts’, Guildford; begins Through the Looking-Glass. Louisa May Alcott, Little Women.   \n1869 (Jan.) Publication of Phantasmagoria, and Other Poems; (12 Jan.) ‘Finished and sent to Macmillan the first chapter of Behind the Looking-Glass, and What Alice Saw There’; first German and French translations of Alice’s Adventures in Wonderland. Jean Ingelow, Mopsa the Fairy.   \n$\\phantom{0}\\mathbf{I}8\\gamma0$ (4 Jan.) ‘Finished the MS of Through the Looking-Glass’.   \n$\\phantom{0}\\mathbf{I}87\\mathbf{I}$ (Dec.) Through the Looking-Glass published (9,000 copies, dated 1872).   \n1872 First Italian translation of Alice’s Adventures in Wonderland; The New Belfry of Christ Church, Oxford.   \n1874 First Dutch translation of Alice’s Adventures in Wonderland; publication of Notes by an Oxford Chiel. Christina Rossetti, Speaking Likenesses.   \n1875 (June) ‘Some Popular Fallacies about Vivisection’, Fortnightly Review. Tom Hood, From Nowhere to the North Pole.   \n1876 (29 Mar.) Publication of The Hunting of the Snark.   \n1877 (31 July) Takes rooms at 27 Lushington Road, Eastbourne, for the summer; he returns to them each summer for the rest of his life.   \n1878 45th thousand of Through the Looking-Glass.   \n1879 (Mar.) Publication of Euclid and his Modern Rivals; Doublets, a Word Puzzle.   \n1880 (July) Gives up photography; marriage of Alice Liddell to Reginald Hargreaves; begins $_{\\textit{A}}$ Tangled Tale in The Monthly Packet.   \n1882–92 Curator of Christ Church Common Room.   \n1882 Richard Jefferies, Bevis.   \n1883 (6 Dec.) Publication of Rhyme? and Reason? Robert Louis Stevenson, Treasure Island.   \n$\\mathbf{I}88_{4}$ (Nov.) The Principles of Parliamentary Representation.   \n1885 Criminal Law Amendment Act raises age of consent to 16; (22 Dec.) publication of $_{\\textit{A}}$ Tangled Tale.   \n1886 (22 Dec.) Publication of Alice’s Adventures under Ground; (23 Dec.) first night of Henry Savile Clarke’s ‘Dream Play’, Alice in Wonderland (Prince of Wales Theatre; the play was published in early $\\phantom{0}\\mathbf{I}88\\phantom{7}$ ––dated 188",
    "chunk_order_index": 20,
    "full_doc_id": "doc-25e80a930cbb6f47e8c54c6356e1edba"
  },
  "chunk-63e0005b7085bcc9c8b8fe828c6d7a9d": {
    "tokens": 1200,
    "content": "1885 Criminal Law Amendment Act raises age of consent to 16; (22 Dec.) publication of $_{\\textit{A}}$ Tangled Tale.   \n1886 (22 Dec.) Publication of Alice’s Adventures under Ground; (23 Dec.) first night of Henry Savile Clarke’s ‘Dream Play’, Alice in Wonderland (Prince of Wales Theatre; the play was published in early $\\phantom{0}\\mathbf{I}88\\phantom{7}$ ––dated 1886). Frances Hodgson Burnett, Little Lord Fauntleroy.   \n1887 (21 Feb.) Publication of The Game of Logic (an edition printed in 1886 was cancelled and sold to America).   \n1888 Curiosa Mathematica: A New Theory of Parallels.   \n1889 (12 Dec.) Publication of Sylvie and Bruno. Andrew Lang, The Blue Fairy Book.   \n1890 Publication of The Nursery Alice, Eight or Nine Wise Words about Letter-Writing, and (July) the Wonderland Stamp Case.   \n1893 (29 Dec.) Publication of Sylvie and Bruno Concluded; Pillow Problems (Curiosa Mathematica II).   \n1894 Rudyard Kipling, The Jungle Book.   \n1895 G. E. Farrow, The Wallypug of Why; Kenneth Grahame, The Golden Age.   \n1896 (21 Feb.) Publication of Symbolic Logic, Part 1.   \n1898 (14 Jan.) Dies at ‘The Chestnuts’, Guildford; (Feb.) publication of Three Sunsets and Other Poems; (Dec.) The Life and Letters of Lewis Carroll (dated 1899).  \n\n![](images/image_3.jpg)  \n\n# ALICE’S ADVENTURES IN WONDERLAND  \n\n# This page intentionally left blank  \n\nAll in the golden afternoon Full leisurely we glide; For both our oars, with little skill, By little arms are plied, While little hands make vain pretence Our wanderings to guide.  \n\nAh, cruel Three! In such an hour, Beneath such dreamy weather, To beg a tale of breath too weak To stir the tiniest feather! Yet what can one poor voice avail Against three tongues together?  \n\nImperious Prima flashes forth Her edict ‘to begin it’: In gentler tones Secunda hopes ‘There will be nonsense in it!’ While Tertia\\* interrupts the tale Not more than once a minute.  \n\nAnon, to sudden silence won, In fancy they pursue The dream-child moving through a land Of wonders wild and new, In friendly chat with bird or beast–– And half believe it true.  \n\nAnd ever, as the story drained The wells of fancy dry,   \nAnd faintly strove that weary one To put the subject by,   \n‘The rest next time––’ ‘It is next time!’ The happy voices cry.   \nThus grew the tale of Wonderland: Thus slowly, one by one,   \nIts quaint events were hammered out–– And now the tale is done,   \nAnd home we steer, a merry crew, Beneath the setting sun.   \nAlice! A childish story take, And, with a gentle hand,   \nLay it where Childhood’s dreams are twined In Memory’s mystic band,   \nLike pilgrim’s wither’d wreath of flowers Pluck’d in a far-off land.  \n\n# PREFACE TO THE  \n\n# SEVENTY-NINTH THOUSAND  \n\nAs Alice is about to appear on the Stage,\\* and as the lines beginning: ‘ ’Tis the voice of the Lobster’ were found to be too fragmentary for dramatic purposes four lines have been added to the first stanza and six to the second, while the Oyster has been developed into a Panther.  \n\nChristmas, 1886  \n\n# PREFACE TO THE EIGHTY-SIXTH THOUSANDof the $6/-$ edition  \n\nEnquiries have been so often addressed to me, as to whether any answer to the Hatter’s Riddle (see p. 60) can be imagined, that I may as well put on record here what seems to me to be a fairly appropriate answer, viz. ‘Because it can produce a few notes, though they are very flat; and it is never put with the wrong end in front!’ This, however, is merely an afterthought: the Riddle, as originally invented, had no answer at all.  \n\nFor this eighty-sixth thousand, fresh electrotypes have been taken from the wood-blocks (which, never having been used for printing from, are in as good condition as when first cut in $\\mathbf{I}\\,865$ ), and the whole book has been set up afresh with new type. If the artistic qualities of this re-issue fall short, in any particular, of those possessed by the original issue, it will not be for want of painstaking on the part of author, publisher, or printer.  \n\nI take this opportunity of announcing that the Nursery ‘Alice,’\\* hitherto priced at four shillings, net, is now to be had on the same terms as the ordinary shilling picture-books–– although I feel sure that it is, in every quality (except the text itself, on which I am not qualified to pronounce), greatly superior to them. Four shillings was a perfectly reasonable price to charge, considering the very heavy initial outlay I had incurred: still, as the Public have practically said ‘We will not give more than a shilling for a picture-book, however artistically got-up’, I am content to reckon my outlay on the book as so much dead loss, and, rather than let the little ones, for whom it was written, go without it, I am selling it at a price which is, to me, much the same thing as giving it away.  \n\n# CONTENTS  \n\ni. down the rabbit-hole page 9   \nii",
    "chunk_order_index": 21,
    "full_doc_id": "doc-25e80a930cbb6f47e8c54c6356e1edba"
  },
  "chunk-4e7114a3dd027707a5fdf7786a65618e": {
    "tokens": 1200,
    "content": "the Public have practically said ‘We will not give more than a shilling for a picture-book, however artistically got-up’, I am content to reckon my outlay on the book as so much dead loss, and, rather than let the little ones, for whom it was written, go without it, I am selling it at a price which is, to me, much the same thing as giving it away.  \n\n# CONTENTS  \n\ni. down the rabbit-hole page 9   \nii. the pool of tears 16   \niii. a caucus-race and a long tale 24   \niv. the rabbit sends in a little bill 31   \nv. advice from a caterpillar 40   \nvi. pig and pepper 50   \nvii. a mad tea-party 60   \nviii. the queen’s croquet-ground 69   \nix. the mock turtle’s story 79   \nx. the lobster-quadrille 88   \nxi. who stole the tarts? 96   \nxii. alice ’s evidence 103  \n\n# This page intentionally left blank  \n\n![](images/image_4.jpg)  \nCHAPTER I   \ndown the rabbit-hole  \n\nAlice was beginning to get very tired of sitting by her sister on the bank, and of having nothing to do: once or twice she had peeped into the book her sister was reading, but it had no pictures or conversations in it, ‘and what is the use of a book,’ thought Alice, ‘without pictures or conversations?’  \n\nSo she was considering, in her own mind (as well as she could, for the hot day made her feel very sleepy and stupid), whether the pleasure of making a daisy-chain would be worth the trouble of getting up and picking the daisies, when suddenly a White Rabbit\\* with pink eyes ran close by her.  \n\nThere was nothing so very remarkable in that; nor did Alice think it so very much out of the way to hear the Rabbit say to itself ‘Oh dear! Oh dear! I shall be too late!’ (when she thought it over afterwards, it occurred to her that she ought to have wondered at this, but at the time it all seemed quite natural); but, when the Rabbit actually took a watch out of its waistcoat-pocket, and looked at it, and then hurried on, Alice started to her feet, for it flashed across her mind that she had never before seen a rabbit with either a waistcoat-pocket, or a watch to take out of it, and, burning with curiosity, she ran across the field after it, and was just in time to see it pop down a large rabbit-hole under the hedge.  \n\nIn another moment down went Alice after it, never once considering how in the world she was to get out again.  \n\nThe rabbit-hole went straight on like a tunnel for some way, and then dipped suddenly down, so suddenly that Alice had not a moment to think about stopping herself before she found herself falling down what seemed to be a very deep well.  \n\nEither the well was very deep, or she fell very slowly, for she had plenty of time as she went down to look about her, and to wonder what was going to happen next. First, she tried to look down and make out what she was coming to, but it was too dark to see anything: then she looked at the sides of the well, and noticed that they were filled with cupboards and book-shelves: here and there she saw maps and pictures hung upon pegs. She took down a jar from one of the shelves as she passed: it was labeled ‘ORANGE MARMALADE, $^{,*}$ but to her great disappointment it was empty: she did not like to drop the jar, for fear of killing somebody underneath, so managed to put it into one of the cupboards as she fell past it.  \n\n‘Well!’ thought Alice to herself. ‘After such a fall as this, I shall think nothing of tumbling down-stairs! How brave they’ll all think me at home! Why, I wouldn’t say anything about it, even if I fell off the top of the house!’\\* (Which was very likely true.)  \n\nDown, down, down. Would the fall never come to an end? ‘I wonder how many miles I’ve fallen by this time?’ she said aloud. ‘I must be getting somewhere near the centre of the earth. Let me see: that would be four thousand miles down, I think––’ (for, you see, Alice had learnt several things of this sort in her lessons in the school-room, and though this was not a very good opportunity for showing off her knowledge, as there was no one to listen to her, still it was good practice to say it over) ‘––yes, that’s about the right distance––but then I wonder what Latitude or Longitude I’ve got to?’ (Alice had not the slightest idea what Latitude was, or Longitude either, but she thought they were nice grand words to say.)  \n\nPresently she began again. ‘I wonder if I shall fall right through the earth!\\* How funny it’ll seem to come out among the people that walk with their heads downwards! The antipathies, I think––’ (she was rather glad there was no one listening, this time, as it didn’t sound at all the right word) ‘––but I shall have to ask them what the name of the country is, you know. Please, Ma’am, is this New Zealand? Or Australia?’ (and she tried to curtsey as she spoke––fancy, curtseying as you’re falling through the air! Do you think you could manage it?) ‘And what an ignorant little girl she’ll think me for asking! No, it’ll never do to ask: perhaps I shall see it written up somewhere.’  \n\nDown, down, down. There",
    "chunk_order_index": 22,
    "full_doc_id": "doc-25e80a930cbb6f47e8c54c6356e1edba"
  },
  "chunk-4754eef30eba5accf2e874409f3e91d2": {
    "tokens": 1200,
    "content": "to ask them what the name of the country is, you know. Please, Ma’am, is this New Zealand? Or Australia?’ (and she tried to curtsey as she spoke––fancy, curtseying as you’re falling through the air! Do you think you could manage it?) ‘And what an ignorant little girl she’ll think me for asking! No, it’ll never do to ask: perhaps I shall see it written up somewhere.’  \n\nDown, down, down. There was nothing else to do, so Alice soon began talking again. ‘Dinah’ll miss me very much to-night, I should think!’ (Dinah\\* was the cat.) ‘I hope they’ll remember her saucer of milk at tea-time. Dinah, my dear! I wish you were down here with me! There are no mice in the air, I’m afraid, but you might catch a bat, and that’s very like a mouse, you know. But do cats eat bats, I wonder?’ And here Alice began to get rather sleepy, and went on saying to herself, in a dreamy sort of way, ‘Do cats eat bats? Do cats eat bats?’ and sometimes ‘Do bats eat cats?’, for, you see, as she couldn’t answer either question, it didn’t much matter which way she put it. She felt that she was dozing off, and had just begun to dream that she was walking hand in hand with Dinah, and was saying to her, very earnestly, ‘Now, Dinah, tell me the truth: did you ever eat a bat?’, when suddenly, thump! thump! down she came upon a heap of sticks and dry leaves, and the fall was over.  \n\nAlice was not a bit hurt, and she jumped up on to her feet in a moment: she looked up, but it was all dark overhead:  \n\nbefore her was another long passage, and the White Rabbit was still in sight, hurrying down it. There was not a moment to be lost: away went Alice like the wind, and was just in time to hear it say, as it turned a corner, ‘Oh my ears and whiskers, how late it’s getting!’ She was close behind it when she turned the corner, but the Rabbit was no longer to be seen: she found herself in a long, low hall, which was lit up by a row of lamps hanging from the roof.  \n\nThere were doors all round the hall, but they were all locked; and when Alice had been all the way down one side and up the other, trying every door, she walked sadly down the middle, wondering how she was ever to get out again.  \n\nSuddenly she came upon a little three-legged table, all made of solid glass: there was nothing on it but a tiny golden key,\\* and Alice’s first idea was that this might belong to one of the doors of the hall; but, alas! either the locks were too large, or the key was too small, but at any rate it would not open any of them. However, on the second time round, she came upon a low curtain she had not noticed before, and behind it was a little door about fifteen inches high: she tried the little golden key in the lock, and to her great delight it fitted!  \n\n![](images/image_5.jpg)  \n\nAlice opened the door and found that it led into a small passage, not much larger than a rat-hole: she knelt down and looked along the passage into the loveliest garden you ever saw. How she longed to get out of that dark hall, and wander about among those beds of bright flowers and those cool fountains, but she could not even get her head through the doorway;\\* ‘and even if my head would go through,’ thought poor Alice, ‘it would be of very little use without my shoulders. Oh, how I wish I could shut up like a telescope! I think I could, if I only knew how to begin.’ For, you see, so many out-ofthe-way things had happened lately, that Alice had begun to think that very few things indeed were really impossible.  \n\nThere seemed to be no use in waiting by the little door, so she went back to the table, half hoping she might find another key on it, or at any rate a book of rules for shutting people up  like  telescopes:  this time  she  found  a  little bottle  on  it  (‘which certainly was  not  here before,’ said Alice), and tied round the neck of the bottle was a paper label, with the words ‘DRINK ME’ beautifully printed on it in large letters.  \n\nIt was all very well to say ‘Drink me,’ but the  \n\n![](images/image_6.jpg)  \n\nwise little Alice was not going to do that in a hurry. ‘No, I’ll look first,’ she said, ‘and see whether it’s marked “poison” or not’; for she had read several nice little stories about children who had got burnt, and eaten up by wild beasts, and other unpleasant things, all because they would not remember the simple rules their friends had taught them: such as, that a red-hot poker will burn you if you hold it too long; and that, if you cut your finger very deeply with a knife, it usually bleeds; and she had never forgotten that, if you drink much from a bottle marked ‘poison,’ it is almost certain to disagree with you, sooner or later.  \n\nHowever, this bottle was not marked ‘poison,’ so Alice ventured to taste it, and, finding it very nice (it had, in fact, a sort of mixed flavour of cherry-tart, custard, pine-apple, roast turkey, toffy, and hot buttered toast), she",
    "chunk_order_index": 23,
    "full_doc_id": "doc-25e80a930cbb6f47e8c54c6356e1edba"
  },
  "chunk-c241a81be54f0c742288bc69a5baadc8": {
    "tokens": 1001,
    "content": "it usually bleeds; and she had never forgotten that, if you drink much from a bottle marked ‘poison,’ it is almost certain to disagree with you, sooner or later.  \n\nHowever, this bottle was not marked ‘poison,’ so Alice ventured to taste it, and, finding it very nice (it had, in fact, a sort of mixed flavour of cherry-tart, custard, pine-apple, roast turkey, toffy, and hot buttered toast), she very soon finished it off.  \n\n![](images/image_7.jpg)  \n\n‘What a curious feeling!’ said Alice. ‘I must be shutting up like a telescope!’  \n\nAnd so it was indeed: she was now only ten inches high, and her face brightened up at the thought that she was now the right size for going through the little door into that lovely garden. First, however, she waited for a few minutes to see if she was going to shrink any further: she felt a little nervous about this; ‘for it might end, you know,’ said Alice to herself, ‘in my going out altogether, like a candle. I wonder what I should be like then?’ And she tried to fancy what the flame of a candle looks like after the candle is blown out, for she could not remember ever having seen such a thing.  \n\nAfter a while, finding that nothing more happened, she decided on going into the garden at once; but, alas for poor Alice! when she got to the door, she found she had forgotten the little golden key, and when she went back to the table for it, she found she could not possibly reach it: she could see it quite plainly through the glass, and she tried her best to climb up one of the legs of the table, but it was too slippery; and when she had tired herself out with trying, the poor little thing sat down and cried.  \n\n‘Come, there’s no use in crying like that!’ said Alice to herself rather sharply. ‘I advise you to leave off this minute!’ She generally gave herself very good advice (though she very seldom followed it), and sometimes she scolded herself so severely as to bring tears into her eyes; and once she remembered trying to box her own ears for having cheated herself in a game of croquet she was playing against herself, for this curious child was very fond of pretending to be two people. ‘But it’s no use now,’ thought poor Alice, ‘to pretend to be two people! Why, there’s hardly enough of me left to make one respectable person.’  \n\nSoon her eye fell on a little glass box that was lying under the table: she opened it, and found in it a very small cake, on which the words ‘EAT $\\mathrm{ME^{\\circ\\ast}}$ were beautifully marked in currants. ‘Well, I’ll eat it,’ said Alice, ‘and if it makes me grow larger, I can reach the key; and if it makes me grow smaller, I can creep under the door: so either way I’ll get into the garden, and I don’t care which happens!’  \n\nShe ate a little bit, and said anxiously to herself ‘Which way? Which way?’, holding her hand on the top of her head to feel which way it was growing; and she was quite surprised to find that she remained the same size. To be sure, this is what generally happens when one eats cake; but Alice had got so much into the way of expecting nothing but out-of-theway things to happen, that it seemed quite dull and stupid for life to go on in the common way.  \n\nSo she set to work, and very soon finished off the cake.  \n\n![](images/image_8.jpg)  \n\n![](images/image_9.jpg)  \n\n# CHAPTER II  \n\nthe pool of tears ‘Curiouser  and  curiouser!’ cried Alice (she was so much surprised, that for the moment she quite forgot how to speak good English). ‘Now I’m opening out like the largest telescope that ever was!  Good-bye,  feet!’ (for  when  she  looked down at her feet, they seemed to be almost out of sight, they were getting  so  far  off). ‘Oh, my  poor  little  feet,  I wonder who will put on your  shoes  and  stockings for you now, dears? I’m  sure $I$ sha’n’t  be able! I shall be a great deal too far off to trouble myself  about  you:  you must  manage  the  best way you can––but I must be kind to them,’ thought Alice, ‘or perhaps they  \n\nnew pair of boots every Christmas.’  \n\nAnd she went on planning to herself how she would manage it. ‘They must go by the carrier,’ she thought; ‘and how",
    "chunk_order_index": 24,
    "full_doc_id": "doc-25e80a930cbb6f47e8c54c6356e1edba"
  }
}