{
    "image_1": [
        {
            "entity_name": "IMAGE_1_PERSON-0.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'person'. The entity features are as follows:Person Features:- Gender: Female- Skin Color: Fair- Hairstyle: Dark hair, styled in a bun with a headpiece that includes a crown-like element and feathers- Facial Expression: Stern and serious- Age: Appears to be an adult woman- Clothing: Wearing a blue dress with gold trim and a white collar with black diamond patterns; the sleeves are puffed and also have gold trim- Accessories: Earrings and a necklace are visible, adding to the regal appearance- Posture: Sitting upright, with one hand resting on her hip and the other holding a scepter or similar objectOverall, the character appears to be a queen or a figure of royalty, given the crown and the regal attire."
        },
        {
            "entity_name": "IMAGE_1",
            "entity_type": "ORI_IMG",
            "description": "The image depicts a whimsical and colorful scene featuring a character resembling the Queen of Hearts from Lewis Carroll's 'Alice's Adventures in Wonderland'. The queen is dressed in a vibrant, ornate costume with a blue dress adorned with gold and red patterns. She wears a large, triangular black hat with a golden crown on top. Her expression is stern and commanding, with her mouth set in a firm line. In her left hand, she holds a plate with several red tarts, each topped with what appears to be jam or jelly. To her right, there is a smaller figure, possibly a card soldier, who is also dressed in a similar style with a crown and holding a scepter. The background features a lush garden with green hedges shaped like hearts and flowers, adding to the fantastical atmosphere. Butterflies can be seen fluttering around, enhancing the magical setting. The overall mood of the image conveys a sense of authority and fantasy, typical of the story's themes."
        },
        {
            "entity_name": "QUEEN OF HEARTS",
            "entity_type": "PERSON",
            "description": "A regal figure with a stern expression, wearing a crown and holding a plate of tarts."
        },
        {
            "entity_name": "KING OF HEARTS",
            "entity_type": "PERSON",
            "description": "A smaller figure standing behind the Queen, also wearing a crown and holding a scepter."
        },
        {
            "entity_name": "GARDEN",
            "entity_type": "GEO",
            "description": "A lush garden with green hedges shaped like hearts and red flowers."
        },
        {
            "entity_name": "TARTS",
            "entity_type": "OBJECT",
            "description": "A plate of red tarts being held by the Queen."
        }
    ],
    "image_2": [
        {
            "entity_name": "IMAGE_2",
            "entity_type": "ORI_IMG",
            "description": "The image depicts a decorative element with a symmetrical design. The central motif is an ornate shield-like shape with a blue and gold color scheme. The shield features intricate patterns, including a starburst design at the top and a stylized emblem in the center. Flanking the shield are two red objects that resemble ceremonial maces or scepters, each resting on a surface that appears to be a stone or marble ledge. The background consists of a striped pattern with alternating red and yellow stripes, giving the impression of a draped fabric or curtain. The overall aesthetic suggests a formal or ceremonial setting, possibly related to heraldry or official insignia."
        },
        {
            "entity_name": "RED AND YELLOW STRIPED CLOTH",
            "entity_type": "OBJECT",
            "description": "A cloth with alternating red and yellow stripes, draped in the background."
        },
        {
            "entity_name": "BLUE AND GOLD EMBLEM",
            "entity_type": "OBJECT",
            "description": "An emblem featuring a blue and gold design, placed centrally above the cloth."
        },
        {
            "entity_name": "RED VASES",
            "entity_type": "OBJECT",
            "description": "Two identical red vases positioned symmetrically on either side of the emblem."
        }
    ],
    "image_3": [
        {
            "entity_name": "IMAGE_3",
            "entity_type": "ORI_IMG",
            "description": "The image is a black-and-white illustration from 'Alice's Adventures in Wonderland.' It depicts a courtroom scene with various characters. At the center, there is a king and queen seated on thrones, both wearing crowns and robes. The king holds a scepter and has a surprised expression, while the queen looks stern and angry. To the left of the king, a rabbit dressed in a suit stands holding a scroll. On the right side of the queen, a man in a tall hat and uniform stands guard. Below the royal couple, a bird-like creature sits at a table with a plate of food, seemingly eating. Another character, possibly a knight, stands to the left of the bird, holding a shield and sword. The background features large windows with curtains and a coat of arms with hearts. The overall atmosphere is one of tension and absurdity, typical of the whimsical and fantastical world of Wonderland."
        },
        {
            "entity_name": "KING OF HEARTS",
            "entity_type": "PERSON",
            "description": "A crowned figure with a surprised expression, sitting on a throne."
        },
        {
            "entity_name": "QUEEN OF HEARTS",
            "entity_type": "PERSON",
            "description": "A crowned figure with an angry expression, sitting beside the King of Hearts."
        },
        {
            "entity_name": "WHITE RABBIT",
            "entity_type": "PERSON",
            "description": "A rabbit dressed in formal attire, standing near the King of Hearts."
        },
        {
            "entity_name": "KNAVE OF HEARTS",
            "entity_type": "PERSON",
            "description": "A figure in armor, standing in front of the table."
        },
        {
            "entity_name": "DODO",
            "entity_type": "PERSON",
            "description": "A bird-like creature, sitting at the table."
        },
        {
            "entity_name": "COURTROOM",
            "entity_type": "GEO",
            "description": "The setting is a courtroom with a table and thrones."
        }
    ],
    "image_4": [
        {
            "entity_name": "IMAGE_4_PERSON-0.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'organism'. The entity features are as follows:Organism Features:- Species: Rabbit- Age: Adult- Color: White with black spots and stripes on the clothing- Shape: Upright posture, standing on hind legs- Size: Appears to be of average size for a rabbit- Posture: Standing upright like a human, giving it an anthropomorphic appearance- Structural Characteristics: Wearing a checkered coat with a belt, holding a watch in one paw, and has long ears and a bushy tailOverall, the rabbit is depicted in a whimsical, storybook style, dressed in human-like clothing and engaged in human-like activities."
        },
        {
            "entity_name": "IMAGE_4",
            "entity_type": "ORI_IMG",
            "description": "The image is a black-and-white illustration of a rabbit dressed in human clothing, standing upright on its hind legs. The rabbit is wearing a checkered vest and a waistcoat, with a white shirt underneath. It has a long necktie and is holding a pocket watch in its right hand, which it appears to be checking. The rabbit also has a walking stick under its left arm. The background shows a grassy field with some tall grass and a dandelion. The rabbit looks hurried and concerned, as if it is running late for an important appointment. The overall atmosphere of the image conveys a sense of urgency and anxiety."
        },
        {
            "entity_name": "WHITE RABBIT",
            "entity_type": "PERSON",
            "description": "A rabbit dressed in a checkered vest and pants, holding a pocket watch and an umbrella, appearing to be in a hurry."
        },
        {
            "entity_name": "POCKET WATCH",
            "entity_type": "OBJECT",
            "description": "A round, metallic object held by the White Rabbit, used for telling time."
        },
        {
            "entity_name": "UMBRELLA",
            "entity_type": "OBJECT",
            "description": "A long, thin object carried over the shoulder of the White Rabbit, typically used for protection from rain."
        },
        {
            "entity_name": "GRASS",
            "entity_type": "GEO",
            "description": "Green grassy area where the White Rabbit is standing, with some flowers and plants around."
        }
    ],
    "image_5": [
        {
            "entity_name": "IMAGE_5_PERSON-0.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'person'. The entity features are as follows:Person Features:- Gender: Female- Hairstyle: Long, wavy hair that reaches down to the middle of her back- Clothing: Wearing a light-colored dress with a full skirt that flares out; the dress has a high waist and long sleeves; she also wears dark shoes- Posture: Bending forward slightly, reaching out with one hand towards an object that appears to be a piece of furniture or a doorframe; her other hand is resting on her hip- Accessories: No visible accessoriesOverall, the character appears to be in motion, possibly exploring or interacting with her surroundings."
        },
        {
            "entity_name": "IMAGE_5",
            "entity_type": "ORI_IMG",
            "description": "The image is a black-and-white illustration depicting a young girl, presumably Alice from the story 'Alice in Wonderland,' peering through a small door. The girl has long hair and is wearing a dress with a pinafore. She is bending forward slightly, her hand pulling back a curtain to reveal a tiny door. The scene suggests curiosity and anticipation as she looks through the doorway into what appears to be a garden or another world. The background is minimalistic, focusing attention on the girl and the small door. The overall atmosphere conveys a sense of wonder and adventure as Alice discovers a hidden passage."
        },
        {
            "entity_name": "ALICE",
            "entity_type": "PERSON",
            "description": "A young girl with long hair, wearing a dress and shoes, pulling back a curtain."
        },
        {
            "entity_name": "CURTAIN",
            "entity_type": "OBJECT",
            "description": "A striped curtain partially covering a door."
        },
        {
            "entity_name": "DOOR",
            "entity_type": "OBJECT",
            "description": "A small door behind the curtain."
        }
    ],
    "image_6": [
        {
            "entity_name": "IMAGE_6_PERSON-0.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'person'. The entity features are as follows:Person Features:- Gender: Female- Hairstyle: Long, wavy hair that falls past the shoulders- Expression: Neutral, with a slight frown and eyes looking downward- Age: Appears to be a young girl- Clothing: Wearing a long, puffy-sleeved dress with a high collar and a full skirt; dark stockings and shoes- Posture: Standing with hands clasped in front, slightly hunched overOverall, the character gives off a classic, storybook vibe, reminiscent of a fairy tale or historical setting."
        },
        {
            "entity_name": "IMAGE_6",
            "entity_type": "ORI_IMG",
            "description": "The image is a black-and-white illustration of a young girl standing next to a small table. The girl has long, wavy hair and is wearing a short-sleeved dress with a full skirt. She is holding a small bottle in her right hand, which has a label that reads 'DRINK ME' in large letters. The girl appears to be examining the bottle closely, with a curious and cautious expression on her face. Her left hand is resting on her waist, and she is wearing knee-high socks and shoes. The table next to her is round and has a simple design with a single leg. The background is minimalistic, with no additional details or objects visible. The overall atmosphere of the image conveys a sense of wonder and caution as the girl contemplates the mysterious contents of the bottle."
        },
        {
            "entity_name": "ALICE",
            "entity_type": "PERSON",
            "description": "A young girl with long hair, wearing a dress and holding a bottle labeled 'DRINK ME' in her hand."
        },
        {
            "entity_name": "BOTTLE",
            "entity_type": "OBJECT",
            "description": "A small bottle with a label that reads 'DRINK ME', held by Alice."
        },
        {
            "entity_name": "TABLE",
            "entity_type": "OBJECT",
            "description": "A small table with a single drawer, on which the bottle is placed."
        }
    ],
    "image_7": [
        {
            "entity_name": "IMAGE_7",
            "entity_type": "ORI_IMG",
            "description": "The image consists of a series of black asterisks (*) arranged in a pattern on a white background. There are three rows of asterisks, with the top and bottom rows containing five asterisks each, and the middle row containing four asterisks. The asterisks are evenly spaced within each row, creating a symmetrical and balanced appearance. The overall pattern is simple and repetitive, with no additional elements or colors present."
        },
        {
            "entity_name": "STAR 1",
            "entity_type": "OBJECT",
            "description": "A star located at the top left corner of the image."
        },
        {
            "entity_name": "STAR 2",
            "entity_type": "OBJECT",
            "description": "A star located in the middle of the top row."
        },
        {
            "entity_name": "STAR 3",
            "entity_type": "OBJECT",
            "description": "A star located at the top right corner of the image."
        },
        {
            "entity_name": "STAR 4",
            "entity_type": "OBJECT",
            "description": "A star located in the middle of the second row from the top."
        },
        {
            "entity_name": "STAR 5",
            "entity_type": "OBJECT",
            "description": "A star located in the middle of the image."
        },
        {
            "entity_name": "STAR 6",
            "entity_type": "OBJECT",
            "description": "A star located in the middle of the second row from the bottom."
        },
        {
            "entity_name": "STAR 7",
            "entity_type": "OBJECT",
            "description": "A star located at the bottom left corner of the image."
        },
        {
            "entity_name": "STAR 8",
            "entity_type": "OBJECT",
            "description": "A star located in the middle of the bottom row."
        },
        {
            "entity_name": "STAR 9",
            "entity_type": "OBJECT",
            "description": "A star located at the bottom right corner of the image."
        }
    ],
    "image_8": [
        {
            "entity_name": "IMAGE_8",
            "entity_type": "ORI_IMG",
            "description": "The image consists of a pattern of black asterisks (*) arranged in a grid-like formation against a white background. There are three rows and five columns, making a total of fifteen asterisks. Each asterisk is evenly spaced from the others, creating a uniform and symmetrical appearance. The asterisks are identical in size and shape, appearing as simple, solid black symbols."
        },
        {
            "entity_name": "STAR PATTERN",
            "entity_type": "GEO",
            "description": "A pattern of stars arranged in a triangular formation with the base at the bottom and the apex at the top. The stars are evenly spaced and form a symmetrical design."
        }
    ],
    "image_9": [
        {
            "entity_name": "IMAGE_9_PERSON-0.JPG",
            "entity_type": "IMG",
            "description": "The category of this image feature block is 'person'. The entity features are as follows:Person Features:- Gender: Female- Hairstyle: Long, wavy hair that falls past the shoulders- Expression: Neutral, with a slightly curious or surprised look- Age: Appears to be a young girl- Clothing: Wearing a long, puffy-sleeved dress with a high collar and a ribbon tied at the neck; the dress has a full skirt that reaches the ankles- Accessories: Holding a piece of cloth or garment in her left hand, which she appears to be examining or adjustingOverall, the character gives off a vintage or storybook vibe, reminiscent of classic illustrations from children's literature."
        },
        {
            "entity_name": "IMAGE_9",
            "entity_type": "ORI_IMG",
            "description": "The image is a black-and-white illustration of Alice from the classic story 'Alice in Wonderland.' Alice is depicted standing and looking surprised or bewildered. She has long, wavy hair that falls past her shoulders and is wearing a dress with a high collar and puffed sleeves. Her posture is slightly bent forward, and one hand is placed on her chest while the other is resting on what appears to be a wall or a large object next to her. The expression on her face conveys a sense of curiosity and confusion, fitting the context where she is experiencing unusual growth. The background is minimalistic, with only a few lines suggesting a wall or a barrier next to her. The overall atmosphere of the image aligns with the whimsical and surreal tone of the story, capturing Alice's reaction to her extraordinary situation."
        },
        {
            "entity_name": "ALICE",
            "entity_type": "PERSON",
            "description": "A young girl with long hair, wearing a dress and standing next to a pole."
        },
        {
            "entity_name": "POLE",
            "entity_type": "OBJECT",
            "description": "A tall, vertical structure that Alice is standing next to."
        }
    ]
}