{
    "chunk-4023cee8b87a8c75b9c81b6158337c08": [
        {
            "entity_name": "Interstate 710 (Los Angeles)",
            "entity_type": "GEO",
            "description": "Interstate 710 is a highway in Los Angeles known for its traffic congestion, where freight trucks and commuters clog the highway, contributing to poor air quality.",
            "source_entities": [
                "INTERSTATE 710",
                "LOS ANGELES"
            ]
        },
        {
            "entity_name": "California’s Department of Transportation",
            "entity_type": "ORGANIZATION",
            "description": "California’s Department of Transportation is responsible for building highways in the state, including Interstate 710, and is part of the ongoing debate on congestion solutions.",
            "source_entities": [
                "CALIFORNIA’S DEPARTMENT OF TRANSPORTATION"
            ]
        },
        {
            "entity_name": "Katy Freeway (Houston)",
            "entity_type": "GEO",
            "description": "Katy Freeway is a highway in Houston known for being one of the world's widest highways, spanning 26 lanes in some spots.",
            "source_entities": [
                "KATY FREEWAY",
                "HOUSTON"
            ]
        },
        {
            "entity_name": "United States Congress",
            "entity_type": "ORGANIZATION",
            "description": "The United States Congress is the legislative body where Representative Kevin McCarthy is seeking the position of speaker, and where the functioning has ground to a halt due to the lack of a speaker.",
            "source_entities": [
                "UNITED STATES CONGRESS",
                "HOUSE OF REPRESENTATIVES"
            ]
        },
        {
            "entity_name": "Dadi Village (Guizhou Province, China)",
            "entity_type": "GEO",
            "description": "Dadi Village is a corn farming community in China's Guizhou Province, a rural area with limited medical resources, where Covid infections surged and is bracing for an onslaught of infections due to Lunar New Year travel.",
            "source_entities": [
                "DADI VILLAGE",
                "GUIZHOU PROVINCE",
                "CHINA",
                "RURAL AREAS"
            ]
        },
        {
            "entity_name": "Biden Administration",
            "entity_type": "ORGANIZATION",
            "description": "The Biden administration is suggesting more thoughtful solutions to congestion, including fixing existing roads and providing transit options, and has enacted the Infrastructure Law that provides funding for highways.",
            "source_entities": [
                "BIDEN ADMINISTRATION",
                "INFRASTRUCTURE LAW"
            ]
        },
        {
            "entity_name": "Republican Party",
            "entity_type": "ORGANIZATION",
            "description": "The Republican Party is described as having a slim governing majority and an unyielding hard-right flank that disdains normal government operations, affecting the functioning of the United States Congress.",
            "source_entities": [
                "REPUBLICAN PARTY"
            ]
        }
    ],
    "chunk-06a7e74025d44363b4b683d6489ee976": [
        {
            "entity_name": "House of Representatives",
            "entity_type": "ORGANIZATION",
            "description": "The legislative body where the vote for the speakership occurred and where the deep divisions and challenges to governance are evident. It is also the location where Representatives Ken Buck and Wesley Hunt were called back to cast votes.",
            "source_entities": [
                "HOUSE OF REPRESENTATIVES",
                "WASHINGTON"
            ]
        },
        {
            "entity_name": "Republican Party (G.O.P.)",
            "entity_type": "ORGANIZATION",
            "description": "The political party with a narrow majority in the House of Representatives, which is facing challenges in governance. This party includes an ultraconservative band that insisted on changes to dilute the power of the speakership and gain outsize influence.",
            "source_entities": [
                "G.O.P.",
                "REPUBLICAN PARTY",
                "ULTRACONSERVATIVE BAND"
            ]
        },
        {
            "entity_name": "Bureau of Labor Statistics",
            "entity_type": "ORGANIZATION",
            "description": "The source of the data on monthly change in jobs, which is seasonally adjusted, and reported the addition of 223,000 jobs in December, aligning with economists' expectations.",
            "source_entities": [
                "LABOR DEPARTMENT",
                "BUREAU OF LABOR STATISTICS"
            ]
        },
        {
            "entity_name": "S&P Global Market Intelligence",
            "entity_type": "ORGANIZATION",
            "description": "The entity that provided commentary on the labor market and job growth, with Chris Varvares as co-head of U.S. economics. It also reflected expectations that a slowdown in job growth and wage gains could reduce the pressure on prices and make the Federal Reserve less aggressive in raising interest rates.",
            "source_entities": [
                "S&P GLOBAL MARKET INTELLIGENCE",
                "CHRIS VARVARES"
            ]
        },
        {
            "entity_name": "Bike-Path Killings",
            "entity_type": "EVENT",
            "description": "The event in which Sayfullo Saipov drove a truck down a bicycle path in Manhattan, killing eight people and injuring more than a dozen. This is the first federal death penalty trial under the Biden administration, scheduled to begin in the Federal District Court in Manhattan.",
            "source_entities": [
                "BIKE-PATH KILLINGS",
                "MANHATTAN",
                "WEST SIDE",
                "FEDERAL DISTRICT COURT IN MANHATTAN"
            ]
        },
        {
            "entity_name": "Sayfullo Saipov",
            "entity_type": "PERSON",
            "description": "The individual charged for the bike-path killings in Manhattan on Halloween 2017, with a trial scheduled in the Federal District Court in Manhattan. His case led to a denial by Attorney General Merrick B. Garland to withdraw the death penalty order, despite President Biden's campaign stance against capital punishment.",
            "source_entities": [
                "SAYFULLO SAIPOV",
                "DONALD J. TRUMP",
                "MERRICK B. GARLAND",
                "JUSTICE DEPARTMENT"
            ]
        }
    ],
    "chunk-33c9c0d6ae3e3e3e11e3d513c88d12fb": null
}